#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_GameplayOptionsList

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "E_GameDifficulty_structs.hpp"


namespace SDK::Params
{

// Function WBP_Settings_GameplayOptionsList.WBP_Settings_GameplayOptionsList_C.BindOnOptionEntryFocused
// 0x0010 (0x0010 - 0x0000)
struct WBP_Settings_GameplayOptionsList_C_BindOnOptionEntryFocused final
{
public:
	TDelegate<void(class UWBP_Settings_OptionEntry_C* Widget)> Event;                                // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_GameplayOptionsList_C_BindOnOptionEntryFocused) == 0x000004, "Wrong alignment on WBP_Settings_GameplayOptionsList_C_BindOnOptionEntryFocused");
static_assert(sizeof(WBP_Settings_GameplayOptionsList_C_BindOnOptionEntryFocused) == 0x000010, "Wrong size on WBP_Settings_GameplayOptionsList_C_BindOnOptionEntryFocused");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_BindOnOptionEntryFocused, Event) == 0x000000, "Member 'WBP_Settings_GameplayOptionsList_C_BindOnOptionEntryFocused::Event' has a wrong offset!");

// Function WBP_Settings_GameplayOptionsList.WBP_Settings_GameplayOptionsList_C.BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_InvertCameraPitch_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_InvertCameraPitch_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_0;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUserWidget*                            Widget;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_InvertCameraPitch_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_InvertCameraPitch_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_InvertCameraPitch_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_InvertCameraPitch_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_InvertCameraPitch_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_InvertCameraPitch_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_InvertCameraPitch_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature, Name_0) == 0x000008, "Member 'WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_InvertCameraPitch_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature::Name_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_InvertCameraPitch_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature, Widget) == 0x000018, "Member 'WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_InvertCameraPitch_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_GameplayOptionsList.WBP_Settings_GameplayOptionsList_C.BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_InvertCameraYaw_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_InvertCameraYaw_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_0;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUserWidget*                            Widget;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_InvertCameraYaw_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_InvertCameraYaw_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_InvertCameraYaw_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_InvertCameraYaw_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_InvertCameraYaw_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_InvertCameraYaw_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_InvertCameraYaw_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature, Name_0) == 0x000008, "Member 'WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_InvertCameraYaw_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature::Name_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_InvertCameraYaw_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature, Widget) == 0x000018, "Member 'WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_InvertCameraYaw_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_GameplayOptionsList.WBP_Settings_GameplayOptionsList_C.BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_Rumble_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_Rumble_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_0;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUserWidget*                            Widget;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_Rumble_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_Rumble_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_Rumble_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_Rumble_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_Rumble_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_Rumble_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_Rumble_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature, Name_0) == 0x000008, "Member 'WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_Rumble_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature::Name_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_Rumble_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature, Widget) == 0x000018, "Member 'WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_NamedBoolSelector_Rumble_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_GameplayOptionsList.WBP_Settings_GameplayOptionsList_C.BndEvt__WBP_Settings_ControllerOptionsList_WBP_SliderSelector_CameraPitchInputMultiplier_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_SliderSelector_CameraPitchInputMultiplier_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_SliderSelector_CameraPitchInputMultiplier_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_SliderSelector_CameraPitchInputMultiplier_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_SliderSelector_CameraPitchInputMultiplier_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_SliderSelector_CameraPitchInputMultiplier_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_SliderSelector_CameraPitchInputMultiplier_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_SliderSelector_CameraPitchInputMultiplier_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_SliderSelector_CameraPitchInputMultiplier_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature, Widget) == 0x000008, "Member 'WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_SliderSelector_CameraPitchInputMultiplier_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_GameplayOptionsList.WBP_Settings_GameplayOptionsList_C.BndEvt__WBP_Settings_ControllerOptionsList_WBP_SliderSelectorCameraYawInputMultiplier_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_SliderSelectorCameraYawInputMultiplier_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_SliderSelectorCameraYawInputMultiplier_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_SliderSelectorCameraYawInputMultiplier_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_SliderSelectorCameraYawInputMultiplier_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_SliderSelectorCameraYawInputMultiplier_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_SliderSelectorCameraYawInputMultiplier_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_SliderSelectorCameraYawInputMultiplier_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_SliderSelectorCameraYawInputMultiplier_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature, Widget) == 0x000008, "Member 'WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_ControllerOptionsList_WBP_SliderSelectorCameraYawInputMultiplier_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_GameplayOptionsList.WBP_Settings_GameplayOptionsList_C.BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_AimInputChoice_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_AimInputChoice_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_0;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUserWidget*                            Widget;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_AimInputChoice_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_AimInputChoice_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_AimInputChoice_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_AimInputChoice_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_AimInputChoice_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_AimInputChoice_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_AimInputChoice_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature, Name_0) == 0x000008, "Member 'WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_AimInputChoice_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature::Name_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_AimInputChoice_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature, Widget) == 0x000018, "Member 'WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_AimInputChoice_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_GameplayOptionsList.WBP_Settings_GameplayOptionsList_C.BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_CustomizationInCinematics_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_CustomizationInCinematics_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_0;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUserWidget*                            Widget;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_CustomizationInCinematics_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_CustomizationInCinematics_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_CustomizationInCinematics_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_CustomizationInCinematics_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_CustomizationInCinematics_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_CustomizationInCinematics_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_CustomizationInCinematics_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature, Name_0) == 0x000008, "Member 'WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_CustomizationInCinematics_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature::Name_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_CustomizationInCinematics_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature, Widget) == 0x000018, "Member 'WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_CustomizationInCinematics_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_GameplayOptionsList.WBP_Settings_GameplayOptionsList_C.BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_RunInputChoice_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_RunInputChoice_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_0;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUserWidget*                            Widget;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_RunInputChoice_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_RunInputChoice_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_RunInputChoice_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_RunInputChoice_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_RunInputChoice_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_RunInputChoice_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_RunInputChoice_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature, Name_0) == 0x000008, "Member 'WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_RunInputChoice_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature::Name_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_RunInputChoice_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature, Widget) == 0x000018, "Member 'WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_RunInputChoice_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_GameplayOptionsList.WBP_Settings_GameplayOptionsList_C.BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_Tutorials_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_Tutorials_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_0;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUserWidget*                            Widget;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_Tutorials_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_Tutorials_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_Tutorials_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_Tutorials_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_Tutorials_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_Tutorials_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_Tutorials_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature, Name_0) == 0x000008, "Member 'WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_Tutorials_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature::Name_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_Tutorials_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature, Widget) == 0x000018, "Member 'WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_Tutorials_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_GameplayOptionsList.WBP_Settings_GameplayOptionsList_C.BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedIntegerSelector_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedIntegerSelector_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_0;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUserWidget*                            Widget;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedIntegerSelector_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedIntegerSelector_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedIntegerSelector_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedIntegerSelector_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedIntegerSelector_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedIntegerSelector_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedIntegerSelector_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature, Name_0) == 0x000008, "Member 'WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedIntegerSelector_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature::Name_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedIntegerSelector_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature, Widget) == 0x000018, "Member 'WBP_Settings_GameplayOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedIntegerSelector_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_GameplayOptionsList.WBP_Settings_GameplayOptionsList_C.ExecuteUbergraph_WBP_Settings_GameplayOptionsList
// 0x0160 (0x0160 - 0x0000)
struct WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Value_9;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Name_7;                 // 0x0008(0x0010)()
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget_9;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Value_8;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Name_6;                 // 0x0028(0x0010)()
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget_8;               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Value_7;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Name_5;                 // 0x0048(0x0010)()
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget_7;               // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_Value_6;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget_6;               // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_Value_5;                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget_5;               // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SliderSelector_C*                  K2Node_DynamicCast_AsWBP_Slider_Selector;          // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SliderSelector_C*                  K2Node_DynamicCast_AsWBP_Slider_Selector_1;        // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetMapRangedClampedValue_ReturnValue;     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetMapRangedClampedValue_ReturnValue_1;   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Value_4;                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Name_4;                 // 0x00B8(0x0010)()
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget_4;               // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_GameDifficultyManager_C*            CallFunc_GetDifficultyManager_ReturnValue;         // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Value_3;                // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Name_3;                 // 0x00E0(0x0010)()
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget_3;               // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Value_2;                // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Name_2;                 // 0x0100(0x0010)()
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget_2;               // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Value_1;                // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Name_1;                 // 0x0120(0x0010)()
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget_1;               // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Value;                  // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Name;                   // 0x0140(0x0010)()
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget;                 // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCameraPitchInputMultiplier_Value_ImplicitCast; // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCameraYawInputMultiplier_Value_ImplicitCast; // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList) == 0x000008, "Wrong alignment on WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList");
static_assert(sizeof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList) == 0x000160, "Wrong size on WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, EntryPoint) == 0x000000, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, K2Node_ComponentBoundEvent_Value_9) == 0x000004, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::K2Node_ComponentBoundEvent_Value_9' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, K2Node_ComponentBoundEvent_Name_7) == 0x000008, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::K2Node_ComponentBoundEvent_Name_7' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, K2Node_ComponentBoundEvent_Widget_9) == 0x000018, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::K2Node_ComponentBoundEvent_Widget_9' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, K2Node_ComponentBoundEvent_Value_8) == 0x000020, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::K2Node_ComponentBoundEvent_Value_8' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, K2Node_ComponentBoundEvent_Name_6) == 0x000028, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::K2Node_ComponentBoundEvent_Name_6' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, K2Node_ComponentBoundEvent_Widget_8) == 0x000038, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::K2Node_ComponentBoundEvent_Widget_8' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, K2Node_ComponentBoundEvent_Value_7) == 0x000040, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::K2Node_ComponentBoundEvent_Value_7' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, K2Node_ComponentBoundEvent_Name_5) == 0x000048, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::K2Node_ComponentBoundEvent_Name_5' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, K2Node_ComponentBoundEvent_Widget_7) == 0x000058, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::K2Node_ComponentBoundEvent_Widget_7' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, K2Node_ComponentBoundEvent_Value_6) == 0x000060, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::K2Node_ComponentBoundEvent_Value_6' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, K2Node_ComponentBoundEvent_Widget_6) == 0x000068, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::K2Node_ComponentBoundEvent_Widget_6' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, K2Node_ComponentBoundEvent_Value_5) == 0x000070, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::K2Node_ComponentBoundEvent_Value_5' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, K2Node_ComponentBoundEvent_Widget_5) == 0x000078, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::K2Node_ComponentBoundEvent_Widget_5' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, K2Node_DynamicCast_AsWBP_Slider_Selector) == 0x000080, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::K2Node_DynamicCast_AsWBP_Slider_Selector' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, K2Node_DynamicCast_AsWBP_Slider_Selector_1) == 0x000090, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::K2Node_DynamicCast_AsWBP_Slider_Selector_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, CallFunc_GetMapRangedClampedValue_ReturnValue) == 0x0000A0, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::CallFunc_GetMapRangedClampedValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, CallFunc_GetMapRangedClampedValue_ReturnValue_1) == 0x0000A8, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::CallFunc_GetMapRangedClampedValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, K2Node_ComponentBoundEvent_Value_4) == 0x0000B0, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::K2Node_ComponentBoundEvent_Value_4' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, K2Node_ComponentBoundEvent_Name_4) == 0x0000B8, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::K2Node_ComponentBoundEvent_Name_4' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, K2Node_ComponentBoundEvent_Widget_4) == 0x0000C8, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::K2Node_ComponentBoundEvent_Widget_4' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, CallFunc_GetDifficultyManager_ReturnValue) == 0x0000D0, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::CallFunc_GetDifficultyManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, K2Node_ComponentBoundEvent_Value_3) == 0x0000D8, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::K2Node_ComponentBoundEvent_Value_3' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, K2Node_ComponentBoundEvent_Name_3) == 0x0000E0, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::K2Node_ComponentBoundEvent_Name_3' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, K2Node_ComponentBoundEvent_Widget_3) == 0x0000F0, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::K2Node_ComponentBoundEvent_Widget_3' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, K2Node_ComponentBoundEvent_Value_2) == 0x0000F8, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::K2Node_ComponentBoundEvent_Value_2' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, K2Node_ComponentBoundEvent_Name_2) == 0x000100, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::K2Node_ComponentBoundEvent_Name_2' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, K2Node_ComponentBoundEvent_Widget_2) == 0x000110, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::K2Node_ComponentBoundEvent_Widget_2' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, CallFunc_Conv_IntToByte_ReturnValue) == 0x000118, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, K2Node_ComponentBoundEvent_Value_1) == 0x000119, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::K2Node_ComponentBoundEvent_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, K2Node_ComponentBoundEvent_Name_1) == 0x000120, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::K2Node_ComponentBoundEvent_Name_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, K2Node_ComponentBoundEvent_Widget_1) == 0x000130, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::K2Node_ComponentBoundEvent_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, CallFunc_GetValidValue_ReturnValue) == 0x000138, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, K2Node_ComponentBoundEvent_Value) == 0x000139, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, K2Node_ComponentBoundEvent_Name) == 0x000140, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::K2Node_ComponentBoundEvent_Name' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, K2Node_ComponentBoundEvent_Widget) == 0x000150, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, CallFunc_SetCameraPitchInputMultiplier_Value_ImplicitCast) == 0x000158, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::CallFunc_SetCameraPitchInputMultiplier_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList, CallFunc_SetCameraYawInputMultiplier_Value_ImplicitCast) == 0x00015C, "Member 'WBP_Settings_GameplayOptionsList_C_ExecuteUbergraph_WBP_Settings_GameplayOptionsList::CallFunc_SetCameraYawInputMultiplier_Value_ImplicitCast' has a wrong offset!");

// Function WBP_Settings_GameplayOptionsList.WBP_Settings_GameplayOptionsList_C.LoadUserSettings
// 0x0260 (0x0260 - 0x0000)
struct WBP_Settings_GameplayOptionsList_C_LoadUserSettings final
{
public:
	TMap<class UWBP_NamedBoolSelector_C*, bool>   local_BoolWidgetToValue;                           // 0x0000(0x0050)(Edit, BlueprintVisible, ContainsInstancedReference)
	class FText                                   Temp_text_Variable;                                // 0x0050(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0060(0x0010)()
	bool                                          Temp_bool_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_2;                              // 0x0078(0x0010)()
	class FText                                   Temp_text_Variable_3;                              // 0x0088(0x0010)()
	bool                                          Temp_bool_Variable_1;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_4;                              // 0x00A0(0x0010)()
	class FText                                   Temp_text_Variable_5;                              // 0x00B0(0x0010)()
	bool                                          Temp_bool_Variable_2;                              // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_6;                              // 0x00C8(0x0010)()
	class FText                                   Temp_text_Variable_7;                              // 0x00D8(0x0010)()
	TArray<class UWBP_NamedBoolSelector_C*>       CallFunc_Map_Keys_Keys;                            // 0x00E8(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_NamedBoolSelector_C*               CallFunc_Array_Get_Item;                           // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10E[0x2];                                      // 0x010E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetPlatformNameAsTag_ReturnValue;         // 0x0114(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetPlatformNameAsTag_ReturnValue_1;       // 0x0120(0x0008)(NoDestructor, HasGetValueTypeHash)
