#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NotificationBullet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_NotificationBullet.WBP_NotificationBullet_C
// 0x0038 (0x0318 - 0x02E0)
class UWBP_NotificationBullet_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Animation_Appear;                                  // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Glow_CircleBlurMaterial;                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_NotificationBullet_Circle;                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_NotificationBullet_Star;                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UINotifiedObject_C> Notified_Object;                                 // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_NotificationBullet(int32 EntryPoint);
	void Finished_339394B94330A31107E79382211BD141();
	void HideNotification();
	void LoadNotificationData(TScriptInterface<class IBPI_UINotifiedObject_C> NotifiedObject);
	void MarkNotificationAsRead(class UUserWidget* MarkCaller);
	void ResetNotificationData();
	void UpdateNotificationVisibility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_NotificationBullet_C">();
	}
	static class UWBP_NotificationBullet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_NotificationBullet_C>();
	}
};
static_assert(alignof(UWBP_NotificationBullet_C) == 0x000008, "Wrong alignment on UWBP_NotificationBullet_C");
static_assert(sizeof(UWBP_NotificationBullet_C) == 0x000318, "Wrong size on UWBP_NotificationBullet_C");
static_assert(offsetof(UWBP_NotificationBullet_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_NotificationBullet_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_NotificationBullet_C, Animation_Appear) == 0x0002E8, "Member 'UWBP_NotificationBullet_C::Animation_Appear' has a wrong offset!");
static_assert(offsetof(UWBP_NotificationBullet_C, Image_Glow_CircleBlurMaterial) == 0x0002F0, "Member 'UWBP_NotificationBullet_C::Image_Glow_CircleBlurMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_NotificationBullet_C, Image_NotificationBullet_Circle) == 0x0002F8, "Member 'UWBP_NotificationBullet_C::Image_NotificationBullet_Circle' has a wrong offset!");
static_assert(offsetof(UWBP_NotificationBullet_C, Image_NotificationBullet_Star) == 0x000300, "Member 'UWBP_NotificationBullet_C::Image_NotificationBullet_Star' has a wrong offset!");
static_assert(offsetof(UWBP_NotificationBullet_C, Notified_Object) == 0x000308, "Member 'UWBP_NotificationBullet_C::Notified_Object' has a wrong offset!");

}

