#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_StartGameOptions

#include "Basic.hpp"

#include "EModalUIResponse_structs.hpp"


namespace SDK::Params
{

// Function WBP_Settings_StartGameOptions.WBP_Settings_StartGameOptions_C.BndEvt__WBP_Settings_GenericPage_WBP_CommonBoundActionButton_ApplySettings_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Settings_StartGameOptions_C_BndEvt__WBP_Settings_GenericPage_WBP_CommonBoundActionButton_ApplySettings_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_StartGameOptions_C_BndEvt__WBP_Settings_GenericPage_WBP_CommonBoundActionButton_ApplySettings_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_StartGameOptions_C_BndEvt__WBP_Settings_GenericPage_WBP_CommonBoundActionButton_ApplySettings_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Settings_StartGameOptions_C_BndEvt__WBP_Settings_GenericPage_WBP_CommonBoundActionButton_ApplySettings_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Settings_StartGameOptions_C_BndEvt__WBP_Settings_GenericPage_WBP_CommonBoundActionButton_ApplySettings_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Settings_StartGameOptions_C_BndEvt__WBP_Settings_GenericPage_WBP_CommonBoundActionButton_ApplySettings_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Settings_StartGameOptions_C_BndEvt__WBP_Settings_GenericPage_WBP_CommonBoundActionButton_ApplySettings_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Settings_StartGameOptions.WBP_Settings_StartGameOptions_C.BndEvt__WBP_Settings_GenericPage_WBP_CommonBoundActionButton_Back_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Settings_StartGameOptions_C_BndEvt__WBP_Settings_GenericPage_WBP_CommonBoundActionButton_Back_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_StartGameOptions_C_BndEvt__WBP_Settings_GenericPage_WBP_CommonBoundActionButton_Back_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_StartGameOptions_C_BndEvt__WBP_Settings_GenericPage_WBP_CommonBoundActionButton_Back_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Settings_StartGameOptions_C_BndEvt__WBP_Settings_GenericPage_WBP_CommonBoundActionButton_Back_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Settings_StartGameOptions_C_BndEvt__WBP_Settings_GenericPage_WBP_CommonBoundActionButton_Back_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Settings_StartGameOptions_C_BndEvt__WBP_Settings_GenericPage_WBP_CommonBoundActionButton_Back_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Settings_StartGameOptions_C_BndEvt__WBP_Settings_GenericPage_WBP_CommonBoundActionButton_Back_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Settings_StartGameOptions.WBP_Settings_StartGameOptions_C.ExecuteUbergraph_WBP_Settings_StartGameOptions
// 0x0048 (0x0048 - 0x0000)
struct WBP_Settings_StartGameOptions_C_ExecuteUbergraph_WBP_Settings_StartGameOptions final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EModalUIResponse InUserResponse)> K2Node_CreateDelegate_OutputDelegate;           // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ModalPopup_C*                      CallFunc_CreateModalWindow_OutputPin;              // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EModalUIResponse                              K2Node_CustomEvent_InUserResponse;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreSettingValidBeforeApply_IsValid;       // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_SaveManager_C*                      CallFunc_GetSaveManager_SaveManager;               // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnySaveInAnySlot_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_StartGameOptions_C_ExecuteUbergraph_WBP_Settings_StartGameOptions) == 0x000008, "Wrong alignment on WBP_Settings_StartGameOptions_C_ExecuteUbergraph_WBP_Settings_StartGameOptions");
static_assert(sizeof(WBP_Settings_StartGameOptions_C_ExecuteUbergraph_WBP_Settings_StartGameOptions) == 0x000048, "Wrong size on WBP_Settings_StartGameOptions_C_ExecuteUbergraph_WBP_Settings_StartGameOptions");
static_assert(offsetof(WBP_Settings_StartGameOptions_C_ExecuteUbergraph_WBP_Settings_StartGameOptions, EntryPoint) == 0x000000, "Member 'WBP_Settings_StartGameOptions_C_ExecuteUbergraph_WBP_Settings_StartGameOptions::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptions_C_ExecuteUbergraph_WBP_Settings_StartGameOptions, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_Settings_StartGameOptions_C_ExecuteUbergraph_WBP_Settings_StartGameOptions::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptions_C_ExecuteUbergraph_WBP_Settings_StartGameOptions, K2Node_ComponentBoundEvent_Button_1) == 0x000018, "Member 'WBP_Settings_StartGameOptions_C_ExecuteUbergraph_WBP_Settings_StartGameOptions::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptions_C_ExecuteUbergraph_WBP_Settings_StartGameOptions, CallFunc_CreateModalWindow_OutputPin) == 0x000020, "Member 'WBP_Settings_StartGameOptions_C_ExecuteUbergraph_WBP_Settings_StartGameOptions::CallFunc_CreateModalWindow_OutputPin' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptions_C_ExecuteUbergraph_WBP_Settings_StartGameOptions, K2Node_CustomEvent_InUserResponse) == 0x000028, "Member 'WBP_Settings_StartGameOptions_C_ExecuteUbergraph_WBP_Settings_StartGameOptions::K2Node_CustomEvent_InUserResponse' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptions_C_ExecuteUbergraph_WBP_Settings_StartGameOptions, K2Node_SwitchEnum_CmpSuccess) == 0x000029, "Member 'WBP_Settings_StartGameOptions_C_ExecuteUbergraph_WBP_Settings_StartGameOptions::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptions_C_ExecuteUbergraph_WBP_Settings_StartGameOptions, CallFunc_AreSettingValidBeforeApply_IsValid) == 0x00002A, "Member 'WBP_Settings_StartGameOptions_C_ExecuteUbergraph_WBP_Settings_StartGameOptions::CallFunc_AreSettingValidBeforeApply_IsValid' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptions_C_ExecuteUbergraph_WBP_Settings_StartGameOptions, K2Node_ComponentBoundEvent_Button) == 0x000030, "Member 'WBP_Settings_StartGameOptions_C_ExecuteUbergraph_WBP_Settings_StartGameOptions::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptions_C_ExecuteUbergraph_WBP_Settings_StartGameOptions, CallFunc_GetSaveManager_SaveManager) == 0x000038, "Member 'WBP_Settings_StartGameOptions_C_ExecuteUbergraph_WBP_Settings_StartGameOptions::CallFunc_GetSaveManager_SaveManager' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptions_C_ExecuteUbergraph_WBP_Settings_StartGameOptions, CallFunc_HasAnySaveInAnySlot_ReturnValue) == 0x000040, "Member 'WBP_Settings_StartGameOptions_C_ExecuteUbergraph_WBP_Settings_StartGameOptions::CallFunc_HasAnySaveInAnySlot_ReturnValue' has a wrong offset!");

// Function WBP_Settings_StartGameOptions.WBP_Settings_StartGameOptions_C.OnStartGameResponse
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_StartGameOptions_C_OnStartGameResponse final
{
public:
	EModalUIResponse                              InUserResponse;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_StartGameOptions_C_OnStartGameResponse) == 0x000001, "Wrong alignment on WBP_Settings_StartGameOptions_C_OnStartGameResponse");
static_assert(sizeof(WBP_Settings_StartGameOptions_C_OnStartGameResponse) == 0x000001, "Wrong size on WBP_Settings_StartGameOptions_C_OnStartGameResponse");
static_assert(offsetof(WBP_Settings_StartGameOptions_C_OnStartGameResponse, InUserResponse) == 0x000000, "Member 'WBP_Settings_StartGameOptions_C_OnStartGameResponse::InUserResponse' has a wrong offset!");

// Function WBP_Settings_StartGameOptions.WBP_Settings_StartGameOptions_C.BP_GetDesiredFocusTarget
// 0x0010 (0x0010 - 0x0000)
struct WBP_Settings_StartGameOptions_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_StartGameOptions_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_Settings_StartGameOptions_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_Settings_StartGameOptions_C_BP_GetDesiredFocusTarget) == 0x000010, "Wrong size on WBP_Settings_StartGameOptions_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_Settings_StartGameOptions_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_Settings_StartGameOptions_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptions_C_BP_GetDesiredFocusTarget, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000008, "Member 'WBP_Settings_StartGameOptions_C_BP_GetDesiredFocusTarget::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");

}

