#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FirstLetter_TitleText

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_FirstLetter_TitleText.WBP_FirstLetter_TitleText_C
// 0x00F0 (0x03D0 - 0x02E0)
class UWBP_FirstLetter_TitleText_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Display_Text;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             FirstLetter;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   DefaultText;                                       // 0x02F8(0x0010)(Edit, BlueprintVisible)
	struct FSlateFontInfo                         TextFont_first_letter;                             // 0x0308(0x0060)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSlateFontInfo                         TextFont;                                          // 0x0368(0x0060)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         FontSize;                                          // 0x03C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_FirstLetter_TitleText(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetText(const class FText& Text);
	void UpdateText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_FirstLetter_TitleText_C">();
	}
	static class UWBP_FirstLetter_TitleText_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_FirstLetter_TitleText_C>();
	}
};
static_assert(alignof(UWBP_FirstLetter_TitleText_C) == 0x000008, "Wrong alignment on UWBP_FirstLetter_TitleText_C");
static_assert(sizeof(UWBP_FirstLetter_TitleText_C) == 0x0003D0, "Wrong size on UWBP_FirstLetter_TitleText_C");
static_assert(offsetof(UWBP_FirstLetter_TitleText_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_FirstLetter_TitleText_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_FirstLetter_TitleText_C, Display_Text) == 0x0002E8, "Member 'UWBP_FirstLetter_TitleText_C::Display_Text' has a wrong offset!");
static_assert(offsetof(UWBP_FirstLetter_TitleText_C, FirstLetter) == 0x0002F0, "Member 'UWBP_FirstLetter_TitleText_C::FirstLetter' has a wrong offset!");
static_assert(offsetof(UWBP_FirstLetter_TitleText_C, DefaultText) == 0x0002F8, "Member 'UWBP_FirstLetter_TitleText_C::DefaultText' has a wrong offset!");
static_assert(offsetof(UWBP_FirstLetter_TitleText_C, TextFont_first_letter) == 0x000308, "Member 'UWBP_FirstLetter_TitleText_C::TextFont_first_letter' has a wrong offset!");
static_assert(offsetof(UWBP_FirstLetter_TitleText_C, TextFont) == 0x000368, "Member 'UWBP_FirstLetter_TitleText_C::TextFont' has a wrong offset!");
static_assert(offsetof(UWBP_FirstLetter_TitleText_C, FontSize) == 0x0003C8, "Member 'UWBP_FirstLetter_TitleText_C::FontSize' has a wrong offset!");

}

