#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ToastCard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EToastNotificationTheme_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ToastCard.WBP_ToastCard_C
// 0x0060 (0x0340 - 0x02E0)
class UWBP_ToastCard_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_FadeOUT;                                      // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_FadeIN;                                       // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Circle_Right;                                // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_CircleLeft;                                  // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Line_Bottom;                                 // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Line_Top;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SF_RichTextBlock_C*                WBP_SF_RichTextBlock_C_31;                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0328(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	double                                        Duration;                                          // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_ToastCard(int32 EntryPoint);
	void Init(const class FText& Text_0, EToastNotificationTheme Theme);
	void OnFadeInFinished();
	void OnFadeOutAnimationFinished();
	void PreConstruct(bool IsDesignTime);
	void SetText(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ToastCard_C">();
	}
	static class UWBP_ToastCard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ToastCard_C>();
	}
};
static_assert(alignof(UWBP_ToastCard_C) == 0x000008, "Wrong alignment on UWBP_ToastCard_C");
static_assert(sizeof(UWBP_ToastCard_C) == 0x000340, "Wrong size on UWBP_ToastCard_C");
static_assert(offsetof(UWBP_ToastCard_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_ToastCard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ToastCard_C, Anim_FadeOUT) == 0x0002E8, "Member 'UWBP_ToastCard_C::Anim_FadeOUT' has a wrong offset!");
static_assert(offsetof(UWBP_ToastCard_C, Anim_FadeIN) == 0x0002F0, "Member 'UWBP_ToastCard_C::Anim_FadeIN' has a wrong offset!");
static_assert(offsetof(UWBP_ToastCard_C, Image_Background) == 0x0002F8, "Member 'UWBP_ToastCard_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWBP_ToastCard_C, Image_Circle_Right) == 0x000300, "Member 'UWBP_ToastCard_C::Image_Circle_Right' has a wrong offset!");
static_assert(offsetof(UWBP_ToastCard_C, Image_CircleLeft) == 0x000308, "Member 'UWBP_ToastCard_C::Image_CircleLeft' has a wrong offset!");
static_assert(offsetof(UWBP_ToastCard_C, Image_Line_Bottom) == 0x000310, "Member 'UWBP_ToastCard_C::Image_Line_Bottom' has a wrong offset!");
static_assert(offsetof(UWBP_ToastCard_C, Image_Line_Top) == 0x000318, "Member 'UWBP_ToastCard_C::Image_Line_Top' has a wrong offset!");
static_assert(offsetof(UWBP_ToastCard_C, WBP_SF_RichTextBlock_C_31) == 0x000320, "Member 'UWBP_ToastCard_C::WBP_SF_RichTextBlock_C_31' has a wrong offset!");
static_assert(offsetof(UWBP_ToastCard_C, Text) == 0x000328, "Member 'UWBP_ToastCard_C::Text' has a wrong offset!");
static_assert(offsetof(UWBP_ToastCard_C, Duration) == 0x000338, "Member 'UWBP_ToastCard_C::Duration' has a wrong offset!");

}

