#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SkillTreeConnection

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ESkillNodeState_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SkillTreeConnection.WBP_SkillTreeConnection_C
// 0x0028 (0x0308 - 0x02E0)
class UWBP_SkillTreeConnection_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_LineConnector;                               // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LineConnector_SoloLine;                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ShaderPaint_Placeholer;                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsInactive;                                        // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsActive;                                          // 0x0301(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUpgradeReady;                                    // 0x0302(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUnaffordable;                                    // 0x0303(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESkillNodeState                               ConnectionSkillState;                              // 0x0304(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AlreadyActivated();
	void Event_Active();
	void Event_Inactive();
	void Event_UpgradeReady();
	void ExecuteUbergraph_WBP_SkillTreeConnection(int32 EntryPoint);
	void HideAllLines();
	void PreConstruct(bool IsDesignTime);
	void SetConnectionStateNew(ESkillNodeState ConnectionState);
	void UpdateState();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SkillTreeConnection_C">();
	}
	static class UWBP_SkillTreeConnection_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SkillTreeConnection_C>();
	}
};
static_assert(alignof(UWBP_SkillTreeConnection_C) == 0x000008, "Wrong alignment on UWBP_SkillTreeConnection_C");
static_assert(sizeof(UWBP_SkillTreeConnection_C) == 0x000308, "Wrong size on UWBP_SkillTreeConnection_C");
static_assert(offsetof(UWBP_SkillTreeConnection_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_SkillTreeConnection_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SkillTreeConnection_C, Image_LineConnector) == 0x0002E8, "Member 'UWBP_SkillTreeConnection_C::Image_LineConnector' has a wrong offset!");
static_assert(offsetof(UWBP_SkillTreeConnection_C, Image_LineConnector_SoloLine) == 0x0002F0, "Member 'UWBP_SkillTreeConnection_C::Image_LineConnector_SoloLine' has a wrong offset!");
static_assert(offsetof(UWBP_SkillTreeConnection_C, Image_ShaderPaint_Placeholer) == 0x0002F8, "Member 'UWBP_SkillTreeConnection_C::Image_ShaderPaint_Placeholer' has a wrong offset!");
static_assert(offsetof(UWBP_SkillTreeConnection_C, IsInactive) == 0x000300, "Member 'UWBP_SkillTreeConnection_C::IsInactive' has a wrong offset!");
static_assert(offsetof(UWBP_SkillTreeConnection_C, IsActive) == 0x000301, "Member 'UWBP_SkillTreeConnection_C::IsActive' has a wrong offset!");
static_assert(offsetof(UWBP_SkillTreeConnection_C, IsUpgradeReady) == 0x000302, "Member 'UWBP_SkillTreeConnection_C::IsUpgradeReady' has a wrong offset!");
static_assert(offsetof(UWBP_SkillTreeConnection_C, IsUnaffordable) == 0x000303, "Member 'UWBP_SkillTreeConnection_C::IsUnaffordable' has a wrong offset!");
static_assert(offsetof(UWBP_SkillTreeConnection_C, ConnectionSkillState) == 0x000304, "Member 'UWBP_SkillTreeConnection_C::ConnectionSkillState' has a wrong offset!");

}

