#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MiniMap_Main

#include "Basic.hpp"

#include "EnhancedInput_structs.hpp"
#include "Engine_structs.hpp"
#include "S_MinimapLevelIdentifier_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function WBP_MiniMap_Main.WBP_MiniMap_Main_C.BP_OnHandleBackAction
// 0x0001 (0x0001 - 0x0000)
struct WBP_MiniMap_Main_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MiniMap_Main_C_BP_OnHandleBackAction) == 0x000001, "Wrong alignment on WBP_MiniMap_Main_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_MiniMap_Main_C_BP_OnHandleBackAction) == 0x000001, "Wrong size on WBP_MiniMap_Main_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_MiniMap_Main_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_MiniMap_Main_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");

// Function WBP_MiniMap_Main.WBP_MiniMap_Main_C.ConvertMapLocationToWidgetLocation
// 0x0078 (0x0078 - 0x0000)
struct WBP_MiniMap_Main_C_ConvertMapLocationToWidgetLocation final
{
public:
	struct FVector2D                              InMapLocation;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              OutWidgetLocation;                                 // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetMapHeight_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetMapWidth_ReturnValue;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MiniMap_Main_C_ConvertMapLocationToWidgetLocation) == 0x000008, "Wrong alignment on WBP_MiniMap_Main_C_ConvertMapLocationToWidgetLocation");
static_assert(sizeof(WBP_MiniMap_Main_C_ConvertMapLocationToWidgetLocation) == 0x000078, "Wrong size on WBP_MiniMap_Main_C_ConvertMapLocationToWidgetLocation");
static_assert(offsetof(WBP_MiniMap_Main_C_ConvertMapLocationToWidgetLocation, InMapLocation) == 0x000000, "Member 'WBP_MiniMap_Main_C_ConvertMapLocationToWidgetLocation::InMapLocation' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ConvertMapLocationToWidgetLocation, OutWidgetLocation) == 0x000010, "Member 'WBP_MiniMap_Main_C_ConvertMapLocationToWidgetLocation::OutWidgetLocation' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ConvertMapLocationToWidgetLocation, CallFunc_BreakVector2D_X) == 0x000020, "Member 'WBP_MiniMap_Main_C_ConvertMapLocationToWidgetLocation::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ConvertMapLocationToWidgetLocation, CallFunc_BreakVector2D_Y) == 0x000028, "Member 'WBP_MiniMap_Main_C_ConvertMapLocationToWidgetLocation::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ConvertMapLocationToWidgetLocation, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_MiniMap_Main_C_ConvertMapLocationToWidgetLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ConvertMapLocationToWidgetLocation, CallFunc_GetMapHeight_ReturnValue) == 0x000038, "Member 'WBP_MiniMap_Main_C_ConvertMapLocationToWidgetLocation::CallFunc_GetMapHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ConvertMapLocationToWidgetLocation, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000040, "Member 'WBP_MiniMap_Main_C_ConvertMapLocationToWidgetLocation::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ConvertMapLocationToWidgetLocation, CallFunc_GetMapWidth_ReturnValue) == 0x000048, "Member 'WBP_MiniMap_Main_C_ConvertMapLocationToWidgetLocation::CallFunc_GetMapWidth_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ConvertMapLocationToWidgetLocation, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000050, "Member 'WBP_MiniMap_Main_C_ConvertMapLocationToWidgetLocation::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ConvertMapLocationToWidgetLocation, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000058, "Member 'WBP_MiniMap_Main_C_ConvertMapLocationToWidgetLocation::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ConvertMapLocationToWidgetLocation, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000060, "Member 'WBP_MiniMap_Main_C_ConvertMapLocationToWidgetLocation::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ConvertMapLocationToWidgetLocation, CallFunc_MakeVector2D_ReturnValue) == 0x000068, "Member 'WBP_MiniMap_Main_C_ConvertMapLocationToWidgetLocation::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function WBP_MiniMap_Main.WBP_MiniMap_Main_C.DrawUnlockedSections
// 0x0058 (0x0058 - 0x0000)
struct WBP_MiniMap_Main_C_DrawUnlockedSections final
{
public:
	TArray<double>                                UnlockedSections;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvas*                                CallFunc_BeginDrawCanvasToRenderTarget_Canvas;     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_BeginDrawCanvasToRenderTarget_Size;       // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDrawToRenderTargetContext             CallFunc_BeginDrawCanvasToRenderTarget_Context;    // 0x0048(0x0008)(NoDestructor)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MiniMap_Main_C_DrawUnlockedSections) == 0x000008, "Wrong alignment on WBP_MiniMap_Main_C_DrawUnlockedSections");
static_assert(sizeof(WBP_MiniMap_Main_C_DrawUnlockedSections) == 0x000058, "Wrong size on WBP_MiniMap_Main_C_DrawUnlockedSections");
static_assert(offsetof(WBP_MiniMap_Main_C_DrawUnlockedSections, UnlockedSections) == 0x000000, "Member 'WBP_MiniMap_Main_C_DrawUnlockedSections::UnlockedSections' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_DrawUnlockedSections, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_MiniMap_Main_C_DrawUnlockedSections::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_DrawUnlockedSections, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'WBP_MiniMap_Main_C_DrawUnlockedSections::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_DrawUnlockedSections, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_MiniMap_Main_C_DrawUnlockedSections::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_DrawUnlockedSections, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'WBP_MiniMap_Main_C_DrawUnlockedSections::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_DrawUnlockedSections, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'WBP_MiniMap_Main_C_DrawUnlockedSections::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_DrawUnlockedSections, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WBP_MiniMap_Main_C_DrawUnlockedSections::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_DrawUnlockedSections, CallFunc_BeginDrawCanvasToRenderTarget_Canvas) == 0x000030, "Member 'WBP_MiniMap_Main_C_DrawUnlockedSections::CallFunc_BeginDrawCanvasToRenderTarget_Canvas' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_DrawUnlockedSections, CallFunc_BeginDrawCanvasToRenderTarget_Size) == 0x000038, "Member 'WBP_MiniMap_Main_C_DrawUnlockedSections::CallFunc_BeginDrawCanvasToRenderTarget_Size' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_DrawUnlockedSections, CallFunc_BeginDrawCanvasToRenderTarget_Context) == 0x000048, "Member 'WBP_MiniMap_Main_C_DrawUnlockedSections::CallFunc_BeginDrawCanvasToRenderTarget_Context' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_DrawUnlockedSections, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000050, "Member 'WBP_MiniMap_Main_C_DrawUnlockedSections::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_MiniMap_Main.WBP_MiniMap_Main_C.ExecuteUbergraph_WBP_MiniMap_Main
// 0x04A0 (0x04A0 - 0x0000)
struct WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_3;     // 0x0008(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_3;     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_3;   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_3;    // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_InputActionValueToAxis1D_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_2;     // 0x0048(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_2;     // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_2;   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_2;    // 0x0070(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_1; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_1;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue_1; // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      K2Node_DynamicCast_AsMaterial_Instance;            // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x00F0(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x0118(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_2;                            // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_3;                              // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3_0;                            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4_0;                            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0158(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0180(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_3;                            // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5;                              // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5_0;                            // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_6;                              // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_6_0;                            // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable_4;                            // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_5;                            // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x01DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default;                             // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_6;                            // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      K2Node_DynamicCast_AsMaterial_Instance_1;          // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_5;     // 0x0230(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_5;     // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_5;   // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_5;    // 0x0258(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Conv_InputActionValueToAxis2D_ReturnValue; // 0x0268(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27D[0x3];                                      // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_MiniMapCapture_C*                   CallFunc_GetActorOfClass_ReturnValue;              // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<double>                                CallFunc_GetUnlockedMapSectionsNormalized_NormalizedUnlockedMapSections; // 0x0298(0x0010)(ReferenceParm)
	uint8                                         Pad_2A8[0x8];                                      // 0x02A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x02B0(0x00D0)()
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0380(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_LevelEntrancePOI_C*>        CallFunc_Map_Values_Values;                        // 0x0390(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_LevelEntrancePOI_C*                CallFunc_Array_Get_Item;                           // 0x03A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetWidgetLocation_WidgetLocation;         // 0x03B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsQuestObjective_bIsQuestObjective;       // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_4;     // 0x03D0(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_4;     // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_4;   // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_4;    // 0x03F8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable;                              // 0x0400(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_2;                            // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_2; // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default_1;                           // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetTriggerParameter_self_CastInput; // 0x0430(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0441(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_442[0x2];                                      // 0x0442(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0444(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0454(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_1;    // 0x0455(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_456[0x2];                                      // 0x0456(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_7;                              // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_461[0x7];                                      // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_7_0;                            // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_8;                              // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_8_0;                            // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_7;                            // 0x0480(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_MiniMapWidth_ImplicitCast;      // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_MiniMapHeight_ImplicitCast;     // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main) == 0x000010, "Wrong alignment on WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main");
static_assert(sizeof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main) == 0x0004A0, "Wrong size on WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, EntryPoint) == 0x000000, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, K2Node_EnhancedInputActionEvent_ActionValue_3) == 0x000008, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::K2Node_EnhancedInputActionEvent_ActionValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, K2Node_EnhancedInputActionEvent_ElapsedTime_3) == 0x000028, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::K2Node_EnhancedInputActionEvent_ElapsedTime_3' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, K2Node_EnhancedInputActionEvent_TriggeredTime_3) == 0x00002C, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::K2Node_EnhancedInputActionEvent_TriggeredTime_3' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, K2Node_EnhancedInputActionEvent_SourceAction_3) == 0x000030, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::K2Node_EnhancedInputActionEvent_SourceAction_3' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, CallFunc_Conv_InputActionValueToAxis1D_ReturnValue) == 0x000040, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::CallFunc_Conv_InputActionValueToAxis1D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, K2Node_EnhancedInputActionEvent_ActionValue_2) == 0x000048, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::K2Node_EnhancedInputActionEvent_ActionValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, K2Node_EnhancedInputActionEvent_ElapsedTime_2) == 0x000068, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::K2Node_EnhancedInputActionEvent_ElapsedTime_2' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, K2Node_EnhancedInputActionEvent_TriggeredTime_2) == 0x00006C, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::K2Node_EnhancedInputActionEvent_TriggeredTime_2' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, K2Node_EnhancedInputActionEvent_SourceAction_2) == 0x000070, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::K2Node_EnhancedInputActionEvent_SourceAction_2' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, Temp_object_Variable) == 0x000078, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_1) == 0x000080, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, Temp_real_Variable) == 0x000088, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, Temp_real_Variable_1) == 0x000090, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, Temp_real_Variable_0) == 0x000098, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, Temp_real_Variable_1_0) == 0x0000A0, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, Temp_real_Variable_1_1) == 0x0000A8, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::Temp_real_Variable_1_1' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, Temp_real_Variable_1) == 0x0000B0, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, Temp_real_Variable_2) == 0x0000B8, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, CallFunc_K2_GetScalarParameterValue_ReturnValue) == 0x0000C0, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::CallFunc_K2_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, CallFunc_K2_GetScalarParameterValue_ReturnValue_1) == 0x0000C4, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::CallFunc_K2_GetScalarParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000C8, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, K2Node_CustomEvent_Loaded_1) == 0x0000D0, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, Temp_object_Variable_1) == 0x0000D8, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, K2Node_DynamicCast_AsMaterial_Instance) == 0x0000E0, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::K2Node_DynamicCast_AsMaterial_Instance' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, K2Node_EnhancedInputActionEvent_ActionValue_1) == 0x0000F0, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::K2Node_EnhancedInputActionEvent_ActionValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, K2Node_EnhancedInputActionEvent_ElapsedTime_1) == 0x000110, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::K2Node_EnhancedInputActionEvent_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, K2Node_EnhancedInputActionEvent_TriggeredTime_1) == 0x000114, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::K2Node_EnhancedInputActionEvent_TriggeredTime_1' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, K2Node_EnhancedInputActionEvent_SourceAction_1) == 0x000118, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::K2Node_EnhancedInputActionEvent_SourceAction_1' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, Temp_object_Variable_2) == 0x000120, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000128, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, Temp_real_Variable_3) == 0x000130, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, Temp_real_Variable_4) == 0x000138, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, Temp_real_Variable_3_0) == 0x000140, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::Temp_real_Variable_3_0' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, Temp_real_Variable_4_0) == 0x000148, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::Temp_real_Variable_4_0' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, Temp_bool_Variable) == 0x000150, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000158, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000178, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x00017C, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000180, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, CallFunc_Conv_InputActionValueToBool_ReturnValue_1) == 0x000188, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::CallFunc_Conv_InputActionValueToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, Temp_object_Variable_3) == 0x000190, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, Temp_real_Variable_5) == 0x000198, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, Temp_real_Variable_5_0) == 0x0001A0, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::Temp_real_Variable_5_0' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, Temp_real_Variable_6) == 0x0001A8, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::Temp_real_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, Temp_bool_Variable_1) == 0x0001B0, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, Temp_real_Variable_6_0) == 0x0001B8, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::Temp_real_Variable_6_0' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, Temp_bool_Variable_2) == 0x0001C0, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, Temp_object_Variable_4) == 0x0001C8, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, Temp_object_Variable_5) == 0x0001D0, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, Temp_bool_Variable_3) == 0x0001D8, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, Temp_name_Variable) == 0x0001DC, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, K2Node_Select_Default) == 0x0001E8, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, CallFunc_SpawnSound2D_ReturnValue) == 0x0001F0, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, Temp_name_Variable_1) == 0x0001F8, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, K2Node_CustomEvent_Loaded) == 0x000200, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, CallFunc_IsValid_ReturnValue_1) == 0x000208, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, Temp_object_Variable_6) == 0x000210, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, K2Node_DynamicCast_AsMaterial_Instance_1) == 0x000218, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::K2Node_DynamicCast_AsMaterial_Instance_1' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, K2Node_DynamicCast_bSuccess_1) == 0x000220, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000228, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, K2Node_EnhancedInputActionEvent_ActionValue_5) == 0x000230, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::K2Node_EnhancedInputActionEvent_ActionValue_5' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, K2Node_EnhancedInputActionEvent_ElapsedTime_5) == 0x000250, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::K2Node_EnhancedInputActionEvent_ElapsedTime_5' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, K2Node_EnhancedInputActionEvent_TriggeredTime_5) == 0x000254, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::K2Node_EnhancedInputActionEvent_TriggeredTime_5' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, K2Node_EnhancedInputActionEvent_SourceAction_5) == 0x000258, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::K2Node_EnhancedInputActionEvent_SourceAction_5' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, Temp_int_Loop_Counter_Variable) == 0x000260, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, CallFunc_Conv_InputActionValueToAxis2D_ReturnValue) == 0x000268, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::CallFunc_Conv_InputActionValueToAxis2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, CallFunc_Add_IntInt_ReturnValue) == 0x000278, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, K2Node_Event_IsDesignTime) == 0x00027C, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000280, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, CallFunc_GetActorOfClass_ReturnValue) == 0x000288, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, CallFunc_GetCustomGI_ReturnValue) == 0x000290, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, CallFunc_GetUnlockedMapSectionsNormalized_NormalizedUnlockedMapSections) == 0x000298, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::CallFunc_GetUnlockedMapSectionsNormalized_NormalizedUnlockedMapSections' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, K2Node_MakeStruct_SlateBrush) == 0x0002B0, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, K2Node_CreateDelegate_OutputDelegate) == 0x000380, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, CallFunc_Map_Values_Values) == 0x000390, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, Temp_int_Array_Index_Variable) == 0x0003A0, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, CallFunc_Array_Length_ReturnValue) == 0x0003A4, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, CallFunc_Array_Get_Item) == 0x0003A8, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, CallFunc_Less_IntInt_ReturnValue) == 0x0003B0, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, CallFunc_GetWidgetLocation_WidgetLocation) == 0x0003B8, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::CallFunc_GetWidgetLocation_WidgetLocation' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, CallFunc_IsQuestObjective_bIsQuestObjective) == 0x0003C8, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::CallFunc_IsQuestObjective_bIsQuestObjective' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, K2Node_EnhancedInputActionEvent_ActionValue_4) == 0x0003D0, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::K2Node_EnhancedInputActionEvent_ActionValue_4' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, K2Node_EnhancedInputActionEvent_ElapsedTime_4) == 0x0003F0, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::K2Node_EnhancedInputActionEvent_ElapsedTime_4' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, K2Node_EnhancedInputActionEvent_TriggeredTime_4) == 0x0003F4, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::K2Node_EnhancedInputActionEvent_TriggeredTime_4' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, K2Node_EnhancedInputActionEvent_SourceAction_4) == 0x0003F8, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::K2Node_EnhancedInputActionEvent_SourceAction_4' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, Temp_struct_Variable) == 0x000400, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, Temp_real_Variable_2) == 0x000410, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, Temp_real_Variable_1_2) == 0x000418, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::Temp_real_Variable_1_2' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_2) == 0x000420, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, K2Node_Select_Default_1) == 0x000428, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, CallFunc_SetTriggerParameter_self_CastInput) == 0x000430, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::CallFunc_SetTriggerParameter_self_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, CallFunc_IsValid_ReturnValue_2) == 0x000440, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, CallFunc_IsValid_ReturnValue_3) == 0x000441, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, K2Node_CreateDelegate_OutputDelegate_1) == 0x000444, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000454, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, CallFunc_EqualEqual_DoubleDouble_ReturnValue_1) == 0x000455, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::CallFunc_EqualEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main, Temp_real_Variable_7) == 0x000458, "Member 'WBP_MiniMap_Main_C_ExecuteUbergraph_WBP_MiniMap_Main::Temp_real_Variable_7' has a wrong offset!");
