#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EndBattle_ExperienceBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_EndBattle_ExperienceBar.WBP_EndBattle_ExperienceBar_C
// 0x00B0 (0x03B8 - 0x0308)
class UWBP_EndBattle_ExperienceBar_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_LevelUpLoop;                                  // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_ExperienceGain;                               // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_ExperienceGainLevelUp;                        // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_CharacterLevel_C*                  CharacterLevel;                                    // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ExpBar;                                            // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ExperienceBar;                                     // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   FX_SmokeLevelBackground;                           // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background_Color;                            // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WrappingText_C*                    LevelUpText;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   NiagaraSystemWidget_Explosion;                     // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox;                                       // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         PreviewMaxValue;                                   // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PreviewCurrentValue;                               // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PreviewCurrentLevel;                               // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ExperienceGainProgress;                            // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentLevel;                                      // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentXP;                                         // 0x0384(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TargetXP;                                          // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TargetLevel;                                       // 0x038C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FinalLevel;                                        // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FinalXP;                                           // 0x0394(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnLevelUpTriggered;                                // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnLevelUpFinished;                                 // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_WBP_EndBattle_ExperienceBar(int32 EntryPoint);
	void LoadCharacterData(class UBP_CharacterData_C* InCharacterData);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void OnTimerEnded();
	void PreConstruct(bool IsDesignTime);
	void SetExperienceGainProgress(double ExperienceGainProgress_0);
	void SetLevelAndValue(int32 Level, int32 exp, int32 MaxExp);
	void TriggerExperienceGainAnimation(class UBP_CharacterData_C* CharacterData);
	void TriggerLevelUp();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_EndBattle_ExperienceBar_C">();
	}
	static class UWBP_EndBattle_ExperienceBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_EndBattle_ExperienceBar_C>();
	}
};
static_assert(alignof(UWBP_EndBattle_ExperienceBar_C) == 0x000008, "Wrong alignment on UWBP_EndBattle_ExperienceBar_C");
static_assert(sizeof(UWBP_EndBattle_ExperienceBar_C) == 0x0003B8, "Wrong size on UWBP_EndBattle_ExperienceBar_C");
static_assert(offsetof(UWBP_EndBattle_ExperienceBar_C, UberGraphFrame) == 0x000308, "Member 'UWBP_EndBattle_ExperienceBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_ExperienceBar_C, Anim_LevelUpLoop) == 0x000310, "Member 'UWBP_EndBattle_ExperienceBar_C::Anim_LevelUpLoop' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_ExperienceBar_C, Anim_ExperienceGain) == 0x000318, "Member 'UWBP_EndBattle_ExperienceBar_C::Anim_ExperienceGain' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_ExperienceBar_C, Anim_ExperienceGainLevelUp) == 0x000320, "Member 'UWBP_EndBattle_ExperienceBar_C::Anim_ExperienceGainLevelUp' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_ExperienceBar_C, CharacterLevel) == 0x000328, "Member 'UWBP_EndBattle_ExperienceBar_C::CharacterLevel' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_ExperienceBar_C, ExpBar) == 0x000330, "Member 'UWBP_EndBattle_ExperienceBar_C::ExpBar' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_ExperienceBar_C, ExperienceBar) == 0x000338, "Member 'UWBP_EndBattle_ExperienceBar_C::ExperienceBar' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_ExperienceBar_C, FX_SmokeLevelBackground) == 0x000340, "Member 'UWBP_EndBattle_ExperienceBar_C::FX_SmokeLevelBackground' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_ExperienceBar_C, Image_Background_Color) == 0x000348, "Member 'UWBP_EndBattle_ExperienceBar_C::Image_Background_Color' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_ExperienceBar_C, LevelUpText) == 0x000350, "Member 'UWBP_EndBattle_ExperienceBar_C::LevelUpText' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_ExperienceBar_C, NiagaraSystemWidget_Explosion) == 0x000358, "Member 'UWBP_EndBattle_ExperienceBar_C::NiagaraSystemWidget_Explosion' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_ExperienceBar_C, RetainerBox) == 0x000360, "Member 'UWBP_EndBattle_ExperienceBar_C::RetainerBox' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_ExperienceBar_C, PreviewMaxValue) == 0x000368, "Member 'UWBP_EndBattle_ExperienceBar_C::PreviewMaxValue' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_ExperienceBar_C, PreviewCurrentValue) == 0x00036C, "Member 'UWBP_EndBattle_ExperienceBar_C::PreviewCurrentValue' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_ExperienceBar_C, PreviewCurrentLevel) == 0x000370, "Member 'UWBP_EndBattle_ExperienceBar_C::PreviewCurrentLevel' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_ExperienceBar_C, ExperienceGainProgress) == 0x000378, "Member 'UWBP_EndBattle_ExperienceBar_C::ExperienceGainProgress' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_ExperienceBar_C, CurrentLevel) == 0x000380, "Member 'UWBP_EndBattle_ExperienceBar_C::CurrentLevel' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_ExperienceBar_C, CurrentXP) == 0x000384, "Member 'UWBP_EndBattle_ExperienceBar_C::CurrentXP' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_ExperienceBar_C, TargetXP) == 0x000388, "Member 'UWBP_EndBattle_ExperienceBar_C::TargetXP' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_ExperienceBar_C, TargetLevel) == 0x00038C, "Member 'UWBP_EndBattle_ExperienceBar_C::TargetLevel' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_ExperienceBar_C, FinalLevel) == 0x000390, "Member 'UWBP_EndBattle_ExperienceBar_C::FinalLevel' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_ExperienceBar_C, FinalXP) == 0x000394, "Member 'UWBP_EndBattle_ExperienceBar_C::FinalXP' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_ExperienceBar_C, OnLevelUpTriggered) == 0x000398, "Member 'UWBP_EndBattle_ExperienceBar_C::OnLevelUpTriggered' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_ExperienceBar_C, OnLevelUpFinished) == 0x0003A8, "Member 'UWBP_EndBattle_ExperienceBar_C::OnLevelUpFinished' has a wrong offset!");

}

