#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SkillButtonModifier_RequiredStains

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EAttackType_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SkillButtonModifier_RequiredStains.WBP_SkillButtonModifier_RequiredStains_C
// 0x0060 (0x0340 - 0x02E0)
class UWBP_SkillButtonModifier_RequiredStains_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDynamicEntryBox*                       StainBox;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<EAttackType, int32>                      RequiredStains;                                    // 0x02F0(0x0050)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void Construct();
	void ExecuteUbergraph_WBP_SkillButtonModifier_RequiredStains(int32 EntryPoint);
	void UpdateStainsList();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SkillButtonModifier_RequiredStains_C">();
	}
	static class UWBP_SkillButtonModifier_RequiredStains_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SkillButtonModifier_RequiredStains_C>();
	}
};
static_assert(alignof(UWBP_SkillButtonModifier_RequiredStains_C) == 0x000008, "Wrong alignment on UWBP_SkillButtonModifier_RequiredStains_C");
static_assert(sizeof(UWBP_SkillButtonModifier_RequiredStains_C) == 0x000340, "Wrong size on UWBP_SkillButtonModifier_RequiredStains_C");
static_assert(offsetof(UWBP_SkillButtonModifier_RequiredStains_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_SkillButtonModifier_RequiredStains_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SkillButtonModifier_RequiredStains_C, StainBox) == 0x0002E8, "Member 'UWBP_SkillButtonModifier_RequiredStains_C::StainBox' has a wrong offset!");
static_assert(offsetof(UWBP_SkillButtonModifier_RequiredStains_C, RequiredStains) == 0x0002F0, "Member 'UWBP_SkillButtonModifier_RequiredStains_C::RequiredStains' has a wrong offset!");

}

