#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TargetWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TargetWidget.WBP_TargetWidget_C
// 0x0038 (0x0318 - 0x02E0)
class UWBP_TargetWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       LoopAnimation;                                     // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ArtDecoTarget;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SoloArrow_Bot;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SoloArrow_Left;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SoloArrow_Right;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SoloArrow_Top;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_TargetWidget(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TargetWidget_C">();
	}
	static class UWBP_TargetWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TargetWidget_C>();
	}
};
static_assert(alignof(UWBP_TargetWidget_C) == 0x000008, "Wrong alignment on UWBP_TargetWidget_C");
static_assert(sizeof(UWBP_TargetWidget_C) == 0x000318, "Wrong size on UWBP_TargetWidget_C");
static_assert(offsetof(UWBP_TargetWidget_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_TargetWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TargetWidget_C, LoopAnimation) == 0x0002E8, "Member 'UWBP_TargetWidget_C::LoopAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_TargetWidget_C, ArtDecoTarget) == 0x0002F0, "Member 'UWBP_TargetWidget_C::ArtDecoTarget' has a wrong offset!");
static_assert(offsetof(UWBP_TargetWidget_C, SoloArrow_Bot) == 0x0002F8, "Member 'UWBP_TargetWidget_C::SoloArrow_Bot' has a wrong offset!");
static_assert(offsetof(UWBP_TargetWidget_C, SoloArrow_Left) == 0x000300, "Member 'UWBP_TargetWidget_C::SoloArrow_Left' has a wrong offset!");
static_assert(offsetof(UWBP_TargetWidget_C, SoloArrow_Right) == 0x000308, "Member 'UWBP_TargetWidget_C::SoloArrow_Right' has a wrong offset!");
static_assert(offsetof(UWBP_TargetWidget_C, SoloArrow_Top) == 0x000310, "Member 'UWBP_TargetWidget_C::SoloArrow_Top' has a wrong offset!");

}

