#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WeaponLevelTooltip

#include "Basic.hpp"

#include "EWeaponQuality_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_WeaponLevelTooltip.WBP_WeaponLevelTooltip_C
// 0x0020 (0x0300 - 0x02E0)
class UWBP_WeaponLevelTooltip_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       Level;                                             // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       LevelTitle;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsColorQualityDependent;                           // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetLevel(int32 Level_0);
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WBP_WeaponLevelTooltip(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_WeaponLevelTooltip_C">();
	}
	static class UWBP_WeaponLevelTooltip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_WeaponLevelTooltip_C>();
	}
};
static_assert(alignof(UWBP_WeaponLevelTooltip_C) == 0x000008, "Wrong alignment on UWBP_WeaponLevelTooltip_C");
static_assert(sizeof(UWBP_WeaponLevelTooltip_C) == 0x000300, "Wrong size on UWBP_WeaponLevelTooltip_C");
static_assert(offsetof(UWBP_WeaponLevelTooltip_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_WeaponLevelTooltip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponLevelTooltip_C, Level) == 0x0002E8, "Member 'UWBP_WeaponLevelTooltip_C::Level' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponLevelTooltip_C, LevelTitle) == 0x0002F0, "Member 'UWBP_WeaponLevelTooltip_C::LevelTitle' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponLevelTooltip_C, IsColorQualityDependent) == 0x0002F8, "Member 'UWBP_WeaponLevelTooltip_C::IsColorQualityDependent' has a wrong offset!");

}

