#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_GM_ShowExperience

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_HUD_GM_ShowExperience.WBP_HUD_GM_ShowExperience_C.ExecuteUbergraph_WBP_HUD_GM_ShowExperience
// 0x0018 (0x0018 - 0x0000)
struct WBP_HUD_GM_ShowExperience_C_ExecuteUbergraph_WBP_HUD_GM_ShowExperience final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
};
static_assert(alignof(WBP_HUD_GM_ShowExperience_C_ExecuteUbergraph_WBP_HUD_GM_ShowExperience) == 0x000008, "Wrong alignment on WBP_HUD_GM_ShowExperience_C_ExecuteUbergraph_WBP_HUD_GM_ShowExperience");
static_assert(sizeof(WBP_HUD_GM_ShowExperience_C_ExecuteUbergraph_WBP_HUD_GM_ShowExperience) == 0x000018, "Wrong size on WBP_HUD_GM_ShowExperience_C_ExecuteUbergraph_WBP_HUD_GM_ShowExperience");
static_assert(offsetof(WBP_HUD_GM_ShowExperience_C_ExecuteUbergraph_WBP_HUD_GM_ShowExperience, EntryPoint) == 0x000000, "Member 'WBP_HUD_GM_ShowExperience_C_ExecuteUbergraph_WBP_HUD_GM_ShowExperience::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GM_ShowExperience_C_ExecuteUbergraph_WBP_HUD_GM_ShowExperience, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_HUD_GM_ShowExperience_C_ExecuteUbergraph_WBP_HUD_GM_ShowExperience::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WBP_HUD_GM_ShowExperience.WBP_HUD_GM_ShowExperience_C.SetExperienceGainProgress
// 0x0030 (0x0030 - 0x0000)
struct WBP_HUD_GM_ShowExperience_C_SetExperienceGainProgress final
{
public:
	double                                        ExperienceGainProgress_0;                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0010)()
};
static_assert(alignof(WBP_HUD_GM_ShowExperience_C_SetExperienceGainProgress) == 0x000008, "Wrong alignment on WBP_HUD_GM_ShowExperience_C_SetExperienceGainProgress");
static_assert(sizeof(WBP_HUD_GM_ShowExperience_C_SetExperienceGainProgress) == 0x000030, "Wrong size on WBP_HUD_GM_ShowExperience_C_SetExperienceGainProgress");
static_assert(offsetof(WBP_HUD_GM_ShowExperience_C_SetExperienceGainProgress, ExperienceGainProgress_0) == 0x000000, "Member 'WBP_HUD_GM_ShowExperience_C_SetExperienceGainProgress::ExperienceGainProgress_0' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GM_ShowExperience_C_SetExperienceGainProgress, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'WBP_HUD_GM_ShowExperience_C_SetExperienceGainProgress::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GM_ShowExperience_C_SetExperienceGainProgress, CallFunc_Lerp_ReturnValue) == 0x000010, "Member 'WBP_HUD_GM_ShowExperience_C_SetExperienceGainProgress::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GM_ShowExperience_C_SetExperienceGainProgress, CallFunc_FCeil_ReturnValue) == 0x000018, "Member 'WBP_HUD_GM_ShowExperience_C_SetExperienceGainProgress::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GM_ShowExperience_C_SetExperienceGainProgress, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'WBP_HUD_GM_ShowExperience_C_SetExperienceGainProgress::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WBP_HUD_GM_ShowExperience.WBP_HUD_GM_ShowExperience_C.SetExperienceTarget
// 0x0004 (0x0004 - 0x0000)
struct WBP_HUD_GM_ShowExperience_C_SetExperienceTarget final
{
public:
	int32                                         Number;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_GM_ShowExperience_C_SetExperienceTarget) == 0x000004, "Wrong alignment on WBP_HUD_GM_ShowExperience_C_SetExperienceTarget");
static_assert(sizeof(WBP_HUD_GM_ShowExperience_C_SetExperienceTarget) == 0x000004, "Wrong size on WBP_HUD_GM_ShowExperience_C_SetExperienceTarget");
static_assert(offsetof(WBP_HUD_GM_ShowExperience_C_SetExperienceTarget, Number) == 0x000000, "Member 'WBP_HUD_GM_ShowExperience_C_SetExperienceTarget::Number' has a wrong offset!");

// Function WBP_HUD_GM_ShowExperience.WBP_HUD_GM_ShowExperience_C.TriggerExperienceGainAnim
// 0x0008 (0x0008 - 0x0000)
struct WBP_HUD_GM_ShowExperience_C_TriggerExperienceGainAnim final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_GM_ShowExperience_C_TriggerExperienceGainAnim) == 0x000008, "Wrong alignment on WBP_HUD_GM_ShowExperience_C_TriggerExperienceGainAnim");
static_assert(sizeof(WBP_HUD_GM_ShowExperience_C_TriggerExperienceGainAnim) == 0x000008, "Wrong size on WBP_HUD_GM_ShowExperience_C_TriggerExperienceGainAnim");
static_assert(offsetof(WBP_HUD_GM_ShowExperience_C_TriggerExperienceGainAnim, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'WBP_HUD_GM_ShowExperience_C_TriggerExperienceGainAnim::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

}

