#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Loot_Currency

#include "Basic.hpp"

#include "WBP_Loot_Base_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Loot_Currency.WBP_Loot_Currency_C
// 0x0018 (0x0470 - 0x0458)
class UWBP_Loot_Currency_C final : public UWBP_Loot_Base_C
{
public:
	class UCommonLazyImage*                       CurrencyIcon;                                      // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CurrencyName;                                      // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CurrencyQuantity;                                  // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetItemData(class UBP_GeneratedItemInfo_Base_C* GeneratedItemInfo, const struct FS_LootContext& LootContext);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Loot_Currency_C">();
	}
	static class UWBP_Loot_Currency_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Loot_Currency_C>();
	}
};
static_assert(alignof(UWBP_Loot_Currency_C) == 0x000008, "Wrong alignment on UWBP_Loot_Currency_C");
static_assert(sizeof(UWBP_Loot_Currency_C) == 0x000470, "Wrong size on UWBP_Loot_Currency_C");
static_assert(offsetof(UWBP_Loot_Currency_C, CurrencyIcon) == 0x000458, "Member 'UWBP_Loot_Currency_C::CurrencyIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Loot_Currency_C, CurrencyName) == 0x000460, "Member 'UWBP_Loot_Currency_C::CurrencyName' has a wrong offset!");
static_assert(offsetof(UWBP_Loot_Currency_C, CurrencyQuantity) == 0x000468, "Member 'UWBP_Loot_Currency_C::CurrencyQuantity' has a wrong offset!");

}

