#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharacterMarker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CharacterMarker.WBP_CharacterMarker_C
// 0x0040 (0x0320 - 0x02E0)
class UWBP_CharacterMarker_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonLazyImage*                       CharacterPortrait;                                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_52;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Learnt;                                            // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_CharacterData_C*                    CharacterData;                                     // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDead;                                            // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLearnt;                                          // 0x0309(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30A[0x2];                                      // 0x030A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            Slate_Color;                                       // 0x030C(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void LoadDeadMaterial(class UMaterialInterface* DeadMaterial);
	void LoadTextureInMask(class UTexture* Texture);
	void PreConstruct(bool IsDesignTime);
	void SetCharacterData(class UBP_CharacterData_C* CharacterData_0, bool Learnt_0, bool IsDead_0);
	void Refresh();
	void SetCharacterDefinition(const struct FS_jRPG_CharacterDefinition& CharacterDefinition);
	void ExecuteUbergraph_WBP_CharacterMarker(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CharacterMarker_C">();
	}
	static class UWBP_CharacterMarker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CharacterMarker_C>();
	}
};
static_assert(alignof(UWBP_CharacterMarker_C) == 0x000008, "Wrong alignment on UWBP_CharacterMarker_C");
static_assert(sizeof(UWBP_CharacterMarker_C) == 0x000320, "Wrong size on UWBP_CharacterMarker_C");
static_assert(offsetof(UWBP_CharacterMarker_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_CharacterMarker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMarker_C, CharacterPortrait) == 0x0002E8, "Member 'UWBP_CharacterMarker_C::CharacterPortrait' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMarker_C, Image_52) == 0x0002F0, "Member 'UWBP_CharacterMarker_C::Image_52' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMarker_C, Learnt) == 0x0002F8, "Member 'UWBP_CharacterMarker_C::Learnt' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMarker_C, CharacterData) == 0x000300, "Member 'UWBP_CharacterMarker_C::CharacterData' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMarker_C, IsDead) == 0x000308, "Member 'UWBP_CharacterMarker_C::IsDead' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMarker_C, IsLearnt) == 0x000309, "Member 'UWBP_CharacterMarker_C::IsLearnt' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterMarker_C, Slate_Color) == 0x00030C, "Member 'UWBP_CharacterMarker_C::Slate_Color' has a wrong offset!");

}

