#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Items_Panel

#include "Basic.hpp"

#include "S_SortDropdownEntry_structs.hpp"
#include "E_jRPG_StatType_structs.hpp"
#include "S_jRPG_Item_StaticData_structs.hpp"
#include "BlueprintSorting_structs.hpp"
#include "E_jRPG_ItemType_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_Items_Panel.WBP_Items_Panel_C.BndEvt__WBP_Items_Panel_ItemsTileView_K2Node_ComponentBoundEvent_0_OnListEntryGeneratedDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Items_Panel_C_BndEvt__WBP_Items_Panel_ItemsTileView_K2Node_ComponentBoundEvent_0_OnListEntryGeneratedDynamic__DelegateSignature final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Items_Panel_C_BndEvt__WBP_Items_Panel_ItemsTileView_K2Node_ComponentBoundEvent_0_OnListEntryGeneratedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Items_Panel_C_BndEvt__WBP_Items_Panel_ItemsTileView_K2Node_ComponentBoundEvent_0_OnListEntryGeneratedDynamic__DelegateSignature");
static_assert(sizeof(WBP_Items_Panel_C_BndEvt__WBP_Items_Panel_ItemsTileView_K2Node_ComponentBoundEvent_0_OnListEntryGeneratedDynamic__DelegateSignature) == 0x000008, "Wrong size on WBP_Items_Panel_C_BndEvt__WBP_Items_Panel_ItemsTileView_K2Node_ComponentBoundEvent_0_OnListEntryGeneratedDynamic__DelegateSignature");
static_assert(offsetof(WBP_Items_Panel_C_BndEvt__WBP_Items_Panel_ItemsTileView_K2Node_ComponentBoundEvent_0_OnListEntryGeneratedDynamic__DelegateSignature, Widget) == 0x000000, "Member 'WBP_Items_Panel_C_BndEvt__WBP_Items_Panel_ItemsTileView_K2Node_ComponentBoundEvent_0_OnListEntryGeneratedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Items_Panel.WBP_Items_Panel_C.ExecuteUbergraph_WBP_Items_Panel
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_Items_Panel_C_ExecuteUbergraph_WBP_Items_Panel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate;           // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_Inventory_Item_Row_C* Widget)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_Inventory_Item_Row_C* Widget)> K2Node_CreateDelegate_OutputDelegate_3; // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue; // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm)
	TDelegate<void(class UBP_ItemFilter_Base_C* ItemFilter)> K2Node_CreateDelegate_OutputDelegate_4; // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_CustomEvent_Button;                         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget;                 // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Inventory_Item_Row_C*              K2Node_DynamicCast_AsWBP_Inventory_Item_Row;       // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Inventory_Item_Row_C*              K2Node_CustomEvent_Widget_1;                       // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Inventory_Item_Row_C*              K2Node_CustomEvent_Widget;                         // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_ItemFilter_Base_C*                  CallFunc_GetCurrentFilter_Filter;                  // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Items_Panel_C_ExecuteUbergraph_WBP_Items_Panel) == 0x000008, "Wrong alignment on WBP_Items_Panel_C_ExecuteUbergraph_WBP_Items_Panel");
static_assert(sizeof(WBP_Items_Panel_C_ExecuteUbergraph_WBP_Items_Panel) == 0x0000A8, "Wrong size on WBP_Items_Panel_C_ExecuteUbergraph_WBP_Items_Panel");
static_assert(offsetof(WBP_Items_Panel_C_ExecuteUbergraph_WBP_Items_Panel, EntryPoint) == 0x000000, "Member 'WBP_Items_Panel_C_ExecuteUbergraph_WBP_Items_Panel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ExecuteUbergraph_WBP_Items_Panel, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_Items_Panel_C_ExecuteUbergraph_WBP_Items_Panel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ExecuteUbergraph_WBP_Items_Panel, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_Items_Panel_C_ExecuteUbergraph_WBP_Items_Panel::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ExecuteUbergraph_WBP_Items_Panel, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'WBP_Items_Panel_C_ExecuteUbergraph_WBP_Items_Panel::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ExecuteUbergraph_WBP_Items_Panel, K2Node_CreateDelegate_OutputDelegate_3) == 0x000034, "Member 'WBP_Items_Panel_C_ExecuteUbergraph_WBP_Items_Panel::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ExecuteUbergraph_WBP_Items_Panel, CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue) == 0x000048, "Member 'WBP_Items_Panel_C_ExecuteUbergraph_WBP_Items_Panel::CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ExecuteUbergraph_WBP_Items_Panel, K2Node_MakeArray_Array) == 0x000050, "Member 'WBP_Items_Panel_C_ExecuteUbergraph_WBP_Items_Panel::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ExecuteUbergraph_WBP_Items_Panel, K2Node_CreateDelegate_OutputDelegate_4) == 0x000060, "Member 'WBP_Items_Panel_C_ExecuteUbergraph_WBP_Items_Panel::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ExecuteUbergraph_WBP_Items_Panel, K2Node_CustomEvent_Button) == 0x000070, "Member 'WBP_Items_Panel_C_ExecuteUbergraph_WBP_Items_Panel::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ExecuteUbergraph_WBP_Items_Panel, K2Node_ComponentBoundEvent_Widget) == 0x000078, "Member 'WBP_Items_Panel_C_ExecuteUbergraph_WBP_Items_Panel::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ExecuteUbergraph_WBP_Items_Panel, K2Node_DynamicCast_AsWBP_Inventory_Item_Row) == 0x000080, "Member 'WBP_Items_Panel_C_ExecuteUbergraph_WBP_Items_Panel::K2Node_DynamicCast_AsWBP_Inventory_Item_Row' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ExecuteUbergraph_WBP_Items_Panel, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'WBP_Items_Panel_C_ExecuteUbergraph_WBP_Items_Panel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ExecuteUbergraph_WBP_Items_Panel, K2Node_CustomEvent_Widget_1) == 0x000090, "Member 'WBP_Items_Panel_C_ExecuteUbergraph_WBP_Items_Panel::K2Node_CustomEvent_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ExecuteUbergraph_WBP_Items_Panel, K2Node_CustomEvent_Widget) == 0x000098, "Member 'WBP_Items_Panel_C_ExecuteUbergraph_WBP_Items_Panel::K2Node_CustomEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ExecuteUbergraph_WBP_Items_Panel, CallFunc_GetCurrentFilter_Filter) == 0x0000A0, "Member 'WBP_Items_Panel_C_ExecuteUbergraph_WBP_Items_Panel::CallFunc_GetCurrentFilter_Filter' has a wrong offset!");

// Function WBP_Items_Panel.WBP_Items_Panel_C.ItemsSortLambda
// 0x0440 (0x0440 - 0x0000)
struct WBP_Items_Panel_C_ItemsSortLambda final
{
public:
	class UBP_ItemInstance_Base_C*                ItemLhs;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_ItemInstance_Base_C*                ItemRhs;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOrderingResult*                        OrderingResult;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, E_jRPG_StatType>            NameToStatMap;                                     // 0x0018(0x0050)(Edit, BlueprintVisible)
	int32                                         Temp_int_Variable;                                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetAcquiredPlayTime_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_ItemInstance_Gear_C*                K2Node_DynamicCast_AsBP_Item_Instance_Gear;        // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetQuantity_ReturnValue;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentLevel_ReturnValue;              // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_jRPG_Item_StaticData                CallFunc_GetItemStaticData_ItemStaticData;         // 0x0090(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	double                                        CallFunc_GetAcquiredPlayTime_ReturnValue_1;        // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_SignOfFloat_ReturnValue;                  // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetQuantity_ReturnValue_1;                // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_ItemInstance_Gear_C*                K2Node_DynamicCast_AsBP_Item_Instance_Gear_1;      // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SignOfInteger_ReturnValue;                // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentLevel_ReturnValue_1;            // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_jRPG_Item_StaticData                CallFunc_GetItemStaticData_ItemStaticData_1;       // 0x0208(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0340(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESortOrdering                                 Temp_byte_Variable;                                // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x3];                                      // 0x0351(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CompareStrings_ReturnValue;               // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SignOfInteger_ReturnValue_1;              // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortOrdering                                 Temp_byte_Variable_1;                              // 0x035C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35D[0x3];                                      // 0x035D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortOrdering                                 Temp_byte_Variable_2;                              // 0x0364(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_365[0x3];                                      // 0x0365(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortOrdering                                 Temp_byte_Variable_3;                              // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortOrdering                                 Temp_byte_Variable_4;                              // 0x036D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortOrdering                                 Temp_byte_Variable_5;                              // 0x036E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36F[0x1];                                      // 0x036F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, E_jRPG_StatType>            K2Node_MakeVariable_MakeVariableOutput;            // 0x0370(0x0050)()
	ESortOrdering                                 K2Node_Select_Default;                             // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C1[0x3];                                      // 0x03C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_wildcard_Variable;                            // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortOrdering                                 Temp_byte_Variable_6;                              // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_SortDropdownEntry                   CallFunc_GetActiveDropdownEntry_ActiveDropdownEntry; // 0x03D0(0x0018)(HasGetValueTypeHash)
	int32                                         Temp_wildcard_Variable_1;                          // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1[0x3];                                      // 0x03F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SignOfInteger_ReturnValue_2;              // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x03FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortOrdering                                 K2Node_Select_Default_1;                           // 0x03FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortOrdering                                 Temp_byte_Variable_7;                              // 0x03FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortOrdering                                 Temp_byte_Variable_8;                              // 0x03FF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_SortDropdownEntry                   CallFunc_GetActiveDropdownEntry_ActiveDropdownEntry_1; // 0x0400(0x0018)(HasGetValueTypeHash)
	struct FS_SortDropdownEntry                   CallFunc_GetActiveDropdownEntry_ActiveDropdownEntry_2; // 0x0418(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_2;        // 0x0431(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_432[0x2];                                      // 0x0432(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortOrdering                                 K2Node_Select_Default_2;                           // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Items_Panel_C_ItemsSortLambda) == 0x000008, "Wrong alignment on WBP_Items_Panel_C_ItemsSortLambda");
static_assert(sizeof(WBP_Items_Panel_C_ItemsSortLambda) == 0x000440, "Wrong size on WBP_Items_Panel_C_ItemsSortLambda");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, ItemLhs) == 0x000000, "Member 'WBP_Items_Panel_C_ItemsSortLambda::ItemLhs' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, ItemRhs) == 0x000008, "Member 'WBP_Items_Panel_C_ItemsSortLambda::ItemRhs' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, OrderingResult) == 0x000010, "Member 'WBP_Items_Panel_C_ItemsSortLambda::OrderingResult' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, NameToStatMap) == 0x000018, "Member 'WBP_Items_Panel_C_ItemsSortLambda::NameToStatMap' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, Temp_int_Variable) == 0x000068, "Member 'WBP_Items_Panel_C_ItemsSortLambda::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, CallFunc_GetAcquiredPlayTime_ReturnValue) == 0x000070, "Member 'WBP_Items_Panel_C_ItemsSortLambda::CallFunc_GetAcquiredPlayTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, K2Node_DynamicCast_AsBP_Item_Instance_Gear) == 0x000078, "Member 'WBP_Items_Panel_C_ItemsSortLambda::K2Node_DynamicCast_AsBP_Item_Instance_Gear' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'WBP_Items_Panel_C_ItemsSortLambda::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, CallFunc_GetQuantity_ReturnValue) == 0x000084, "Member 'WBP_Items_Panel_C_ItemsSortLambda::CallFunc_GetQuantity_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, CallFunc_GetCurrentLevel_ReturnValue) == 0x000088, "Member 'WBP_Items_Panel_C_ItemsSortLambda::CallFunc_GetCurrentLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, CallFunc_GetItemStaticData_ItemStaticData) == 0x000090, "Member 'WBP_Items_Panel_C_ItemsSortLambda::CallFunc_GetItemStaticData_ItemStaticData' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, CallFunc_GetAcquiredPlayTime_ReturnValue_1) == 0x0001C0, "Member 'WBP_Items_Panel_C_ItemsSortLambda::CallFunc_GetAcquiredPlayTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0001C8, "Member 'WBP_Items_Panel_C_ItemsSortLambda::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, CallFunc_Conv_TextToString_ReturnValue) == 0x0001D0, "Member 'WBP_Items_Panel_C_ItemsSortLambda::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, CallFunc_SignOfFloat_ReturnValue) == 0x0001E0, "Member 'WBP_Items_Panel_C_ItemsSortLambda::CallFunc_SignOfFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, CallFunc_GetQuantity_ReturnValue_1) == 0x0001E8, "Member 'WBP_Items_Panel_C_ItemsSortLambda::CallFunc_GetQuantity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, CallFunc_FTrunc_ReturnValue) == 0x0001EC, "Member 'WBP_Items_Panel_C_ItemsSortLambda::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, K2Node_DynamicCast_AsBP_Item_Instance_Gear_1) == 0x0001F0, "Member 'WBP_Items_Panel_C_ItemsSortLambda::K2Node_DynamicCast_AsBP_Item_Instance_Gear_1' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, K2Node_DynamicCast_bSuccess_1) == 0x0001F8, "Member 'WBP_Items_Panel_C_ItemsSortLambda::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, CallFunc_SignOfInteger_ReturnValue) == 0x0001FC, "Member 'WBP_Items_Panel_C_ItemsSortLambda::CallFunc_SignOfInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, CallFunc_GetCurrentLevel_ReturnValue_1) == 0x000200, "Member 'WBP_Items_Panel_C_ItemsSortLambda::CallFunc_GetCurrentLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, CallFunc_Add_IntInt_ReturnValue) == 0x000204, "Member 'WBP_Items_Panel_C_ItemsSortLambda::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, CallFunc_GetItemStaticData_ItemStaticData_1) == 0x000208, "Member 'WBP_Items_Panel_C_ItemsSortLambda::CallFunc_GetItemStaticData_ItemStaticData_1' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000338, "Member 'WBP_Items_Panel_C_ItemsSortLambda::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000340, "Member 'WBP_Items_Panel_C_ItemsSortLambda::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, Temp_byte_Variable) == 0x000350, "Member 'WBP_Items_Panel_C_ItemsSortLambda::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, CallFunc_CompareStrings_ReturnValue) == 0x000354, "Member 'WBP_Items_Panel_C_ItemsSortLambda::CallFunc_CompareStrings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, CallFunc_SignOfInteger_ReturnValue_1) == 0x000358, "Member 'WBP_Items_Panel_C_ItemsSortLambda::CallFunc_SignOfInteger_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, Temp_byte_Variable_1) == 0x00035C, "Member 'WBP_Items_Panel_C_ItemsSortLambda::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, CallFunc_Add_IntInt_ReturnValue_1) == 0x000360, "Member 'WBP_Items_Panel_C_ItemsSortLambda::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, Temp_byte_Variable_2) == 0x000364, "Member 'WBP_Items_Panel_C_ItemsSortLambda::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, Temp_int_Variable_1) == 0x000368, "Member 'WBP_Items_Panel_C_ItemsSortLambda::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, Temp_byte_Variable_3) == 0x00036C, "Member 'WBP_Items_Panel_C_ItemsSortLambda::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, Temp_byte_Variable_4) == 0x00036D, "Member 'WBP_Items_Panel_C_ItemsSortLambda::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, Temp_byte_Variable_5) == 0x00036E, "Member 'WBP_Items_Panel_C_ItemsSortLambda::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, K2Node_MakeVariable_MakeVariableOutput) == 0x000370, "Member 'WBP_Items_Panel_C_ItemsSortLambda::K2Node_MakeVariable_MakeVariableOutput' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, K2Node_Select_Default) == 0x0003C0, "Member 'WBP_Items_Panel_C_ItemsSortLambda::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, Temp_wildcard_Variable) == 0x0003C4, "Member 'WBP_Items_Panel_C_ItemsSortLambda::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, Temp_byte_Variable_6) == 0x0003C8, "Member 'WBP_Items_Panel_C_ItemsSortLambda::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, CallFunc_GetActiveDropdownEntry_ActiveDropdownEntry) == 0x0003D0, "Member 'WBP_Items_Panel_C_ItemsSortLambda::CallFunc_GetActiveDropdownEntry_ActiveDropdownEntry' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, Temp_wildcard_Variable_1) == 0x0003E8, "Member 'WBP_Items_Panel_C_ItemsSortLambda::Temp_wildcard_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, CallFunc_Subtract_IntInt_ReturnValue) == 0x0003EC, "Member 'WBP_Items_Panel_C_ItemsSortLambda::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0003F0, "Member 'WBP_Items_Panel_C_ItemsSortLambda::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, CallFunc_SignOfInteger_ReturnValue_2) == 0x0003F4, "Member 'WBP_Items_Panel_C_ItemsSortLambda::CallFunc_SignOfInteger_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, CallFunc_Add_IntInt_ReturnValue_2) == 0x0003F8, "Member 'WBP_Items_Panel_C_ItemsSortLambda::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0003FC, "Member 'WBP_Items_Panel_C_ItemsSortLambda::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, K2Node_Select_Default_1) == 0x0003FD, "Member 'WBP_Items_Panel_C_ItemsSortLambda::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, Temp_byte_Variable_7) == 0x0003FE, "Member 'WBP_Items_Panel_C_ItemsSortLambda::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, Temp_byte_Variable_8) == 0x0003FF, "Member 'WBP_Items_Panel_C_ItemsSortLambda::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, CallFunc_GetActiveDropdownEntry_ActiveDropdownEntry_1) == 0x000400, "Member 'WBP_Items_Panel_C_ItemsSortLambda::CallFunc_GetActiveDropdownEntry_ActiveDropdownEntry_1' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, CallFunc_GetActiveDropdownEntry_ActiveDropdownEntry_2) == 0x000418, "Member 'WBP_Items_Panel_C_ItemsSortLambda::CallFunc_GetActiveDropdownEntry_ActiveDropdownEntry_2' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000430, "Member 'WBP_Items_Panel_C_ItemsSortLambda::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, CallFunc_EqualEqual_NameName_ReturnValue_2) == 0x000431, "Member 'WBP_Items_Panel_C_ItemsSortLambda::CallFunc_EqualEqual_NameName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, Temp_int_Variable_2) == 0x000434, "Member 'WBP_Items_Panel_C_ItemsSortLambda::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_ItemsSortLambda, K2Node_Select_Default_2) == 0x000438, "Member 'WBP_Items_Panel_C_ItemsSortLambda::K2Node_Select_Default_2' has a wrong offset!");

// Function WBP_Items_Panel.WBP_Items_Panel_C.LoadItems
// 0x02F0 (0x02F0 - 0x0000)
struct WBP_Items_Panel_C_LoadItems final
{
public:
	class UBP_ItemFilter_Base_C*                  ItemFilter;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ItemFilter_Base_C*                  CallFunc_GetCurrentFilter_Filter;                  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_ItemUpgradeSystem_C*                CallFunc_GetItemUpgradeSystem_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_ItemInstance_Base_C*>        CallFunc_GetAllItemInstances_ReturnValue;          // 0x0038(0x0010)(ReferenceParm)
	class UBP_ItemInstance_Base_C*                CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_jRPG_Item_StaticData                CallFunc_GetItemStaticData_ItemStaticData;         // 0x0050(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_ItemFilterInterface_C> CallFunc_ExecuteFilter_self_CastInput;        // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_ItemInstance_Base_C*>        CallFunc_ExecuteFilter_FilteredItemInstances;      // 0x0198(0x0010)(ReferenceParm)
	class UBP_ItemInstance_Base_C*                CallFunc_Array_Get_Item_1;                         // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_jRPG_Item_StaticData                CallFunc_GetItemStaticData_ItemStaticData_1;       // 0x01B8(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Items_Panel_C_LoadItems) == 0x000008, "Wrong alignment on WBP_Items_Panel_C_LoadItems");
static_assert(sizeof(WBP_Items_Panel_C_LoadItems) == 0x0002F0, "Wrong size on WBP_Items_Panel_C_LoadItems");
static_assert(offsetof(WBP_Items_Panel_C_LoadItems, ItemFilter) == 0x000000, "Member 'WBP_Items_Panel_C_LoadItems::ItemFilter' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_LoadItems, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_Items_Panel_C_LoadItems::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_LoadItems, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'WBP_Items_Panel_C_LoadItems::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_LoadItems, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WBP_Items_Panel_C_LoadItems::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_LoadItems, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WBP_Items_Panel_C_LoadItems::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_LoadItems, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'WBP_Items_Panel_C_LoadItems::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_LoadItems, Temp_int_Loop_Counter_Variable_1) == 0x00001C, "Member 'WBP_Items_Panel_C_LoadItems::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_LoadItems, CallFunc_Add_IntInt_ReturnValue_1) == 0x000020, "Member 'WBP_Items_Panel_C_LoadItems::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_LoadItems, CallFunc_GetCurrentFilter_Filter) == 0x000028, "Member 'WBP_Items_Panel_C_LoadItems::CallFunc_GetCurrentFilter_Filter' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_LoadItems, CallFunc_GetItemUpgradeSystem_ReturnValue) == 0x000030, "Member 'WBP_Items_Panel_C_LoadItems::CallFunc_GetItemUpgradeSystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_LoadItems, CallFunc_GetAllItemInstances_ReturnValue) == 0x000038, "Member 'WBP_Items_Panel_C_LoadItems::CallFunc_GetAllItemInstances_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_LoadItems, CallFunc_Array_Get_Item) == 0x000048, "Member 'WBP_Items_Panel_C_LoadItems::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_LoadItems, CallFunc_GetItemStaticData_ItemStaticData) == 0x000050, "Member 'WBP_Items_Panel_C_LoadItems::CallFunc_GetItemStaticData_ItemStaticData' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_LoadItems, CallFunc_Array_Length_ReturnValue) == 0x000180, "Member 'WBP_Items_Panel_C_LoadItems::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_LoadItems, CallFunc_Less_IntInt_ReturnValue) == 0x000184, "Member 'WBP_Items_Panel_C_LoadItems::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_LoadItems, CallFunc_ExecuteFilter_self_CastInput) == 0x000188, "Member 'WBP_Items_Panel_C_LoadItems::CallFunc_ExecuteFilter_self_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_LoadItems, CallFunc_ExecuteFilter_FilteredItemInstances) == 0x000198, "Member 'WBP_Items_Panel_C_LoadItems::CallFunc_ExecuteFilter_FilteredItemInstances' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_LoadItems, CallFunc_Array_Get_Item_1) == 0x0001A8, "Member 'WBP_Items_Panel_C_LoadItems::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_LoadItems, CallFunc_Array_Length_ReturnValue_1) == 0x0001B0, "Member 'WBP_Items_Panel_C_LoadItems::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_LoadItems, CallFunc_GetItemStaticData_ItemStaticData_1) == 0x0001B8, "Member 'WBP_Items_Panel_C_LoadItems::CallFunc_GetItemStaticData_ItemStaticData_1' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_LoadItems, CallFunc_Less_IntInt_ReturnValue_1) == 0x0002E8, "Member 'WBP_Items_Panel_C_LoadItems::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_Items_Panel.WBP_Items_Panel_C.OnBackClicked
// 0x0008 (0x0008 - 0x0000)
struct WBP_Items_Panel_C_OnBackClicked final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Items_Panel_C_OnBackClicked) == 0x000008, "Wrong alignment on WBP_Items_Panel_C_OnBackClicked");
static_assert(sizeof(WBP_Items_Panel_C_OnBackClicked) == 0x000008, "Wrong size on WBP_Items_Panel_C_OnBackClicked");
static_assert(offsetof(WBP_Items_Panel_C_OnBackClicked, Button) == 0x000000, "Member 'WBP_Items_Panel_C_OnBackClicked::Button' has a wrong offset!");

// Function WBP_Items_Panel.WBP_Items_Panel_C.OnInventoryItemClicked
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_Items_Panel_C_OnInventoryItemClicked final
{
public:
	class UWBP_Inventory_Item_Row_C*              ItemWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IUserObjectListEntry>  CallFunc_GetListItemObject_UserObjectListEntry_CastInput; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetListItemObject_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_ItemInstance_Base_C*                K2Node_DynamicCast_AsBP_Item_Instance_Base;        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CommonActionBarContainer_C*        CallFunc_GetGameMenuActionBarFromPanel_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FS_jRPG_Item_StaticData                CallFunc_GetItemStaticData_ItemStaticData;         // 0x0038(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16A[0x6];                                      // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CommonBoundActionButton_C*         CallFunc_FindActionButtonFromButton_CommonButtonBase; // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Controller_World_C*            K2Node_DynamicCast_AsBP_J_RPG_Controller_World;    // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_192[0x6];                                      // 0x0192(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Controller_World_C*            K2Node_DynamicCast_AsBP_J_RPG_Controller_World_1;  // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Items_Panel_C_OnInventoryItemClicked) == 0x000008, "Wrong alignment on WBP_Items_Panel_C_OnInventoryItemClicked");
static_assert(sizeof(WBP_Items_Panel_C_OnInventoryItemClicked) == 0x0001B0, "Wrong size on WBP_Items_Panel_C_OnInventoryItemClicked");
static_assert(offsetof(WBP_Items_Panel_C_OnInventoryItemClicked, ItemWidget) == 0x000000, "Member 'WBP_Items_Panel_C_OnInventoryItemClicked::ItemWidget' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_OnInventoryItemClicked, CallFunc_GetListItemObject_UserObjectListEntry_CastInput) == 0x000008, "Member 'WBP_Items_Panel_C_OnInventoryItemClicked::CallFunc_GetListItemObject_UserObjectListEntry_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_OnInventoryItemClicked, CallFunc_GetListItemObject_ReturnValue) == 0x000018, "Member 'WBP_Items_Panel_C_OnInventoryItemClicked::CallFunc_GetListItemObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_OnInventoryItemClicked, K2Node_DynamicCast_AsBP_Item_Instance_Base) == 0x000020, "Member 'WBP_Items_Panel_C_OnInventoryItemClicked::K2Node_DynamicCast_AsBP_Item_Instance_Base' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_OnInventoryItemClicked, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_Items_Panel_C_OnInventoryItemClicked::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_OnInventoryItemClicked, CallFunc_GetGameMenuActionBarFromPanel_ReturnValue) == 0x000030, "Member 'WBP_Items_Panel_C_OnInventoryItemClicked::CallFunc_GetGameMenuActionBarFromPanel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_OnInventoryItemClicked, CallFunc_GetItemStaticData_ItemStaticData) == 0x000038, "Member 'WBP_Items_Panel_C_OnInventoryItemClicked::CallFunc_GetItemStaticData_ItemStaticData' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_OnInventoryItemClicked, CallFunc_IsValid_ReturnValue) == 0x000168, "Member 'WBP_Items_Panel_C_OnInventoryItemClicked::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_OnInventoryItemClicked, K2Node_SwitchEnum_CmpSuccess) == 0x000169, "Member 'WBP_Items_Panel_C_OnInventoryItemClicked::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_OnInventoryItemClicked, CallFunc_FindActionButtonFromButton_CommonButtonBase) == 0x000170, "Member 'WBP_Items_Panel_C_OnInventoryItemClicked::CallFunc_FindActionButtonFromButton_CommonButtonBase' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_OnInventoryItemClicked, CallFunc_GetPlayerController_ReturnValue) == 0x000178, "Member 'WBP_Items_Panel_C_OnInventoryItemClicked::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_OnInventoryItemClicked, CallFunc_IsVisible_ReturnValue) == 0x000180, "Member 'WBP_Items_Panel_C_OnInventoryItemClicked::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_OnInventoryItemClicked, K2Node_DynamicCast_AsBP_J_RPG_Controller_World) == 0x000188, "Member 'WBP_Items_Panel_C_OnInventoryItemClicked::K2Node_DynamicCast_AsBP_J_RPG_Controller_World' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_OnInventoryItemClicked, K2Node_DynamicCast_bSuccess_1) == 0x000190, "Member 'WBP_Items_Panel_C_OnInventoryItemClicked::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_OnInventoryItemClicked, CallFunc_IsValid_ReturnValue_1) == 0x000191, "Member 'WBP_Items_Panel_C_OnInventoryItemClicked::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_OnInventoryItemClicked, CallFunc_GetPlayerController_ReturnValue_1) == 0x000198, "Member 'WBP_Items_Panel_C_OnInventoryItemClicked::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_OnInventoryItemClicked, K2Node_DynamicCast_AsBP_J_RPG_Controller_World_1) == 0x0001A0, "Member 'WBP_Items_Panel_C_OnInventoryItemClicked::K2Node_DynamicCast_AsBP_J_RPG_Controller_World_1' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_OnInventoryItemClicked, K2Node_DynamicCast_bSuccess_2) == 0x0001A8, "Member 'WBP_Items_Panel_C_OnInventoryItemClicked::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function WBP_Items_Panel.WBP_Items_Panel_C.OnInventoryItemFocused
// 0x01B8 (0x01B8 - 0x0000)
struct WBP_Items_Panel_C_OnInventoryItemFocused final
{
public:
	class UWBP_Inventory_Item_Row_C*              ItemWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IUserObjectListEntry>  CallFunc_GetListItemObject_UserObjectListEntry_CastInput; // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetListItemObject_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_ItemInstance_Base_C*                K2Node_DynamicCast_AsBP_Item_Instance_Base;        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_jRPG_ItemType                               CallFunc_GetItemType_Item_Type;                    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_jRPG_Item_StaticData                CallFunc_GetItemStaticData_ItemStaticData;         // 0x0038(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetNameFromItemSubtype_Name;              // 0x016C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17A[0x2];                                      // 0x017A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_CharacterData_C*>            CallFunc_GetCharacterCollection_Characters;        // 0x0190(0x0010)(ReferenceParm)
	class UBP_CharacterData_C*                    CallFunc_Array_Get_Item;                           // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_2;        // 0x01AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01AF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_3;        // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_4;        // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Items_Panel_C_OnInventoryItemFocused) == 0x000008, "Wrong alignment on WBP_Items_Panel_C_OnInventoryItemFocused");
static_assert(sizeof(WBP_Items_Panel_C_OnInventoryItemFocused) == 0x0001B8, "Wrong size on WBP_Items_Panel_C_OnInventoryItemFocused");
static_assert(offsetof(WBP_Items_Panel_C_OnInventoryItemFocused, ItemWidget) == 0x000000, "Member 'WBP_Items_Panel_C_OnInventoryItemFocused::ItemWidget' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_OnInventoryItemFocused, Temp_bool_True_if_break_was_hit_Variable) == 0x000008, "Member 'WBP_Items_Panel_C_OnInventoryItemFocused::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_OnInventoryItemFocused, CallFunc_GetListItemObject_UserObjectListEntry_CastInput) == 0x000010, "Member 'WBP_Items_Panel_C_OnInventoryItemFocused::CallFunc_GetListItemObject_UserObjectListEntry_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_OnInventoryItemFocused, CallFunc_GetListItemObject_ReturnValue) == 0x000020, "Member 'WBP_Items_Panel_C_OnInventoryItemFocused::CallFunc_GetListItemObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_OnInventoryItemFocused, K2Node_DynamicCast_AsBP_Item_Instance_Base) == 0x000028, "Member 'WBP_Items_Panel_C_OnInventoryItemFocused::K2Node_DynamicCast_AsBP_Item_Instance_Base' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_OnInventoryItemFocused, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_Items_Panel_C_OnInventoryItemFocused::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_OnInventoryItemFocused, CallFunc_Not_PreBool_ReturnValue) == 0x000031, "Member 'WBP_Items_Panel_C_OnInventoryItemFocused::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_OnInventoryItemFocused, CallFunc_GetItemType_Item_Type) == 0x000032, "Member 'WBP_Items_Panel_C_OnInventoryItemFocused::CallFunc_GetItemType_Item_Type' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_OnInventoryItemFocused, CallFunc_GetItemStaticData_ItemStaticData) == 0x000038, "Member 'WBP_Items_Panel_C_OnInventoryItemFocused::CallFunc_GetItemStaticData_ItemStaticData' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_OnInventoryItemFocused, K2Node_SwitchEnum_CmpSuccess) == 0x000168, "Member 'WBP_Items_Panel_C_OnInventoryItemFocused::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_OnInventoryItemFocused, CallFunc_GetNameFromItemSubtype_Name) == 0x00016C, "Member 'WBP_Items_Panel_C_OnInventoryItemFocused::CallFunc_GetNameFromItemSubtype_Name' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_OnInventoryItemFocused, Temp_int_Array_Index_Variable) == 0x000174, "Member 'WBP_Items_Panel_C_OnInventoryItemFocused::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Items_Panel_C_OnInventoryItemFocused, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000178, "Member 'WBP_Items_Panel_C_OnInventoryItemFocused::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
