#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TutorialCollection

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SandFall_structs.hpp"
#include "CommonUI_classes.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TutorialCollection.WBP_TutorialCollection_C
// 0x0058 (0x0488 - 0x0430)
class UWBP_TutorialCollection_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_CommonBoundActionButton_C*         WBP_CommonBoundActionButton_Back;                  // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonBoundActionButton_C*         WBP_CommonBoundActionButton_ScrollEntry;           // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TutorialContent_C*                 WBP_TutorialContent;                               // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TutorialEntriesList_C*             WBP_TutorialEntriesList;                           // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSoundEventDataTableRowHandle          SD_OnActivated;                                    // 0x0458(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FSoundEventDataTableRowHandle          SD_OnDeactivated;                                  // 0x0468(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	TMulticastInlineDelegate<void()>              OnBackToOwnerPressed;                              // 0x0478(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_TutorialCollection_WBP_CommonBoundActionButton_Back_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_TutorialCollection_WBP_TutorialEntriesList_K2Node_ComponentBoundEvent_0_OnTutorialItemNavigated__DelegateSignature(class UBP_TutorialViewItem_C* TutorialViewItem);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void Construct();
	void ExecuteUbergraph_WBP_TutorialCollection(int32 EntryPoint);
	void InpActEvt_IA_UI_Menu_ScrollEntry_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void OnInputMethodChanged_Event(ECommonInputType bNewInputType);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TutorialCollection_C">();
	}
	static class UWBP_TutorialCollection_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TutorialCollection_C>();
	}
};
static_assert(alignof(UWBP_TutorialCollection_C) == 0x000008, "Wrong alignment on UWBP_TutorialCollection_C");
static_assert(sizeof(UWBP_TutorialCollection_C) == 0x000488, "Wrong size on UWBP_TutorialCollection_C");
static_assert(offsetof(UWBP_TutorialCollection_C, UberGraphFrame) == 0x000430, "Member 'UWBP_TutorialCollection_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialCollection_C, WBP_CommonBoundActionButton_Back) == 0x000438, "Member 'UWBP_TutorialCollection_C::WBP_CommonBoundActionButton_Back' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialCollection_C, WBP_CommonBoundActionButton_ScrollEntry) == 0x000440, "Member 'UWBP_TutorialCollection_C::WBP_CommonBoundActionButton_ScrollEntry' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialCollection_C, WBP_TutorialContent) == 0x000448, "Member 'UWBP_TutorialCollection_C::WBP_TutorialContent' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialCollection_C, WBP_TutorialEntriesList) == 0x000450, "Member 'UWBP_TutorialCollection_C::WBP_TutorialEntriesList' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialCollection_C, SD_OnActivated) == 0x000458, "Member 'UWBP_TutorialCollection_C::SD_OnActivated' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialCollection_C, SD_OnDeactivated) == 0x000468, "Member 'UWBP_TutorialCollection_C::SD_OnDeactivated' has a wrong offset!");
static_assert(offsetof(UWBP_TutorialCollection_C, OnBackToOwnerPressed) == 0x000478, "Member 'UWBP_TutorialCollection_C::OnBackToOwnerPressed' has a wrong offset!");

}

