#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_BattleActionTooltip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUD_BattleActionTooltip.WBP_HUD_BattleActionTooltip_C
// 0x0050 (0x0330 - 0x02E0)
class UWBP_HUD_BattleActionTooltip_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Disappear;                                    // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Appear;                                       // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background_Solid;                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LineBottom;                                  // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LineBottom_Dark;                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LineBottom_Top;                              // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LineBottom_Top_Dark;                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TitleText;                                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Appear(bool AutoFadeout);
	void Disappear();
	void ExecuteUbergraph_WBP_HUD_BattleActionTooltip(int32 EntryPoint);
	void ShowTooltip(const class FText& ToolTipText_0, bool AutoFadeout);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUD_BattleActionTooltip_C">();
	}
	static class UWBP_HUD_BattleActionTooltip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_BattleActionTooltip_C>();
	}
};
static_assert(alignof(UWBP_HUD_BattleActionTooltip_C) == 0x000008, "Wrong alignment on UWBP_HUD_BattleActionTooltip_C");
static_assert(sizeof(UWBP_HUD_BattleActionTooltip_C) == 0x000330, "Wrong size on UWBP_HUD_BattleActionTooltip_C");
static_assert(offsetof(UWBP_HUD_BattleActionTooltip_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_HUD_BattleActionTooltip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_BattleActionTooltip_C, Anim_Disappear) == 0x0002E8, "Member 'UWBP_HUD_BattleActionTooltip_C::Anim_Disappear' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_BattleActionTooltip_C, Anim_Appear) == 0x0002F0, "Member 'UWBP_HUD_BattleActionTooltip_C::Anim_Appear' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_BattleActionTooltip_C, Image_Background) == 0x0002F8, "Member 'UWBP_HUD_BattleActionTooltip_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_BattleActionTooltip_C, Image_Background_Solid) == 0x000300, "Member 'UWBP_HUD_BattleActionTooltip_C::Image_Background_Solid' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_BattleActionTooltip_C, Image_LineBottom) == 0x000308, "Member 'UWBP_HUD_BattleActionTooltip_C::Image_LineBottom' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_BattleActionTooltip_C, Image_LineBottom_Dark) == 0x000310, "Member 'UWBP_HUD_BattleActionTooltip_C::Image_LineBottom_Dark' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_BattleActionTooltip_C, Image_LineBottom_Top) == 0x000318, "Member 'UWBP_HUD_BattleActionTooltip_C::Image_LineBottom_Top' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_BattleActionTooltip_C, Image_LineBottom_Top_Dark) == 0x000320, "Member 'UWBP_HUD_BattleActionTooltip_C::Image_LineBottom_Top_Dark' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_BattleActionTooltip_C, TitleText) == 0x000328, "Member 'UWBP_HUD_BattleActionTooltip_C::TitleText' has a wrong offset!");

}

