#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharacterSelectorEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CharacterSelectorEntry.WBP_CharacterSelectorEntry_C
// 0x0050 (0x0330 - 0x02E0)
class UWBP_CharacterSelectorEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_NotificationBullet_C*              CharacterNotificationBullet;                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_CharacterPortrait;                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       PartyIndicator;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_MaskPortrait;                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CharacterSelectorButton_C*         WBP_CharacterSelectorButton;                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UBP_CharacterData_C* CharacterData)> OnPortraitClicked;      // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UBP_CharacterData_C*                    CharacterData;                                     // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldShowNotification;                           // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BPI_ShouldShowNotification(bool* bShouldShow);
	void GetTiedObject(class UObject** Object);
	void LoadCharacter(class UBP_CharacterData_C* CharacterData_0);
	void BPI_OnMarkNotificationAsRead(class UUserWidget* MarkCaller);
	void OnUINavigationFocusLost();
	void OnUIAction();
	void OnUINavigationFocus(const class UBP_UINavigationFocusEvent_C* FocusEventBP);
	void SetNotificationEnabled(bool Enabled);
	void BndEvt__WBP_CharacterSelectorEntry_WBP_CharacterSelectorButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WBP_CharacterSelectorEntry(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CharacterSelectorEntry_C">();
	}
	static class UWBP_CharacterSelectorEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CharacterSelectorEntry_C>();
	}
};
static_assert(alignof(UWBP_CharacterSelectorEntry_C) == 0x000008, "Wrong alignment on UWBP_CharacterSelectorEntry_C");
static_assert(sizeof(UWBP_CharacterSelectorEntry_C) == 0x000330, "Wrong size on UWBP_CharacterSelectorEntry_C");
static_assert(offsetof(UWBP_CharacterSelectorEntry_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_CharacterSelectorEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelectorEntry_C, CharacterNotificationBullet) == 0x0002E8, "Member 'UWBP_CharacterSelectorEntry_C::CharacterNotificationBullet' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelectorEntry_C, Image_CharacterPortrait) == 0x0002F0, "Member 'UWBP_CharacterSelectorEntry_C::Image_CharacterPortrait' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelectorEntry_C, PartyIndicator) == 0x0002F8, "Member 'UWBP_CharacterSelectorEntry_C::PartyIndicator' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelectorEntry_C, RetainerBox_MaskPortrait) == 0x000300, "Member 'UWBP_CharacterSelectorEntry_C::RetainerBox_MaskPortrait' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelectorEntry_C, WBP_CharacterSelectorButton) == 0x000308, "Member 'UWBP_CharacterSelectorEntry_C::WBP_CharacterSelectorButton' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelectorEntry_C, OnPortraitClicked) == 0x000310, "Member 'UWBP_CharacterSelectorEntry_C::OnPortraitClicked' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelectorEntry_C, CharacterData) == 0x000320, "Member 'UWBP_CharacterSelectorEntry_C::CharacterData' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelectorEntry_C, bShouldShowNotification) == 0x000328, "Member 'UWBP_CharacterSelectorEntry_C::bShouldShowNotification' has a wrong offset!");

}

