#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_QTE

#include "Basic.hpp"

#include "WBP_HUD_QTE_Base_classes.hpp"
#include "Engine_structs.hpp"
#include "EButton_Control_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUD_QTE.WBP_HUD_QTE_C
// 0x0140 (0x04B0 - 0x0370)
class UWBP_HUD_QTE_C final : public UWBP_HUD_QTE_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_HUD_QTE_C;                      // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_AutoQTE;                                      // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Fail;                                         // 0x0380(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Success_Perfect;                              // 0x0388(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Success;                                      // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Perfect;                                      // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Appear;                                       // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_ProgressBar;                                  // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Angle_ArtDeco_Left;                          // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Angle_ArtDeco_Right;                         // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background_1;                                // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Circle__Full;                                // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_CircleDot;                                   // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_CircleDotPerfect;                            // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_CircleIn;                                    // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_CursorProgress;                              // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Flare;                                       // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LineBottom;                                  // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LineFive_1;                                  // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LineFour;                                    // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LineFour_Thin;                               // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LineLeft;                                    // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LineOne;                                     // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LineOne_1;                                   // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LineRight;                                   // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LineThree;                                   // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LineThree_1;                                 // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LineTop;                                     // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LineTwo;                                     // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LineTwo_1;                                   // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Square;                                      // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Square_1;                                    // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Square_2;                                    // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InputActionBinding_C*              WBP_GenericInputActionBinding_QTE_Ico;             // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          isPerfect;                                         // 0x0488(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFailed;                                          // 0x0489(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48A[0x6];                                      // 0x048A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        PreDurationRealTime;                               // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ValidityDurationRealTime;                          // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              NewEventDispatcher;                                // 0x04A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	double GetProgressAnimPlaybackSpeed();
	class FString GetDebugString();
	double GetProgressAnimPlaybackSpeedOld();
	double GetAppearAnimPlaybackSpeed();
	void PlayFinalAnimation(bool IsSuccess, bool isPerfect_0);
	double GetBasePlaybackSpeed();
	void GetAnim_PerfectNotification(class UWidgetAnimation** Animation);
	void GetAnim_AnticipationFlash(class UWidgetAnimation** Animation);
	void GetAnim_Success(class UWidgetAnimation** Anim_Success_0);
	void GetAnim_Success_Perfect(class UWidgetAnimation** Anim_Success_Perfect_0);
	void GetAnim_Fail(class UWidgetAnimation** Anim_Fail_0);
	void GetAnim_Progress(class UWidgetAnimation** Animation);
	void OnProgressAnimationFinished();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void OnAppearAnimationFinished();
	void Perfect_QTE();
	void Regular_QTE();
	void Miss_QTE();
	void Construct();
	void StartQTE(double NowTime, double PreDuration, double ValidityDuration, class ULevelSequencePlayer* TimeSource);
	void QTE_Animations();
	void ExecuteUbergraph_WBP_HUD_QTE(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUD_QTE_C">();
	}
	static class UWBP_HUD_QTE_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_QTE_C>();
	}
};
static_assert(alignof(UWBP_HUD_QTE_C) == 0x000008, "Wrong alignment on UWBP_HUD_QTE_C");
static_assert(sizeof(UWBP_HUD_QTE_C) == 0x0004B0, "Wrong size on UWBP_HUD_QTE_C");
static_assert(offsetof(UWBP_HUD_QTE_C, UberGraphFrame_WBP_HUD_QTE_C) == 0x000370, "Member 'UWBP_HUD_QTE_C::UberGraphFrame_WBP_HUD_QTE_C' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, Anim_AutoQTE) == 0x000378, "Member 'UWBP_HUD_QTE_C::Anim_AutoQTE' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, Anim_Fail) == 0x000380, "Member 'UWBP_HUD_QTE_C::Anim_Fail' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, Anim_Success_Perfect) == 0x000388, "Member 'UWBP_HUD_QTE_C::Anim_Success_Perfect' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, Anim_Success) == 0x000390, "Member 'UWBP_HUD_QTE_C::Anim_Success' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, Anim_Perfect) == 0x000398, "Member 'UWBP_HUD_QTE_C::Anim_Perfect' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, Anim_Appear) == 0x0003A0, "Member 'UWBP_HUD_QTE_C::Anim_Appear' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, Anim_ProgressBar) == 0x0003A8, "Member 'UWBP_HUD_QTE_C::Anim_ProgressBar' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, Image_Angle_ArtDeco_Left) == 0x0003B0, "Member 'UWBP_HUD_QTE_C::Image_Angle_ArtDeco_Left' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, Image_Angle_ArtDeco_Right) == 0x0003B8, "Member 'UWBP_HUD_QTE_C::Image_Angle_ArtDeco_Right' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, Image_Background) == 0x0003C0, "Member 'UWBP_HUD_QTE_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, Image_Background_1) == 0x0003C8, "Member 'UWBP_HUD_QTE_C::Image_Background_1' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, Image_Circle__Full) == 0x0003D0, "Member 'UWBP_HUD_QTE_C::Image_Circle__Full' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, Image_CircleDot) == 0x0003D8, "Member 'UWBP_HUD_QTE_C::Image_CircleDot' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, Image_CircleDotPerfect) == 0x0003E0, "Member 'UWBP_HUD_QTE_C::Image_CircleDotPerfect' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, Image_CircleIn) == 0x0003E8, "Member 'UWBP_HUD_QTE_C::Image_CircleIn' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, Image_CursorProgress) == 0x0003F0, "Member 'UWBP_HUD_QTE_C::Image_CursorProgress' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, Image_Flare) == 0x0003F8, "Member 'UWBP_HUD_QTE_C::Image_Flare' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, Image_LineBottom) == 0x000400, "Member 'UWBP_HUD_QTE_C::Image_LineBottom' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, Image_LineFive_1) == 0x000408, "Member 'UWBP_HUD_QTE_C::Image_LineFive_1' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, Image_LineFour) == 0x000410, "Member 'UWBP_HUD_QTE_C::Image_LineFour' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, Image_LineFour_Thin) == 0x000418, "Member 'UWBP_HUD_QTE_C::Image_LineFour_Thin' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, Image_LineLeft) == 0x000420, "Member 'UWBP_HUD_QTE_C::Image_LineLeft' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, Image_LineOne) == 0x000428, "Member 'UWBP_HUD_QTE_C::Image_LineOne' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, Image_LineOne_1) == 0x000430, "Member 'UWBP_HUD_QTE_C::Image_LineOne_1' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, Image_LineRight) == 0x000438, "Member 'UWBP_HUD_QTE_C::Image_LineRight' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, Image_LineThree) == 0x000440, "Member 'UWBP_HUD_QTE_C::Image_LineThree' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, Image_LineThree_1) == 0x000448, "Member 'UWBP_HUD_QTE_C::Image_LineThree_1' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, Image_LineTop) == 0x000450, "Member 'UWBP_HUD_QTE_C::Image_LineTop' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, Image_LineTwo) == 0x000458, "Member 'UWBP_HUD_QTE_C::Image_LineTwo' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, Image_LineTwo_1) == 0x000460, "Member 'UWBP_HUD_QTE_C::Image_LineTwo_1' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, Image_Square) == 0x000468, "Member 'UWBP_HUD_QTE_C::Image_Square' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, Image_Square_1) == 0x000470, "Member 'UWBP_HUD_QTE_C::Image_Square_1' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, Image_Square_2) == 0x000478, "Member 'UWBP_HUD_QTE_C::Image_Square_2' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, WBP_GenericInputActionBinding_QTE_Ico) == 0x000480, "Member 'UWBP_HUD_QTE_C::WBP_GenericInputActionBinding_QTE_Ico' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, isPerfect) == 0x000488, "Member 'UWBP_HUD_QTE_C::isPerfect' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, IsFailed) == 0x000489, "Member 'UWBP_HUD_QTE_C::IsFailed' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, PreDurationRealTime) == 0x000490, "Member 'UWBP_HUD_QTE_C::PreDurationRealTime' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, ValidityDurationRealTime) == 0x000498, "Member 'UWBP_HUD_QTE_C::ValidityDurationRealTime' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_QTE_C, NewEventDispatcher) == 0x0004A0, "Member 'UWBP_HUD_QTE_C::NewEventDispatcher' has a wrong offset!");

}

