#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UniqueMechanic_Charge

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SandFall_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UniqueMechanic_Charge.WBP_UniqueMechanic_Charge_C
// 0x0218 (0x04F8 - 0x02E0)
class UWBP_UniqueMechanic_Charge_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_BackTo0;                                      // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_TurnStart;                                    // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Overcharge;                                   // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_NewChargeSlot;                                // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Charges_GlowLoop;                             // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ArmGlow;                                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Gustave_UniqueMecanique;               // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arm;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ArmShadow;                                   // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background_Glow;                             // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Glow1;                                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Glow10;                                      // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Glow2;                                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Glow3;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Glow4;                                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Glow5;                                       // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Glow6;                                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Glow7;                                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Glow8;                                       // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Glow9;                                       // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Lightning;                                   // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Line1;                                       // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Line10;                                      // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Line2;                                       // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Line3;                                       // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Line4;                                       // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Line5;                                       // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Line6;                                       // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Line7;                                       // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Line8;                                       // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Line9;                                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Charge1;                                   // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Charge10;                                  // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Charge2;                                   // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Charge3;                                   // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Charge4;                                   // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Charge5;                                   // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Charge6;                                   // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Charge7;                                   // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Charge8;                                   // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Charge9;                                   // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_BackgroundGlow;                        // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBoxArm;                                    // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_CurrentValue;                            // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_MaxValue;                                // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ValueBox;                                          // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Name_UniqueMechanics_C*            WBP_Name_UniqueMechanics;                          // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsAppearing;                                       // 0x0460(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_461[0x7];                                      // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_UniqueMechanic_Charge_Component_C*  ChargeMechanicComponent;                           // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<class UImage*>                         GlowImages;                                        // 0x0470(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UOverlay*>                       ChargeImages;                                      // 0x0480(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         CurrentValue;                                      // 0x0490(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_Weak;                                        // 0x0494(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_Medium;                                      // 0x04A4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_Strong;                                      // 0x04B4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_Max;                                         // 0x04C4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D4[0x4];                                      // 0x04D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundEventDataTableRowHandle          SD_OverchargeFull_Switch;                          // 0x04D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FSoundEventDataTableRowHandle          SD_OverchargeFull_TurnStart;                       // 0x04E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void Appear();
	void Construct();
	void Disappear();
	void ExecuteUbergraph_WBP_UniqueMechanic_Charge(int32 EntryPoint);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void OnInitialized();
	void Reset_Slots_Visibility();
	void SequenceEvent__ENTRYPOINTWBP_UniqueMechanic_Charge();
	void SetNewCharge();
	void UpdateChargeUI(int32 NewValue, int32 PreviousValue);
	void UpdateCurrentValue();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UniqueMechanic_Charge_C">();
	}
	static class UWBP_UniqueMechanic_Charge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UniqueMechanic_Charge_C>();
	}
};
static_assert(alignof(UWBP_UniqueMechanic_Charge_C) == 0x000008, "Wrong alignment on UWBP_UniqueMechanic_Charge_C");
static_assert(sizeof(UWBP_UniqueMechanic_Charge_C) == 0x0004F8, "Wrong size on UWBP_UniqueMechanic_Charge_C");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_UniqueMechanic_Charge_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Anim_BackTo0) == 0x0002E8, "Member 'UWBP_UniqueMechanic_Charge_C::Anim_BackTo0' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Anim_TurnStart) == 0x0002F0, "Member 'UWBP_UniqueMechanic_Charge_C::Anim_TurnStart' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Anim_Overcharge) == 0x0002F8, "Member 'UWBP_UniqueMechanic_Charge_C::Anim_Overcharge' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Anim_NewChargeSlot) == 0x000300, "Member 'UWBP_UniqueMechanic_Charge_C::Anim_NewChargeSlot' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Anim_Charges_GlowLoop) == 0x000308, "Member 'UWBP_UniqueMechanic_Charge_C::Anim_Charges_GlowLoop' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, ArmGlow) == 0x000310, "Member 'UWBP_UniqueMechanic_Charge_C::ArmGlow' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, CanvasPanel_Gustave_UniqueMecanique) == 0x000318, "Member 'UWBP_UniqueMechanic_Charge_C::CanvasPanel_Gustave_UniqueMecanique' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Image_Arm) == 0x000320, "Member 'UWBP_UniqueMechanic_Charge_C::Image_Arm' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Image_ArmShadow) == 0x000328, "Member 'UWBP_UniqueMechanic_Charge_C::Image_ArmShadow' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Image_Background_Glow) == 0x000330, "Member 'UWBP_UniqueMechanic_Charge_C::Image_Background_Glow' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Image_Glow1) == 0x000338, "Member 'UWBP_UniqueMechanic_Charge_C::Image_Glow1' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Image_Glow10) == 0x000340, "Member 'UWBP_UniqueMechanic_Charge_C::Image_Glow10' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Image_Glow2) == 0x000348, "Member 'UWBP_UniqueMechanic_Charge_C::Image_Glow2' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Image_Glow3) == 0x000350, "Member 'UWBP_UniqueMechanic_Charge_C::Image_Glow3' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Image_Glow4) == 0x000358, "Member 'UWBP_UniqueMechanic_Charge_C::Image_Glow4' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Image_Glow5) == 0x000360, "Member 'UWBP_UniqueMechanic_Charge_C::Image_Glow5' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Image_Glow6) == 0x000368, "Member 'UWBP_UniqueMechanic_Charge_C::Image_Glow6' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Image_Glow7) == 0x000370, "Member 'UWBP_UniqueMechanic_Charge_C::Image_Glow7' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Image_Glow8) == 0x000378, "Member 'UWBP_UniqueMechanic_Charge_C::Image_Glow8' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Image_Glow9) == 0x000380, "Member 'UWBP_UniqueMechanic_Charge_C::Image_Glow9' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Image_Lightning) == 0x000388, "Member 'UWBP_UniqueMechanic_Charge_C::Image_Lightning' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Image_Line1) == 0x000390, "Member 'UWBP_UniqueMechanic_Charge_C::Image_Line1' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Image_Line10) == 0x000398, "Member 'UWBP_UniqueMechanic_Charge_C::Image_Line10' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Image_Line2) == 0x0003A0, "Member 'UWBP_UniqueMechanic_Charge_C::Image_Line2' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Image_Line3) == 0x0003A8, "Member 'UWBP_UniqueMechanic_Charge_C::Image_Line3' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Image_Line4) == 0x0003B0, "Member 'UWBP_UniqueMechanic_Charge_C::Image_Line4' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Image_Line5) == 0x0003B8, "Member 'UWBP_UniqueMechanic_Charge_C::Image_Line5' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Image_Line6) == 0x0003C0, "Member 'UWBP_UniqueMechanic_Charge_C::Image_Line6' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Image_Line7) == 0x0003C8, "Member 'UWBP_UniqueMechanic_Charge_C::Image_Line7' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Image_Line8) == 0x0003D0, "Member 'UWBP_UniqueMechanic_Charge_C::Image_Line8' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Image_Line9) == 0x0003D8, "Member 'UWBP_UniqueMechanic_Charge_C::Image_Line9' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Overlay_Charge1) == 0x0003E0, "Member 'UWBP_UniqueMechanic_Charge_C::Overlay_Charge1' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Overlay_Charge10) == 0x0003E8, "Member 'UWBP_UniqueMechanic_Charge_C::Overlay_Charge10' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Overlay_Charge2) == 0x0003F0, "Member 'UWBP_UniqueMechanic_Charge_C::Overlay_Charge2' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Overlay_Charge3) == 0x0003F8, "Member 'UWBP_UniqueMechanic_Charge_C::Overlay_Charge3' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Overlay_Charge4) == 0x000400, "Member 'UWBP_UniqueMechanic_Charge_C::Overlay_Charge4' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Overlay_Charge5) == 0x000408, "Member 'UWBP_UniqueMechanic_Charge_C::Overlay_Charge5' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Overlay_Charge6) == 0x000410, "Member 'UWBP_UniqueMechanic_Charge_C::Overlay_Charge6' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Overlay_Charge7) == 0x000418, "Member 'UWBP_UniqueMechanic_Charge_C::Overlay_Charge7' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Overlay_Charge8) == 0x000420, "Member 'UWBP_UniqueMechanic_Charge_C::Overlay_Charge8' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Overlay_Charge9) == 0x000428, "Member 'UWBP_UniqueMechanic_Charge_C::Overlay_Charge9' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, RetainerBox_BackgroundGlow) == 0x000430, "Member 'UWBP_UniqueMechanic_Charge_C::RetainerBox_BackgroundGlow' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, RetainerBoxArm) == 0x000438, "Member 'UWBP_UniqueMechanic_Charge_C::RetainerBoxArm' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, TextBlock_CurrentValue) == 0x000440, "Member 'UWBP_UniqueMechanic_Charge_C::TextBlock_CurrentValue' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, TextBlock_MaxValue) == 0x000448, "Member 'UWBP_UniqueMechanic_Charge_C::TextBlock_MaxValue' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, ValueBox) == 0x000450, "Member 'UWBP_UniqueMechanic_Charge_C::ValueBox' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, WBP_Name_UniqueMechanics) == 0x000458, "Member 'UWBP_UniqueMechanic_Charge_C::WBP_Name_UniqueMechanics' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, IsAppearing) == 0x000460, "Member 'UWBP_UniqueMechanic_Charge_C::IsAppearing' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, ChargeMechanicComponent) == 0x000468, "Member 'UWBP_UniqueMechanic_Charge_C::ChargeMechanicComponent' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, GlowImages) == 0x000470, "Member 'UWBP_UniqueMechanic_Charge_C::GlowImages' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, ChargeImages) == 0x000480, "Member 'UWBP_UniqueMechanic_Charge_C::ChargeImages' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, CurrentValue) == 0x000490, "Member 'UWBP_UniqueMechanic_Charge_C::CurrentValue' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Color_Weak) == 0x000494, "Member 'UWBP_UniqueMechanic_Charge_C::Color_Weak' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Color_Medium) == 0x0004A4, "Member 'UWBP_UniqueMechanic_Charge_C::Color_Medium' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Color_Strong) == 0x0004B4, "Member 'UWBP_UniqueMechanic_Charge_C::Color_Strong' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, Color_Max) == 0x0004C4, "Member 'UWBP_UniqueMechanic_Charge_C::Color_Max' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, SD_OverchargeFull_Switch) == 0x0004D8, "Member 'UWBP_UniqueMechanic_Charge_C::SD_OverchargeFull_Switch' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Charge_C, SD_OverchargeFull_TurnStart) == 0x0004E8, "Member 'UWBP_UniqueMechanic_Charge_C::SD_OverchargeFull_TurnStart' has a wrong offset!");

}

