#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EndBattle_ExperienceBar

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_EndBattle_ExperienceBar.WBP_EndBattle_ExperienceBar_C.ExecuteUbergraph_WBP_EndBattle_ExperienceBar
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraUIComponent*                    CallFunc_GetNiagaraComponent_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetExperienceNeededToLevelUp_ExperienceNeeded; // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStartTime_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetExperienceNeededToLevelUp_ExperienceNeeded_1; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0088(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraUIComponent*                    CallFunc_GetNiagaraComponent_ReturnValue_1;        // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar) == 0x000008, "Wrong alignment on WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar");
static_assert(sizeof(WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar) == 0x0000A0, "Wrong size on WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar, EntryPoint) == 0x000000, "Member 'WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar, Temp_bool_Variable) == 0x000004, "Member 'WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar, Temp_int_Variable) == 0x000008, "Member 'WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar, K2Node_Event_IsDesignTime) == 0x000028, "Member 'WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar, CallFunc_GetNiagaraComponent_ReturnValue) == 0x000040, "Member 'WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar::CallFunc_GetNiagaraComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00004C, "Member 'WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar, CallFunc_Less_IntInt_ReturnValue) == 0x00004D, "Member 'WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar, CallFunc_Add_IntInt_ReturnValue_1) == 0x000050, "Member 'WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar, CallFunc_GetExperienceNeededToLevelUp_ExperienceNeeded) == 0x000054, "Member 'WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar::CallFunc_GetExperienceNeededToLevelUp_ExperienceNeeded' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000058, "Member 'WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar, Temp_int_Variable_1) == 0x00005C, "Member 'WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar, CallFunc_GetStartTime_ReturnValue) == 0x000060, "Member 'WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar::CallFunc_GetStartTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar, CallFunc_PlayAnimation_ReturnValue) == 0x000068, "Member 'WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar, CallFunc_PlayAnimation_ReturnValue_1) == 0x000070, "Member 'WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar, CallFunc_GetExperienceNeededToLevelUp_ExperienceNeeded_1) == 0x000078, "Member 'WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar::CallFunc_GetExperienceNeededToLevelUp_ExperienceNeeded_1' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar, K2Node_Select_Default) == 0x00007C, "Member 'WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar, CallFunc_PlayAnimation_ReturnValue_2) == 0x000080, "Member 'WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar, K2Node_Event_Animation) == 0x000088, "Member 'WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000090, "Member 'WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x000091, "Member 'WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar, CallFunc_GetNiagaraComponent_ReturnValue_1) == 0x000098, "Member 'WBP_EndBattle_ExperienceBar_C_ExecuteUbergraph_WBP_EndBattle_ExperienceBar::CallFunc_GetNiagaraComponent_ReturnValue_1' has a wrong offset!");

// Function WBP_EndBattle_ExperienceBar.WBP_EndBattle_ExperienceBar_C.LoadCharacterData
// 0x0010 (0x0010 - 0x0000)
struct WBP_EndBattle_ExperienceBar_C_LoadCharacterData final
{
public:
	class UBP_CharacterData_C*                    InCharacterData;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentLevelExperience_CurrentExperienceInLevel; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetExperienceNeededToLevelUp_ExperienceNeeded; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EndBattle_ExperienceBar_C_LoadCharacterData) == 0x000008, "Wrong alignment on WBP_EndBattle_ExperienceBar_C_LoadCharacterData");
static_assert(sizeof(WBP_EndBattle_ExperienceBar_C_LoadCharacterData) == 0x000010, "Wrong size on WBP_EndBattle_ExperienceBar_C_LoadCharacterData");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_LoadCharacterData, InCharacterData) == 0x000000, "Member 'WBP_EndBattle_ExperienceBar_C_LoadCharacterData::InCharacterData' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_LoadCharacterData, CallFunc_GetCurrentLevelExperience_CurrentExperienceInLevel) == 0x000008, "Member 'WBP_EndBattle_ExperienceBar_C_LoadCharacterData::CallFunc_GetCurrentLevelExperience_CurrentExperienceInLevel' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_LoadCharacterData, CallFunc_GetExperienceNeededToLevelUp_ExperienceNeeded) == 0x00000C, "Member 'WBP_EndBattle_ExperienceBar_C_LoadCharacterData::CallFunc_GetExperienceNeededToLevelUp_ExperienceNeeded' has a wrong offset!");

// Function WBP_EndBattle_ExperienceBar.WBP_EndBattle_ExperienceBar_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct WBP_EndBattle_ExperienceBar_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EndBattle_ExperienceBar_C_OnAnimationFinished) == 0x000008, "Wrong alignment on WBP_EndBattle_ExperienceBar_C_OnAnimationFinished");
static_assert(sizeof(WBP_EndBattle_ExperienceBar_C_OnAnimationFinished) == 0x000008, "Wrong size on WBP_EndBattle_ExperienceBar_C_OnAnimationFinished");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_OnAnimationFinished, Animation) == 0x000000, "Member 'WBP_EndBattle_ExperienceBar_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function WBP_EndBattle_ExperienceBar.WBP_EndBattle_ExperienceBar_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_EndBattle_ExperienceBar_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EndBattle_ExperienceBar_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_EndBattle_ExperienceBar_C_PreConstruct");
static_assert(sizeof(WBP_EndBattle_ExperienceBar_C_PreConstruct) == 0x000001, "Wrong size on WBP_EndBattle_ExperienceBar_C_PreConstruct");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_EndBattle_ExperienceBar_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_EndBattle_ExperienceBar.WBP_EndBattle_ExperienceBar_C.SetExperienceGainProgress
// 0x0030 (0x0030 - 0x0000)
struct WBP_EndBattle_ExperienceBar_C_SetExperienceGainProgress final
{
public:
	double                                        ExperienceGainProgress_0;                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ProgressBreakpoint;                                // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetExperienceNeededToLevelUp_ExperienceNeeded; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EndBattle_ExperienceBar_C_SetExperienceGainProgress) == 0x000008, "Wrong alignment on WBP_EndBattle_ExperienceBar_C_SetExperienceGainProgress");
static_assert(sizeof(WBP_EndBattle_ExperienceBar_C_SetExperienceGainProgress) == 0x000030, "Wrong size on WBP_EndBattle_ExperienceBar_C_SetExperienceGainProgress");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_SetExperienceGainProgress, ExperienceGainProgress_0) == 0x000000, "Member 'WBP_EndBattle_ExperienceBar_C_SetExperienceGainProgress::ExperienceGainProgress_0' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_SetExperienceGainProgress, ProgressBreakpoint) == 0x000008, "Member 'WBP_EndBattle_ExperienceBar_C_SetExperienceGainProgress::ProgressBreakpoint' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_SetExperienceGainProgress, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000010, "Member 'WBP_EndBattle_ExperienceBar_C_SetExperienceGainProgress::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_SetExperienceGainProgress, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000018, "Member 'WBP_EndBattle_ExperienceBar_C_SetExperienceGainProgress::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_SetExperienceGainProgress, CallFunc_Lerp_ReturnValue) == 0x000020, "Member 'WBP_EndBattle_ExperienceBar_C_SetExperienceGainProgress::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_SetExperienceGainProgress, CallFunc_GetExperienceNeededToLevelUp_ExperienceNeeded) == 0x000028, "Member 'WBP_EndBattle_ExperienceBar_C_SetExperienceGainProgress::CallFunc_GetExperienceNeededToLevelUp_ExperienceNeeded' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_SetExperienceGainProgress, CallFunc_FCeil_ReturnValue) == 0x00002C, "Member 'WBP_EndBattle_ExperienceBar_C_SetExperienceGainProgress::CallFunc_FCeil_ReturnValue' has a wrong offset!");

// Function WBP_EndBattle_ExperienceBar.WBP_EndBattle_ExperienceBar_C.SetLevelAndValue
// 0x0100 (0x0100 - 0x0000)
struct WBP_EndBattle_ExperienceBar_C_SetLevelAndValue final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         exp;                                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxExp;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0010)()
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0048)(HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0080(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0090(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E8(0x0010)()
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EndBattle_ExperienceBar_C_SetLevelAndValue) == 0x000008, "Wrong alignment on WBP_EndBattle_ExperienceBar_C_SetLevelAndValue");
static_assert(sizeof(WBP_EndBattle_ExperienceBar_C_SetLevelAndValue) == 0x000100, "Wrong size on WBP_EndBattle_ExperienceBar_C_SetLevelAndValue");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_SetLevelAndValue, Level) == 0x000000, "Member 'WBP_EndBattle_ExperienceBar_C_SetLevelAndValue::Level' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_SetLevelAndValue, exp) == 0x000004, "Member 'WBP_EndBattle_ExperienceBar_C_SetLevelAndValue::exp' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_SetLevelAndValue, MaxExp) == 0x000008, "Member 'WBP_EndBattle_ExperienceBar_C_SetLevelAndValue::MaxExp' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_SetLevelAndValue, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000010, "Member 'WBP_EndBattle_ExperienceBar_C_SetLevelAndValue::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_SetLevelAndValue, CallFunc_Conv_IntToText_ReturnValue) == 0x000018, "Member 'WBP_EndBattle_ExperienceBar_C_SetLevelAndValue::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_SetLevelAndValue, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000028, "Member 'WBP_EndBattle_ExperienceBar_C_SetLevelAndValue::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_SetLevelAndValue, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'WBP_EndBattle_ExperienceBar_C_SetLevelAndValue::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_SetLevelAndValue, CallFunc_SafeDivide_ReturnValue) == 0x000078, "Member 'WBP_EndBattle_ExperienceBar_C_SetLevelAndValue::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_SetLevelAndValue, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000080, "Member 'WBP_EndBattle_ExperienceBar_C_SetLevelAndValue::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_SetLevelAndValue, K2Node_MakeStruct_FormatArgumentData_1) == 0x000090, "Member 'WBP_EndBattle_ExperienceBar_C_SetLevelAndValue::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_SetLevelAndValue, K2Node_MakeArray_Array) == 0x0000D8, "Member 'WBP_EndBattle_ExperienceBar_C_SetLevelAndValue::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_SetLevelAndValue, CallFunc_Format_ReturnValue) == 0x0000E8, "Member 'WBP_EndBattle_ExperienceBar_C_SetLevelAndValue::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_SetLevelAndValue, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x0000F8, "Member 'WBP_EndBattle_ExperienceBar_C_SetLevelAndValue::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

// Function WBP_EndBattle_ExperienceBar.WBP_EndBattle_ExperienceBar_C.TriggerExperienceGainAnimation
// 0x0040 (0x0040 - 0x0000)
struct WBP_EndBattle_ExperienceBar_C_TriggerExperienceGainAnimation final
{
public:
	class UBP_CharacterData_C*                    CharacterData;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         NewLocalVar;                                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentLevelExperience_CurrentExperienceInLevel; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetExperienceNeededToLevelUp_ExperienceNeeded; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_2;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_EndBattle_ExperienceBar_C_TriggerExperienceGainAnimation) == 0x000008, "Wrong alignment on WBP_EndBattle_ExperienceBar_C_TriggerExperienceGainAnimation");
static_assert(sizeof(WBP_EndBattle_ExperienceBar_C_TriggerExperienceGainAnimation) == 0x000040, "Wrong size on WBP_EndBattle_ExperienceBar_C_TriggerExperienceGainAnimation");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_TriggerExperienceGainAnimation, CharacterData) == 0x000000, "Member 'WBP_EndBattle_ExperienceBar_C_TriggerExperienceGainAnimation::CharacterData' has a wrong offset!");
static_assert(offsetof(WBP_EndBattle_ExperienceBar_C_TriggerExperienceGainAnimation, NewLocalVar) == 0x000008, "Member 'WBP_EndBattle_ExperienceBar_C_TriggerExperienceGainAnimation::NewLocalVar' has a wrong offset!");
