#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Niagara_SlowParticules

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Niagara_SlowParticules.WBP_Niagara_SlowParticules_C.ExecuteUbergraph_WBP_Niagara_SlowParticules
// 0x0018 (0x0018 - 0x0000)
struct WBP_Niagara_SlowParticules_C_ExecuteUbergraph_WBP_Niagara_SlowParticules final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraUIComponent*                    CallFunc_GetNiagaraComponent_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Active;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Niagara_SlowParticules_C_ExecuteUbergraph_WBP_Niagara_SlowParticules) == 0x000008, "Wrong alignment on WBP_Niagara_SlowParticules_C_ExecuteUbergraph_WBP_Niagara_SlowParticules");
static_assert(sizeof(WBP_Niagara_SlowParticules_C_ExecuteUbergraph_WBP_Niagara_SlowParticules) == 0x000018, "Wrong size on WBP_Niagara_SlowParticules_C_ExecuteUbergraph_WBP_Niagara_SlowParticules");
static_assert(offsetof(WBP_Niagara_SlowParticules_C_ExecuteUbergraph_WBP_Niagara_SlowParticules, EntryPoint) == 0x000000, "Member 'WBP_Niagara_SlowParticules_C_ExecuteUbergraph_WBP_Niagara_SlowParticules::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Niagara_SlowParticules_C_ExecuteUbergraph_WBP_Niagara_SlowParticules, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_Niagara_SlowParticules_C_ExecuteUbergraph_WBP_Niagara_SlowParticules::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Niagara_SlowParticules_C_ExecuteUbergraph_WBP_Niagara_SlowParticules, CallFunc_GetNiagaraComponent_ReturnValue) == 0x000008, "Member 'WBP_Niagara_SlowParticules_C_ExecuteUbergraph_WBP_Niagara_SlowParticules::CallFunc_GetNiagaraComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Niagara_SlowParticules_C_ExecuteUbergraph_WBP_Niagara_SlowParticules, K2Node_CustomEvent_Active) == 0x000010, "Member 'WBP_Niagara_SlowParticules_C_ExecuteUbergraph_WBP_Niagara_SlowParticules::K2Node_CustomEvent_Active' has a wrong offset!");

// Function WBP_Niagara_SlowParticules.WBP_Niagara_SlowParticules_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Niagara_SlowParticules_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Niagara_SlowParticules_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Niagara_SlowParticules_C_PreConstruct");
static_assert(sizeof(WBP_Niagara_SlowParticules_C_PreConstruct) == 0x000001, "Wrong size on WBP_Niagara_SlowParticules_C_PreConstruct");
static_assert(offsetof(WBP_Niagara_SlowParticules_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Niagara_SlowParticules_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Niagara_SlowParticules.WBP_Niagara_SlowParticules_C.Set FX Parameters
// 0x0008 (0x0008 - 0x0000)
struct WBP_Niagara_SlowParticules_C_Set_FX_Parameters final
{
public:
	class UFXSystemComponent*                     SystemFX;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Niagara_SlowParticules_C_Set_FX_Parameters) == 0x000008, "Wrong alignment on WBP_Niagara_SlowParticules_C_Set_FX_Parameters");
static_assert(sizeof(WBP_Niagara_SlowParticules_C_Set_FX_Parameters) == 0x000008, "Wrong size on WBP_Niagara_SlowParticules_C_Set_FX_Parameters");
static_assert(offsetof(WBP_Niagara_SlowParticules_C_Set_FX_Parameters, SystemFX) == 0x000000, "Member 'WBP_Niagara_SlowParticules_C_Set_FX_Parameters::SystemFX' has a wrong offset!");

// Function WBP_Niagara_SlowParticules.WBP_Niagara_SlowParticules_C.SetNiagaraSystemActive
// 0x0001 (0x0001 - 0x0000)
struct WBP_Niagara_SlowParticules_C_SetNiagaraSystemActive final
{
public:
	bool                                          Active;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Niagara_SlowParticules_C_SetNiagaraSystemActive) == 0x000001, "Wrong alignment on WBP_Niagara_SlowParticules_C_SetNiagaraSystemActive");
static_assert(sizeof(WBP_Niagara_SlowParticules_C_SetNiagaraSystemActive) == 0x000001, "Wrong size on WBP_Niagara_SlowParticules_C_SetNiagaraSystemActive");
static_assert(offsetof(WBP_Niagara_SlowParticules_C_SetNiagaraSystemActive, Active) == 0x000000, "Member 'WBP_Niagara_SlowParticules_C_SetNiagaraSystemActive::Active' has a wrong offset!");

}

