#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_LootQueue

#include "Basic.hpp"

#include "S_MerchantItemSellData_structs.hpp"
#include "S_LootContext_structs.hpp"
#include "Engine_structs.hpp"
#include "E_jRPG_ItemType_structs.hpp"
#include "S_MerchantItemQueueData_structs.hpp"


namespace SDK::Params
{

// Function WBP_HUD_LootQueue.WBP_HUD_LootQueue_C.ExecuteUbergraph_WBP_HUD_LootQueue
// 0x0870 (0x0870 - 0x0000)
struct WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCommonActivatableWidget>   Temp_class_Variable;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCommonActivatableWidget>   Temp_class_Variable_1;                             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCommonActivatableWidget>   Temp_class_Variable_2;                             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCommonActivatableWidget>   Temp_class_Variable_3;                             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCommonActivatableWidget>   Temp_class_Variable_4;                             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCommonActivatableWidget>   Temp_class_Variable_5;                             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCommonActivatableWidget>   Temp_class_Variable_6;                             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCommonActivatableWidget>   Temp_class_Variable_7;                             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCommonActivatableWidget>   Temp_class_Variable_8;                             // 0x0048(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCommonActivatableWidget>   Temp_class_Variable_9;                             // 0x0050(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCommonActivatableWidget>   Temp_class_Variable_10;                            // 0x0060(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCommonActivatableWidget>   Temp_class_Variable_11;                            // 0x0068(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCommonActivatableWidget>   Temp_class_Variable_12;                            // 0x0078(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCommonActivatableWidget>   Temp_class_Variable_13;                            // 0x0080(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0088(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x008C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UCommonActivatableWidget>   Temp_class_Variable_14;                            // 0x0090(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	E_jRPG_ItemType                               Temp_byte_Variable;                                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCommonActivatableWidget>   Temp_class_Variable_15;                            // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCommonActivatableWidget>   Temp_class_Variable_16;                            // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCommonActivatableWidget>   Temp_class_Variable_17;                            // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_jRPG_ItemType                               Temp_byte_Variable_1;                              // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CE[0x2];                                       // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_InventoryManager_C*            CallFunc_GetInventoryManager_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_GeneratedItemInfo_Base_C*           K2Node_CustomEvent_GeneratedItemInfo;              // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_LootContext                         K2Node_CustomEvent_LootContext;                    // 0x00E8(0x0004)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GeneratedItemInfo_Item_C*           K2Node_DynamicCast_AsBP_Generated_Item_Info_Item;  // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GeneratedItemInfo_Chroma_C*         K2Node_DynamicCast_AsBP_Generated_Item_Info_Chroma; // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GeneratedItemInfo_UpgradableItem_C* K2Node_DynamicCast_AsBP_Generated_Item_Info_Upgradable_Item; // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUpgrade_ReturnValue;                    // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x011B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConvertedToChroma_bIsConvertedToChroma; // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConvertedToChroma_bIsConvertedToChroma_1; // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x011E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x011F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUpgrade_ReturnValue_1;                  // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_jRPG_ItemType                               CallFunc_GetItemType_ReturnValue;                  // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0123(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_126[0x2];                                      // 0x0126(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCommonActivatableWidget>   K2Node_Select_Default;                             // 0x0128(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UWBP_Loot_Currency_C*                   CallFunc_BP_AddWidget_ReturnValue;                 // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UCommonActivatableWidget>   Temp_class_Variable_18;                            // 0x0138(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCommonActivatableWidget>   Temp_class_Variable_19;                            // 0x0140(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCommonActivatableWidget>   Temp_class_Variable_20;                            // 0x0150(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCommonActivatableWidget>   K2Node_Select_Default_1;                           // 0x0158(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCommonActivatableWidget>   Temp_class_Variable_21;                            // 0x0160(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_BP_AddWidget_ReturnValue_1;               // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Loot_Base_C*                       K2Node_DynamicCast_AsWBP_Loot_Base;                // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17A[0x6];                                      // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               CallFunc_BP_AddWidget_ReturnValue_2;               // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UCommonActivatableWidget>   K2Node_Select_Default_2;                           // 0x0188(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UWBP_Loot_Base_C*                       K2Node_DynamicCast_AsWBP_Loot_Base_1;              // 0x0190(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               CallFunc_BP_AddWidget_ReturnValue_3;               // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Loot_Base_C*                       K2Node_DynamicCast_AsWBP_Loot_Base_2;              // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName PassiveEffectName)> K2Node_CreateDelegate_OutputDelegate;             // 0x01C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_PassiveEffectName;              // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Loot_PassiveEffect_C*              CallFunc_BP_AddWidget_ReturnValue_4;               // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UBP_GeneratedItemInfo_Base_C* GeneratedItemInfo, const struct FS_LootContext& LootContext)> K2Node_CreateDelegate_OutputDelegate_1; // 0x01E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FA[0x6];                                      // 0x01FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_MerchantItemSellData                K2Node_CustomEvent_BoughtItemData;                 // 0x0200(0x0170)(ContainsInstancedReference, HasGetValueTypeHash)
	class UBP_ItemInstance_Base_C*                K2Node_CustomEvent_PreviousItemInstance;           // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_ItemInstance_Gear_C*                K2Node_DynamicCast_AsBP_Item_Instance_Gear;        // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x3];                                      // 0x0381(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentLevel_ReturnValue;              // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_ItemInstance_Gear_C*                K2Node_DynamicCast_AsBP_Item_Instance_Gear_1;      // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_MerchantItemQueueData               K2Node_MakeStruct_S_MerchantItemQueueData;         // 0x0398(0x0138)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentLevel_ReturnValue_1;            // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D4[0x4];                                      // 0x04D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_MerchantItemQueueData               K2Node_MakeStruct_S_MerchantItemQueueData_1;       // 0x04D8(0x0138)(ContainsInstancedReference, HasGetValueTypeHash)
	TSubclassOf<class UCommonActivatableWidget>   Temp_class_Variable_22;                            // 0x0610(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCommonActivatableWidget>   Temp_class_Variable_23;                            // 0x0618(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<struct FS_MerchantItemQueueData>       CallFunc_Map_Keys_Keys;                            // 0x0620(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FS_MerchantItemQueueData               CallFunc_Array_Get_Item;                           // 0x0630(0x0138)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0768(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x076C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x076D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x076E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x076F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x0770(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x0771(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_772[0x6];                                      // 0x0772(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCommonActivatableWidget>   K2Node_Select_Default_3;                           // 0x0778(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0780(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_781[0x7];                                      // 0x0781(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               CallFunc_BP_AddWidget_ReturnValue_5;               // 0x0788(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Loot_Base_C*                       K2Node_DynamicCast_AsWBP_Loot_Base_3;              // 0x0790(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0798(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_799[0x7];                                      // 0x0799(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCommonActivatableWidget>   K2Node_Select_Default_4;                           // 0x07A0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_BP_AddWidget_ReturnValue_6;               // 0x07A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x07B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B1[0x7];                                      // 0x07B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Loot_Base_C*                       K2Node_DynamicCast_AsWBP_Loot_Base_4;              // 0x07B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x07C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x07C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x07C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x07C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C4[0x4];                                      // 0x07C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCommonActivatableWidget>   K2Node_Select_Default_5;                           // 0x07C8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x07D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D1[0x7];                                      // 0x07D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               CallFunc_BP_AddWidget_ReturnValue_7;               // 0x07D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Loot_Base_C*                       K2Node_DynamicCast_AsWBP_Loot_Base_5;              // 0x07E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x07E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E9[0x7];                                      // 0x07E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCommonActivatableWidget>   Temp_class_Variable_24;                            // 0x07F0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Find_Value;                           // 0x07F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x07FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7FD[0x3];                                      // 0x07FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0800(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_804[0x4];                                      // 0x0804(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCommonActivatableWidget>   Temp_class_Variable_25;                            // 0x0808(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Find_Value_1;                         // 0x0810(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0814(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_815[0x3];                                      // 0x0815(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0818(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81C[0x4];                                      // 0x081C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCommonActivatableWidget>   Temp_class_Variable_26;                            // 0x0820(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCommonActivatableWidget>   Temp_class_Variable_27;                            // 0x0828(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Find_Value_2;                         // 0x0830(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x0834(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_835[0x3];                                      // 0x0835(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCommonActivatableWidget>   Temp_class_Variable_28;                            // 0x0838(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCommonActivatableWidget>   Temp_class_Variable_29;                            // 0x0840(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCommonActivatableWidget>   K2Node_Select_Default_6;                           // 0x0848(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue_1;               // 0x0850(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_851[0x7];                                      // 0x0851(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               CallFunc_BP_AddWidget_ReturnValue_8;               // 0x0858(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Loot_Base_C*                       K2Node_DynamicCast_AsWBP_Loot_Base_6;              // 0x0860(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0868(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue) == 0x000008, "Wrong alignment on WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue");
static_assert(sizeof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue) == 0x000870, "Wrong size on WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, EntryPoint) == 0x000000, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, Temp_class_Variable) == 0x000008, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, Temp_class_Variable_1) == 0x000010, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, Temp_class_Variable_2) == 0x000018, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::Temp_class_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, Temp_class_Variable_3) == 0x000020, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::Temp_class_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, Temp_class_Variable_4) == 0x000028, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::Temp_class_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, Temp_class_Variable_5) == 0x000030, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::Temp_class_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, Temp_class_Variable_6) == 0x000038, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::Temp_class_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, Temp_class_Variable_7) == 0x000040, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::Temp_class_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, Temp_class_Variable_8) == 0x000048, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::Temp_class_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, Temp_class_Variable_9) == 0x000050, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::Temp_class_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, Temp_bool_Variable) == 0x000058, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, Temp_class_Variable_10) == 0x000060, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::Temp_class_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, Temp_class_Variable_11) == 0x000068, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::Temp_class_Variable_11' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, Temp_bool_Variable_1) == 0x000070, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, Temp_class_Variable_12) == 0x000078, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::Temp_class_Variable_12' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, Temp_class_Variable_13) == 0x000080, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::Temp_class_Variable_13' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, Temp_int_Variable) == 0x000088, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, Temp_int_Variable_1) == 0x00008C, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, Temp_class_Variable_14) == 0x000090, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::Temp_class_Variable_14' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, Temp_byte_Variable) == 0x000098, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, Temp_class_Variable_15) == 0x0000A0, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::Temp_class_Variable_15' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, Temp_class_Variable_16) == 0x0000A8, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::Temp_class_Variable_16' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, Temp_int_Variable_2) == 0x0000B0, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, Temp_class_Variable_17) == 0x0000B8, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::Temp_class_Variable_17' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, Temp_int_Loop_Counter_Variable) == 0x0000C0, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_Add_IntInt_ReturnValue) == 0x0000C4, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, Temp_int_Array_Index_Variable) == 0x0000C8, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, Temp_byte_Variable_1) == 0x0000CC, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, Temp_bool_Variable_2) == 0x0000CD, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, Temp_int_Variable_3) == 0x0000D0, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_GetInventoryManager_ReturnValue) == 0x0000D8, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_GetInventoryManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, K2Node_CustomEvent_GeneratedItemInfo) == 0x0000E0, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::K2Node_CustomEvent_GeneratedItemInfo' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, K2Node_CustomEvent_LootContext) == 0x0000E8, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::K2Node_CustomEvent_LootContext' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, K2Node_DynamicCast_AsBP_Generated_Item_Info_Item) == 0x0000F0, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::K2Node_DynamicCast_AsBP_Generated_Item_Info_Item' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, K2Node_DynamicCast_AsBP_Generated_Item_Info_Chroma) == 0x000100, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::K2Node_DynamicCast_AsBP_Generated_Item_Info_Chroma' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, K2Node_DynamicCast_bSuccess_1) == 0x000108, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, K2Node_DynamicCast_AsBP_Generated_Item_Info_Upgradable_Item) == 0x000110, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::K2Node_DynamicCast_AsBP_Generated_Item_Info_Upgradable_Item' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, K2Node_DynamicCast_bSuccess_2) == 0x000118, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_IsUpgrade_ReturnValue) == 0x000119, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_IsUpgrade_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_Not_PreBool_ReturnValue) == 0x00011A, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_Not_PreBool_ReturnValue_1) == 0x00011B, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_IsConvertedToChroma_bIsConvertedToChroma) == 0x00011C, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_IsConvertedToChroma_bIsConvertedToChroma' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_IsConvertedToChroma_bIsConvertedToChroma_1) == 0x00011D, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_IsConvertedToChroma_bIsConvertedToChroma_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_Not_PreBool_ReturnValue_2) == 0x00011E, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_BooleanAND_ReturnValue) == 0x00011F, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_IsUpgrade_ReturnValue_1) == 0x000120, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_IsUpgrade_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_GetItemType_ReturnValue) == 0x000121, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_GetItemType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000122, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000123, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_Not_PreBool_ReturnValue_3) == 0x000124, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000125, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, K2Node_Select_Default) == 0x000128, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_BP_AddWidget_ReturnValue) == 0x000130, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_BP_AddWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, Temp_class_Variable_18) == 0x000138, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::Temp_class_Variable_18' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, Temp_class_Variable_19) == 0x000140, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::Temp_class_Variable_19' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, Temp_bool_Variable_3) == 0x000148, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, Temp_class_Variable_20) == 0x000150, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::Temp_class_Variable_20' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, K2Node_Select_Default_1) == 0x000158, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, Temp_class_Variable_21) == 0x000160, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::Temp_class_Variable_21' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_BP_AddWidget_ReturnValue_1) == 0x000168, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_BP_AddWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, K2Node_DynamicCast_AsWBP_Loot_Base) == 0x000170, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::K2Node_DynamicCast_AsWBP_Loot_Base' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, K2Node_DynamicCast_bSuccess_3) == 0x000178, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, Temp_bool_Variable_4) == 0x000179, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_BP_AddWidget_ReturnValue_2) == 0x000180, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_BP_AddWidget_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, K2Node_Select_Default_2) == 0x000188, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, K2Node_DynamicCast_AsWBP_Loot_Base_1) == 0x000190, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::K2Node_DynamicCast_AsWBP_Loot_Base_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, K2Node_DynamicCast_bSuccess_4) == 0x000198, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_BP_AddWidget_ReturnValue_3) == 0x0001A0, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_BP_AddWidget_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, K2Node_DynamicCast_AsWBP_Loot_Base_2) == 0x0001A8, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::K2Node_DynamicCast_AsWBP_Loot_Base_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, K2Node_DynamicCast_bSuccess_5) == 0x0001B0, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_GetCustomGI_ReturnValue) == 0x0001B8, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, K2Node_CreateDelegate_OutputDelegate) == 0x0001C0, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, K2Node_CustomEvent_PassiveEffectName) == 0x0001D0, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::K2Node_CustomEvent_PassiveEffectName' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_Array_Add_ReturnValue) == 0x0001D8, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_BP_AddWidget_ReturnValue_4) == 0x0001E0, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_BP_AddWidget_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001E8, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_Array_IsEmpty_ReturnValue) == 0x0001F8, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_Not_PreBool_ReturnValue_4) == 0x0001F9, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, K2Node_CustomEvent_BoughtItemData) == 0x000200, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::K2Node_CustomEvent_BoughtItemData' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, K2Node_CustomEvent_PreviousItemInstance) == 0x000370, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::K2Node_CustomEvent_PreviousItemInstance' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, K2Node_DynamicCast_AsBP_Item_Instance_Gear) == 0x000378, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::K2Node_DynamicCast_AsBP_Item_Instance_Gear' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, K2Node_DynamicCast_bSuccess_6) == 0x000380, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_GetCurrentLevel_ReturnValue) == 0x000384, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_GetCurrentLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, K2Node_DynamicCast_AsBP_Item_Instance_Gear_1) == 0x000388, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::K2Node_DynamicCast_AsBP_Item_Instance_Gear_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, K2Node_DynamicCast_bSuccess_7) == 0x000390, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, K2Node_MakeStruct_S_MerchantItemQueueData) == 0x000398, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::K2Node_MakeStruct_S_MerchantItemQueueData' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_GetCurrentLevel_ReturnValue_1) == 0x0004D0, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_GetCurrentLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, K2Node_MakeStruct_S_MerchantItemQueueData_1) == 0x0004D8, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::K2Node_MakeStruct_S_MerchantItemQueueData_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, Temp_class_Variable_22) == 0x000610, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::Temp_class_Variable_22' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, Temp_class_Variable_23) == 0x000618, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::Temp_class_Variable_23' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_Map_Keys_Keys) == 0x000620, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_Array_Get_Item) == 0x000630, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_Array_Length_ReturnValue) == 0x000768, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_Less_IntInt_ReturnValue) == 0x00076C, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_Greater_IntInt_ReturnValue) == 0x00076D, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00076E, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_BooleanAND_ReturnValue_1) == 0x00076F, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_Not_PreBool_ReturnValue_5) == 0x000770, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_Not_PreBool_ReturnValue_6) == 0x000771, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_Not_PreBool_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, K2Node_Select_Default_3) == 0x000778, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000780, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_BP_AddWidget_ReturnValue_5) == 0x000788, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_BP_AddWidget_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, K2Node_DynamicCast_AsWBP_Loot_Base_3) == 0x000790, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::K2Node_DynamicCast_AsWBP_Loot_Base_3' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, K2Node_DynamicCast_bSuccess_8) == 0x000798, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, K2Node_Select_Default_4) == 0x0007A0, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_BP_AddWidget_ReturnValue_6) == 0x0007A8, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_BP_AddWidget_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_IsValidClass_ReturnValue) == 0x0007B0, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, K2Node_DynamicCast_AsWBP_Loot_Base_4) == 0x0007B8, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::K2Node_DynamicCast_AsWBP_Loot_Base_4' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, K2Node_DynamicCast_bSuccess_9) == 0x0007C0, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x0007C1, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x0007C2, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_EqualEqual_ByteByte_ReturnValue_6) == 0x0007C3, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_EqualEqual_ByteByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, K2Node_Select_Default_5) == 0x0007C8, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue, CallFunc_BooleanOR_ReturnValue) == 0x0007D0, "Member 'WBP_HUD_LootQueue_C_ExecuteUbergraph_WBP_HUD_LootQueue::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
