#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_GM_EndBattle_Panel

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "S_BattleSummaryStats_structs.hpp"
#include "S_BattleRewards_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_HUD_GM_EndBattle_Panel.WBP_HUD_GM_EndBattle_Panel_C.BndEvt__WBP_HUD_GM_EndBattle_Panel_WBP_GM_PromptGeneric_Continue_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_HUD_GM_EndBattle_Panel_C_BndEvt__WBP_HUD_GM_EndBattle_Panel_WBP_GM_PromptGeneric_Continue_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature final
{
public:
	class UWBP_GM_PromptGeneric_C*                PromptWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_GM_EndBattle_Panel_C_BndEvt__WBP_HUD_GM_EndBattle_Panel_WBP_GM_PromptGeneric_Continue_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_HUD_GM_EndBattle_Panel_C_BndEvt__WBP_HUD_GM_EndBattle_Panel_WBP_GM_PromptGeneric_Continue_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_HUD_GM_EndBattle_Panel_C_BndEvt__WBP_HUD_GM_EndBattle_Panel_WBP_GM_PromptGeneric_Continue_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000008, "Wrong size on WBP_HUD_GM_EndBattle_Panel_C_BndEvt__WBP_HUD_GM_EndBattle_Panel_WBP_GM_PromptGeneric_Continue_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_HUD_GM_EndBattle_Panel_C_BndEvt__WBP_HUD_GM_EndBattle_Panel_WBP_GM_PromptGeneric_Continue_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature, PromptWidget) == 0x000000, "Member 'WBP_HUD_GM_EndBattle_Panel_C_BndEvt__WBP_HUD_GM_EndBattle_Panel_WBP_GM_PromptGeneric_Continue_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature::PromptWidget' has a wrong offset!");

// Function WBP_HUD_GM_EndBattle_Panel.WBP_HUD_GM_EndBattle_Panel_C.ExecuteUbergraph_WBP_HUD_GM_EndBattle_Panel
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_HUD_GM_EndBattle_Panel_C_ExecuteUbergraph_WBP_HUD_GM_EndBattle_Panel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFontOutlineSettings                   K2Node_MakeStruct_FontOutlineSettings;             // 0x0008(0x0020)(NoDestructor, HasGetValueTypeHash)
	class UWBP_GM_PromptGeneric_C*                K2Node_ComponentBoundEvent_PromptWidget;           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0068(0x0060)(HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_GM_EndBattle_Panel_C_ExecuteUbergraph_WBP_HUD_GM_EndBattle_Panel) == 0x000008, "Wrong alignment on WBP_HUD_GM_EndBattle_Panel_C_ExecuteUbergraph_WBP_HUD_GM_EndBattle_Panel");
static_assert(sizeof(WBP_HUD_GM_EndBattle_Panel_C_ExecuteUbergraph_WBP_HUD_GM_EndBattle_Panel) == 0x0000C8, "Wrong size on WBP_HUD_GM_EndBattle_Panel_C_ExecuteUbergraph_WBP_HUD_GM_EndBattle_Panel");
static_assert(offsetof(WBP_HUD_GM_EndBattle_Panel_C_ExecuteUbergraph_WBP_HUD_GM_EndBattle_Panel, EntryPoint) == 0x000000, "Member 'WBP_HUD_GM_EndBattle_Panel_C_ExecuteUbergraph_WBP_HUD_GM_EndBattle_Panel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GM_EndBattle_Panel_C_ExecuteUbergraph_WBP_HUD_GM_EndBattle_Panel, K2Node_MakeStruct_FontOutlineSettings) == 0x000008, "Member 'WBP_HUD_GM_EndBattle_Panel_C_ExecuteUbergraph_WBP_HUD_GM_EndBattle_Panel::K2Node_MakeStruct_FontOutlineSettings' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GM_EndBattle_Panel_C_ExecuteUbergraph_WBP_HUD_GM_EndBattle_Panel, K2Node_ComponentBoundEvent_PromptWidget) == 0x000028, "Member 'WBP_HUD_GM_EndBattle_Panel_C_ExecuteUbergraph_WBP_HUD_GM_EndBattle_Panel::K2Node_ComponentBoundEvent_PromptWidget' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GM_EndBattle_Panel_C_ExecuteUbergraph_WBP_HUD_GM_EndBattle_Panel, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'WBP_HUD_GM_EndBattle_Panel_C_ExecuteUbergraph_WBP_HUD_GM_EndBattle_Panel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GM_EndBattle_Panel_C_ExecuteUbergraph_WBP_HUD_GM_EndBattle_Panel, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000040, "Member 'WBP_HUD_GM_EndBattle_Panel_C_ExecuteUbergraph_WBP_HUD_GM_EndBattle_Panel::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GM_EndBattle_Panel_C_ExecuteUbergraph_WBP_HUD_GM_EndBattle_Panel, CallFunc_PlayAnimationForward_ReturnValue) == 0x000048, "Member 'WBP_HUD_GM_EndBattle_Panel_C_ExecuteUbergraph_WBP_HUD_GM_EndBattle_Panel::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GM_EndBattle_Panel_C_ExecuteUbergraph_WBP_HUD_GM_EndBattle_Panel, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000050, "Member 'WBP_HUD_GM_EndBattle_Panel_C_ExecuteUbergraph_WBP_HUD_GM_EndBattle_Panel::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GM_EndBattle_Panel_C_ExecuteUbergraph_WBP_HUD_GM_EndBattle_Panel, K2Node_CreateDelegate_OutputDelegate_1) == 0x000058, "Member 'WBP_HUD_GM_EndBattle_Panel_C_ExecuteUbergraph_WBP_HUD_GM_EndBattle_Panel::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GM_EndBattle_Panel_C_ExecuteUbergraph_WBP_HUD_GM_EndBattle_Panel, K2Node_MakeStruct_SlateFontInfo) == 0x000068, "Member 'WBP_HUD_GM_EndBattle_Panel_C_ExecuteUbergraph_WBP_HUD_GM_EndBattle_Panel::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");

// Function WBP_HUD_GM_EndBattle_Panel.WBP_HUD_GM_EndBattle_Panel_C.Load Battle Stats and Rewards
// 0x0048 (0x0048 - 0x0000)
struct WBP_HUD_GM_EndBattle_Panel_C_Load_Battle_Stats_and_Rewards final
{
public:
	struct FS_BattleSummaryStats                  BattleSummaryStats;                                // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_BattleRewards                       Battle_Rewards_0;                                  // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_GM_EndBattle_Panel_C_Load_Battle_Stats_and_Rewards) == 0x000008, "Wrong alignment on WBP_HUD_GM_EndBattle_Panel_C_Load_Battle_Stats_and_Rewards");
static_assert(sizeof(WBP_HUD_GM_EndBattle_Panel_C_Load_Battle_Stats_and_Rewards) == 0x000048, "Wrong size on WBP_HUD_GM_EndBattle_Panel_C_Load_Battle_Stats_and_Rewards");
static_assert(offsetof(WBP_HUD_GM_EndBattle_Panel_C_Load_Battle_Stats_and_Rewards, BattleSummaryStats) == 0x000000, "Member 'WBP_HUD_GM_EndBattle_Panel_C_Load_Battle_Stats_and_Rewards::BattleSummaryStats' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GM_EndBattle_Panel_C_Load_Battle_Stats_and_Rewards, Battle_Rewards_0) == 0x000028, "Member 'WBP_HUD_GM_EndBattle_Panel_C_Load_Battle_Stats_and_Rewards::Battle_Rewards_0' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GM_EndBattle_Panel_C_Load_Battle_Stats_and_Rewards, Temp_byte_Variable) == 0x000040, "Member 'WBP_HUD_GM_EndBattle_Panel_C_Load_Battle_Stats_and_Rewards::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GM_EndBattle_Panel_C_Load_Battle_Stats_and_Rewards, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000041, "Member 'WBP_HUD_GM_EndBattle_Panel_C_Load_Battle_Stats_and_Rewards::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GM_EndBattle_Panel_C_Load_Battle_Stats_and_Rewards, Temp_byte_Variable_1) == 0x000042, "Member 'WBP_HUD_GM_EndBattle_Panel_C_Load_Battle_Stats_and_Rewards::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GM_EndBattle_Panel_C_Load_Battle_Stats_and_Rewards, Temp_bool_Variable) == 0x000043, "Member 'WBP_HUD_GM_EndBattle_Panel_C_Load_Battle_Stats_and_Rewards::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GM_EndBattle_Panel_C_Load_Battle_Stats_and_Rewards, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000044, "Member 'WBP_HUD_GM_EndBattle_Panel_C_Load_Battle_Stats_and_Rewards::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GM_EndBattle_Panel_C_Load_Battle_Stats_and_Rewards, CallFunc_BooleanAND_ReturnValue) == 0x000045, "Member 'WBP_HUD_GM_EndBattle_Panel_C_Load_Battle_Stats_and_Rewards::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GM_EndBattle_Panel_C_Load_Battle_Stats_and_Rewards, K2Node_Select_Default) == 0x000046, "Member 'WBP_HUD_GM_EndBattle_Panel_C_Load_Battle_Stats_and_Rewards::K2Node_Select_Default' has a wrong offset!");

// Function WBP_HUD_GM_EndBattle_Panel.WBP_HUD_GM_EndBattle_Panel_C.LoadCharacterBattleStats
// 0x0010 (0x0010 - 0x0000)
struct WBP_HUD_GM_EndBattle_Panel_C_LoadCharacterBattleStats final
{
public:
	TArray<class UAC_jRPG_CharacterBattleStats_C*> CharacterBattleStats_0;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_HUD_GM_EndBattle_Panel_C_LoadCharacterBattleStats) == 0x000008, "Wrong alignment on WBP_HUD_GM_EndBattle_Panel_C_LoadCharacterBattleStats");
static_assert(sizeof(WBP_HUD_GM_EndBattle_Panel_C_LoadCharacterBattleStats) == 0x000010, "Wrong size on WBP_HUD_GM_EndBattle_Panel_C_LoadCharacterBattleStats");
static_assert(offsetof(WBP_HUD_GM_EndBattle_Panel_C_LoadCharacterBattleStats, CharacterBattleStats_0) == 0x000000, "Member 'WBP_HUD_GM_EndBattle_Panel_C_LoadCharacterBattleStats::CharacterBattleStats_0' has a wrong offset!");

// Function WBP_HUD_GM_EndBattle_Panel.WBP_HUD_GM_EndBattle_Panel_C.LoadInitialCharacterStates
// 0x0010 (0x0010 - 0x0000)
struct WBP_HUD_GM_EndBattle_Panel_C_LoadInitialCharacterStates final
{
public:
	TArray<class UBP_CharacterData_C*>            CharacterDatas;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_HUD_GM_EndBattle_Panel_C_LoadInitialCharacterStates) == 0x000008, "Wrong alignment on WBP_HUD_GM_EndBattle_Panel_C_LoadInitialCharacterStates");
static_assert(sizeof(WBP_HUD_GM_EndBattle_Panel_C_LoadInitialCharacterStates) == 0x000010, "Wrong size on WBP_HUD_GM_EndBattle_Panel_C_LoadInitialCharacterStates");
static_assert(offsetof(WBP_HUD_GM_EndBattle_Panel_C_LoadInitialCharacterStates, CharacterDatas) == 0x000000, "Member 'WBP_HUD_GM_EndBattle_Panel_C_LoadInitialCharacterStates::CharacterDatas' has a wrong offset!");

// Function WBP_HUD_GM_EndBattle_Panel.WBP_HUD_GM_EndBattle_Panel_C.LoadKilledEnemies
// 0x0010 (0x0010 - 0x0000)
struct WBP_HUD_GM_EndBattle_Panel_C_LoadKilledEnemies final
{
public:
	TArray<class ABP_jRPG_Character_Battle_Base_C*> KilledEnemies;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_HUD_GM_EndBattle_Panel_C_LoadKilledEnemies) == 0x000008, "Wrong alignment on WBP_HUD_GM_EndBattle_Panel_C_LoadKilledEnemies");
static_assert(sizeof(WBP_HUD_GM_EndBattle_Panel_C_LoadKilledEnemies) == 0x000010, "Wrong size on WBP_HUD_GM_EndBattle_Panel_C_LoadKilledEnemies");
static_assert(offsetof(WBP_HUD_GM_EndBattle_Panel_C_LoadKilledEnemies, KilledEnemies) == 0x000000, "Member 'WBP_HUD_GM_EndBattle_Panel_C_LoadKilledEnemies::KilledEnemies' has a wrong offset!");

}

