#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OverlayHealCartridge

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_OverlayHealCartridge.WBP_OverlayHealCartridge_C
// 0x0038 (0x0468 - 0x0430)
class UWBP_OverlayHealCartridge_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonLazyImage*                       Background;                                        // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HealingElixirCount_C*              HealingElixirCount;                                // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GM_PromptGeneric_C*                HealPrompt;                                        // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnHealSuccess;                                     // 0x0450(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bHideBindingWhenInactive;                          // 0x0460(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_OverviewHealCartridge_HealPrompt_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void ExecuteUbergraph_WBP_OverlayHealCartridge(int32 EntryPoint);
	void OnTutorialTriggerHeal();
	void SetPromptActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_OverlayHealCartridge_C">();
	}
	static class UWBP_OverlayHealCartridge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_OverlayHealCartridge_C>();
	}
};
static_assert(alignof(UWBP_OverlayHealCartridge_C) == 0x000008, "Wrong alignment on UWBP_OverlayHealCartridge_C");
static_assert(sizeof(UWBP_OverlayHealCartridge_C) == 0x000468, "Wrong size on UWBP_OverlayHealCartridge_C");
static_assert(offsetof(UWBP_OverlayHealCartridge_C, UberGraphFrame) == 0x000430, "Member 'UWBP_OverlayHealCartridge_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_OverlayHealCartridge_C, Background) == 0x000438, "Member 'UWBP_OverlayHealCartridge_C::Background' has a wrong offset!");
static_assert(offsetof(UWBP_OverlayHealCartridge_C, HealingElixirCount) == 0x000440, "Member 'UWBP_OverlayHealCartridge_C::HealingElixirCount' has a wrong offset!");
static_assert(offsetof(UWBP_OverlayHealCartridge_C, HealPrompt) == 0x000448, "Member 'UWBP_OverlayHealCartridge_C::HealPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_OverlayHealCartridge_C, OnHealSuccess) == 0x000450, "Member 'UWBP_OverlayHealCartridge_C::OnHealSuccess' has a wrong offset!");
static_assert(offsetof(UWBP_OverlayHealCartridge_C, bHideBindingWhenInactive) == 0x000460, "Member 'UWBP_OverlayHealCartridge_C::bHideBindingWhenInactive' has a wrong offset!");

}

