#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Debug_UMG_AnimationDebugger_WidgetEntry

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Debug_UMG_AnimationDebugger_WidgetEntry.WBP_Debug_UMG_AnimationDebugger_WidgetEntry_C.RegisterWidget
// 0x0068 (0x0068 - 0x0000)
struct WBP_Debug_UMG_AnimationDebugger_WidgetEntry_C_RegisterWidget final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidgetAnimation*>               Animations;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0010)()
	class UWidgetAnimation*                       CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C* CallFunc_BP_CreateEntryOfClass_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_UMG_AnimationDebugger_WidgetEntry_C_RegisterWidget) == 0x000008, "Wrong alignment on WBP_Debug_UMG_AnimationDebugger_WidgetEntry_C_RegisterWidget");
static_assert(sizeof(WBP_Debug_UMG_AnimationDebugger_WidgetEntry_C_RegisterWidget) == 0x000068, "Wrong size on WBP_Debug_UMG_AnimationDebugger_WidgetEntry_C_RegisterWidget");
static_assert(offsetof(WBP_Debug_UMG_AnimationDebugger_WidgetEntry_C_RegisterWidget, Widget) == 0x000000, "Member 'WBP_Debug_UMG_AnimationDebugger_WidgetEntry_C_RegisterWidget::Widget' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UMG_AnimationDebugger_WidgetEntry_C_RegisterWidget, Animations) == 0x000008, "Member 'WBP_Debug_UMG_AnimationDebugger_WidgetEntry_C_RegisterWidget::Animations' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UMG_AnimationDebugger_WidgetEntry_C_RegisterWidget, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_Debug_UMG_AnimationDebugger_WidgetEntry_C_RegisterWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UMG_AnimationDebugger_WidgetEntry_C_RegisterWidget, CallFunc_GetDisplayName_ReturnValue) == 0x000020, "Member 'WBP_Debug_UMG_AnimationDebugger_WidgetEntry_C_RegisterWidget::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UMG_AnimationDebugger_WidgetEntry_C_RegisterWidget, Temp_int_Array_Index_Variable) == 0x000030, "Member 'WBP_Debug_UMG_AnimationDebugger_WidgetEntry_C_RegisterWidget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UMG_AnimationDebugger_WidgetEntry_C_RegisterWidget, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'WBP_Debug_UMG_AnimationDebugger_WidgetEntry_C_RegisterWidget::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UMG_AnimationDebugger_WidgetEntry_C_RegisterWidget, CallFunc_Array_Get_Item) == 0x000048, "Member 'WBP_Debug_UMG_AnimationDebugger_WidgetEntry_C_RegisterWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UMG_AnimationDebugger_WidgetEntry_C_RegisterWidget, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'WBP_Debug_UMG_AnimationDebugger_WidgetEntry_C_RegisterWidget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UMG_AnimationDebugger_WidgetEntry_C_RegisterWidget, CallFunc_BP_CreateEntryOfClass_ReturnValue) == 0x000058, "Member 'WBP_Debug_UMG_AnimationDebugger_WidgetEntry_C_RegisterWidget::CallFunc_BP_CreateEntryOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UMG_AnimationDebugger_WidgetEntry_C_RegisterWidget, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'WBP_Debug_UMG_AnimationDebugger_WidgetEntry_C_RegisterWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UMG_AnimationDebugger_WidgetEntry_C_RegisterWidget, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'WBP_Debug_UMG_AnimationDebugger_WidgetEntry_C_RegisterWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

