#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_GeneralOptionsList

#include "Basic.hpp"

#include "WBP_Settings_OptionsList_Abstract_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Settings_GeneralOptionsList.WBP_Settings_GeneralOptionsList_C
// 0x0080 (0x04B8 - 0x0438)
class UWBP_Settings_GeneralOptionsList_C final : public UWBP_Settings_OptionsList_Abstract_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_Settings_GeneralOptionsList_C;  // 0x0438(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_NamedBoolSelector_C*               WBP_NamedBoolSelector_Subtitles;                   // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NamedBoolSelector_C*               WBP_NamedBoolSelector_Subtitles_DisplaySpeaker;    // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NamedBoolSelector_C*               WBP_NamedBoolSelector_Subtitles_SpeakerPersonalColor; // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NamedIntegerSelector_C*            WBP_NamedIntegerSelector_AudioLanguage;            // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NamedIntegerSelector_C*            WBP_NamedIntegerSelector_Language;                 // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NamedIntegerSelector_C*            WBP_NamedIntegerSelector_Subtitles_Size;           // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_OptionEntriesHeader_C*    WBP_Settings_OptionEntriesHeader_Language;         // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_OptionEntriesHeader_C*    WBP_Settings_OptionEntriesHeader_Subtitles;        // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_OptionEntry_C*            WBP_Settings_OptionEntry_AudioLanguage;            // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_OptionEntry_C*            WBP_Settings_OptionEntry_Language;                 // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_OptionEntry_C*            WBP_Settings_OptionEntry_Subtitles;                // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_OptionEntry_C*            WBP_Settings_OptionEntry_Subtitles_DisplaySpeaker; // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_OptionEntry_C*            WBP_Settings_OptionEntry_Subtitles_Size;           // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_OptionEntry_C*            WBP_Settings_OptionEntry_Subtitles_SpeakerPersonalColor; // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConfigurableGameUserSettings*          GameUserSettings;                                  // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BindOnOptionEntryFocused(const TDelegate<void(class UWBP_Settings_OptionEntry_C* Widget)>& Event);
	void BndEvt__WBP_Settings_GeneralOptionsList_WBP_NamedBoolSelector_Subtitles_DisplaySpeaker_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature(bool Value, const class FText& Name_0, class UUserWidget* Widget);
	void BndEvt__WBP_Settings_GeneralOptionsList_WBP_NamedBoolSelector_Subtitles_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature(bool Value, const class FText& Name_0, class UUserWidget* Widget);
	void BndEvt__WBP_Settings_GeneralOptionsList_WBP_NamedBoolSelector_Subtitles_SpeakerPersonalColor_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature(bool Value, const class FText& Name_0, class UUserWidget* Widget);
	void BndEvt__WBP_Settings_GeneralOptionsList_WBP_NamedIntegerSelector_AudioLanguage_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature(int32 Value, const class FText& Name_0, class UUserWidget* Widget);
	void BndEvt__WBP_Settings_GeneralOptionsList_WBP_NamedIntegerSelector_Language_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature(int32 Value, const class FText& Name_0, class UUserWidget* Widget);
	void BndEvt__WBP_Settings_GeneralOptionsList_WBP_NamedIntegerSelector_Subtitles_Size_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature(int32 Value, const class FText& Name_0, class UUserWidget* Widget);
	void ExecuteUbergraph_WBP_Settings_GeneralOptionsList(int32 EntryPoint);
	void GetAudioLanguageAvailableValues(TMap<int32, class FText>* Values);
	void GetAudioLanguageSelectedCultureIndex(int32* Selected_Culture);
	void GetLanguageAvailableValues(TMap<int32, class FText>* Values);
	void GetLanguageSelectedCultureIndex(int32* Selected_Culture);
	void LoadUserSettings();
	void SetupAvailableOptions();
	void UnbindOnOptionEntryFocused(const TDelegate<void(class UWBP_Settings_OptionEntry_C* Widget)>& Event);
	void UpdateSpeakerPersonalColorWidget();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Settings_GeneralOptionsList_C">();
	}
	static class UWBP_Settings_GeneralOptionsList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Settings_GeneralOptionsList_C>();
	}
};
static_assert(alignof(UWBP_Settings_GeneralOptionsList_C) == 0x000008, "Wrong alignment on UWBP_Settings_GeneralOptionsList_C");
static_assert(sizeof(UWBP_Settings_GeneralOptionsList_C) == 0x0004B8, "Wrong size on UWBP_Settings_GeneralOptionsList_C");
static_assert(offsetof(UWBP_Settings_GeneralOptionsList_C, UberGraphFrame_WBP_Settings_GeneralOptionsList_C) == 0x000438, "Member 'UWBP_Settings_GeneralOptionsList_C::UberGraphFrame_WBP_Settings_GeneralOptionsList_C' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GeneralOptionsList_C, WBP_NamedBoolSelector_Subtitles) == 0x000440, "Member 'UWBP_Settings_GeneralOptionsList_C::WBP_NamedBoolSelector_Subtitles' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GeneralOptionsList_C, WBP_NamedBoolSelector_Subtitles_DisplaySpeaker) == 0x000448, "Member 'UWBP_Settings_GeneralOptionsList_C::WBP_NamedBoolSelector_Subtitles_DisplaySpeaker' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GeneralOptionsList_C, WBP_NamedBoolSelector_Subtitles_SpeakerPersonalColor) == 0x000450, "Member 'UWBP_Settings_GeneralOptionsList_C::WBP_NamedBoolSelector_Subtitles_SpeakerPersonalColor' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GeneralOptionsList_C, WBP_NamedIntegerSelector_AudioLanguage) == 0x000458, "Member 'UWBP_Settings_GeneralOptionsList_C::WBP_NamedIntegerSelector_AudioLanguage' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GeneralOptionsList_C, WBP_NamedIntegerSelector_Language) == 0x000460, "Member 'UWBP_Settings_GeneralOptionsList_C::WBP_NamedIntegerSelector_Language' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GeneralOptionsList_C, WBP_NamedIntegerSelector_Subtitles_Size) == 0x000468, "Member 'UWBP_Settings_GeneralOptionsList_C::WBP_NamedIntegerSelector_Subtitles_Size' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GeneralOptionsList_C, WBP_Settings_OptionEntriesHeader_Language) == 0x000470, "Member 'UWBP_Settings_GeneralOptionsList_C::WBP_Settings_OptionEntriesHeader_Language' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GeneralOptionsList_C, WBP_Settings_OptionEntriesHeader_Subtitles) == 0x000478, "Member 'UWBP_Settings_GeneralOptionsList_C::WBP_Settings_OptionEntriesHeader_Subtitles' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GeneralOptionsList_C, WBP_Settings_OptionEntry_AudioLanguage) == 0x000480, "Member 'UWBP_Settings_GeneralOptionsList_C::WBP_Settings_OptionEntry_AudioLanguage' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GeneralOptionsList_C, WBP_Settings_OptionEntry_Language) == 0x000488, "Member 'UWBP_Settings_GeneralOptionsList_C::WBP_Settings_OptionEntry_Language' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GeneralOptionsList_C, WBP_Settings_OptionEntry_Subtitles) == 0x000490, "Member 'UWBP_Settings_GeneralOptionsList_C::WBP_Settings_OptionEntry_Subtitles' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GeneralOptionsList_C, WBP_Settings_OptionEntry_Subtitles_DisplaySpeaker) == 0x000498, "Member 'UWBP_Settings_GeneralOptionsList_C::WBP_Settings_OptionEntry_Subtitles_DisplaySpeaker' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GeneralOptionsList_C, WBP_Settings_OptionEntry_Subtitles_Size) == 0x0004A0, "Member 'UWBP_Settings_GeneralOptionsList_C::WBP_Settings_OptionEntry_Subtitles_Size' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GeneralOptionsList_C, WBP_Settings_OptionEntry_Subtitles_SpeakerPersonalColor) == 0x0004A8, "Member 'UWBP_Settings_GeneralOptionsList_C::WBP_Settings_OptionEntry_Subtitles_SpeakerPersonalColor' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GeneralOptionsList_C, GameUserSettings) == 0x0004B0, "Member 'UWBP_Settings_GeneralOptionsList_C::GameUserSettings' has a wrong offset!");

}

