#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GM_MainMenuContainer

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FLevelDataEntry_structs.hpp"
#include "E_GameMenuPage_structs.hpp"


namespace SDK::Params
{

// Function WBP_GM_MainMenuContainer.WBP_GM_MainMenuContainer_C.ActivateCurrentWidgetInSwitcher
// 0x0020 (0x0020 - 0x0000)
struct WBP_GM_MainMenuContainer_C_ActivateCurrentWidgetInSwitcher final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_GameMenuPage                                Temp_byte_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_GameMenuPage                                Temp_byte_Variable_3;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               K2Node_DynamicCast_AsCommon_Activatable_Widget;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_GameMenuPage                                K2Node_Select_Default_1;                           // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_MainMenuContainer_C_ActivateCurrentWidgetInSwitcher) == 0x000008, "Wrong alignment on WBP_GM_MainMenuContainer_C_ActivateCurrentWidgetInSwitcher");
static_assert(sizeof(WBP_GM_MainMenuContainer_C_ActivateCurrentWidgetInSwitcher) == 0x000020, "Wrong size on WBP_GM_MainMenuContainer_C_ActivateCurrentWidgetInSwitcher");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_ActivateCurrentWidgetInSwitcher, Temp_byte_Variable) == 0x000000, "Member 'WBP_GM_MainMenuContainer_C_ActivateCurrentWidgetInSwitcher::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_ActivateCurrentWidgetInSwitcher, Temp_byte_Variable_1) == 0x000001, "Member 'WBP_GM_MainMenuContainer_C_ActivateCurrentWidgetInSwitcher::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_ActivateCurrentWidgetInSwitcher, Temp_bool_Variable) == 0x000002, "Member 'WBP_GM_MainMenuContainer_C_ActivateCurrentWidgetInSwitcher::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_ActivateCurrentWidgetInSwitcher, Temp_byte_Variable_2) == 0x000003, "Member 'WBP_GM_MainMenuContainer_C_ActivateCurrentWidgetInSwitcher::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_ActivateCurrentWidgetInSwitcher, Temp_byte_Variable_3) == 0x000004, "Member 'WBP_GM_MainMenuContainer_C_ActivateCurrentWidgetInSwitcher::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_ActivateCurrentWidgetInSwitcher, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'WBP_GM_MainMenuContainer_C_ActivateCurrentWidgetInSwitcher::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_ActivateCurrentWidgetInSwitcher, Temp_bool_Variable_1) == 0x000006, "Member 'WBP_GM_MainMenuContainer_C_ActivateCurrentWidgetInSwitcher::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_ActivateCurrentWidgetInSwitcher, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000007, "Member 'WBP_GM_MainMenuContainer_C_ActivateCurrentWidgetInSwitcher::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_ActivateCurrentWidgetInSwitcher, CallFunc_GetActiveWidget_ReturnValue) == 0x000008, "Member 'WBP_GM_MainMenuContainer_C_ActivateCurrentWidgetInSwitcher::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_ActivateCurrentWidgetInSwitcher, K2Node_DynamicCast_AsCommon_Activatable_Widget) == 0x000010, "Member 'WBP_GM_MainMenuContainer_C_ActivateCurrentWidgetInSwitcher::K2Node_DynamicCast_AsCommon_Activatable_Widget' has a wrong offset!");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_ActivateCurrentWidgetInSwitcher, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_GM_MainMenuContainer_C_ActivateCurrentWidgetInSwitcher::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_ActivateCurrentWidgetInSwitcher, K2Node_Select_Default) == 0x000019, "Member 'WBP_GM_MainMenuContainer_C_ActivateCurrentWidgetInSwitcher::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_ActivateCurrentWidgetInSwitcher, K2Node_Select_Default_1) == 0x00001A, "Member 'WBP_GM_MainMenuContainer_C_ActivateCurrentWidgetInSwitcher::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_GM_MainMenuContainer.WBP_GM_MainMenuContainer_C.BndEvt__WBP_GameMenu_v2_WBP_GM_TeamOverview3D_Page_K2Node_ComponentBoundEvent_7_OnCharacterSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_MainMenuContainer_C_BndEvt__WBP_GameMenu_v2_WBP_GM_TeamOverview3D_Page_K2Node_ComponentBoundEvent_7_OnCharacterSelected__DelegateSignature final
{
public:
	class UBP_CharacterData_C*                    CharacterData;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_MainMenuContainer_C_BndEvt__WBP_GameMenu_v2_WBP_GM_TeamOverview3D_Page_K2Node_ComponentBoundEvent_7_OnCharacterSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GM_MainMenuContainer_C_BndEvt__WBP_GameMenu_v2_WBP_GM_TeamOverview3D_Page_K2Node_ComponentBoundEvent_7_OnCharacterSelected__DelegateSignature");
static_assert(sizeof(WBP_GM_MainMenuContainer_C_BndEvt__WBP_GameMenu_v2_WBP_GM_TeamOverview3D_Page_K2Node_ComponentBoundEvent_7_OnCharacterSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_GM_MainMenuContainer_C_BndEvt__WBP_GameMenu_v2_WBP_GM_TeamOverview3D_Page_K2Node_ComponentBoundEvent_7_OnCharacterSelected__DelegateSignature");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_BndEvt__WBP_GameMenu_v2_WBP_GM_TeamOverview3D_Page_K2Node_ComponentBoundEvent_7_OnCharacterSelected__DelegateSignature, CharacterData) == 0x000000, "Member 'WBP_GM_MainMenuContainer_C_BndEvt__WBP_GameMenu_v2_WBP_GM_TeamOverview3D_Page_K2Node_ComponentBoundEvent_7_OnCharacterSelected__DelegateSignature::CharacterData' has a wrong offset!");

// Function WBP_GM_MainMenuContainer.WBP_GM_MainMenuContainer_C.BndEvt__WBP_GM_MainMenuContainer_WBP_GM_Journal_Page_K2Node_ComponentBoundEvent_3_OnJournalItemNavigated__DelegateSignature
// 0x000C (0x000C - 0x0000)
struct WBP_GM_MainMenuContainer_C_BndEvt__WBP_GM_MainMenuContainer_WBP_GM_Journal_Page_K2Node_ComponentBoundEvent_3_OnJournalItemNavigated__DelegateSignature final
{
public:
	bool                                          IsOwned;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AssociatedLevel;                                   // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_MainMenuContainer_C_BndEvt__WBP_GM_MainMenuContainer_WBP_GM_Journal_Page_K2Node_ComponentBoundEvent_3_OnJournalItemNavigated__DelegateSignature) == 0x000004, "Wrong alignment on WBP_GM_MainMenuContainer_C_BndEvt__WBP_GM_MainMenuContainer_WBP_GM_Journal_Page_K2Node_ComponentBoundEvent_3_OnJournalItemNavigated__DelegateSignature");
static_assert(sizeof(WBP_GM_MainMenuContainer_C_BndEvt__WBP_GM_MainMenuContainer_WBP_GM_Journal_Page_K2Node_ComponentBoundEvent_3_OnJournalItemNavigated__DelegateSignature) == 0x00000C, "Wrong size on WBP_GM_MainMenuContainer_C_BndEvt__WBP_GM_MainMenuContainer_WBP_GM_Journal_Page_K2Node_ComponentBoundEvent_3_OnJournalItemNavigated__DelegateSignature");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_BndEvt__WBP_GM_MainMenuContainer_WBP_GM_Journal_Page_K2Node_ComponentBoundEvent_3_OnJournalItemNavigated__DelegateSignature, IsOwned) == 0x000000, "Member 'WBP_GM_MainMenuContainer_C_BndEvt__WBP_GM_MainMenuContainer_WBP_GM_Journal_Page_K2Node_ComponentBoundEvent_3_OnJournalItemNavigated__DelegateSignature::IsOwned' has a wrong offset!");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_BndEvt__WBP_GM_MainMenuContainer_WBP_GM_Journal_Page_K2Node_ComponentBoundEvent_3_OnJournalItemNavigated__DelegateSignature, AssociatedLevel) == 0x000004, "Member 'WBP_GM_MainMenuContainer_C_BndEvt__WBP_GM_MainMenuContainer_WBP_GM_Journal_Page_K2Node_ComponentBoundEvent_3_OnJournalItemNavigated__DelegateSignature::AssociatedLevel' has a wrong offset!");

// Function WBP_GM_MainMenuContainer.WBP_GM_MainMenuContainer_C.BndEvt__WBP_GM_MainMenuContainer_WBP_GM_TeamOverview3D_Page_K2Node_ComponentBoundEvent_2_OnCharacterFocused__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_MainMenuContainer_C_BndEvt__WBP_GM_MainMenuContainer_WBP_GM_TeamOverview3D_Page_K2Node_ComponentBoundEvent_2_OnCharacterFocused__DelegateSignature final
{
public:
	class UBP_CharacterData_C*                    CharacterData;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_MainMenuContainer_C_BndEvt__WBP_GM_MainMenuContainer_WBP_GM_TeamOverview3D_Page_K2Node_ComponentBoundEvent_2_OnCharacterFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GM_MainMenuContainer_C_BndEvt__WBP_GM_MainMenuContainer_WBP_GM_TeamOverview3D_Page_K2Node_ComponentBoundEvent_2_OnCharacterFocused__DelegateSignature");
static_assert(sizeof(WBP_GM_MainMenuContainer_C_BndEvt__WBP_GM_MainMenuContainer_WBP_GM_TeamOverview3D_Page_K2Node_ComponentBoundEvent_2_OnCharacterFocused__DelegateSignature) == 0x000008, "Wrong size on WBP_GM_MainMenuContainer_C_BndEvt__WBP_GM_MainMenuContainer_WBP_GM_TeamOverview3D_Page_K2Node_ComponentBoundEvent_2_OnCharacterFocused__DelegateSignature");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_BndEvt__WBP_GM_MainMenuContainer_WBP_GM_TeamOverview3D_Page_K2Node_ComponentBoundEvent_2_OnCharacterFocused__DelegateSignature, CharacterData) == 0x000000, "Member 'WBP_GM_MainMenuContainer_C_BndEvt__WBP_GM_MainMenuContainer_WBP_GM_TeamOverview3D_Page_K2Node_ComponentBoundEvent_2_OnCharacterFocused__DelegateSignature::CharacterData' has a wrong offset!");

// Function WBP_GM_MainMenuContainer.WBP_GM_MainMenuContainer_C.DeactivateCurrentWidgetInSwitcher
// 0x0001 (0x0001 - 0x0000)
struct WBP_GM_MainMenuContainer_C_DeactivateCurrentWidgetInSwitcher final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_MainMenuContainer_C_DeactivateCurrentWidgetInSwitcher) == 0x000001, "Wrong alignment on WBP_GM_MainMenuContainer_C_DeactivateCurrentWidgetInSwitcher");
static_assert(sizeof(WBP_GM_MainMenuContainer_C_DeactivateCurrentWidgetInSwitcher) == 0x000001, "Wrong size on WBP_GM_MainMenuContainer_C_DeactivateCurrentWidgetInSwitcher");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_DeactivateCurrentWidgetInSwitcher, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_GM_MainMenuContainer_C_DeactivateCurrentWidgetInSwitcher::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_GM_MainMenuContainer.WBP_GM_MainMenuContainer_C.ExecuteUbergraph_WBP_GM_MainMenuContainer
// 0x0050 (0x0050 - 0x0000)
struct WBP_GM_MainMenuContainer_C_ExecuteUbergraph_WBP_GM_MainMenuContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_IsOwned;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_AssociatedLevel;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate;           // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_1;         // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterData_C*                    K2Node_ComponentBoundEvent_CharacterData_1;        // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_CustomEvent_Button_1;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_CustomEvent_Button;                         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterData_C*                    K2Node_ComponentBoundEvent_CharacterData;          // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_MainMenuContainer_C_ExecuteUbergraph_WBP_GM_MainMenuContainer) == 0x000008, "Wrong alignment on WBP_GM_MainMenuContainer_C_ExecuteUbergraph_WBP_GM_MainMenuContainer");
static_assert(sizeof(WBP_GM_MainMenuContainer_C_ExecuteUbergraph_WBP_GM_MainMenuContainer) == 0x000050, "Wrong size on WBP_GM_MainMenuContainer_C_ExecuteUbergraph_WBP_GM_MainMenuContainer");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_ExecuteUbergraph_WBP_GM_MainMenuContainer, EntryPoint) == 0x000000, "Member 'WBP_GM_MainMenuContainer_C_ExecuteUbergraph_WBP_GM_MainMenuContainer::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_ExecuteUbergraph_WBP_GM_MainMenuContainer, K2Node_ComponentBoundEvent_IsOwned) == 0x000004, "Member 'WBP_GM_MainMenuContainer_C_ExecuteUbergraph_WBP_GM_MainMenuContainer::K2Node_ComponentBoundEvent_IsOwned' has a wrong offset!");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_ExecuteUbergraph_WBP_GM_MainMenuContainer, K2Node_ComponentBoundEvent_AssociatedLevel) == 0x000008, "Member 'WBP_GM_MainMenuContainer_C_ExecuteUbergraph_WBP_GM_MainMenuContainer::K2Node_ComponentBoundEvent_AssociatedLevel' has a wrong offset!");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_ExecuteUbergraph_WBP_GM_MainMenuContainer, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_GM_MainMenuContainer_C_ExecuteUbergraph_WBP_GM_MainMenuContainer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_ExecuteUbergraph_WBP_GM_MainMenuContainer, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'WBP_GM_MainMenuContainer_C_ExecuteUbergraph_WBP_GM_MainMenuContainer::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_ExecuteUbergraph_WBP_GM_MainMenuContainer, K2Node_ComponentBoundEvent_CharacterData_1) == 0x000030, "Member 'WBP_GM_MainMenuContainer_C_ExecuteUbergraph_WBP_GM_MainMenuContainer::K2Node_ComponentBoundEvent_CharacterData_1' has a wrong offset!");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_ExecuteUbergraph_WBP_GM_MainMenuContainer, K2Node_CustomEvent_Button_1) == 0x000038, "Member 'WBP_GM_MainMenuContainer_C_ExecuteUbergraph_WBP_GM_MainMenuContainer::K2Node_CustomEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_ExecuteUbergraph_WBP_GM_MainMenuContainer, K2Node_CustomEvent_Button) == 0x000040, "Member 'WBP_GM_MainMenuContainer_C_ExecuteUbergraph_WBP_GM_MainMenuContainer::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_ExecuteUbergraph_WBP_GM_MainMenuContainer, K2Node_ComponentBoundEvent_CharacterData) == 0x000048, "Member 'WBP_GM_MainMenuContainer_C_ExecuteUbergraph_WBP_GM_MainMenuContainer::K2Node_ComponentBoundEvent_CharacterData' has a wrong offset!");

// Function WBP_GM_MainMenuContainer.WBP_GM_MainMenuContainer_C.OnInventoryClicked
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_MainMenuContainer_C_OnInventoryClicked final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_MainMenuContainer_C_OnInventoryClicked) == 0x000008, "Wrong alignment on WBP_GM_MainMenuContainer_C_OnInventoryClicked");
static_assert(sizeof(WBP_GM_MainMenuContainer_C_OnInventoryClicked) == 0x000008, "Wrong size on WBP_GM_MainMenuContainer_C_OnInventoryClicked");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_OnInventoryClicked, Button) == 0x000000, "Member 'WBP_GM_MainMenuContainer_C_OnInventoryClicked::Button' has a wrong offset!");

// Function WBP_GM_MainMenuContainer.WBP_GM_MainMenuContainer_C.OnJournalClicked
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_MainMenuContainer_C_OnJournalClicked final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_MainMenuContainer_C_OnJournalClicked) == 0x000008, "Wrong alignment on WBP_GM_MainMenuContainer_C_OnJournalClicked");
static_assert(sizeof(WBP_GM_MainMenuContainer_C_OnJournalClicked) == 0x000008, "Wrong size on WBP_GM_MainMenuContainer_C_OnJournalClicked");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_OnJournalClicked, Button) == 0x000000, "Member 'WBP_GM_MainMenuContainer_C_OnJournalClicked::Button' has a wrong offset!");

// Function WBP_GM_MainMenuContainer.WBP_GM_MainMenuContainer_C.SetActiveWidgetInSwitcher
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_MainMenuContainer_C_SetActiveWidgetInSwitcher final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_MainMenuContainer_C_SetActiveWidgetInSwitcher) == 0x000004, "Wrong alignment on WBP_GM_MainMenuContainer_C_SetActiveWidgetInSwitcher");
static_assert(sizeof(WBP_GM_MainMenuContainer_C_SetActiveWidgetInSwitcher) == 0x000008, "Wrong size on WBP_GM_MainMenuContainer_C_SetActiveWidgetInSwitcher");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_SetActiveWidgetInSwitcher, InIndex) == 0x000000, "Member 'WBP_GM_MainMenuContainer_C_SetActiveWidgetInSwitcher::InIndex' has a wrong offset!");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_SetActiveWidgetInSwitcher, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WBP_GM_MainMenuContainer_C_SetActiveWidgetInSwitcher::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_GM_MainMenuContainer.WBP_GM_MainMenuContainer_C.SwitchActiveBackground
// 0x01C8 (0x01C8 - 0x0000)
struct WBP_GM_MainMenuContainer_C_SwitchActiveBackground final
{
public:
	bool                                          IsLevelDisplayed;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   LevelName;                                         // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLevelData_Found;                       // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFLevelDataEntry                       CallFunc_GetLevelData_LevelData;                   // 0x0010(0x01B0)(HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_MainMenuContainer_C_SwitchActiveBackground) == 0x000008, "Wrong alignment on WBP_GM_MainMenuContainer_C_SwitchActiveBackground");
static_assert(sizeof(WBP_GM_MainMenuContainer_C_SwitchActiveBackground) == 0x0001C8, "Wrong size on WBP_GM_MainMenuContainer_C_SwitchActiveBackground");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_SwitchActiveBackground, IsLevelDisplayed) == 0x000000, "Member 'WBP_GM_MainMenuContainer_C_SwitchActiveBackground::IsLevelDisplayed' has a wrong offset!");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_SwitchActiveBackground, LevelName) == 0x000004, "Member 'WBP_GM_MainMenuContainer_C_SwitchActiveBackground::LevelName' has a wrong offset!");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_SwitchActiveBackground, Temp_byte_Variable) == 0x00000C, "Member 'WBP_GM_MainMenuContainer_C_SwitchActiveBackground::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_SwitchActiveBackground, CallFunc_GetLevelData_Found) == 0x00000D, "Member 'WBP_GM_MainMenuContainer_C_SwitchActiveBackground::CallFunc_GetLevelData_Found' has a wrong offset!");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_SwitchActiveBackground, CallFunc_GetLevelData_LevelData) == 0x000010, "Member 'WBP_GM_MainMenuContainer_C_SwitchActiveBackground::CallFunc_GetLevelData_LevelData' has a wrong offset!");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_SwitchActiveBackground, Temp_byte_Variable_1) == 0x0001C0, "Member 'WBP_GM_MainMenuContainer_C_SwitchActiveBackground::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_SwitchActiveBackground, Temp_bool_Variable) == 0x0001C1, "Member 'WBP_GM_MainMenuContainer_C_SwitchActiveBackground::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_SwitchActiveBackground, K2Node_Select_Default) == 0x0001C2, "Member 'WBP_GM_MainMenuContainer_C_SwitchActiveBackground::K2Node_Select_Default' has a wrong offset!");

// Function WBP_GM_MainMenuContainer.WBP_GM_MainMenuContainer_C.BP_GetDesiredFocusTarget
// 0x0010 (0x0010 - 0x0000)
struct WBP_GM_MainMenuContainer_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_MainMenuContainer_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_GM_MainMenuContainer_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_GM_MainMenuContainer_C_BP_GetDesiredFocusTarget) == 0x000010, "Wrong size on WBP_GM_MainMenuContainer_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_GM_MainMenuContainer_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_MainMenuContainer_C_BP_GetDesiredFocusTarget, CallFunc_GetActiveWidget_ReturnValue) == 0x000008, "Member 'WBP_GM_MainMenuContainer_C_BP_GetDesiredFocusTarget::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");

}

