#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_DisplayCharacters

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUD_DisplayCharacters.WBP_HUD_DisplayCharacters_C
// 0x0048 (0x0328 - 0x02E0)
class UWBP_HUD_DisplayCharacters_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_3Characters;                                  // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_2Characters;                                  // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_1Character;                                   // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Appear_Panel;                                 // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_CharacterPortaitsContainer;          // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_HUD_Battle_CharacterPortrait_C*> CharacterPortraitWidgets;                     // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          HasAppeared;                                       // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddCharacter(class UAC_jRPG_CharacterBattleStats_C* CharacterBattleStats, class UWBP_HUD_Battle_CharacterPortrait_C** CreatedWidget);
	void Appear();
	void Construct();
	void Event_SkipTurnOff();
	void Event_SkipTurnOn();
	void ExecuteUbergraph_WBP_HUD_DisplayCharacters(int32 EntryPoint);
	void FindCharacterPortrait(class UAC_jRPG_CharacterBattleStats_C* CharacterStats, class UWBP_HUD_Battle_CharacterPortrait_C** Portrait);
	void OnCharacterKickedFromBattle(class ABP_jRPG_Character_Battle_Base_C* Character);
	void OnCharacterReintegratesBattle(class ABP_jRPG_Character_Battle_Base_C* Character);
	void OnCharacterTurnStart(class UAC_jRPG_CharacterBattleStats_C* Character);
	void OnInitialized();
	void OnTimerEnd();
	void PreConstruct(bool IsDesignTime);
	void RemoveCharacter(class UAC_jRPG_CharacterBattleStats_C* CharacterBattleStats);
	void Set_CharactersCount(int32 Number);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUD_DisplayCharacters_C">();
	}
	static class UWBP_HUD_DisplayCharacters_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_DisplayCharacters_C>();
	}
};
static_assert(alignof(UWBP_HUD_DisplayCharacters_C) == 0x000008, "Wrong alignment on UWBP_HUD_DisplayCharacters_C");
static_assert(sizeof(UWBP_HUD_DisplayCharacters_C) == 0x000328, "Wrong size on UWBP_HUD_DisplayCharacters_C");
static_assert(offsetof(UWBP_HUD_DisplayCharacters_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_HUD_DisplayCharacters_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_DisplayCharacters_C, Anim_3Characters) == 0x0002E8, "Member 'UWBP_HUD_DisplayCharacters_C::Anim_3Characters' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_DisplayCharacters_C, Anim_2Characters) == 0x0002F0, "Member 'UWBP_HUD_DisplayCharacters_C::Anim_2Characters' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_DisplayCharacters_C, Anim_1Character) == 0x0002F8, "Member 'UWBP_HUD_DisplayCharacters_C::Anim_1Character' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_DisplayCharacters_C, Anim_Appear_Panel) == 0x000300, "Member 'UWBP_HUD_DisplayCharacters_C::Anim_Appear_Panel' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_DisplayCharacters_C, HorizontalBox_CharacterPortaitsContainer) == 0x000308, "Member 'UWBP_HUD_DisplayCharacters_C::HorizontalBox_CharacterPortaitsContainer' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_DisplayCharacters_C, CharacterPortraitWidgets) == 0x000310, "Member 'UWBP_HUD_DisplayCharacters_C::CharacterPortraitWidgets' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_DisplayCharacters_C, HasAppeared) == 0x000320, "Member 'UWBP_HUD_DisplayCharacters_C::HasAppeared' has a wrong offset!");

}

