#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PauseMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SandFall_structs.hpp"
#include "EModalUIResponse_structs.hpp"
#include "CommonUI_classes.hpp"
#include "E_jRPG_YesNoQuestions_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PauseMenu.WBP_PauseMenu_C
// 0x0138 (0x0568 - 0x0430)
class UWBP_PauseMenu_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background;                                        // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBackgroundBlur*                        BackgroundBlur;                                    // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MM_BackupSavesBox_C*               BackupSavesBox;                                    // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonActionBarContainer_C*        CommonActionBarContainer;                          // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WrappingText_C*                    ExpBasicsWrappingText;                             // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NotificationBullet_C*              ExpeditionBasicsBullet;                            // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BaseButton_C*                      ExpeditionBasicsButton;                            // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BaseButton_C*                      LoadPreviousSavesButton;                           // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WrappingText_C*                    LoadPreviousSaveWrappingText;                      // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        PauseMenuSwitcher;                                 // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PausePanel;                                        // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BaseButton_C*                      QuitGameButton;                                    // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BaseButton_C*                      ResumeButton;                                      // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BaseButton_C*                      ReturnToTitleScreenButton;                         // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WrappingText_C*                    ReturnWrappingText;                                // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BaseButton_C*                      SettingsButton;                                    // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonBoundActionButton_C*         WBP_CommonBoundActionButton_Back;                  // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GM_Settings_Page_C*                WBP_GM_Settings_Page;                              // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TutorialCollection_C*              WBP_TutorialCollection;                            // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnBackToExploration;                               // 0x04D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FDataTableRowHandle                    SDQuitButton;                                      // 0x04E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	TMulticastInlineDelegate<void()>              OnRequestQuit;                                     // 0x04F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FSoundEventDataTableRowHandle          SD_OnActivated;                                    // 0x0500(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FSoundEventDataTableRowHandle          SD_OnDeactivated;                                  // 0x0510(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FSoundEventDataTableRowHandle          SD_OnBackFromSettings;                             // 0x0520(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	TArray<class UBP_SaveGameData_C*>             BackupSaveDatas;                                   // 0x0530(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         BackupSaveNames;                                   // 0x0540(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 LastSelectedBackupSave;                            // 0x0550(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UBP_LatentAction_LoadGame_C*            LoadlLatentAction;                                 // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AreSettingsOpen(bool* AreSettingsOpen_0);
	void BndEvt__WBP_PauseMenu_BackupSavesBox_K2Node_ComponentBoundEvent_7_OnBackupSaveClicked__DelegateSignature(const class FString& Save);
	void BndEvt__WBP_PauseMenu_ExpeditionBasicsButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_PauseMenu_LoadPreviousSavesButton_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_PauseMenu_QuitGameButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_PauseMenu_ResumeButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_PauseMenu_ReturnToTitleScreenButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_PauseMenu_SettingsButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_PauseMenu_WBP_CommonBoundActionButton_Back_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void BPI_OnMarkNotificationAsRead(class UUserWidget* MarkCaller);
	void BPI_ShouldShowNotification(bool* bShouldShow);
	void Construct();
	void ExecuteUbergraph_WBP_PauseMenu(int32 EntryPoint);
	void OnBackToPauseFromTutorialPressed();
	void OnBackToPausePressed();
	void OnFinished_8B3FF00241D6025AE56B958F6A190E8E();
	void OnQuitGameResponse(EModalUIResponse InUserResponse);
	void OnReturnToTitleScreenResponse(EModalUIResponse InUserResponse);
	void OnUserResponseToLoadBackupSave(bool IsAccepted);
	void RetrieveBackupSaves();
	void RetrievePreviousSave(const class FString& SaveName);
	void SetActiveWidgetInSwitcher(int32 InIndex);
	void ShowSaveModalPopup(const class FText& PopupTitle, const class FText& PopupMessage, E_jRPG_YesNoQuestions DecisionToMake, bool IsHoldConfirm, const class FString& SelectedGameSaveSlot, class UWBP_ModalPopup_C** ModalPopup);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PauseMenu_C">();
	}
	static class UWBP_PauseMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PauseMenu_C>();
	}
};
static_assert(alignof(UWBP_PauseMenu_C) == 0x000008, "Wrong alignment on UWBP_PauseMenu_C");
static_assert(sizeof(UWBP_PauseMenu_C) == 0x000568, "Wrong size on UWBP_PauseMenu_C");
static_assert(offsetof(UWBP_PauseMenu_C, UberGraphFrame) == 0x000430, "Member 'UWBP_PauseMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, Background) == 0x000438, "Member 'UWBP_PauseMenu_C::Background' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, BackgroundBlur) == 0x000440, "Member 'UWBP_PauseMenu_C::BackgroundBlur' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, BackupSavesBox) == 0x000448, "Member 'UWBP_PauseMenu_C::BackupSavesBox' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, CommonActionBarContainer) == 0x000450, "Member 'UWBP_PauseMenu_C::CommonActionBarContainer' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, ExpBasicsWrappingText) == 0x000458, "Member 'UWBP_PauseMenu_C::ExpBasicsWrappingText' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, ExpeditionBasicsBullet) == 0x000460, "Member 'UWBP_PauseMenu_C::ExpeditionBasicsBullet' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, ExpeditionBasicsButton) == 0x000468, "Member 'UWBP_PauseMenu_C::ExpeditionBasicsButton' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, LoadPreviousSavesButton) == 0x000470, "Member 'UWBP_PauseMenu_C::LoadPreviousSavesButton' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, LoadPreviousSaveWrappingText) == 0x000478, "Member 'UWBP_PauseMenu_C::LoadPreviousSaveWrappingText' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, PauseMenuSwitcher) == 0x000480, "Member 'UWBP_PauseMenu_C::PauseMenuSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, PausePanel) == 0x000488, "Member 'UWBP_PauseMenu_C::PausePanel' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, QuitGameButton) == 0x000490, "Member 'UWBP_PauseMenu_C::QuitGameButton' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, ResumeButton) == 0x000498, "Member 'UWBP_PauseMenu_C::ResumeButton' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, ReturnToTitleScreenButton) == 0x0004A0, "Member 'UWBP_PauseMenu_C::ReturnToTitleScreenButton' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, ReturnWrappingText) == 0x0004A8, "Member 'UWBP_PauseMenu_C::ReturnWrappingText' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, SettingsButton) == 0x0004B0, "Member 'UWBP_PauseMenu_C::SettingsButton' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, WBP_CommonBoundActionButton_Back) == 0x0004B8, "Member 'UWBP_PauseMenu_C::WBP_CommonBoundActionButton_Back' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, WBP_GM_Settings_Page) == 0x0004C0, "Member 'UWBP_PauseMenu_C::WBP_GM_Settings_Page' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, WBP_TutorialCollection) == 0x0004C8, "Member 'UWBP_PauseMenu_C::WBP_TutorialCollection' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, OnBackToExploration) == 0x0004D0, "Member 'UWBP_PauseMenu_C::OnBackToExploration' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, SDQuitButton) == 0x0004E0, "Member 'UWBP_PauseMenu_C::SDQuitButton' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, OnRequestQuit) == 0x0004F0, "Member 'UWBP_PauseMenu_C::OnRequestQuit' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, SD_OnActivated) == 0x000500, "Member 'UWBP_PauseMenu_C::SD_OnActivated' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, SD_OnDeactivated) == 0x000510, "Member 'UWBP_PauseMenu_C::SD_OnDeactivated' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, SD_OnBackFromSettings) == 0x000520, "Member 'UWBP_PauseMenu_C::SD_OnBackFromSettings' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, BackupSaveDatas) == 0x000530, "Member 'UWBP_PauseMenu_C::BackupSaveDatas' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, BackupSaveNames) == 0x000540, "Member 'UWBP_PauseMenu_C::BackupSaveNames' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, LastSelectedBackupSave) == 0x000550, "Member 'UWBP_PauseMenu_C::LastSelectedBackupSave' has a wrong offset!");
static_assert(offsetof(UWBP_PauseMenu_C, LoadlLatentAction) == 0x000560, "Member 'UWBP_PauseMenu_C::LoadlLatentAction' has a wrong offset!");

}

