#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_LootEntry

#include "Basic.hpp"

#include "S_jRPG_Item_StaticData_structs.hpp"
#include "UMG_structs.hpp"
#include "E_jRPG_ItemType_structs.hpp"
#include "SlateCore_structs.hpp"
#include "EWeaponQuality_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_HUD_LootEntry.WBP_HUD_LootEntry_C.ExecuteUbergraph_WBP_HUD_LootEntry
// 0x0378 (0x0378 - 0x0000)
struct WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D_1;                 // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_jRPG_Item_StaticData                K2Node_CustomEvent_ItemDefinition;                 // 0x0080(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ItemQuantity;                   // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x01C8(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_212[0x6];                                      // 0x0212(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0218(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0260(0x0010)(ReferenceParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0278(0x0010)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0288(0x0014)()
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_2;              // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x02B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GeneratedItemInfo_Base_C*           K2Node_CustomEvent_GeneratedItem;                  // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemQuantity_Quantity;                 // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GeneratedItemInfo_UpgradableItem_C* K2Node_DynamicCast_AsBP_Generated_Item_Info_Upgradable_Item; // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x02E8(0x0010)()
	int32                                         CallFunc_GetPreviousLevel_CurrentLevel;            // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentLevel_CurrentLevel;             // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWeaponQuality                                CallFunc_GetWeaponQualityForUpgradeLevel_Quality;  // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWeaponQuality                                CallFunc_GetWeaponQualityForUpgradeLevel_Quality_1; // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUpgrade_ReturnValue;                    // 0x0302(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_303[0x1];                                      // 0x0303(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetItemQualityColor_ReturnValue;          // 0x0304(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowQuantity_ReturnValue;           // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_jRPG_ItemType                               CallFunc_GetItemType_ReturnValue;                  // 0x0315(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0316(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0317(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetItemDisplayText_ReturnValue;           // 0x0320(0x0010)()
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetItemIcon_ReturnValue;                  // 0x0330(0x0028)(HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_1;                           // 0x0358(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0360(0x0014)()
};
static_assert(alignof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry) == 0x000008, "Wrong alignment on WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry");
static_assert(sizeof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry) == 0x000378, "Wrong size on WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, EntryPoint) == 0x000000, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, K2Node_CustomEvent_Loaded_1) == 0x000008, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, Temp_object_Variable) == 0x000020, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, K2Node_DynamicCast_AsTexture_2D) == 0x000028, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, K2Node_CustomEvent_Loaded) == 0x000038, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, Temp_object_Variable_1) == 0x000040, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, K2Node_DynamicCast_AsTexture_2D_1) == 0x000048, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::K2Node_DynamicCast_AsTexture_2D_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, Temp_bool_Variable) == 0x000051, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, Temp_bool_Variable_1) == 0x000052, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, Temp_byte_Variable) == 0x000053, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, Temp_byte_Variable_1) == 0x000054, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, CallFunc_PlayAnimation_ReturnValue) == 0x000058, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, K2Node_CreateDelegate_OutputDelegate_1) == 0x000060, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, CallFunc_PlayAnimation_ReturnValue_1) == 0x000070, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, CallFunc_PlayAnimation_ReturnValue_2) == 0x000078, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, K2Node_CustomEvent_ItemDefinition) == 0x000080, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::K2Node_CustomEvent_ItemDefinition' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, K2Node_CustomEvent_ItemQuantity) == 0x0001B0, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::K2Node_CustomEvent_ItemQuantity' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, CallFunc_Conv_IntToInt64_ReturnValue) == 0x0001B8, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, CallFunc_PlayAnimation_ReturnValue_3) == 0x0001C0, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, K2Node_MakeStruct_FormatArgumentData) == 0x0001C8, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000210, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000211, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, K2Node_MakeStruct_FormatArgumentData_1) == 0x000218, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, K2Node_MakeArray_Array) == 0x000260, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, CallFunc_PlayAnimation_ReturnValue_4) == 0x000270, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, CallFunc_Format_ReturnValue) == 0x000278, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, K2Node_MakeStruct_SlateColor) == 0x000288, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, CallFunc_GetPlayerPawn_ReturnValue) == 0x0002A0, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x0002A8, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, CallFunc_GetPlayerPawn_ReturnValue_2) == 0x0002B0, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::CallFunc_GetPlayerPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, K2Node_CreateDelegate_OutputDelegate_2) == 0x0002B8, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, K2Node_CustomEvent_GeneratedItem) == 0x0002C8, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::K2Node_CustomEvent_GeneratedItem' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, CallFunc_GetItemQuantity_Quantity) == 0x0002D0, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::CallFunc_GetItemQuantity_Quantity' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, K2Node_DynamicCast_AsBP_Generated_Item_Info_Upgradable_Item) == 0x0002D8, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::K2Node_DynamicCast_AsBP_Generated_Item_Info_Upgradable_Item' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, K2Node_DynamicCast_bSuccess_2) == 0x0002E0, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, CallFunc_Conv_IntToText_ReturnValue) == 0x0002E8, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, CallFunc_GetPreviousLevel_CurrentLevel) == 0x0002F8, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::CallFunc_GetPreviousLevel_CurrentLevel' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, CallFunc_GetCurrentLevel_CurrentLevel) == 0x0002FC, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::CallFunc_GetCurrentLevel_CurrentLevel' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, CallFunc_GetWeaponQualityForUpgradeLevel_Quality) == 0x000300, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::CallFunc_GetWeaponQualityForUpgradeLevel_Quality' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, CallFunc_GetWeaponQualityForUpgradeLevel_Quality_1) == 0x000301, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::CallFunc_GetWeaponQualityForUpgradeLevel_Quality_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, CallFunc_IsUpgrade_ReturnValue) == 0x000302, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::CallFunc_IsUpgrade_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, CallFunc_GetItemQualityColor_ReturnValue) == 0x000304, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::CallFunc_GetItemQualityColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, CallFunc_ShouldShowQuantity_ReturnValue) == 0x000314, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::CallFunc_ShouldShowQuantity_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, CallFunc_GetItemType_ReturnValue) == 0x000315, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::CallFunc_GetItemType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000316, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, K2Node_Select_Default) == 0x000317, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000318, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, CallFunc_GetItemDisplayText_ReturnValue) == 0x000320, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::CallFunc_GetItemDisplayText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, CallFunc_GetItemIcon_ReturnValue) == 0x000330, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::CallFunc_GetItemIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, K2Node_Select_Default_1) == 0x000358, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry, K2Node_MakeStruct_SlateColor_1) == 0x000360, "Member 'WBP_HUD_LootEntry_C_ExecuteUbergraph_WBP_HUD_LootEntry::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

// Function WBP_HUD_LootEntry.WBP_HUD_LootEntry_C.LoadGeneratedItemInfo
// 0x0008 (0x0008 - 0x0000)
struct WBP_HUD_LootEntry_C_LoadGeneratedItemInfo final
{
public:
	class UBP_GeneratedItemInfo_Base_C*           GeneratedItem;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_LootEntry_C_LoadGeneratedItemInfo) == 0x000008, "Wrong alignment on WBP_HUD_LootEntry_C_LoadGeneratedItemInfo");
static_assert(sizeof(WBP_HUD_LootEntry_C_LoadGeneratedItemInfo) == 0x000008, "Wrong size on WBP_HUD_LootEntry_C_LoadGeneratedItemInfo");
static_assert(offsetof(WBP_HUD_LootEntry_C_LoadGeneratedItemInfo, GeneratedItem) == 0x000000, "Member 'WBP_HUD_LootEntry_C_LoadGeneratedItemInfo::GeneratedItem' has a wrong offset!");

// Function WBP_HUD_LootEntry.WBP_HUD_LootEntry_C.LoadItemInfo
// 0x0138 (0x0138 - 0x0000)
struct WBP_HUD_LootEntry_C_LoadItemInfo final
{
public:
	struct FS_jRPG_Item_StaticData                ItemDefinition;                                    // 0x0000(0x0130)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         ItemQuantity;                                      // 0x0130(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_LootEntry_C_LoadItemInfo) == 0x000008, "Wrong alignment on WBP_HUD_LootEntry_C_LoadItemInfo");
static_assert(sizeof(WBP_HUD_LootEntry_C_LoadItemInfo) == 0x000138, "Wrong size on WBP_HUD_LootEntry_C_LoadItemInfo");
static_assert(offsetof(WBP_HUD_LootEntry_C_LoadItemInfo, ItemDefinition) == 0x000000, "Member 'WBP_HUD_LootEntry_C_LoadItemInfo::ItemDefinition' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootEntry_C_LoadItemInfo, ItemQuantity) == 0x000130, "Member 'WBP_HUD_LootEntry_C_LoadItemInfo::ItemQuantity' has a wrong offset!");

// Function WBP_HUD_LootEntry.WBP_HUD_LootEntry_C.OnLoaded_8E5C5A044B17B50EA0A0DEBFE9D6479F
// 0x0008 (0x0008 - 0x0000)
struct WBP_HUD_LootEntry_C_OnLoaded_8E5C5A044B17B50EA0A0DEBFE9D6479F final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_LootEntry_C_OnLoaded_8E5C5A044B17B50EA0A0DEBFE9D6479F) == 0x000008, "Wrong alignment on WBP_HUD_LootEntry_C_OnLoaded_8E5C5A044B17B50EA0A0DEBFE9D6479F");
static_assert(sizeof(WBP_HUD_LootEntry_C_OnLoaded_8E5C5A044B17B50EA0A0DEBFE9D6479F) == 0x000008, "Wrong size on WBP_HUD_LootEntry_C_OnLoaded_8E5C5A044B17B50EA0A0DEBFE9D6479F");
static_assert(offsetof(WBP_HUD_LootEntry_C_OnLoaded_8E5C5A044B17B50EA0A0DEBFE9D6479F, Loaded) == 0x000000, "Member 'WBP_HUD_LootEntry_C_OnLoaded_8E5C5A044B17B50EA0A0DEBFE9D6479F::Loaded' has a wrong offset!");

// Function WBP_HUD_LootEntry.WBP_HUD_LootEntry_C.OnLoaded_966BBD7B4084FEC0E84A98A58576955D
// 0x0008 (0x0008 - 0x0000)
struct WBP_HUD_LootEntry_C_OnLoaded_966BBD7B4084FEC0E84A98A58576955D final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_LootEntry_C_OnLoaded_966BBD7B4084FEC0E84A98A58576955D) == 0x000008, "Wrong alignment on WBP_HUD_LootEntry_C_OnLoaded_966BBD7B4084FEC0E84A98A58576955D");
static_assert(sizeof(WBP_HUD_LootEntry_C_OnLoaded_966BBD7B4084FEC0E84A98A58576955D) == 0x000008, "Wrong size on WBP_HUD_LootEntry_C_OnLoaded_966BBD7B4084FEC0E84A98A58576955D");
static_assert(offsetof(WBP_HUD_LootEntry_C_OnLoaded_966BBD7B4084FEC0E84A98A58576955D, Loaded) == 0x000000, "Member 'WBP_HUD_LootEntry_C_OnLoaded_966BBD7B4084FEC0E84A98A58576955D::Loaded' has a wrong offset!");

}

