#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_LevelNameAnnounce

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUD_LevelNameAnnounce.WBP_HUD_LevelNameAnnounce_C
// 0x0048 (0x0478 - 0x0430)
class UWBP_HUD_LevelNameAnnounce_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Hide;                                         // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Show;                                         // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonLazyImage*                       Background;                                        // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBlock_LevelName;                               // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        DisplayTime;                                       // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           DisplayTimerHandle;                                // 0x0460(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWBP_HUD_LevelNameAnnounceQueue_C*      OwnerQueue;                                        // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AnnounceAudioComponent;                            // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	void BP_OnDeactivated();
	void DestroyAudioComponent(class FName OutputName, const struct FMetaSoundOutput& Output);
	void ExecuteUbergraph_WBP_HUD_LevelNameAnnounce(int32 EntryPoint);
	class UCommonActivatableWidget* GetVirtualTreeParent();
	void OnQueuePaused();
	void OnQueueResumed();
	void OnShowAnimationFinished();
	void OnTimerEnd();
	void PreConstruct(bool IsDesignTime);
	void SetOwnerQueue(class UWBP_HUD_LevelNameAnnounceQueue_C* InOwnerQueue);
	void Show();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUD_LevelNameAnnounce_C">();
	}
	static class UWBP_HUD_LevelNameAnnounce_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_LevelNameAnnounce_C>();
	}
};
static_assert(alignof(UWBP_HUD_LevelNameAnnounce_C) == 0x000008, "Wrong alignment on UWBP_HUD_LevelNameAnnounce_C");
static_assert(sizeof(UWBP_HUD_LevelNameAnnounce_C) == 0x000478, "Wrong size on UWBP_HUD_LevelNameAnnounce_C");
static_assert(offsetof(UWBP_HUD_LevelNameAnnounce_C, UberGraphFrame) == 0x000430, "Member 'UWBP_HUD_LevelNameAnnounce_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LevelNameAnnounce_C, Anim_Hide) == 0x000438, "Member 'UWBP_HUD_LevelNameAnnounce_C::Anim_Hide' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LevelNameAnnounce_C, Anim_Show) == 0x000440, "Member 'UWBP_HUD_LevelNameAnnounce_C::Anim_Show' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LevelNameAnnounce_C, Background) == 0x000448, "Member 'UWBP_HUD_LevelNameAnnounce_C::Background' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LevelNameAnnounce_C, TextBlock_LevelName) == 0x000450, "Member 'UWBP_HUD_LevelNameAnnounce_C::TextBlock_LevelName' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LevelNameAnnounce_C, DisplayTime) == 0x000458, "Member 'UWBP_HUD_LevelNameAnnounce_C::DisplayTime' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LevelNameAnnounce_C, DisplayTimerHandle) == 0x000460, "Member 'UWBP_HUD_LevelNameAnnounce_C::DisplayTimerHandle' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LevelNameAnnounce_C, OwnerQueue) == 0x000468, "Member 'UWBP_HUD_LevelNameAnnounce_C::OwnerQueue' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LevelNameAnnounce_C, AnnounceAudioComponent) == 0x000470, "Member 'UWBP_HUD_LevelNameAnnounce_C::AnnounceAudioComponent' has a wrong offset!");

}

