#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TypeSelector_Generic

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_TypeSelector_Generic.WBP_TypeSelector_Generic_C.GetCurrentSelectionID
// 0x0018 (0x0018 - 0x0000)
struct WBP_TypeSelector_Generic_C_GetCurrentSelectionID final
{
public:
	class FName                                   SelectionID;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x0008(0x0010)(ReferenceParm)
};
static_assert(alignof(WBP_TypeSelector_Generic_C_GetCurrentSelectionID) == 0x000008, "Wrong alignment on WBP_TypeSelector_Generic_C_GetCurrentSelectionID");
static_assert(sizeof(WBP_TypeSelector_Generic_C_GetCurrentSelectionID) == 0x000018, "Wrong size on WBP_TypeSelector_Generic_C_GetCurrentSelectionID");
static_assert(offsetof(WBP_TypeSelector_Generic_C_GetCurrentSelectionID, SelectionID) == 0x000000, "Member 'WBP_TypeSelector_Generic_C_GetCurrentSelectionID::SelectionID' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_GetCurrentSelectionID, CallFunc_Map_Keys_Keys) == 0x000008, "Member 'WBP_TypeSelector_Generic_C_GetCurrentSelectionID::CallFunc_Map_Keys_Keys' has a wrong offset!");

// Function WBP_TypeSelector_Generic.WBP_TypeSelector_Generic_C.ReconstructWidget
// 0x0068 (0x0068 - 0x0000)
struct WBP_TypeSelector_Generic_C_ReconstructWidget final
{
public:
	class UWBP_TypeSelector_Button_Generic_C*     CallFunc_Create_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x0018(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Map_Find_Value;                           // 0x0030(0x0010)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 SelectorIndex)>          K2Node_CreateDelegate_OutputDelegate;              // 0x004C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TypeSelector_Generic_C_ReconstructWidget) == 0x000008, "Wrong alignment on WBP_TypeSelector_Generic_C_ReconstructWidget");
static_assert(sizeof(WBP_TypeSelector_Generic_C_ReconstructWidget) == 0x000068, "Wrong size on WBP_TypeSelector_Generic_C_ReconstructWidget");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ReconstructWidget, CallFunc_Create_ReturnValue) == 0x000000, "Member 'WBP_TypeSelector_Generic_C_ReconstructWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ReconstructWidget, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_TypeSelector_Generic_C_ReconstructWidget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ReconstructWidget, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_TypeSelector_Generic_C_ReconstructWidget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ReconstructWidget, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_TypeSelector_Generic_C_ReconstructWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ReconstructWidget, CallFunc_Map_Keys_Keys) == 0x000018, "Member 'WBP_TypeSelector_Generic_C_ReconstructWidget::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ReconstructWidget, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_TypeSelector_Generic_C_ReconstructWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ReconstructWidget, CallFunc_Map_Find_Value) == 0x000030, "Member 'WBP_TypeSelector_Generic_C_ReconstructWidget::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ReconstructWidget, CallFunc_Map_Find_ReturnValue) == 0x000040, "Member 'WBP_TypeSelector_Generic_C_ReconstructWidget::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ReconstructWidget, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'WBP_TypeSelector_Generic_C_ReconstructWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ReconstructWidget, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'WBP_TypeSelector_Generic_C_ReconstructWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ReconstructWidget, K2Node_CreateDelegate_OutputDelegate) == 0x00004C, "Member 'WBP_TypeSelector_Generic_C_ReconstructWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ReconstructWidget, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000060, "Member 'WBP_TypeSelector_Generic_C_ReconstructWidget::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");

// Function WBP_TypeSelector_Generic.WBP_TypeSelector_Generic_C.SetWidgetSelected
// 0x0020 (0x0020 - 0x0000)
struct WBP_TypeSelector_Generic_C_SetWidgetSelected final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Selected;                                          // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_TypeSelector_Button_Generic_C*     K2Node_DynamicCast_AsWBP_Type_Selector_Button_Generic; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TypeSelector_Generic_C_SetWidgetSelected) == 0x000008, "Wrong alignment on WBP_TypeSelector_Generic_C_SetWidgetSelected");
static_assert(sizeof(WBP_TypeSelector_Generic_C_SetWidgetSelected) == 0x000020, "Wrong size on WBP_TypeSelector_Generic_C_SetWidgetSelected");
static_assert(offsetof(WBP_TypeSelector_Generic_C_SetWidgetSelected, Index_0) == 0x000000, "Member 'WBP_TypeSelector_Generic_C_SetWidgetSelected::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_SetWidgetSelected, Selected) == 0x000004, "Member 'WBP_TypeSelector_Generic_C_SetWidgetSelected::Selected' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_SetWidgetSelected, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'WBP_TypeSelector_Generic_C_SetWidgetSelected::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_SetWidgetSelected, K2Node_DynamicCast_AsWBP_Type_Selector_Button_Generic) == 0x000010, "Member 'WBP_TypeSelector_Generic_C_SetWidgetSelected::K2Node_DynamicCast_AsWBP_Type_Selector_Button_Generic' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_SetWidgetSelected, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_TypeSelector_Generic_C_SetWidgetSelected::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_TypeSelector_Generic.WBP_TypeSelector_Generic_C.ChangeSelection
// 0x0018 (0x0018 - 0x0000)
struct WBP_TypeSelector_Generic_C_ChangeSelection final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x0008(0x0010)(ReferenceParm)
};
static_assert(alignof(WBP_TypeSelector_Generic_C_ChangeSelection) == 0x000008, "Wrong alignment on WBP_TypeSelector_Generic_C_ChangeSelection");
static_assert(sizeof(WBP_TypeSelector_Generic_C_ChangeSelection) == 0x000018, "Wrong size on WBP_TypeSelector_Generic_C_ChangeSelection");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ChangeSelection, NewIndex) == 0x000000, "Member 'WBP_TypeSelector_Generic_C_ChangeSelection::NewIndex' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ChangeSelection, CallFunc_Map_Keys_Keys) == 0x000008, "Member 'WBP_TypeSelector_Generic_C_ChangeSelection::CallFunc_Map_Keys_Keys' has a wrong offset!");

// Function WBP_TypeSelector_Generic.WBP_TypeSelector_Generic_C.SetOptions
// 0x0050 (0x0050 - 0x0000)
struct WBP_TypeSelector_Generic_C_SetOptions final
{
public:
	TMap<class FName, class FText>                Options_0;                                         // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_TypeSelector_Generic_C_SetOptions) == 0x000008, "Wrong alignment on WBP_TypeSelector_Generic_C_SetOptions");
static_assert(sizeof(WBP_TypeSelector_Generic_C_SetOptions) == 0x000050, "Wrong size on WBP_TypeSelector_Generic_C_SetOptions");
static_assert(offsetof(WBP_TypeSelector_Generic_C_SetOptions, Options_0) == 0x000000, "Member 'WBP_TypeSelector_Generic_C_SetOptions::Options_0' has a wrong offset!");

// Function WBP_TypeSelector_Generic.WBP_TypeSelector_Generic_C.BndEvt__WBP_TypeSelector_Generic_WBP_ButtonBinding_Next_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_TypeSelector_Generic_C_BndEvt__WBP_TypeSelector_Generic_WBP_ButtonBinding_Next_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TypeSelector_Generic_C_BndEvt__WBP_TypeSelector_Generic_WBP_ButtonBinding_Next_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TypeSelector_Generic_C_BndEvt__WBP_TypeSelector_Generic_WBP_ButtonBinding_Next_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_TypeSelector_Generic_C_BndEvt__WBP_TypeSelector_Generic_WBP_ButtonBinding_Next_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_TypeSelector_Generic_C_BndEvt__WBP_TypeSelector_Generic_WBP_ButtonBinding_Next_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_TypeSelector_Generic_C_BndEvt__WBP_TypeSelector_Generic_WBP_ButtonBinding_Next_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_TypeSelector_Generic_C_BndEvt__WBP_TypeSelector_Generic_WBP_ButtonBinding_Next_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_TypeSelector_Generic.WBP_TypeSelector_Generic_C.BndEvt__WBP_TypeSelector_Generic_WBP_ButtonBinding_Previous_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_TypeSelector_Generic_C_BndEvt__WBP_TypeSelector_Generic_WBP_ButtonBinding_Previous_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TypeSelector_Generic_C_BndEvt__WBP_TypeSelector_Generic_WBP_ButtonBinding_Previous_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TypeSelector_Generic_C_BndEvt__WBP_TypeSelector_Generic_WBP_ButtonBinding_Previous_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_TypeSelector_Generic_C_BndEvt__WBP_TypeSelector_Generic_WBP_ButtonBinding_Previous_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_TypeSelector_Generic_C_BndEvt__WBP_TypeSelector_Generic_WBP_ButtonBinding_Previous_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_TypeSelector_Generic_C_BndEvt__WBP_TypeSelector_Generic_WBP_ButtonBinding_Previous_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_TypeSelector_Generic_C_BndEvt__WBP_TypeSelector_Generic_WBP_ButtonBinding_Previous_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_TypeSelector_Generic.WBP_TypeSelector_Generic_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_TypeSelector_Generic_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TypeSelector_Generic_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_TypeSelector_Generic_C_PreConstruct");
static_assert(sizeof(WBP_TypeSelector_Generic_C_PreConstruct) == 0x000001, "Wrong size on WBP_TypeSelector_Generic_C_PreConstruct");
static_assert(offsetof(WBP_TypeSelector_Generic_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_TypeSelector_Generic_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_TypeSelector_Generic.WBP_TypeSelector_Generic_C.ExecuteUbergraph_WBP_TypeSelector_Generic
// 0x0090 (0x0090 - 0x0000)
struct WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Map_Length_ReturnValue_1;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0050(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_TypeSelector_Button_Generic_C*     K2Node_DynamicCast_AsWBP_Type_Selector_Button_Generic; // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     K2Node_DynamicCast_AsHorizontal_Box_Slot;          // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic) == 0x000008, "Wrong alignment on WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic");
static_assert(sizeof(WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic) == 0x000090, "Wrong size on WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic, EntryPoint) == 0x000000, "Member 'WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic, Temp_bool_Variable) == 0x000004, "Member 'WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic, Temp_byte_Variable) == 0x000005, "Member 'WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic, K2Node_ComponentBoundEvent_Button_1) == 0x000018, "Member 'WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic, CallFunc_Add_IntInt_ReturnValue_1) == 0x000020, "Member 'WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic, CallFunc_Map_Length_ReturnValue) == 0x000024, "Member 'WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic::CallFunc_Map_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic, CallFunc_Percent_IntInt_ReturnValue) == 0x000028, "Member 'WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic, CallFunc_Subtract_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic, CallFunc_Map_Length_ReturnValue_1) == 0x000034, "Member 'WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic::CallFunc_Map_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000038, "Member 'WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic, CallFunc_SelectInt_ReturnValue) == 0x00003C, "Member 'WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic, K2Node_ComponentBoundEvent_Button) == 0x000040, "Member 'WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic, CallFunc_Not_PreBool_ReturnValue) == 0x000048, "Member 'WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic, K2Node_Select_Default) == 0x000049, "Member 'WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic, K2Node_Event_IsDesignTime) == 0x00004A, "Member 'WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic, CallFunc_GetAllChildren_ReturnValue) == 0x000050, "Member 'WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic, CallFunc_Array_Get_Item) == 0x000060, "Member 'WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic, K2Node_DynamicCast_AsWBP_Type_Selector_Button_Generic) == 0x000070, "Member 'WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic::K2Node_DynamicCast_AsWBP_Type_Selector_Button_Generic' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic, CallFunc_Less_IntInt_ReturnValue_1) == 0x000079, "Member 'WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic, K2Node_DynamicCast_AsHorizontal_Box_Slot) == 0x000080, "Member 'WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic::K2Node_DynamicCast_AsHorizontal_Box_Slot' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'WBP_TypeSelector_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Generic::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function WBP_TypeSelector_Generic.WBP_TypeSelector_Generic_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_TypeSelector_Generic_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TypeSelector_Generic_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_TypeSelector_Generic_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_TypeSelector_Generic_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_TypeSelector_Generic_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_TypeSelector_Generic_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_TypeSelector_Generic_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

