#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GM_Luminas_Panel

#include "Basic.hpp"

#include "S_jRPG_Item_DynamicData_structs.hpp"
#include "Engine_structs.hpp"
#include "SandFall_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonUI_classes.hpp"
#include "S_TutorialCardParameters_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GM_Luminas_Panel.WBP_GM_Luminas_Panel_C
// 0x0120 (0x0550 - 0x0430)
class UWBP_GM_Luminas_Panel_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_BaseButton_C*                      GoToPictosButton;                                  // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonListView*                        LuminaFromEquippedPictosList;                      // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GM_LuminaHeader_C*                 LuminaPoints;                                      // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GM_LuminasList_C*                  LuminasList;                                       // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PictoIcon_C*                       PictoIcon;                                         // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NotificationBullet_C*              PictosNotificationBullet;                          // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               TutoSelectorBox;                                   // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonBoundActionButton_C*         WBP_CommonBoundActionButton_Back;                  // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonBoundActionButton_C*         WBP_CommonBoundActionButton_Enable;                // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonBoundActionButton_C*         WBP_CommonBoundActionButton_Reset;                 // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonBoundActionButton_C*         WBP_CommonBoundActionButton_ToggleFavorite;        // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GM_CharacterSheet_C*               WBP_GM_CharacterSheet;                             // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InputActionBinding_C*              WBP_InputActionBinding;                            // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_CharacterData_C*                    CurrentCharacterData;                              // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterData_C*                    PreviewCharacterData;                              // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(bool ShouldLock)> OnRequestLockCharacterSwitch;                    // 0x04B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(const struct FS_jRPG_Item_DynamicData& A, const struct FS_jRPG_Item_DynamicData& B, class UOrderingResult* Result)> DummyDispatcher_SortLumina; // 0x04C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FSoundEventDataTableRowHandle          SD_EquipLumina;                                    // 0x04D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FSoundEventDataTableRowHandle          SD_UnequipLumina;                                  // 0x04E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	TMulticastInlineDelegate<void()>              OnGoToPictosButtonClicked;                         // 0x04F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsNavigatedEffectEquipped;                         // 0x0500(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_501[0x7];                                      // 0x0501(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_TutorialCardParameters>      Tutorials;                                         // 0x0508(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         CurrentTutorialIndex;                              // 0x0518(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51C[0x4];                                      // 0x051C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Tuto_BlurIndicator_C*              Area_Highlight_Widget;                             // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSoundEventDataTableRowHandle          SD_OnActivated;                                    // 0x0528(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FSoundEventDataTableRowHandle          SD_OnDeactivated;                                  // 0x0538(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class FName                                   FocusedPassiveEffectID;                            // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_GM_Luminas_Panel_GoToPictosButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_GM_Luminas_Panel_GoToPictosButton_K2Node_ComponentBoundEvent_3_OnButtonBaseFocused__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_GM_Luminas_Panel_LuminasList_K2Node_ComponentBoundEvent_0_OnLuminaItemClicked__DelegateSignature(class FName PassiveEffectID);
	void BndEvt__WBP_GM_Luminas_Panel_LuminasList_K2Node_ComponentBoundEvent_5_OnLuminaItemNavigated__DelegateSignature(class FName PassiveEffectID);
	void BndEvt__WBP_GM_Luminas_Panel_WBP_CommonBoundActionButton_Reset_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_GM_Luminas_Panel_WBP_CommonBoundActionButton_ToggleFavorite_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void BPI_GetCharacterNotificationState(class UBP_CharacterData_C* CharacterData, bool* HasNotification);
	void BPI_LoadCharacter(class UBP_CharacterData_C* CharacterData);
	void BPI_OnMarkNotificationAsRead(class UUserWidget* MarkCaller);
	void BPI_ShouldShowNotification(bool* bShouldShow);
	void Construct();
	class UWidget* DoCustomNavigation(EUINavigation Navigation_0);
	void EndLuminaMenuTutorials();
	void ExecuteUbergraph_WBP_GM_Luminas_Panel(int32 EntryPoint);
	void LoadCharacter(class UBP_CharacterData_C* CharacterData);
	void OnTutorialEnd();
	void PreSelectLumina(class FName PassiveEffectID);
	void RebuildActionBarButtons(class UWBP_CommonActionBarContainer_C* ActionBarContainerWidget);
	void ResetLuminas();
	void StartLuminaMenuTutorials();
	void StartTutorial();
	void ToggleLumina(class FName PassiveEffectID);
	void UpdateLuminaPoints();
	void UpdateLuminasFromEquippedPictos();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GM_Luminas_Panel_C">();
	}
	static class UWBP_GM_Luminas_Panel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GM_Luminas_Panel_C>();
	}
};
static_assert(alignof(UWBP_GM_Luminas_Panel_C) == 0x000008, "Wrong alignment on UWBP_GM_Luminas_Panel_C");
static_assert(sizeof(UWBP_GM_Luminas_Panel_C) == 0x000550, "Wrong size on UWBP_GM_Luminas_Panel_C");
static_assert(offsetof(UWBP_GM_Luminas_Panel_C, UberGraphFrame) == 0x000430, "Member 'UWBP_GM_Luminas_Panel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GM_Luminas_Panel_C, GoToPictosButton) == 0x000438, "Member 'UWBP_GM_Luminas_Panel_C::GoToPictosButton' has a wrong offset!");
static_assert(offsetof(UWBP_GM_Luminas_Panel_C, LuminaFromEquippedPictosList) == 0x000440, "Member 'UWBP_GM_Luminas_Panel_C::LuminaFromEquippedPictosList' has a wrong offset!");
static_assert(offsetof(UWBP_GM_Luminas_Panel_C, LuminaPoints) == 0x000448, "Member 'UWBP_GM_Luminas_Panel_C::LuminaPoints' has a wrong offset!");
static_assert(offsetof(UWBP_GM_Luminas_Panel_C, LuminasList) == 0x000450, "Member 'UWBP_GM_Luminas_Panel_C::LuminasList' has a wrong offset!");
static_assert(offsetof(UWBP_GM_Luminas_Panel_C, PictoIcon) == 0x000458, "Member 'UWBP_GM_Luminas_Panel_C::PictoIcon' has a wrong offset!");
static_assert(offsetof(UWBP_GM_Luminas_Panel_C, PictosNotificationBullet) == 0x000460, "Member 'UWBP_GM_Luminas_Panel_C::PictosNotificationBullet' has a wrong offset!");
static_assert(offsetof(UWBP_GM_Luminas_Panel_C, TutoSelectorBox) == 0x000468, "Member 'UWBP_GM_Luminas_Panel_C::TutoSelectorBox' has a wrong offset!");
static_assert(offsetof(UWBP_GM_Luminas_Panel_C, WBP_CommonBoundActionButton_Back) == 0x000470, "Member 'UWBP_GM_Luminas_Panel_C::WBP_CommonBoundActionButton_Back' has a wrong offset!");
static_assert(offsetof(UWBP_GM_Luminas_Panel_C, WBP_CommonBoundActionButton_Enable) == 0x000478, "Member 'UWBP_GM_Luminas_Panel_C::WBP_CommonBoundActionButton_Enable' has a wrong offset!");
static_assert(offsetof(UWBP_GM_Luminas_Panel_C, WBP_CommonBoundActionButton_Reset) == 0x000480, "Member 'UWBP_GM_Luminas_Panel_C::WBP_CommonBoundActionButton_Reset' has a wrong offset!");
static_assert(offsetof(UWBP_GM_Luminas_Panel_C, WBP_CommonBoundActionButton_ToggleFavorite) == 0x000488, "Member 'UWBP_GM_Luminas_Panel_C::WBP_CommonBoundActionButton_ToggleFavorite' has a wrong offset!");
static_assert(offsetof(UWBP_GM_Luminas_Panel_C, WBP_GM_CharacterSheet) == 0x000490, "Member 'UWBP_GM_Luminas_Panel_C::WBP_GM_CharacterSheet' has a wrong offset!");
static_assert(offsetof(UWBP_GM_Luminas_Panel_C, WBP_InputActionBinding) == 0x000498, "Member 'UWBP_GM_Luminas_Panel_C::WBP_InputActionBinding' has a wrong offset!");
static_assert(offsetof(UWBP_GM_Luminas_Panel_C, CurrentCharacterData) == 0x0004A0, "Member 'UWBP_GM_Luminas_Panel_C::CurrentCharacterData' has a wrong offset!");
static_assert(offsetof(UWBP_GM_Luminas_Panel_C, PreviewCharacterData) == 0x0004A8, "Member 'UWBP_GM_Luminas_Panel_C::PreviewCharacterData' has a wrong offset!");
static_assert(offsetof(UWBP_GM_Luminas_Panel_C, OnRequestLockCharacterSwitch) == 0x0004B0, "Member 'UWBP_GM_Luminas_Panel_C::OnRequestLockCharacterSwitch' has a wrong offset!");
static_assert(offsetof(UWBP_GM_Luminas_Panel_C, DummyDispatcher_SortLumina) == 0x0004C0, "Member 'UWBP_GM_Luminas_Panel_C::DummyDispatcher_SortLumina' has a wrong offset!");
static_assert(offsetof(UWBP_GM_Luminas_Panel_C, SD_EquipLumina) == 0x0004D0, "Member 'UWBP_GM_Luminas_Panel_C::SD_EquipLumina' has a wrong offset!");
static_assert(offsetof(UWBP_GM_Luminas_Panel_C, SD_UnequipLumina) == 0x0004E0, "Member 'UWBP_GM_Luminas_Panel_C::SD_UnequipLumina' has a wrong offset!");
static_assert(offsetof(UWBP_GM_Luminas_Panel_C, OnGoToPictosButtonClicked) == 0x0004F0, "Member 'UWBP_GM_Luminas_Panel_C::OnGoToPictosButtonClicked' has a wrong offset!");
static_assert(offsetof(UWBP_GM_Luminas_Panel_C, IsNavigatedEffectEquipped) == 0x000500, "Member 'UWBP_GM_Luminas_Panel_C::IsNavigatedEffectEquipped' has a wrong offset!");
static_assert(offsetof(UWBP_GM_Luminas_Panel_C, Tutorials) == 0x000508, "Member 'UWBP_GM_Luminas_Panel_C::Tutorials' has a wrong offset!");
static_assert(offsetof(UWBP_GM_Luminas_Panel_C, CurrentTutorialIndex) == 0x000518, "Member 'UWBP_GM_Luminas_Panel_C::CurrentTutorialIndex' has a wrong offset!");
static_assert(offsetof(UWBP_GM_Luminas_Panel_C, Area_Highlight_Widget) == 0x000520, "Member 'UWBP_GM_Luminas_Panel_C::Area_Highlight_Widget' has a wrong offset!");
static_assert(offsetof(UWBP_GM_Luminas_Panel_C, SD_OnActivated) == 0x000528, "Member 'UWBP_GM_Luminas_Panel_C::SD_OnActivated' has a wrong offset!");
static_assert(offsetof(UWBP_GM_Luminas_Panel_C, SD_OnDeactivated) == 0x000538, "Member 'UWBP_GM_Luminas_Panel_C::SD_OnDeactivated' has a wrong offset!");
static_assert(offsetof(UWBP_GM_Luminas_Panel_C, FocusedPassiveEffectID) == 0x000548, "Member 'UWBP_GM_Luminas_Panel_C::FocusedPassiveEffectID' has a wrong offset!");

}

