#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Panel_CharacterCustomization

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Panel_CharacterCustomization.WBP_Panel_CharacterCustomization_C.BndEvt__WBP_Panel_CharacterCustomization_WBP_Costume_Customization_K2Node_ComponentBoundEvent_0_OnWaitForPSOCaching__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_Panel_CharacterCustomization_C_BndEvt__WBP_Panel_CharacterCustomization_WBP_Costume_Customization_K2Node_ComponentBoundEvent_0_OnWaitForPSOCaching__DelegateSignature final
{
public:
	bool                                          IsWaiting;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Panel_CharacterCustomization_C_BndEvt__WBP_Panel_CharacterCustomization_WBP_Costume_Customization_K2Node_ComponentBoundEvent_0_OnWaitForPSOCaching__DelegateSignature) == 0x000001, "Wrong alignment on WBP_Panel_CharacterCustomization_C_BndEvt__WBP_Panel_CharacterCustomization_WBP_Costume_Customization_K2Node_ComponentBoundEvent_0_OnWaitForPSOCaching__DelegateSignature");
static_assert(sizeof(WBP_Panel_CharacterCustomization_C_BndEvt__WBP_Panel_CharacterCustomization_WBP_Costume_Customization_K2Node_ComponentBoundEvent_0_OnWaitForPSOCaching__DelegateSignature) == 0x000001, "Wrong size on WBP_Panel_CharacterCustomization_C_BndEvt__WBP_Panel_CharacterCustomization_WBP_Costume_Customization_K2Node_ComponentBoundEvent_0_OnWaitForPSOCaching__DelegateSignature");
static_assert(offsetof(WBP_Panel_CharacterCustomization_C_BndEvt__WBP_Panel_CharacterCustomization_WBP_Costume_Customization_K2Node_ComponentBoundEvent_0_OnWaitForPSOCaching__DelegateSignature, IsWaiting) == 0x000000, "Member 'WBP_Panel_CharacterCustomization_C_BndEvt__WBP_Panel_CharacterCustomization_WBP_Costume_Customization_K2Node_ComponentBoundEvent_0_OnWaitForPSOCaching__DelegateSignature::IsWaiting' has a wrong offset!");

// Function WBP_Panel_CharacterCustomization.WBP_Panel_CharacterCustomization_C.BndEvt__WBP_Panel_CharacterCustomization_WBP_HairCut_Customization_K2Node_ComponentBoundEvent_1_OnWaitForPSOCaching__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_Panel_CharacterCustomization_C_BndEvt__WBP_Panel_CharacterCustomization_WBP_HairCut_Customization_K2Node_ComponentBoundEvent_1_OnWaitForPSOCaching__DelegateSignature final
{
public:
	bool                                          IsWaiting;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Panel_CharacterCustomization_C_BndEvt__WBP_Panel_CharacterCustomization_WBP_HairCut_Customization_K2Node_ComponentBoundEvent_1_OnWaitForPSOCaching__DelegateSignature) == 0x000001, "Wrong alignment on WBP_Panel_CharacterCustomization_C_BndEvt__WBP_Panel_CharacterCustomization_WBP_HairCut_Customization_K2Node_ComponentBoundEvent_1_OnWaitForPSOCaching__DelegateSignature");
static_assert(sizeof(WBP_Panel_CharacterCustomization_C_BndEvt__WBP_Panel_CharacterCustomization_WBP_HairCut_Customization_K2Node_ComponentBoundEvent_1_OnWaitForPSOCaching__DelegateSignature) == 0x000001, "Wrong size on WBP_Panel_CharacterCustomization_C_BndEvt__WBP_Panel_CharacterCustomization_WBP_HairCut_Customization_K2Node_ComponentBoundEvent_1_OnWaitForPSOCaching__DelegateSignature");
static_assert(offsetof(WBP_Panel_CharacterCustomization_C_BndEvt__WBP_Panel_CharacterCustomization_WBP_HairCut_Customization_K2Node_ComponentBoundEvent_1_OnWaitForPSOCaching__DelegateSignature, IsWaiting) == 0x000000, "Member 'WBP_Panel_CharacterCustomization_C_BndEvt__WBP_Panel_CharacterCustomization_WBP_HairCut_Customization_K2Node_ComponentBoundEvent_1_OnWaitForPSOCaching__DelegateSignature::IsWaiting' has a wrong offset!");

// Function WBP_Panel_CharacterCustomization.WBP_Panel_CharacterCustomization_C.BPI_GetCharacterNotificationState
// 0x0010 (0x0010 - 0x0000)
struct WBP_Panel_CharacterCustomization_C_BPI_GetCharacterNotificationState final
{
public:
	class UBP_CharacterData_C*                    CharacterData_0;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          HasNotification;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Panel_CharacterCustomization_C_BPI_GetCharacterNotificationState) == 0x000008, "Wrong alignment on WBP_Panel_CharacterCustomization_C_BPI_GetCharacterNotificationState");
static_assert(sizeof(WBP_Panel_CharacterCustomization_C_BPI_GetCharacterNotificationState) == 0x000010, "Wrong size on WBP_Panel_CharacterCustomization_C_BPI_GetCharacterNotificationState");
static_assert(offsetof(WBP_Panel_CharacterCustomization_C_BPI_GetCharacterNotificationState, CharacterData_0) == 0x000000, "Member 'WBP_Panel_CharacterCustomization_C_BPI_GetCharacterNotificationState::CharacterData_0' has a wrong offset!");
static_assert(offsetof(WBP_Panel_CharacterCustomization_C_BPI_GetCharacterNotificationState, HasNotification) == 0x000008, "Member 'WBP_Panel_CharacterCustomization_C_BPI_GetCharacterNotificationState::HasNotification' has a wrong offset!");

// Function WBP_Panel_CharacterCustomization.WBP_Panel_CharacterCustomization_C.BPI_LoadCharacter
// 0x0008 (0x0008 - 0x0000)
struct WBP_Panel_CharacterCustomization_C_BPI_LoadCharacter final
{
public:
	class UBP_CharacterData_C*                    CharacterData_0;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Panel_CharacterCustomization_C_BPI_LoadCharacter) == 0x000008, "Wrong alignment on WBP_Panel_CharacterCustomization_C_BPI_LoadCharacter");
static_assert(sizeof(WBP_Panel_CharacterCustomization_C_BPI_LoadCharacter) == 0x000008, "Wrong size on WBP_Panel_CharacterCustomization_C_BPI_LoadCharacter");
static_assert(offsetof(WBP_Panel_CharacterCustomization_C_BPI_LoadCharacter, CharacterData_0) == 0x000000, "Member 'WBP_Panel_CharacterCustomization_C_BPI_LoadCharacter::CharacterData_0' has a wrong offset!");

// Function WBP_Panel_CharacterCustomization.WBP_Panel_CharacterCustomization_C.ExecuteUbergraph_WBP_Panel_CharacterCustomization
// 0x0050 (0x0050 - 0x0000)
struct WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInGamepadOrKeyboardNavigationMode_ReturnValue; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue; // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue_1; // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterData_C*                    K2Node_Event_CharacterData;                        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_IsWaiting_1;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_IsWaiting;              // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization) == 0x000008, "Wrong alignment on WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization");
static_assert(sizeof(WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization) == 0x000050, "Wrong size on WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization");
static_assert(offsetof(WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization, EntryPoint) == 0x000000, "Member 'WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization, CallFunc_IsInGamepadOrKeyboardNavigationMode_ReturnValue) == 0x000004, "Member 'WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization::CallFunc_IsInGamepadOrKeyboardNavigationMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization, Temp_bool_Variable) == 0x000018, "Member 'WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization, CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue) == 0x000020, "Member 'WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization::CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization, CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue_1) == 0x000028, "Member 'WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization::CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization, Temp_byte_Variable) == 0x000030, "Member 'WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization, Temp_byte_Variable_1) == 0x000031, "Member 'WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization, Temp_bool_Variable_1) == 0x000032, "Member 'WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization, Temp_byte_Variable_2) == 0x000033, "Member 'WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization, Temp_byte_Variable_3) == 0x000034, "Member 'WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000038, "Member 'WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization, K2Node_Event_CharacterData) == 0x000040, "Member 'WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization::K2Node_Event_CharacterData' has a wrong offset!");
static_assert(offsetof(WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization, K2Node_ComponentBoundEvent_IsWaiting_1) == 0x000048, "Member 'WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization::K2Node_ComponentBoundEvent_IsWaiting_1' has a wrong offset!");
static_assert(offsetof(WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization, K2Node_Select_Default) == 0x000049, "Member 'WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization, K2Node_ComponentBoundEvent_IsWaiting) == 0x00004A, "Member 'WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization::K2Node_ComponentBoundEvent_IsWaiting' has a wrong offset!");
static_assert(offsetof(WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization, K2Node_Select_Default_1) == 0x00004B, "Member 'WBP_Panel_CharacterCustomization_C_ExecuteUbergraph_WBP_Panel_CharacterCustomization::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_Panel_CharacterCustomization.WBP_Panel_CharacterCustomization_C.BP_GetDesiredFocusTarget
// 0x0010 (0x0010 - 0x0000)
struct WBP_Panel_CharacterCustomization_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Panel_CharacterCustomization_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_Panel_CharacterCustomization_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_Panel_CharacterCustomization_C_BP_GetDesiredFocusTarget) == 0x000010, "Wrong size on WBP_Panel_CharacterCustomization_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_Panel_CharacterCustomization_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_Panel_CharacterCustomization_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Panel_CharacterCustomization_C_BP_GetDesiredFocusTarget, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000008, "Member 'WBP_Panel_CharacterCustomization_C_BP_GetDesiredFocusTarget::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");

}

