#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_JRPG_APChange

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_JRPG_APChange.WBP_JRPG_APChange_C.ExecuteUbergraph_WBP_JRPG_APChange
// 0x0160 (0x0160 - 0x0000)
struct WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x003C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_Battle_Base_C*       K2Node_DynamicCast_AsBP_J_RPG_Character_Battle_Base; // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerTeamCharacter_IsPlayerTeam;       // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBoolCVar_ReturnValue;                  // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_ProjectWorldLocationToScreen_ScreenLocation; // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProjectWorldLocationToScreen_ReturnValue; // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAPGain_ReturnValue;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAPGain_ReturnValue_1;                   // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12B[0x5];                                      // 0x012B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_1;                           // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_2;                           // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0150(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange) == 0x000008, "Wrong alignment on WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange");
static_assert(sizeof(WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange) == 0x000160, "Wrong size on WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange");
static_assert(offsetof(WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange, EntryPoint) == 0x000000, "Member 'WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange, Temp_bool_Variable) == 0x000004, "Member 'WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange, Temp_real_Variable) == 0x000008, "Member 'WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange, Temp_real_Variable_1) == 0x000010, "Member 'WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange, Temp_bool_Variable_1) == 0x000018, "Member 'WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x00002C, "Member 'WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange, CallFunc_Not_PreBool_ReturnValue) == 0x000038, "Member 'WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange, K2Node_Event_MyGeometry) == 0x00003C, "Member 'WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange, K2Node_Event_InDeltaTime) == 0x000074, "Member 'WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange, CallFunc_GetPlayerController_ReturnValue) == 0x000078, "Member 'WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange, K2Node_DynamicCast_AsBP_J_RPG_Character_Battle_Base) == 0x000088, "Member 'WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange::K2Node_DynamicCast_AsBP_J_RPG_Character_Battle_Base' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange, CallFunc_IsPlayerTeamCharacter_IsPlayerTeam) == 0x000091, "Member 'WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange::CallFunc_IsPlayerTeamCharacter_IsPlayerTeam' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange, CallFunc_GetSocketLocation_ReturnValue) == 0x000098, "Member 'WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange, CallFunc_Add_VectorVector_ReturnValue) == 0x0000B0, "Member 'WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000C8, "Member 'WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange, K2Node_Select_Default) == 0x0000E0, "Member 'WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange, CallFunc_GetBoolCVar_ReturnValue) == 0x0000F8, "Member 'WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange::CallFunc_GetBoolCVar_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange, CallFunc_ProjectWorldLocationToScreen_ScreenLocation) == 0x000100, "Member 'WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange::CallFunc_ProjectWorldLocationToScreen_ScreenLocation' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange, CallFunc_ProjectWorldLocationToScreen_ReturnValue) == 0x000110, "Member 'WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange::CallFunc_ProjectWorldLocationToScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange, CallFunc_BreakVector2D_X) == 0x000118, "Member 'WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange, CallFunc_BreakVector2D_Y) == 0x000120, "Member 'WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange, CallFunc_IsAPGain_ReturnValue) == 0x000128, "Member 'WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange::CallFunc_IsAPGain_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange, Temp_bool_Variable_2) == 0x000129, "Member 'WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange, CallFunc_IsAPGain_ReturnValue_1) == 0x00012A, "Member 'WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange::CallFunc_IsAPGain_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange, K2Node_Select_Default_1) == 0x000130, "Member 'WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange, K2Node_Select_Default_2) == 0x000138, "Member 'WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange, CallFunc_PlayAnimationForward_ReturnValue) == 0x000140, "Member 'WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000148, "Member 'WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange, CallFunc_MakeVector2D_ReturnValue) == 0x000150, "Member 'WBP_JRPG_APChange_C_ExecuteUbergraph_WBP_JRPG_APChange::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function WBP_JRPG_APChange.WBP_JRPG_APChange_C.IsAPGain
// 0x0002 (0x0002 - 0x0000)
struct WBP_JRPG_APChange_C_IsAPGain final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_JRPG_APChange_C_IsAPGain) == 0x000001, "Wrong alignment on WBP_JRPG_APChange_C_IsAPGain");
static_assert(sizeof(WBP_JRPG_APChange_C_IsAPGain) == 0x000002, "Wrong size on WBP_JRPG_APChange_C_IsAPGain");
static_assert(offsetof(WBP_JRPG_APChange_C_IsAPGain, ReturnValue) == 0x000000, "Member 'WBP_JRPG_APChange_C_IsAPGain::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_IsAPGain, CallFunc_Greater_IntInt_ReturnValue) == 0x000001, "Member 'WBP_JRPG_APChange_C_IsAPGain::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_JRPG_APChange.WBP_JRPG_APChange_C.SetAPText
// 0x0040 (0x0040 - 0x0000)
struct WBP_JRPG_APChange_C_SetAPText final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0018(0x0010)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0030(0x0010)()
};
static_assert(alignof(WBP_JRPG_APChange_C_SetAPText) == 0x000008, "Wrong alignment on WBP_JRPG_APChange_C_SetAPText");
static_assert(sizeof(WBP_JRPG_APChange_C_SetAPText) == 0x000040, "Wrong size on WBP_JRPG_APChange_C_SetAPText");
static_assert(offsetof(WBP_JRPG_APChange_C_SetAPText, Temp_bool_Variable) == 0x000000, "Member 'WBP_JRPG_APChange_C_SetAPText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_SetAPText, CallFunc_Multiply_IntInt_ReturnValue) == 0x000004, "Member 'WBP_JRPG_APChange_C_SetAPText::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_SetAPText, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_JRPG_APChange_C_SetAPText::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_SetAPText, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000018, "Member 'WBP_JRPG_APChange_C_SetAPText::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_SetAPText, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'WBP_JRPG_APChange_C_SetAPText::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_SetAPText, K2Node_Select_Default) == 0x000030, "Member 'WBP_JRPG_APChange_C_SetAPText::K2Node_Select_Default' has a wrong offset!");

// Function WBP_JRPG_APChange.WBP_JRPG_APChange_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_JRPG_APChange_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_JRPG_APChange_C_Tick) == 0x000004, "Wrong alignment on WBP_JRPG_APChange_C_Tick");
static_assert(sizeof(WBP_JRPG_APChange_C_Tick) == 0x00003C, "Wrong size on WBP_JRPG_APChange_C_Tick");
static_assert(offsetof(WBP_JRPG_APChange_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_JRPG_APChange_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_JRPG_APChange_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_JRPG_APChange_C_Tick::InDeltaTime' has a wrong offset!");

}

