#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_DisplayCharacters

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_HUD_DisplayCharacters.WBP_HUD_DisplayCharacters_C.AddCharacter
// 0x0048 (0x0048 - 0x0000)
struct WBP_HUD_DisplayCharacters_C_AddCharacter final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        CharacterBattleStats;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_HUD_Battle_CharacterPortrait_C*    CreatedWidget;                                     // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_HUD_Battle_CharacterPortrait_C*    CallFunc_FindCharacterPortrait_Portrait;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_HUD_Battle_CharacterPortrait_C*    CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_DisplayCharacters_C_AddCharacter) == 0x000008, "Wrong alignment on WBP_HUD_DisplayCharacters_C_AddCharacter");
static_assert(sizeof(WBP_HUD_DisplayCharacters_C_AddCharacter) == 0x000048, "Wrong size on WBP_HUD_DisplayCharacters_C_AddCharacter");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_AddCharacter, CharacterBattleStats) == 0x000000, "Member 'WBP_HUD_DisplayCharacters_C_AddCharacter::CharacterBattleStats' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_AddCharacter, CreatedWidget) == 0x000008, "Member 'WBP_HUD_DisplayCharacters_C_AddCharacter::CreatedWidget' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_AddCharacter, CallFunc_FindCharacterPortrait_Portrait) == 0x000010, "Member 'WBP_HUD_DisplayCharacters_C_AddCharacter::CallFunc_FindCharacterPortrait_Portrait' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_AddCharacter, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_HUD_DisplayCharacters_C_AddCharacter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_AddCharacter, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'WBP_HUD_DisplayCharacters_C_AddCharacter::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_AddCharacter, K2Node_MakeStruct_Margin) == 0x00001C, "Member 'WBP_HUD_DisplayCharacters_C_AddCharacter::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_AddCharacter, CallFunc_Create_ReturnValue) == 0x000030, "Member 'WBP_HUD_DisplayCharacters_C_AddCharacter::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_AddCharacter, CallFunc_Array_Add_ReturnValue) == 0x000038, "Member 'WBP_HUD_DisplayCharacters_C_AddCharacter::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_AddCharacter, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000040, "Member 'WBP_HUD_DisplayCharacters_C_AddCharacter::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");

// Function WBP_HUD_DisplayCharacters.WBP_HUD_DisplayCharacters_C.ExecuteUbergraph_WBP_HUD_DisplayCharacters
// 0x0090 (0x0090 - 0x0000)
struct WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_HUD_Battle_CharacterPortrait_C*    K2Node_DynamicCast_AsWBP_HUD_Battle_Character_Portrait; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Number;                         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       K2Node_CustomEvent_Character_1;                    // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       K2Node_CustomEvent_Character;                      // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_HUD_Battle_CharacterPortrait_C*    CallFunc_FindCharacterPortrait_Portrait;           // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_HUD_Battle_CharacterPortrait_C*    CallFunc_FindCharacterPortrait_Portrait_1;         // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters) == 0x000008, "Wrong alignment on WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters");
static_assert(sizeof(WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters) == 0x000090, "Wrong size on WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters, EntryPoint) == 0x000000, "Member 'WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters, K2Node_Event_IsDesignTime) == 0x000008, "Member 'WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters, CallFunc_GetAllChildren_ReturnValue) == 0x000018, "Member 'WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters, K2Node_DynamicCast_AsWBP_HUD_Battle_Character_Portrait) == 0x000040, "Member 'WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters::K2Node_DynamicCast_AsWBP_HUD_Battle_Character_Portrait' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000050, "Member 'WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000058, "Member 'WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters, CallFunc_Array_Length_ReturnValue) == 0x00005C, "Member 'WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters, K2Node_CustomEvent_Number) == 0x000060, "Member 'WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters::K2Node_CustomEvent_Number' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters, Temp_int_Loop_Counter_Variable) == 0x000064, "Member 'WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters, K2Node_CustomEvent_Character_1) == 0x000070, "Member 'WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters::K2Node_CustomEvent_Character_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters, K2Node_CustomEvent_Character) == 0x000078, "Member 'WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters, CallFunc_FindCharacterPortrait_Portrait) == 0x000080, "Member 'WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters::CallFunc_FindCharacterPortrait_Portrait' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters, CallFunc_FindCharacterPortrait_Portrait_1) == 0x000088, "Member 'WBP_HUD_DisplayCharacters_C_ExecuteUbergraph_WBP_HUD_DisplayCharacters::CallFunc_FindCharacterPortrait_Portrait_1' has a wrong offset!");

// Function WBP_HUD_DisplayCharacters.WBP_HUD_DisplayCharacters_C.FindCharacterPortrait
// 0x0030 (0x0030 - 0x0000)
struct WBP_HUD_DisplayCharacters_C_FindCharacterPortrait final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        CharacterStats;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_HUD_Battle_CharacterPortrait_C*    Portrait;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_HUD_Battle_CharacterPortrait_C*    CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_DisplayCharacters_C_FindCharacterPortrait) == 0x000008, "Wrong alignment on WBP_HUD_DisplayCharacters_C_FindCharacterPortrait");
static_assert(sizeof(WBP_HUD_DisplayCharacters_C_FindCharacterPortrait) == 0x000030, "Wrong size on WBP_HUD_DisplayCharacters_C_FindCharacterPortrait");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_FindCharacterPortrait, CharacterStats) == 0x000000, "Member 'WBP_HUD_DisplayCharacters_C_FindCharacterPortrait::CharacterStats' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_FindCharacterPortrait, Portrait) == 0x000008, "Member 'WBP_HUD_DisplayCharacters_C_FindCharacterPortrait::Portrait' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_FindCharacterPortrait, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_HUD_DisplayCharacters_C_FindCharacterPortrait::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_FindCharacterPortrait, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_HUD_DisplayCharacters_C_FindCharacterPortrait::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_FindCharacterPortrait, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_HUD_DisplayCharacters_C_FindCharacterPortrait::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_FindCharacterPortrait, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'WBP_HUD_DisplayCharacters_C_FindCharacterPortrait::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_FindCharacterPortrait, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_HUD_DisplayCharacters_C_FindCharacterPortrait::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_FindCharacterPortrait, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'WBP_HUD_DisplayCharacters_C_FindCharacterPortrait::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_FindCharacterPortrait, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000029, "Member 'WBP_HUD_DisplayCharacters_C_FindCharacterPortrait::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_FindCharacterPortrait, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00002A, "Member 'WBP_HUD_DisplayCharacters_C_FindCharacterPortrait::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_FindCharacterPortrait, CallFunc_BooleanOR_ReturnValue) == 0x00002B, "Member 'WBP_HUD_DisplayCharacters_C_FindCharacterPortrait::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_HUD_DisplayCharacters.WBP_HUD_DisplayCharacters_C.OnCharacterKickedFromBattle
// 0x0008 (0x0008 - 0x0000)
struct WBP_HUD_DisplayCharacters_C_OnCharacterKickedFromBattle final
{
public:
	class ABP_jRPG_Character_Battle_Base_C*       Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_DisplayCharacters_C_OnCharacterKickedFromBattle) == 0x000008, "Wrong alignment on WBP_HUD_DisplayCharacters_C_OnCharacterKickedFromBattle");
static_assert(sizeof(WBP_HUD_DisplayCharacters_C_OnCharacterKickedFromBattle) == 0x000008, "Wrong size on WBP_HUD_DisplayCharacters_C_OnCharacterKickedFromBattle");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_OnCharacterKickedFromBattle, Character) == 0x000000, "Member 'WBP_HUD_DisplayCharacters_C_OnCharacterKickedFromBattle::Character' has a wrong offset!");

// Function WBP_HUD_DisplayCharacters.WBP_HUD_DisplayCharacters_C.OnCharacterReintegratesBattle
// 0x0008 (0x0008 - 0x0000)
struct WBP_HUD_DisplayCharacters_C_OnCharacterReintegratesBattle final
{
public:
	class ABP_jRPG_Character_Battle_Base_C*       Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_DisplayCharacters_C_OnCharacterReintegratesBattle) == 0x000008, "Wrong alignment on WBP_HUD_DisplayCharacters_C_OnCharacterReintegratesBattle");
static_assert(sizeof(WBP_HUD_DisplayCharacters_C_OnCharacterReintegratesBattle) == 0x000008, "Wrong size on WBP_HUD_DisplayCharacters_C_OnCharacterReintegratesBattle");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_OnCharacterReintegratesBattle, Character) == 0x000000, "Member 'WBP_HUD_DisplayCharacters_C_OnCharacterReintegratesBattle::Character' has a wrong offset!");

// Function WBP_HUD_DisplayCharacters.WBP_HUD_DisplayCharacters_C.OnCharacterTurnStart
// 0x0028 (0x0028 - 0x0000)
struct WBP_HUD_DisplayCharacters_C_OnCharacterTurnStart final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_HUD_Battle_CharacterPortrait_C*    CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_DisplayCharacters_C_OnCharacterTurnStart) == 0x000008, "Wrong alignment on WBP_HUD_DisplayCharacters_C_OnCharacterTurnStart");
static_assert(sizeof(WBP_HUD_DisplayCharacters_C_OnCharacterTurnStart) == 0x000028, "Wrong size on WBP_HUD_DisplayCharacters_C_OnCharacterTurnStart");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_OnCharacterTurnStart, Character) == 0x000000, "Member 'WBP_HUD_DisplayCharacters_C_OnCharacterTurnStart::Character' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_OnCharacterTurnStart, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_HUD_DisplayCharacters_C_OnCharacterTurnStart::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_OnCharacterTurnStart, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_HUD_DisplayCharacters_C_OnCharacterTurnStart::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_OnCharacterTurnStart, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_HUD_DisplayCharacters_C_OnCharacterTurnStart::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_OnCharacterTurnStart, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'WBP_HUD_DisplayCharacters_C_OnCharacterTurnStart::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_OnCharacterTurnStart, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_HUD_DisplayCharacters_C_OnCharacterTurnStart::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_OnCharacterTurnStart, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'WBP_HUD_DisplayCharacters_C_OnCharacterTurnStart::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_HUD_DisplayCharacters.WBP_HUD_DisplayCharacters_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_HUD_DisplayCharacters_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_DisplayCharacters_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_HUD_DisplayCharacters_C_PreConstruct");
static_assert(sizeof(WBP_HUD_DisplayCharacters_C_PreConstruct) == 0x000001, "Wrong size on WBP_HUD_DisplayCharacters_C_PreConstruct");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_HUD_DisplayCharacters_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_HUD_DisplayCharacters.WBP_HUD_DisplayCharacters_C.RemoveCharacter
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_HUD_DisplayCharacters_C_RemoveCharacter final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        CharacterBattleStats;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_HUD_Battle_CharacterPortrait_C*    local_portraitWidget;                              // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0018(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0048)(HasGetValueTypeHash)
	class UWBP_HUD_Battle_CharacterPortrait_C*    CallFunc_FindCharacterPortrait_Portrait;           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_DisplayCharacters_C_RemoveCharacter) == 0x000008, "Wrong alignment on WBP_HUD_DisplayCharacters_C_RemoveCharacter");
static_assert(sizeof(WBP_HUD_DisplayCharacters_C_RemoveCharacter) == 0x0000A0, "Wrong size on WBP_HUD_DisplayCharacters_C_RemoveCharacter");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_RemoveCharacter, CharacterBattleStats) == 0x000000, "Member 'WBP_HUD_DisplayCharacters_C_RemoveCharacter::CharacterBattleStats' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_RemoveCharacter, local_portraitWidget) == 0x000008, "Member 'WBP_HUD_DisplayCharacters_C_RemoveCharacter::local_portraitWidget' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_RemoveCharacter, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_HUD_DisplayCharacters_C_RemoveCharacter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_RemoveCharacter, CallFunc_Conv_NameToText_ReturnValue) == 0x000018, "Member 'WBP_HUD_DisplayCharacters_C_RemoveCharacter::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_RemoveCharacter, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'WBP_HUD_DisplayCharacters_C_RemoveCharacter::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_RemoveCharacter, CallFunc_FindCharacterPortrait_Portrait) == 0x000070, "Member 'WBP_HUD_DisplayCharacters_C_RemoveCharacter::CallFunc_FindCharacterPortrait_Portrait' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_RemoveCharacter, K2Node_MakeArray_Array) == 0x000078, "Member 'WBP_HUD_DisplayCharacters_C_RemoveCharacter::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_RemoveCharacter, CallFunc_Format_ReturnValue) == 0x000088, "Member 'WBP_HUD_DisplayCharacters_C_RemoveCharacter::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_RemoveCharacter, CallFunc_Array_RemoveItem_ReturnValue) == 0x000098, "Member 'WBP_HUD_DisplayCharacters_C_RemoveCharacter::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_RemoveCharacter, CallFunc_RemoveChild_ReturnValue) == 0x000099, "Member 'WBP_HUD_DisplayCharacters_C_RemoveCharacter::CallFunc_RemoveChild_ReturnValue' has a wrong offset!");

// Function WBP_HUD_DisplayCharacters.WBP_HUD_DisplayCharacters_C.Set_CharactersCount
// 0x0004 (0x0004 - 0x0000)
struct WBP_HUD_DisplayCharacters_C_Set_CharactersCount final
{
public:
	int32                                         Number;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_DisplayCharacters_C_Set_CharactersCount) == 0x000004, "Wrong alignment on WBP_HUD_DisplayCharacters_C_Set_CharactersCount");
static_assert(sizeof(WBP_HUD_DisplayCharacters_C_Set_CharactersCount) == 0x000004, "Wrong size on WBP_HUD_DisplayCharacters_C_Set_CharactersCount");
static_assert(offsetof(WBP_HUD_DisplayCharacters_C_Set_CharactersCount, Number) == 0x000000, "Member 'WBP_HUD_DisplayCharacters_C_Set_CharactersCount::Number' has a wrong offset!");

}

