#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry.WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C.ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_CustomEvent_Widget;                         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_CustomEvent_Animation;                      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0040(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0010)()
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0060(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x009C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast;     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry) == 0x000008, "Wrong alignment on WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry");
static_assert(sizeof(WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry) == 0x0000B8, "Wrong size on WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry");
static_assert(offsetof(WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry, EntryPoint) == 0x000000, "Member 'WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry, K2Node_CustomEvent_Widget) == 0x000008, "Member 'WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry::K2Node_CustomEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry, K2Node_CustomEvent_Animation) == 0x000010, "Member 'WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry::K2Node_CustomEvent_Animation' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x00002C, "Member 'WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry, CallFunc_GetDisplayName_ReturnValue) == 0x000030, "Member 'WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000040, "Member 'WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry, CallFunc_Conv_StringToText_ReturnValue) == 0x000050, "Member 'WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry, K2Node_Event_MyGeometry) == 0x000060, "Member 'WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry, K2Node_Event_InDeltaTime) == 0x000098, "Member 'WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry, K2Node_CreateDelegate_OutputDelegate_1) == 0x00009C, "Member 'WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry, CallFunc_Conv_DoubleToText_Value_ImplicitCast) == 0x0000B0, "Member 'WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry::CallFunc_Conv_DoubleToText_Value_ImplicitCast' has a wrong offset!");

// Function WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry.WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C.LoadAnimation
// 0x0010 (0x0010 - 0x0000)
struct WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_LoadAnimation final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_LoadAnimation) == 0x000008, "Wrong alignment on WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_LoadAnimation");
static_assert(sizeof(WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_LoadAnimation) == 0x000010, "Wrong size on WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_LoadAnimation");
static_assert(offsetof(WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_LoadAnimation, Widget) == 0x000000, "Member 'WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_LoadAnimation::Widget' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_LoadAnimation, Animation) == 0x000008, "Member 'WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_LoadAnimation::Animation' has a wrong offset!");

// Function WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry.WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_Tick) == 0x000004, "Wrong alignment on WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_Tick");
static_assert(sizeof(WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_Tick) == 0x00003C, "Wrong size on WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_Tick");
static_assert(offsetof(WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_Debug_UMG_AnimationDebugger_WidgetAnimationEntry_C_Tick::InDeltaTime' has a wrong offset!");

}

