#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Loot_Currency

#include "Basic.hpp"

#include "S_LootContext_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_Loot_Currency.WBP_Loot_Currency_C.SetItemData
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_Loot_Currency_C_SetItemData final
{
public:
	class UBP_GeneratedItemInfo_Base_C*           GeneratedItemInfo;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_LootContext                         LootContext;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GeneratedItemInfo_Chroma_C*         K2Node_DynamicCast_AsBP_Generated_Item_Info_Chroma; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetItemQuantity_Quantity;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetItemDisplayText_ReturnValue;           // 0x0020(0x0010)()
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0048)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetItemIcon_ReturnValue;                  // 0x0080(0x0028)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00B8(0x0010)()
};
static_assert(alignof(WBP_Loot_Currency_C_SetItemData) == 0x000008, "Wrong alignment on WBP_Loot_Currency_C_SetItemData");
static_assert(sizeof(WBP_Loot_Currency_C_SetItemData) == 0x0000C8, "Wrong size on WBP_Loot_Currency_C_SetItemData");
static_assert(offsetof(WBP_Loot_Currency_C_SetItemData, GeneratedItemInfo) == 0x000000, "Member 'WBP_Loot_Currency_C_SetItemData::GeneratedItemInfo' has a wrong offset!");
static_assert(offsetof(WBP_Loot_Currency_C_SetItemData, LootContext) == 0x000008, "Member 'WBP_Loot_Currency_C_SetItemData::LootContext' has a wrong offset!");
static_assert(offsetof(WBP_Loot_Currency_C_SetItemData, K2Node_DynamicCast_AsBP_Generated_Item_Info_Chroma) == 0x000010, "Member 'WBP_Loot_Currency_C_SetItemData::K2Node_DynamicCast_AsBP_Generated_Item_Info_Chroma' has a wrong offset!");
static_assert(offsetof(WBP_Loot_Currency_C_SetItemData, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_Loot_Currency_C_SetItemData::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Loot_Currency_C_SetItemData, CallFunc_GetItemQuantity_Quantity) == 0x00001C, "Member 'WBP_Loot_Currency_C_SetItemData::CallFunc_GetItemQuantity_Quantity' has a wrong offset!");
static_assert(offsetof(WBP_Loot_Currency_C_SetItemData, CallFunc_GetItemDisplayText_ReturnValue) == 0x000020, "Member 'WBP_Loot_Currency_C_SetItemData::CallFunc_GetItemDisplayText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Loot_Currency_C_SetItemData, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000030, "Member 'WBP_Loot_Currency_C_SetItemData::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Loot_Currency_C_SetItemData, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'WBP_Loot_Currency_C_SetItemData::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Loot_Currency_C_SetItemData, CallFunc_GetItemIcon_ReturnValue) == 0x000080, "Member 'WBP_Loot_Currency_C_SetItemData::CallFunc_GetItemIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Loot_Currency_C_SetItemData, K2Node_MakeArray_Array) == 0x0000A8, "Member 'WBP_Loot_Currency_C_SetItemData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Loot_Currency_C_SetItemData, CallFunc_Format_ReturnValue) == 0x0000B8, "Member 'WBP_Loot_Currency_C_SetItemData::CallFunc_Format_ReturnValue' has a wrong offset!");

}

