#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TypeSelector_Button_Generic

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_TypeSelector_Button_Generic.WBP_TypeSelector_Button_Generic_C.BndEvt__WBP_TypeSelector_Button_Generic_BaseButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_TypeSelector_Button_Generic_C_BndEvt__WBP_TypeSelector_Button_Generic_BaseButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TypeSelector_Button_Generic_C_BndEvt__WBP_TypeSelector_Button_Generic_BaseButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TypeSelector_Button_Generic_C_BndEvt__WBP_TypeSelector_Button_Generic_BaseButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_TypeSelector_Button_Generic_C_BndEvt__WBP_TypeSelector_Button_Generic_BaseButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_TypeSelector_Button_Generic_C_BndEvt__WBP_TypeSelector_Button_Generic_BaseButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_BndEvt__WBP_TypeSelector_Button_Generic_BaseButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_TypeSelector_Button_Generic_C_BndEvt__WBP_TypeSelector_Button_Generic_BaseButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_TypeSelector_Button_Generic.WBP_TypeSelector_Button_Generic_C.BndEvt__WBP_TypeSelector_Button_Generic_BaseButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_TypeSelector_Button_Generic_C_BndEvt__WBP_TypeSelector_Button_Generic_BaseButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Selected;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TypeSelector_Button_Generic_C_BndEvt__WBP_TypeSelector_Button_Generic_BaseButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TypeSelector_Button_Generic_C_BndEvt__WBP_TypeSelector_Button_Generic_BaseButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature");
static_assert(sizeof(WBP_TypeSelector_Button_Generic_C_BndEvt__WBP_TypeSelector_Button_Generic_BaseButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature) == 0x000010, "Wrong size on WBP_TypeSelector_Button_Generic_C_BndEvt__WBP_TypeSelector_Button_Generic_BaseButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_BndEvt__WBP_TypeSelector_Button_Generic_BaseButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature, Button) == 0x000000, "Member 'WBP_TypeSelector_Button_Generic_C_BndEvt__WBP_TypeSelector_Button_Generic_BaseButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_BndEvt__WBP_TypeSelector_Button_Generic_BaseButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature, Selected) == 0x000008, "Member 'WBP_TypeSelector_Button_Generic_C_BndEvt__WBP_TypeSelector_Button_Generic_BaseButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature::Selected' has a wrong offset!");

// Function WBP_TypeSelector_Button_Generic.WBP_TypeSelector_Button_Generic_C.BPI_OnMarkNotificationAsRead
// 0x0008 (0x0008 - 0x0000)
struct WBP_TypeSelector_Button_Generic_C_BPI_OnMarkNotificationAsRead final
{
public:
	class UUserWidget*                            MarkCaller;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TypeSelector_Button_Generic_C_BPI_OnMarkNotificationAsRead) == 0x000008, "Wrong alignment on WBP_TypeSelector_Button_Generic_C_BPI_OnMarkNotificationAsRead");
static_assert(sizeof(WBP_TypeSelector_Button_Generic_C_BPI_OnMarkNotificationAsRead) == 0x000008, "Wrong size on WBP_TypeSelector_Button_Generic_C_BPI_OnMarkNotificationAsRead");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_BPI_OnMarkNotificationAsRead, MarkCaller) == 0x000000, "Member 'WBP_TypeSelector_Button_Generic_C_BPI_OnMarkNotificationAsRead::MarkCaller' has a wrong offset!");

// Function WBP_TypeSelector_Button_Generic.WBP_TypeSelector_Button_Generic_C.BPI_ShouldShowNotification
// 0x0038 (0x0038 - 0x0000)
struct WBP_TypeSelector_Button_Generic_C_BPI_ShouldShowNotification final
{
public:
	bool                                          bShouldShow;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue_1;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsThereAnyObjectNotifiedInPool_IsFound;   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsThereAnyObjectNotifiedInPool_IsFound_1; // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue_2;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue_3;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsThereAnyObjectNotifiedInPool_IsFound_2; // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsThereAnyObjectNotifiedInPool_IsFound_3; // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_2;        // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_3;        // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TypeSelector_Button_Generic_C_BPI_ShouldShowNotification) == 0x000008, "Wrong alignment on WBP_TypeSelector_Button_Generic_C_BPI_ShouldShowNotification");
static_assert(sizeof(WBP_TypeSelector_Button_Generic_C_BPI_ShouldShowNotification) == 0x000038, "Wrong size on WBP_TypeSelector_Button_Generic_C_BPI_ShouldShowNotification");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_BPI_ShouldShowNotification, bShouldShow) == 0x000000, "Member 'WBP_TypeSelector_Button_Generic_C_BPI_ShouldShowNotification::bShouldShow' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_BPI_ShouldShowNotification, CallFunc_GetCustomGI_ReturnValue) == 0x000008, "Member 'WBP_TypeSelector_Button_Generic_C_BPI_ShouldShowNotification::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_BPI_ShouldShowNotification, CallFunc_GetCustomGI_ReturnValue_1) == 0x000010, "Member 'WBP_TypeSelector_Button_Generic_C_BPI_ShouldShowNotification::CallFunc_GetCustomGI_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_BPI_ShouldShowNotification, CallFunc_IsThereAnyObjectNotifiedInPool_IsFound) == 0x000018, "Member 'WBP_TypeSelector_Button_Generic_C_BPI_ShouldShowNotification::CallFunc_IsThereAnyObjectNotifiedInPool_IsFound' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_BPI_ShouldShowNotification, CallFunc_IsThereAnyObjectNotifiedInPool_IsFound_1) == 0x000019, "Member 'WBP_TypeSelector_Button_Generic_C_BPI_ShouldShowNotification::CallFunc_IsThereAnyObjectNotifiedInPool_IsFound_1' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_BPI_ShouldShowNotification, CallFunc_GetCustomGI_ReturnValue_2) == 0x000020, "Member 'WBP_TypeSelector_Button_Generic_C_BPI_ShouldShowNotification::CallFunc_GetCustomGI_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_BPI_ShouldShowNotification, CallFunc_GetCustomGI_ReturnValue_3) == 0x000028, "Member 'WBP_TypeSelector_Button_Generic_C_BPI_ShouldShowNotification::CallFunc_GetCustomGI_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_BPI_ShouldShowNotification, CallFunc_IsThereAnyObjectNotifiedInPool_IsFound_2) == 0x000030, "Member 'WBP_TypeSelector_Button_Generic_C_BPI_ShouldShowNotification::CallFunc_IsThereAnyObjectNotifiedInPool_IsFound_2' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_BPI_ShouldShowNotification, CallFunc_IsThereAnyObjectNotifiedInPool_IsFound_3) == 0x000031, "Member 'WBP_TypeSelector_Button_Generic_C_BPI_ShouldShowNotification::CallFunc_IsThereAnyObjectNotifiedInPool_IsFound_3' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_BPI_ShouldShowNotification, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000032, "Member 'WBP_TypeSelector_Button_Generic_C_BPI_ShouldShowNotification::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_BPI_ShouldShowNotification, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000033, "Member 'WBP_TypeSelector_Button_Generic_C_BPI_ShouldShowNotification::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_BPI_ShouldShowNotification, CallFunc_EqualEqual_NameName_ReturnValue_2) == 0x000034, "Member 'WBP_TypeSelector_Button_Generic_C_BPI_ShouldShowNotification::CallFunc_EqualEqual_NameName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_BPI_ShouldShowNotification, CallFunc_EqualEqual_NameName_ReturnValue_3) == 0x000035, "Member 'WBP_TypeSelector_Button_Generic_C_BPI_ShouldShowNotification::CallFunc_EqualEqual_NameName_ReturnValue_3' has a wrong offset!");

// Function WBP_TypeSelector_Button_Generic.WBP_TypeSelector_Button_Generic_C.ExecuteUbergraph_WBP_TypeSelector_Button_Generic
// 0x0078 (0x0078 - 0x0000)
struct WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCommonTextStyle>           Temp_class_Variable;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCommonTextStyle>           Temp_class_Variable_1;                             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_Event_MarkCaller;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UINotifiedObject_C> CallFunc_LoadNotificationData_NotifiedObject_CastInput; // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BPI_ShouldShowNotification_bShouldShow;   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_PoolTag;                        // 0x0044(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_ObjectName;                     // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_CustomEvent_Mark_Caller;                    // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Selected;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCommonTextStyle>           K2Node_Select_Default;                             // 0x0070(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic) == 0x000008, "Wrong alignment on WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic");
static_assert(sizeof(WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic) == 0x000078, "Wrong size on WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic, EntryPoint) == 0x000000, "Member 'WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic, Temp_bool_Variable) == 0x000004, "Member 'WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic, Temp_class_Variable) == 0x000008, "Member 'WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic, Temp_class_Variable_1) == 0x000010, "Member 'WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic, K2Node_Event_MarkCaller) == 0x000018, "Member 'WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic::K2Node_Event_MarkCaller' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic, K2Node_Event_IsDesignTime) == 0x000020, "Member 'WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic, K2Node_ComponentBoundEvent_Button_1) == 0x000028, "Member 'WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic, CallFunc_LoadNotificationData_NotifiedObject_CastInput) == 0x000030, "Member 'WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic::CallFunc_LoadNotificationData_NotifiedObject_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic, CallFunc_BPI_ShouldShowNotification_bShouldShow) == 0x000040, "Member 'WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic::CallFunc_BPI_ShouldShowNotification_bShouldShow' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic, CallFunc_Not_PreBool_ReturnValue) == 0x000041, "Member 'WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic, K2Node_CustomEvent_PoolTag) == 0x000044, "Member 'WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic::K2Node_CustomEvent_PoolTag' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic, K2Node_CustomEvent_ObjectName) == 0x00004C, "Member 'WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic::K2Node_CustomEvent_ObjectName' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic, K2Node_CustomEvent_Mark_Caller) == 0x000058, "Member 'WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic::K2Node_CustomEvent_Mark_Caller' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic, K2Node_ComponentBoundEvent_Button) == 0x000060, "Member 'WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic, K2Node_ComponentBoundEvent_Selected) == 0x000068, "Member 'WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic::K2Node_ComponentBoundEvent_Selected' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic, CallFunc_MatchesTag_ReturnValue) == 0x000069, "Member 'WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic, K2Node_Select_Default) == 0x000070, "Member 'WBP_TypeSelector_Button_Generic_C_ExecuteUbergraph_WBP_TypeSelector_Button_Generic::K2Node_Select_Default' has a wrong offset!");

// Function WBP_TypeSelector_Button_Generic.WBP_TypeSelector_Button_Generic_C.OnItemMarkedAsRead
// 0x0018 (0x0018 - 0x0000)
struct WBP_TypeSelector_Button_Generic_C_OnItemMarkedAsRead final
{
public:
	struct FGameplayTag                           PoolTag;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class FName                                   ObjectName;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Mark_Caller;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TypeSelector_Button_Generic_C_OnItemMarkedAsRead) == 0x000008, "Wrong alignment on WBP_TypeSelector_Button_Generic_C_OnItemMarkedAsRead");
static_assert(sizeof(WBP_TypeSelector_Button_Generic_C_OnItemMarkedAsRead) == 0x000018, "Wrong size on WBP_TypeSelector_Button_Generic_C_OnItemMarkedAsRead");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_OnItemMarkedAsRead, PoolTag) == 0x000000, "Member 'WBP_TypeSelector_Button_Generic_C_OnItemMarkedAsRead::PoolTag' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_OnItemMarkedAsRead, ObjectName) == 0x000008, "Member 'WBP_TypeSelector_Button_Generic_C_OnItemMarkedAsRead::ObjectName' has a wrong offset!");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_OnItemMarkedAsRead, Mark_Caller) == 0x000010, "Member 'WBP_TypeSelector_Button_Generic_C_OnItemMarkedAsRead::Mark_Caller' has a wrong offset!");

// Function WBP_TypeSelector_Button_Generic.WBP_TypeSelector_Button_Generic_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_TypeSelector_Button_Generic_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TypeSelector_Button_Generic_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_TypeSelector_Button_Generic_C_PreConstruct");
static_assert(sizeof(WBP_TypeSelector_Button_Generic_C_PreConstruct) == 0x000001, "Wrong size on WBP_TypeSelector_Button_Generic_C_PreConstruct");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_TypeSelector_Button_Generic_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_TypeSelector_Button_Generic.WBP_TypeSelector_Button_Generic_C.SetFilterName
// 0x0008 (0x0008 - 0x0000)
struct WBP_TypeSelector_Button_Generic_C_SetFilterName final
{
public:
	class FName                                   FilterName_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TypeSelector_Button_Generic_C_SetFilterName) == 0x000004, "Wrong alignment on WBP_TypeSelector_Button_Generic_C_SetFilterName");
static_assert(sizeof(WBP_TypeSelector_Button_Generic_C_SetFilterName) == 0x000008, "Wrong size on WBP_TypeSelector_Button_Generic_C_SetFilterName");
static_assert(offsetof(WBP_TypeSelector_Button_Generic_C_SetFilterName, FilterName_0) == 0x000000, "Member 'WBP_TypeSelector_Button_Generic_C_SetFilterName::FilterName_0' has a wrong offset!");

}

