#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HeadingText

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HeadingText.WBP_HeadingText_C
// 0x0040 (0x0348 - 0x0308)
class UWBP_HeadingText_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       FirstLetter;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WrappingText_C*                    Heading;                                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsUpper;                                           // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 FirstLetterStyle;                                  // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 HeadingStyle;                                      // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   ContentText;                                       // 0x0338(0x0010)(Edit, BlueprintVisible)

public:
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_HeadingText(int32 EntryPoint);
	void OnNextTick();
	void PreConstruct(bool IsDesignTime);
	void Set_Text(class FText& InText);
	void UpdateText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HeadingText_C">();
	}
	static class UWBP_HeadingText_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HeadingText_C>();
	}
};
static_assert(alignof(UWBP_HeadingText_C) == 0x000008, "Wrong alignment on UWBP_HeadingText_C");
static_assert(sizeof(UWBP_HeadingText_C) == 0x000348, "Wrong size on UWBP_HeadingText_C");
static_assert(offsetof(UWBP_HeadingText_C, UberGraphFrame) == 0x000308, "Member 'UWBP_HeadingText_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HeadingText_C, FirstLetter) == 0x000310, "Member 'UWBP_HeadingText_C::FirstLetter' has a wrong offset!");
static_assert(offsetof(UWBP_HeadingText_C, Heading) == 0x000318, "Member 'UWBP_HeadingText_C::Heading' has a wrong offset!");
static_assert(offsetof(UWBP_HeadingText_C, IsUpper) == 0x000320, "Member 'UWBP_HeadingText_C::IsUpper' has a wrong offset!");
static_assert(offsetof(UWBP_HeadingText_C, FirstLetterStyle) == 0x000328, "Member 'UWBP_HeadingText_C::FirstLetterStyle' has a wrong offset!");
static_assert(offsetof(UWBP_HeadingText_C, HeadingStyle) == 0x000330, "Member 'UWBP_HeadingText_C::HeadingStyle' has a wrong offset!");
static_assert(offsetof(UWBP_HeadingText_C, ContentText) == 0x000338, "Member 'UWBP_HeadingText_C::ContentText' has a wrong offset!");

}

