#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GM_LuminaPoints

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GM_LuminaPoints.WBP_GM_LuminaPoints_C
// 0x0020 (0x0300 - 0x02E0)
class UWBP_GM_LuminaPoints_C final : public UUserWidget
{
public:
	class UImage*                                 LuminaIcon;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MaxPoints;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Separator;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       UsedPoints;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetValues(int32 InUsedPoints, int32 InMaxPoints);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GM_LuminaPoints_C">();
	}
	static class UWBP_GM_LuminaPoints_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GM_LuminaPoints_C>();
	}
};
static_assert(alignof(UWBP_GM_LuminaPoints_C) == 0x000008, "Wrong alignment on UWBP_GM_LuminaPoints_C");
static_assert(sizeof(UWBP_GM_LuminaPoints_C) == 0x000300, "Wrong size on UWBP_GM_LuminaPoints_C");
static_assert(offsetof(UWBP_GM_LuminaPoints_C, LuminaIcon) == 0x0002E0, "Member 'UWBP_GM_LuminaPoints_C::LuminaIcon' has a wrong offset!");
static_assert(offsetof(UWBP_GM_LuminaPoints_C, MaxPoints) == 0x0002E8, "Member 'UWBP_GM_LuminaPoints_C::MaxPoints' has a wrong offset!");
static_assert(offsetof(UWBP_GM_LuminaPoints_C, Separator) == 0x0002F0, "Member 'UWBP_GM_LuminaPoints_C::Separator' has a wrong offset!");
static_assert(offsetof(UWBP_GM_LuminaPoints_C, UsedPoints) == 0x0002F8, "Member 'UWBP_GM_LuminaPoints_C::UsedPoints' has a wrong offset!");

}

