#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GM_Settings_Page

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_GM_Settings_Page.WBP_GM_Settings_Page_C.ExecuteUbergraph_WBP_GM_Settings_Page
// 0x0118 (0x0118 - 0x0000)
struct WBP_GM_Settings_Page_C_ExecuteUbergraph_WBP_GM_Settings_Page final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UCommonActivatableWidget*, class FText> K2Node_MakeMap_Map;                           // 0x0008(0x0050)(ConstParm, ContainsInstancedReference)
	struct FGameplayTag                           CallFunc_GetPlatformNameAsTag_ReturnValue;         // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	TMap<class UCommonActivatableWidget*, class FText> K2Node_MakeMap_Map_1;                         // 0x0060(0x0050)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_1;     // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UCommonActivatableWidget*, class FText> K2Node_Select_Default;                        // 0x00B8(0x0050)(ConstParm, ContainsInstancedReference)
	class FName                                   CallFunc_GetTabIdAtIndex_ReturnValue;              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SelectTabByID_ReturnValue;                // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_Settings_Page_C_ExecuteUbergraph_WBP_GM_Settings_Page) == 0x000008, "Wrong alignment on WBP_GM_Settings_Page_C_ExecuteUbergraph_WBP_GM_Settings_Page");
static_assert(sizeof(WBP_GM_Settings_Page_C_ExecuteUbergraph_WBP_GM_Settings_Page) == 0x000118, "Wrong size on WBP_GM_Settings_Page_C_ExecuteUbergraph_WBP_GM_Settings_Page");
static_assert(offsetof(WBP_GM_Settings_Page_C_ExecuteUbergraph_WBP_GM_Settings_Page, EntryPoint) == 0x000000, "Member 'WBP_GM_Settings_Page_C_ExecuteUbergraph_WBP_GM_Settings_Page::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GM_Settings_Page_C_ExecuteUbergraph_WBP_GM_Settings_Page, K2Node_MakeMap_Map) == 0x000008, "Member 'WBP_GM_Settings_Page_C_ExecuteUbergraph_WBP_GM_Settings_Page::K2Node_MakeMap_Map' has a wrong offset!");
static_assert(offsetof(WBP_GM_Settings_Page_C_ExecuteUbergraph_WBP_GM_Settings_Page, CallFunc_GetPlatformNameAsTag_ReturnValue) == 0x000058, "Member 'WBP_GM_Settings_Page_C_ExecuteUbergraph_WBP_GM_Settings_Page::CallFunc_GetPlatformNameAsTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_Settings_Page_C_ExecuteUbergraph_WBP_GM_Settings_Page, K2Node_MakeMap_Map_1) == 0x000060, "Member 'WBP_GM_Settings_Page_C_ExecuteUbergraph_WBP_GM_Settings_Page::K2Node_MakeMap_Map_1' has a wrong offset!");
static_assert(offsetof(WBP_GM_Settings_Page_C_ExecuteUbergraph_WBP_GM_Settings_Page, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x0000B0, "Member 'WBP_GM_Settings_Page_C_ExecuteUbergraph_WBP_GM_Settings_Page::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_Settings_Page_C_ExecuteUbergraph_WBP_GM_Settings_Page, CallFunc_EqualEqual_GameplayTag_ReturnValue_1) == 0x0000B1, "Member 'WBP_GM_Settings_Page_C_ExecuteUbergraph_WBP_GM_Settings_Page::CallFunc_EqualEqual_GameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GM_Settings_Page_C_ExecuteUbergraph_WBP_GM_Settings_Page, Temp_bool_Variable) == 0x0000B2, "Member 'WBP_GM_Settings_Page_C_ExecuteUbergraph_WBP_GM_Settings_Page::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GM_Settings_Page_C_ExecuteUbergraph_WBP_GM_Settings_Page, CallFunc_BooleanOR_ReturnValue) == 0x0000B3, "Member 'WBP_GM_Settings_Page_C_ExecuteUbergraph_WBP_GM_Settings_Page::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_Settings_Page_C_ExecuteUbergraph_WBP_GM_Settings_Page, K2Node_Select_Default) == 0x0000B8, "Member 'WBP_GM_Settings_Page_C_ExecuteUbergraph_WBP_GM_Settings_Page::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_GM_Settings_Page_C_ExecuteUbergraph_WBP_GM_Settings_Page, CallFunc_GetTabIdAtIndex_ReturnValue) == 0x000108, "Member 'WBP_GM_Settings_Page_C_ExecuteUbergraph_WBP_GM_Settings_Page::CallFunc_GetTabIdAtIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_Settings_Page_C_ExecuteUbergraph_WBP_GM_Settings_Page, CallFunc_SelectTabByID_ReturnValue) == 0x000110, "Member 'WBP_GM_Settings_Page_C_ExecuteUbergraph_WBP_GM_Settings_Page::CallFunc_SelectTabByID_ReturnValue' has a wrong offset!");

// Function WBP_GM_Settings_Page.WBP_GM_Settings_Page_C.SetStartGameState
// 0x0005 (0x0005 - 0x0000)
struct WBP_GM_Settings_Page_C_SetStartGameState final
{
public:
	bool                                          IsInStartGameState;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_Settings_Page_C_SetStartGameState) == 0x000001, "Wrong alignment on WBP_GM_Settings_Page_C_SetStartGameState");
static_assert(sizeof(WBP_GM_Settings_Page_C_SetStartGameState) == 0x000005, "Wrong size on WBP_GM_Settings_Page_C_SetStartGameState");
static_assert(offsetof(WBP_GM_Settings_Page_C_SetStartGameState, IsInStartGameState) == 0x000000, "Member 'WBP_GM_Settings_Page_C_SetStartGameState::IsInStartGameState' has a wrong offset!");
static_assert(offsetof(WBP_GM_Settings_Page_C_SetStartGameState, Temp_byte_Variable) == 0x000001, "Member 'WBP_GM_Settings_Page_C_SetStartGameState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GM_Settings_Page_C_SetStartGameState, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_GM_Settings_Page_C_SetStartGameState::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GM_Settings_Page_C_SetStartGameState, Temp_bool_Variable) == 0x000003, "Member 'WBP_GM_Settings_Page_C_SetStartGameState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GM_Settings_Page_C_SetStartGameState, K2Node_Select_Default) == 0x000004, "Member 'WBP_GM_Settings_Page_C_SetStartGameState::K2Node_Select_Default' has a wrong offset!");

// Function WBP_GM_Settings_Page.WBP_GM_Settings_Page_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_Settings_Page_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_Settings_Page_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_GM_Settings_Page_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_GM_Settings_Page_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_GM_Settings_Page_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_GM_Settings_Page_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_GM_Settings_Page_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

