#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_jRPG_BuffSlot

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_jRPG_BuffSlot.WBP_jRPG_BuffSlot_C.ExecuteUbergraph_WBP_jRPG_BuffSlot
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_jRPG_BuffSlot_C_ExecuteUbergraph_WBP_jRPG_BuffSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0xB];                                        // 0x0005(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_GetIconBrush_ReturnValue;                 // 0x0010(0x00D0)()
};
static_assert(alignof(WBP_jRPG_BuffSlot_C_ExecuteUbergraph_WBP_jRPG_BuffSlot) == 0x000010, "Wrong alignment on WBP_jRPG_BuffSlot_C_ExecuteUbergraph_WBP_jRPG_BuffSlot");
static_assert(sizeof(WBP_jRPG_BuffSlot_C_ExecuteUbergraph_WBP_jRPG_BuffSlot) == 0x0000E0, "Wrong size on WBP_jRPG_BuffSlot_C_ExecuteUbergraph_WBP_jRPG_BuffSlot");
static_assert(offsetof(WBP_jRPG_BuffSlot_C_ExecuteUbergraph_WBP_jRPG_BuffSlot, EntryPoint) == 0x000000, "Member 'WBP_jRPG_BuffSlot_C_ExecuteUbergraph_WBP_jRPG_BuffSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_BuffSlot_C_ExecuteUbergraph_WBP_jRPG_BuffSlot, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_jRPG_BuffSlot_C_ExecuteUbergraph_WBP_jRPG_BuffSlot::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_BuffSlot_C_ExecuteUbergraph_WBP_jRPG_BuffSlot, CallFunc_GetIconBrush_ReturnValue) == 0x000010, "Member 'WBP_jRPG_BuffSlot_C_ExecuteUbergraph_WBP_jRPG_BuffSlot::CallFunc_GetIconBrush_ReturnValue' has a wrong offset!");

// Function WBP_jRPG_BuffSlot.WBP_jRPG_BuffSlot_C.GetIconBrush
// 0x0280 (0x0280 - 0x0000)
struct WBP_jRPG_BuffSlot_C_GetIconBrush final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x00D0)(Parm, OutParm, ReturnParm)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x00D0(0x00D0)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0xF];                                      // 0x01A1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue;         // 0x01B0(0x00D0)()
};
static_assert(alignof(WBP_jRPG_BuffSlot_C_GetIconBrush) == 0x000010, "Wrong alignment on WBP_jRPG_BuffSlot_C_GetIconBrush");
static_assert(sizeof(WBP_jRPG_BuffSlot_C_GetIconBrush) == 0x000280, "Wrong size on WBP_jRPG_BuffSlot_C_GetIconBrush");
static_assert(offsetof(WBP_jRPG_BuffSlot_C_GetIconBrush, ReturnValue) == 0x000000, "Member 'WBP_jRPG_BuffSlot_C_GetIconBrush::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_BuffSlot_C_GetIconBrush, K2Node_MakeStruct_SlateBrush) == 0x0000D0, "Member 'WBP_jRPG_BuffSlot_C_GetIconBrush::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_BuffSlot_C_GetIconBrush, CallFunc_IsValid_ReturnValue) == 0x0001A0, "Member 'WBP_jRPG_BuffSlot_C_GetIconBrush::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_BuffSlot_C_GetIconBrush, CallFunc_MakeBrushFromTexture_ReturnValue) == 0x0001B0, "Member 'WBP_jRPG_BuffSlot_C_GetIconBrush::CallFunc_MakeBrushFromTexture_ReturnValue' has a wrong offset!");

// Function WBP_jRPG_BuffSlot.WBP_jRPG_BuffSlot_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_jRPG_BuffSlot_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_jRPG_BuffSlot_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_jRPG_BuffSlot_C_PreConstruct");
static_assert(sizeof(WBP_jRPG_BuffSlot_C_PreConstruct) == 0x000001, "Wrong size on WBP_jRPG_BuffSlot_C_PreConstruct");
static_assert(offsetof(WBP_jRPG_BuffSlot_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_jRPG_BuffSlot_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_jRPG_BuffSlot.WBP_jRPG_BuffSlot_C.SetHeightOverride
// 0x0010 (0x0010 - 0x0000)
struct WBP_jRPG_BuffSlot_C_SetHeightOverride final
{
public:
	double                                        InHeightOverride;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_jRPG_BuffSlot_C_SetHeightOverride) == 0x000008, "Wrong alignment on WBP_jRPG_BuffSlot_C_SetHeightOverride");
static_assert(sizeof(WBP_jRPG_BuffSlot_C_SetHeightOverride) == 0x000010, "Wrong size on WBP_jRPG_BuffSlot_C_SetHeightOverride");
static_assert(offsetof(WBP_jRPG_BuffSlot_C_SetHeightOverride, InHeightOverride) == 0x000000, "Member 'WBP_jRPG_BuffSlot_C_SetHeightOverride::InHeightOverride' has a wrong offset!");
static_assert(offsetof(WBP_jRPG_BuffSlot_C_SetHeightOverride, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x000008, "Member 'WBP_jRPG_BuffSlot_C_SetHeightOverride::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");

}

