#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GM_CharacterSheet

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_GM_CharacterSheet.WBP_GM_CharacterSheet_C.LoadPreviewCharacterData
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_CharacterSheet_C_LoadPreviewCharacterData final
{
public:
	class UBP_CharacterData_C*                    InPreviewData;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_CharacterSheet_C_LoadPreviewCharacterData) == 0x000008, "Wrong alignment on WBP_GM_CharacterSheet_C_LoadPreviewCharacterData");
static_assert(sizeof(WBP_GM_CharacterSheet_C_LoadPreviewCharacterData) == 0x000008, "Wrong size on WBP_GM_CharacterSheet_C_LoadPreviewCharacterData");
static_assert(offsetof(WBP_GM_CharacterSheet_C_LoadPreviewCharacterData, InPreviewData) == 0x000000, "Member 'WBP_GM_CharacterSheet_C_LoadPreviewCharacterData::InPreviewData' has a wrong offset!");

// Function WBP_GM_CharacterSheet.WBP_GM_CharacterSheet_C.LoadCharacterData
// 0x0018 (0x0018 - 0x0000)
struct WBP_GM_CharacterSheet_C_LoadCharacterData final
{
public:
	class UBP_CharacterData_C*                    InCharacterData;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCharacterDisplayName_CharacterDisplayName; // 0x0008(0x0010)()
};
static_assert(alignof(WBP_GM_CharacterSheet_C_LoadCharacterData) == 0x000008, "Wrong alignment on WBP_GM_CharacterSheet_C_LoadCharacterData");
static_assert(sizeof(WBP_GM_CharacterSheet_C_LoadCharacterData) == 0x000018, "Wrong size on WBP_GM_CharacterSheet_C_LoadCharacterData");
static_assert(offsetof(WBP_GM_CharacterSheet_C_LoadCharacterData, InCharacterData) == 0x000000, "Member 'WBP_GM_CharacterSheet_C_LoadCharacterData::InCharacterData' has a wrong offset!");
static_assert(offsetof(WBP_GM_CharacterSheet_C_LoadCharacterData, CallFunc_GetCharacterDisplayName_CharacterDisplayName) == 0x000008, "Member 'WBP_GM_CharacterSheet_C_LoadCharacterData::CallFunc_GetCharacterDisplayName_CharacterDisplayName' has a wrong offset!");

}

