#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StatModifier

#include "Basic.hpp"

#include "E_jRPG_StatType_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_StatModifier.WBP_StatModifier_C
// 0x0018 (0x02F8 - 0x02E0)
class UWBP_StatModifier_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Text_Info;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	E_jRPG_StatType                               StatType;                                          // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x3];                                      // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Intensity;                                         // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_StatModifier(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_StatModifier_C">();
	}
	static class UWBP_StatModifier_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_StatModifier_C>();
	}
};
static_assert(alignof(UWBP_StatModifier_C) == 0x000008, "Wrong alignment on UWBP_StatModifier_C");
static_assert(sizeof(UWBP_StatModifier_C) == 0x0002F8, "Wrong size on UWBP_StatModifier_C");
static_assert(offsetof(UWBP_StatModifier_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_StatModifier_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_StatModifier_C, Text_Info) == 0x0002E8, "Member 'UWBP_StatModifier_C::Text_Info' has a wrong offset!");
static_assert(offsetof(UWBP_StatModifier_C, StatType) == 0x0002F0, "Member 'UWBP_StatModifier_C::StatType' has a wrong offset!");
static_assert(offsetof(UWBP_StatModifier_C, Intensity) == 0x0002F4, "Member 'UWBP_StatModifier_C::Intensity' has a wrong offset!");

}

