#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FullScreenNotification_GradientAttack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_FullScreenNotification_Generic_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_FullScreenNotification_GradientAttack.WBP_FullScreenNotification_GradientAttack_C
// 0x0060 (0x0500 - 0x04A0)
class UWBP_FullScreenNotification_GradientAttack_C final : public UWBP_FullScreenNotification_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_FullScreenNotification_GradientAttack_C; // 0x04A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_ShowTextOverride;                             // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_ShowPromptOverride;                           // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_WrappingText_C*                    CharacterName;                                     // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GM_PromptGeneric_C*                ConfirmPromptOverride;                             // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   FX_PetalTextOverride;                              // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   FX_Smoke_1Override;                                // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   FX_SmokeOverride;                                  // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WrappingText_C*                    NotificationHeaderOverride;                        // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WrappingText_C*                    SkillName;                                         // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    Sound_Event_Data_GradientAttack;                   // 0x04F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void BndEvt__WBP_FullScreenNotification_Generic_ConfirmPrompt_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void ExecuteUbergraph_WBP_FullScreenNotification_GradientAttack(int32 EntryPoint);
	void FX_PetalTextOverride_Event(class UNiagaraSystemWidget* FX_PetalTextOverride_0);
	void FX_SmokeOverride_Event(class UNiagaraSystemWidget* FX_SmokeOverride_0);
	void FX_SmokeOverride_Event_0(class UNiagaraSystemWidget* FX_SmokeOverride_0);
	void LoadNotification(class UBP_DataAsset_FullscreenNotification_C* NotificationData);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void PreConstruct(bool IsDesignTime);
	void SequenceEvent__ENTRYPOINTWBP_FullScreenNotification_GradientAttack(class UNiagaraSystemWidget* FX_PetalTextOverride_0);
	void SequenceEvent__ENTRYPOINTWBP_FullScreenNotification_GradientAttack_0(class UNiagaraSystemWidget* FX_SmokeOverride_0);
	void SequenceEvent__ENTRYPOINTWBP_FullScreenNotification_GradientAttack_1(class UNiagaraSystemWidget* FX_SmokeOverride_0);
	void SetSkillName(class FName GradientItemName);
	void ShowConfirmPrompt();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_FullScreenNotification_GradientAttack_C">();
	}
	static class UWBP_FullScreenNotification_GradientAttack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_FullScreenNotification_GradientAttack_C>();
	}
};
static_assert(alignof(UWBP_FullScreenNotification_GradientAttack_C) == 0x000008, "Wrong alignment on UWBP_FullScreenNotification_GradientAttack_C");
static_assert(sizeof(UWBP_FullScreenNotification_GradientAttack_C) == 0x000500, "Wrong size on UWBP_FullScreenNotification_GradientAttack_C");
static_assert(offsetof(UWBP_FullScreenNotification_GradientAttack_C, UberGraphFrame_WBP_FullScreenNotification_GradientAttack_C) == 0x0004A0, "Member 'UWBP_FullScreenNotification_GradientAttack_C::UberGraphFrame_WBP_FullScreenNotification_GradientAttack_C' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenNotification_GradientAttack_C, Anim_ShowTextOverride) == 0x0004A8, "Member 'UWBP_FullScreenNotification_GradientAttack_C::Anim_ShowTextOverride' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenNotification_GradientAttack_C, Anim_ShowPromptOverride) == 0x0004B0, "Member 'UWBP_FullScreenNotification_GradientAttack_C::Anim_ShowPromptOverride' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenNotification_GradientAttack_C, CharacterName) == 0x0004B8, "Member 'UWBP_FullScreenNotification_GradientAttack_C::CharacterName' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenNotification_GradientAttack_C, ConfirmPromptOverride) == 0x0004C0, "Member 'UWBP_FullScreenNotification_GradientAttack_C::ConfirmPromptOverride' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenNotification_GradientAttack_C, FX_PetalTextOverride) == 0x0004C8, "Member 'UWBP_FullScreenNotification_GradientAttack_C::FX_PetalTextOverride' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenNotification_GradientAttack_C, FX_Smoke_1Override) == 0x0004D0, "Member 'UWBP_FullScreenNotification_GradientAttack_C::FX_Smoke_1Override' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenNotification_GradientAttack_C, FX_SmokeOverride) == 0x0004D8, "Member 'UWBP_FullScreenNotification_GradientAttack_C::FX_SmokeOverride' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenNotification_GradientAttack_C, NotificationHeaderOverride) == 0x0004E0, "Member 'UWBP_FullScreenNotification_GradientAttack_C::NotificationHeaderOverride' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenNotification_GradientAttack_C, SkillName) == 0x0004E8, "Member 'UWBP_FullScreenNotification_GradientAttack_C::SkillName' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenNotification_GradientAttack_C, Sound_Event_Data_GradientAttack) == 0x0004F0, "Member 'UWBP_FullScreenNotification_GradientAttack_C::Sound_Event_Data_GradientAttack' has a wrong offset!");

}

