#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Button_TopMenu_Horizontal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_BaseButton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Button_TopMenu_Horizontal.WBP_Button_TopMenu_Horizontal_C
// 0x0020 (0x1740 - 0x1720)
class UWBP_Button_TopMenu_Horizontal_C final : public UWBP_BaseButton_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_Button_TopMenu_Horizontal_C;    // 0x1720(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_WrappingText_C*                    TabName;                                           // 0x1728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   SetName;                                           // 0x1730(0x0010)(Edit, BlueprintVisible)

public:
	void BP_OnDeselected();
	void BP_OnSelected();
	void Construct();
	void ExecuteUbergraph_WBP_Button_TopMenu_Horizontal(int32 EntryPoint);
	void SetTabName(const class FText& InTabName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Button_TopMenu_Horizontal_C">();
	}
	static class UWBP_Button_TopMenu_Horizontal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Button_TopMenu_Horizontal_C>();
	}
};
static_assert(alignof(UWBP_Button_TopMenu_Horizontal_C) == 0x000010, "Wrong alignment on UWBP_Button_TopMenu_Horizontal_C");
static_assert(sizeof(UWBP_Button_TopMenu_Horizontal_C) == 0x001740, "Wrong size on UWBP_Button_TopMenu_Horizontal_C");
static_assert(offsetof(UWBP_Button_TopMenu_Horizontal_C, UberGraphFrame_WBP_Button_TopMenu_Horizontal_C) == 0x001720, "Member 'UWBP_Button_TopMenu_Horizontal_C::UberGraphFrame_WBP_Button_TopMenu_Horizontal_C' has a wrong offset!");
static_assert(offsetof(UWBP_Button_TopMenu_Horizontal_C, TabName) == 0x001728, "Member 'UWBP_Button_TopMenu_Horizontal_C::TabName' has a wrong offset!");
static_assert(offsetof(UWBP_Button_TopMenu_Horizontal_C, SetName) == 0x001730, "Member 'UWBP_Button_TopMenu_Horizontal_C::SetName' has a wrong offset!");

}

