#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GM_LuminasList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"
#include "E_PassiveEffectCategory_structs.hpp"
#include "E_jRPG_StatType_structs.hpp"
#include "BlueprintSorting_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GM_LuminasList.WBP_GM_LuminasList_C
// 0x00C0 (0x04F0 - 0x0430)
class UWBP_GM_LuminasList_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel_ContextualActionContainer;             // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TypeSelector_Generic_C*            FilterSelector;                                    // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTileView*                        LuminasTileView;                                   // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LuminaTooltip_C*                   NavigatedLuminaTooltip;                            // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SortDropdown_C*                    SortDropdown;                                      // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class FName PassiveEffectID)> OnLuminaItemClicked;                 // 0x0460(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class FName PassiveEffectID)> OnLuminaItemNavigated;               // 0x0470(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UBP_PassiveEffectInstance_C* LuminaLhs, class UBP_PassiveEffectInstance_C* LuminaRhs, class UOrderingResult* OrderingResult)> Dummy_SortLuminas; // 0x0480(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UBP_CharacterData_C*                    CurrentCharacter;                                  // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   ActiveFilter;                                      // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        PictoPassiveEffectInstances;                       // 0x04A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UObject*>                        UnfilteredPictoPassiveEffectInstances;             // 0x04B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UObject*>                        PassiveEffectInstances;                            // 0x04C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UBP_PassiveEffectInstance_C*            LastFocusedPassiveEffect;                          // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWBP_ContextualActions_C*               CurrentContextualAction;                           // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   PreSelectedPassiveEffectID;                        // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastNavigatedIndex;                                // 0x04E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_GM_LuminasList_FilterSelector_K2Node_ComponentBoundEvent_2_OnSelectionChanged__DelegateSignature(class FName SelectionID);
	void BndEvt__WBP_PictosList_PictosTileView_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature(class UUserWidget* Widget);
	void BndEvt__WBP_PictosList_SortDropdown_K2Node_ComponentBoundEvent_0_OnActiveDropdownEntryChanged__DelegateSignature();
	void BndEvt__WBP_PictosList_SortDropdown_K2Node_ComponentBoundEvent_4_OnSortDirectionChanged__DelegateSignature();
	void BP_OnActivated();
	void BP_OnDeactivated();
	void Construct();
	class UWidget* DoCustomNavigationVerticalWrap(EUINavigation Navigation_0);
	void ExecuteUbergraph_WBP_GM_LuminasList(int32 EntryPoint);
	void GetPassiveEffectInstaces(TArray<class UObject*>* PassiveEffectInstances_0);
	void GetUnfilteredPictosPassiveEffectInstances(TArray<class UObject*>* PictoPassiveEffectInstances_0);
	void LoadFilteredLuminas(class FName ActiveFilter_0);
	void LoadLuminasForCharacter(class UBP_CharacterData_C* Character);
	void LoadUnfilteredLuminas();
	void LuminasSortLambda(class UBP_PassiveEffectInstance_C* LuminaLhs, class UBP_PassiveEffectInstance_C* LuminaRhs, class UOrderingResult* OrderingResult);
	void NavigateToLastFocusedPassiveEffect();
	void OnContextualTimerEnded();
	void OnForbiddenLuminaClicked(const struct FVector2D& ClickedLuminaPosition);
	void OnInputMethodChanged(ECommonInputType bNewInputType);
	void OnLuminaElementClicked(class FName PassiveEffectID);
	void OnLuminaElementNavigated(class UBP_PassiveEffectInstance_C* PassiveEffect, const struct FVector2D& AbsolutePos);
	void OnNextTick();
	void SetContextualActionOnClick(const struct FVector2D& ClickedItemPosition);
	void SetPreSelectedPassiveEffect(class FName PreSelectedPassiveEffectID_0);
	void SetTypeSelectorOptions();
	void ShowLuminaTooltip(class FName PassiveEffectID, const struct FVector2D& AbsolutePos);
	void SortLuminas();
	void SortPictosPassiveEffectInstances(class UBP_CharacterData_C* CharacterData);
	void SortUnfilteredPictosPassiveEffectInstances(class UBP_CharacterData_C* CharacterData);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GM_LuminasList_C">();
	}
	static class UWBP_GM_LuminasList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GM_LuminasList_C>();
	}
};
static_assert(alignof(UWBP_GM_LuminasList_C) == 0x000008, "Wrong alignment on UWBP_GM_LuminasList_C");
static_assert(sizeof(UWBP_GM_LuminasList_C) == 0x0004F0, "Wrong size on UWBP_GM_LuminasList_C");
static_assert(offsetof(UWBP_GM_LuminasList_C, UberGraphFrame) == 0x000430, "Member 'UWBP_GM_LuminasList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GM_LuminasList_C, CanvasPanel_ContextualActionContainer) == 0x000438, "Member 'UWBP_GM_LuminasList_C::CanvasPanel_ContextualActionContainer' has a wrong offset!");
static_assert(offsetof(UWBP_GM_LuminasList_C, FilterSelector) == 0x000440, "Member 'UWBP_GM_LuminasList_C::FilterSelector' has a wrong offset!");
static_assert(offsetof(UWBP_GM_LuminasList_C, LuminasTileView) == 0x000448, "Member 'UWBP_GM_LuminasList_C::LuminasTileView' has a wrong offset!");
static_assert(offsetof(UWBP_GM_LuminasList_C, NavigatedLuminaTooltip) == 0x000450, "Member 'UWBP_GM_LuminasList_C::NavigatedLuminaTooltip' has a wrong offset!");
static_assert(offsetof(UWBP_GM_LuminasList_C, SortDropdown) == 0x000458, "Member 'UWBP_GM_LuminasList_C::SortDropdown' has a wrong offset!");
static_assert(offsetof(UWBP_GM_LuminasList_C, OnLuminaItemClicked) == 0x000460, "Member 'UWBP_GM_LuminasList_C::OnLuminaItemClicked' has a wrong offset!");
static_assert(offsetof(UWBP_GM_LuminasList_C, OnLuminaItemNavigated) == 0x000470, "Member 'UWBP_GM_LuminasList_C::OnLuminaItemNavigated' has a wrong offset!");
static_assert(offsetof(UWBP_GM_LuminasList_C, Dummy_SortLuminas) == 0x000480, "Member 'UWBP_GM_LuminasList_C::Dummy_SortLuminas' has a wrong offset!");
static_assert(offsetof(UWBP_GM_LuminasList_C, CurrentCharacter) == 0x000490, "Member 'UWBP_GM_LuminasList_C::CurrentCharacter' has a wrong offset!");
static_assert(offsetof(UWBP_GM_LuminasList_C, ActiveFilter) == 0x000498, "Member 'UWBP_GM_LuminasList_C::ActiveFilter' has a wrong offset!");
static_assert(offsetof(UWBP_GM_LuminasList_C, PictoPassiveEffectInstances) == 0x0004A0, "Member 'UWBP_GM_LuminasList_C::PictoPassiveEffectInstances' has a wrong offset!");
static_assert(offsetof(UWBP_GM_LuminasList_C, UnfilteredPictoPassiveEffectInstances) == 0x0004B0, "Member 'UWBP_GM_LuminasList_C::UnfilteredPictoPassiveEffectInstances' has a wrong offset!");
static_assert(offsetof(UWBP_GM_LuminasList_C, PassiveEffectInstances) == 0x0004C0, "Member 'UWBP_GM_LuminasList_C::PassiveEffectInstances' has a wrong offset!");
static_assert(offsetof(UWBP_GM_LuminasList_C, LastFocusedPassiveEffect) == 0x0004D0, "Member 'UWBP_GM_LuminasList_C::LastFocusedPassiveEffect' has a wrong offset!");
static_assert(offsetof(UWBP_GM_LuminasList_C, CurrentContextualAction) == 0x0004D8, "Member 'UWBP_GM_LuminasList_C::CurrentContextualAction' has a wrong offset!");
static_assert(offsetof(UWBP_GM_LuminasList_C, PreSelectedPassiveEffectID) == 0x0004E0, "Member 'UWBP_GM_LuminasList_C::PreSelectedPassiveEffectID' has a wrong offset!");
static_assert(offsetof(UWBP_GM_LuminasList_C, LastNavigatedIndex) == 0x0004E8, "Member 'UWBP_GM_LuminasList_C::LastNavigatedIndex' has a wrong offset!");

}

