#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Loot_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Loot_Base.WBP_Loot_Base_C
// 0x0028 (0x0458 - 0x0430)
class UWBP_Loot_Base_C : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_FadeIN;                                       // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	double                                        DisplayTime;                                       // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FTimerHandle                           DisplayTimerHandle;                                // 0x0448(0x0008)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWBP_HUD_LootQueue_C*                   OwnerQueue;                                        // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void SetBoughtItemData(const struct FS_MerchantItemQueueData& BoughtItem, int32 Quantity);
	void SetItemData(class UBP_GeneratedItemInfo_Base_C* GeneratedItemInfo, const struct FS_LootContext& LootContext);
	class UCommonActivatableWidget* GetVirtualTreeParent();
	void SetOwnerQueue(class UWBP_HUD_LootQueue_C* InOwnerQueue);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void OnQueuePaused();
	void OnQueueResumed();
	void ExecuteUbergraph_WBP_Loot_Base(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Loot_Base_C">();
	}
	static class UWBP_Loot_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Loot_Base_C>();
	}
};
static_assert(alignof(UWBP_Loot_Base_C) == 0x000008, "Wrong alignment on UWBP_Loot_Base_C");
static_assert(sizeof(UWBP_Loot_Base_C) == 0x000458, "Wrong size on UWBP_Loot_Base_C");
static_assert(offsetof(UWBP_Loot_Base_C, UberGraphFrame) == 0x000430, "Member 'UWBP_Loot_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Loot_Base_C, Anim_FadeIN) == 0x000438, "Member 'UWBP_Loot_Base_C::Anim_FadeIN' has a wrong offset!");
static_assert(offsetof(UWBP_Loot_Base_C, DisplayTime) == 0x000440, "Member 'UWBP_Loot_Base_C::DisplayTime' has a wrong offset!");
static_assert(offsetof(UWBP_Loot_Base_C, DisplayTimerHandle) == 0x000448, "Member 'UWBP_Loot_Base_C::DisplayTimerHandle' has a wrong offset!");
static_assert(offsetof(UWBP_Loot_Base_C, OwnerQueue) == 0x000450, "Member 'UWBP_Loot_Base_C::OwnerQueue' has a wrong offset!");

}

