#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LuminaConsumableEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_ItemQuantity_structs.hpp"


namespace SDK::Params
{

// Function WBP_LuminaConsumableEntry.WBP_LuminaConsumableEntry_C.BndEvt__WBP_CharacterCardButton_BaseButton_K2Node_ComponentBoundEvent_0_OnButtonBaseActionProgress__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_LuminaConsumableEntry_C_BndEvt__WBP_CharacterCardButton_BaseButton_K2Node_ComponentBoundEvent_0_OnButtonBaseActionProgress__DelegateSignature final
{
public:
	double                                        Progress;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LuminaConsumableEntry_C_BndEvt__WBP_CharacterCardButton_BaseButton_K2Node_ComponentBoundEvent_0_OnButtonBaseActionProgress__DelegateSignature) == 0x000008, "Wrong alignment on WBP_LuminaConsumableEntry_C_BndEvt__WBP_CharacterCardButton_BaseButton_K2Node_ComponentBoundEvent_0_OnButtonBaseActionProgress__DelegateSignature");
static_assert(sizeof(WBP_LuminaConsumableEntry_C_BndEvt__WBP_CharacterCardButton_BaseButton_K2Node_ComponentBoundEvent_0_OnButtonBaseActionProgress__DelegateSignature) == 0x000008, "Wrong size on WBP_LuminaConsumableEntry_C_BndEvt__WBP_CharacterCardButton_BaseButton_K2Node_ComponentBoundEvent_0_OnButtonBaseActionProgress__DelegateSignature");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_BndEvt__WBP_CharacterCardButton_BaseButton_K2Node_ComponentBoundEvent_0_OnButtonBaseActionProgress__DelegateSignature, Progress) == 0x000000, "Member 'WBP_LuminaConsumableEntry_C_BndEvt__WBP_CharacterCardButton_BaseButton_K2Node_ComponentBoundEvent_0_OnButtonBaseActionProgress__DelegateSignature::Progress' has a wrong offset!");

// Function WBP_LuminaConsumableEntry.WBP_LuminaConsumableEntry_C.BndEvt__WBP_CharacterCardButton_BaseButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_LuminaConsumableEntry_C_BndEvt__WBP_CharacterCardButton_BaseButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LuminaConsumableEntry_C_BndEvt__WBP_CharacterCardButton_BaseButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_LuminaConsumableEntry_C_BndEvt__WBP_CharacterCardButton_BaseButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_LuminaConsumableEntry_C_BndEvt__WBP_CharacterCardButton_BaseButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_LuminaConsumableEntry_C_BndEvt__WBP_CharacterCardButton_BaseButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_BndEvt__WBP_CharacterCardButton_BaseButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_LuminaConsumableEntry_C_BndEvt__WBP_CharacterCardButton_BaseButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_LuminaConsumableEntry.WBP_LuminaConsumableEntry_C.BndEvt__WBP_CharacterCardButton_BaseButton_K2Node_ComponentBoundEvent_2_OnButtonBaseFocused__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_LuminaConsumableEntry_C_BndEvt__WBP_CharacterCardButton_BaseButton_K2Node_ComponentBoundEvent_2_OnButtonBaseFocused__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LuminaConsumableEntry_C_BndEvt__WBP_CharacterCardButton_BaseButton_K2Node_ComponentBoundEvent_2_OnButtonBaseFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_LuminaConsumableEntry_C_BndEvt__WBP_CharacterCardButton_BaseButton_K2Node_ComponentBoundEvent_2_OnButtonBaseFocused__DelegateSignature");
static_assert(sizeof(WBP_LuminaConsumableEntry_C_BndEvt__WBP_CharacterCardButton_BaseButton_K2Node_ComponentBoundEvent_2_OnButtonBaseFocused__DelegateSignature) == 0x000008, "Wrong size on WBP_LuminaConsumableEntry_C_BndEvt__WBP_CharacterCardButton_BaseButton_K2Node_ComponentBoundEvent_2_OnButtonBaseFocused__DelegateSignature");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_BndEvt__WBP_CharacterCardButton_BaseButton_K2Node_ComponentBoundEvent_2_OnButtonBaseFocused__DelegateSignature, Button) == 0x000000, "Member 'WBP_LuminaConsumableEntry_C_BndEvt__WBP_CharacterCardButton_BaseButton_K2Node_ComponentBoundEvent_2_OnButtonBaseFocused__DelegateSignature::Button' has a wrong offset!");

// Function WBP_LuminaConsumableEntry.WBP_LuminaConsumableEntry_C.BndEvt__WBP_CharacterCardButton_BaseButton_K2Node_ComponentBoundEvent_3_OnButtonBaseUnfocused__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_LuminaConsumableEntry_C_BndEvt__WBP_CharacterCardButton_BaseButton_K2Node_ComponentBoundEvent_3_OnButtonBaseUnfocused__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LuminaConsumableEntry_C_BndEvt__WBP_CharacterCardButton_BaseButton_K2Node_ComponentBoundEvent_3_OnButtonBaseUnfocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_LuminaConsumableEntry_C_BndEvt__WBP_CharacterCardButton_BaseButton_K2Node_ComponentBoundEvent_3_OnButtonBaseUnfocused__DelegateSignature");
static_assert(sizeof(WBP_LuminaConsumableEntry_C_BndEvt__WBP_CharacterCardButton_BaseButton_K2Node_ComponentBoundEvent_3_OnButtonBaseUnfocused__DelegateSignature) == 0x000008, "Wrong size on WBP_LuminaConsumableEntry_C_BndEvt__WBP_CharacterCardButton_BaseButton_K2Node_ComponentBoundEvent_3_OnButtonBaseUnfocused__DelegateSignature");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_BndEvt__WBP_CharacterCardButton_BaseButton_K2Node_ComponentBoundEvent_3_OnButtonBaseUnfocused__DelegateSignature, Button) == 0x000000, "Member 'WBP_LuminaConsumableEntry_C_BndEvt__WBP_CharacterCardButton_BaseButton_K2Node_ComponentBoundEvent_3_OnButtonBaseUnfocused__DelegateSignature::Button' has a wrong offset!");

// Function WBP_LuminaConsumableEntry.WBP_LuminaConsumableEntry_C.ExecuteUbergraph_WBP_LuminaConsumableEntry
// 0x0098 (0x0098 - 0x0000)
struct WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_Progress;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0028(0x0010)(NoDestructor)
	class UAC_jRPG_InventoryManager_C*            CallFunc_GetInventoryManager_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_ItemQuantity>                CallFunc_GetLuminaPointConsumableCost_ReturnValue; // 0x0040(0x0010)(ReferenceParm)
	struct FS_ItemQuantity                        CallFunc_Array_Get_Item;                           // 0x0050(0x0018)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanAffordItemCosts_ReturnValue;           // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraUIComponent*                    CallFunc_GetNiagaraComponent_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraUIComponent*                    CallFunc_GetNiagaraComponent_ReturnValue_1;        // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraUIComponent*                    CallFunc_GetNiagaraComponent_ReturnValue_2;        // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry) == 0x000008, "Wrong alignment on WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry");
static_assert(sizeof(WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry) == 0x000098, "Wrong size on WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry, EntryPoint) == 0x000000, "Member 'WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry, K2Node_ComponentBoundEvent_Progress) == 0x000008, "Member 'WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry::K2Node_ComponentBoundEvent_Progress' has a wrong offset!");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry, K2Node_ComponentBoundEvent_Button_2) == 0x000010, "Member 'WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry, K2Node_ComponentBoundEvent_Button_1) == 0x000018, "Member 'WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry, K2Node_ComponentBoundEvent_Button) == 0x000020, "Member 'WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry, K2Node_MakeStruct_DataTableRowHandle) == 0x000028, "Member 'WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry, CallFunc_GetInventoryManager_ReturnValue) == 0x000038, "Member 'WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry::CallFunc_GetInventoryManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry, CallFunc_GetLuminaPointConsumableCost_ReturnValue) == 0x000040, "Member 'WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry::CallFunc_GetLuminaPointConsumableCost_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry, CallFunc_Array_Get_Item) == 0x000050, "Member 'WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry, CallFunc_CanAffordItemCosts_ReturnValue) == 0x00006C, "Member 'WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry::CallFunc_CanAffordItemCosts_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry, K2Node_Event_IsDesignTime) == 0x00006D, "Member 'WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry, CallFunc_GetNiagaraComponent_ReturnValue) == 0x000070, "Member 'WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry::CallFunc_GetNiagaraComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry, CallFunc_GetNiagaraComponent_ReturnValue_1) == 0x000078, "Member 'WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry::CallFunc_GetNiagaraComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry, CallFunc_GetNiagaraComponent_ReturnValue_2) == 0x000080, "Member 'WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry::CallFunc_GetNiagaraComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry, Temp_int_Loop_Counter_Variable) == 0x000088, "Member 'WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry, CallFunc_Less_IntInt_ReturnValue) == 0x00008C, "Member 'WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry, CallFunc_Add_IntInt_ReturnValue) == 0x000090, "Member 'WBP_LuminaConsumableEntry_C_ExecuteUbergraph_WBP_LuminaConsumableEntry::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_LuminaConsumableEntry.WBP_LuminaConsumableEntry_C.GetCharacterData
// 0x0008 (0x0008 - 0x0000)
struct WBP_LuminaConsumableEntry_C_GetCharacterData final
{
public:
	class UBP_CharacterData_C*                    CharacterData_0;                                   // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LuminaConsumableEntry_C_GetCharacterData) == 0x000008, "Wrong alignment on WBP_LuminaConsumableEntry_C_GetCharacterData");
static_assert(sizeof(WBP_LuminaConsumableEntry_C_GetCharacterData) == 0x000008, "Wrong size on WBP_LuminaConsumableEntry_C_GetCharacterData");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_GetCharacterData, CharacterData_0) == 0x000000, "Member 'WBP_LuminaConsumableEntry_C_GetCharacterData::CharacterData_0' has a wrong offset!");

// Function WBP_LuminaConsumableEntry.WBP_LuminaConsumableEntry_C.LoadCharacterState
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_LuminaConsumableEntry_C_LoadCharacterState final
{
public:
	class UBP_CharacterData_C*                    Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxLuminaPoints_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxLuminaPointsDetails_FromLevel;      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxLuminaPointsDetails_FromConsumables; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0010)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0028(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0048)(HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetCharacterIconBig_CharacterIconBig;     // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm)
	class FText                                   CallFunc_GetCharacterDisplayName_CharacterDisplayName; // 0x0098(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00A8(0x0010)()
};
static_assert(alignof(WBP_LuminaConsumableEntry_C_LoadCharacterState) == 0x000008, "Wrong alignment on WBP_LuminaConsumableEntry_C_LoadCharacterState");
static_assert(sizeof(WBP_LuminaConsumableEntry_C_LoadCharacterState) == 0x0000B8, "Wrong size on WBP_LuminaConsumableEntry_C_LoadCharacterState");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_LoadCharacterState, Character) == 0x000000, "Member 'WBP_LuminaConsumableEntry_C_LoadCharacterState::Character' has a wrong offset!");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_LoadCharacterState, CallFunc_GetMaxLuminaPoints_ReturnValue) == 0x000008, "Member 'WBP_LuminaConsumableEntry_C_LoadCharacterState::CallFunc_GetMaxLuminaPoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_LoadCharacterState, CallFunc_GetMaxLuminaPointsDetails_FromLevel) == 0x00000C, "Member 'WBP_LuminaConsumableEntry_C_LoadCharacterState::CallFunc_GetMaxLuminaPointsDetails_FromLevel' has a wrong offset!");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_LoadCharacterState, CallFunc_GetMaxLuminaPointsDetails_FromConsumables) == 0x000010, "Member 'WBP_LuminaConsumableEntry_C_LoadCharacterState::CallFunc_GetMaxLuminaPointsDetails_FromConsumables' has a wrong offset!");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_LoadCharacterState, CallFunc_Conv_IntToText_ReturnValue) == 0x000018, "Member 'WBP_LuminaConsumableEntry_C_LoadCharacterState::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_LoadCharacterState, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000028, "Member 'WBP_LuminaConsumableEntry_C_LoadCharacterState::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_LoadCharacterState, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'WBP_LuminaConsumableEntry_C_LoadCharacterState::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_LoadCharacterState, CallFunc_GetCharacterIconBig_CharacterIconBig) == 0x000080, "Member 'WBP_LuminaConsumableEntry_C_LoadCharacterState::CallFunc_GetCharacterIconBig_CharacterIconBig' has a wrong offset!");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_LoadCharacterState, K2Node_MakeArray_Array) == 0x000088, "Member 'WBP_LuminaConsumableEntry_C_LoadCharacterState::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_LoadCharacterState, CallFunc_GetCharacterDisplayName_CharacterDisplayName) == 0x000098, "Member 'WBP_LuminaConsumableEntry_C_LoadCharacterState::CallFunc_GetCharacterDisplayName_CharacterDisplayName' has a wrong offset!");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_LoadCharacterState, CallFunc_Format_ReturnValue) == 0x0000A8, "Member 'WBP_LuminaConsumableEntry_C_LoadCharacterState::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_LuminaConsumableEntry.WBP_LuminaConsumableEntry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_LuminaConsumableEntry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LuminaConsumableEntry_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_LuminaConsumableEntry_C_PreConstruct");
static_assert(sizeof(WBP_LuminaConsumableEntry_C_PreConstruct) == 0x000001, "Wrong size on WBP_LuminaConsumableEntry_C_PreConstruct");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_LuminaConsumableEntry_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_LuminaConsumableEntry.WBP_LuminaConsumableEntry_C.UpdatePromptState
// 0x0098 (0x0098 - 0x0000)
struct WBP_LuminaConsumableEntry_C_UpdatePromptState final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0018(0x0010)(NoDestructor)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle_1;            // 0x0028(0x0010)(NoDestructor)
	bool                                          CallFunc_HasAnyUserFocus_ReturnValue;              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_ItemQuantity>                CallFunc_GetLuminaPointConsumableCost_ReturnValue; // 0x0040(0x0010)(ReferenceParm)
	class UAC_jRPG_InventoryManager_C*            CallFunc_GetInventoryManager_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FS_ItemQuantity                        CallFunc_Array_Get_Item;                           // 0x0058(0x0018)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FindItemCountFromInventory_Quantity;      // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_Select_Default_1;                           // 0x0088(0x0010)(ConstParm, NoDestructor)
};
static_assert(alignof(WBP_LuminaConsumableEntry_C_UpdatePromptState) == 0x000008, "Wrong alignment on WBP_LuminaConsumableEntry_C_UpdatePromptState");
static_assert(sizeof(WBP_LuminaConsumableEntry_C_UpdatePromptState) == 0x000098, "Wrong size on WBP_LuminaConsumableEntry_C_UpdatePromptState");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_UpdatePromptState, Temp_bool_Variable) == 0x000000, "Member 'WBP_LuminaConsumableEntry_C_UpdatePromptState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_UpdatePromptState, Temp_real_Variable) == 0x000004, "Member 'WBP_LuminaConsumableEntry_C_UpdatePromptState::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LuminaConsumableEntry_C_UpdatePromptState, Temp_real_Variable_1) == 0x000008, "Member 'WBP_LuminaConsumableEntry_C_UpdatePromptState::Temp_real_Variable_1' has a wrong offset!");
