#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CreditParagraph

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_CreditParagraph.WBP_CreditParagraph_C.ExecuteUbergraph_WBP_CreditParagraph
// 0x0028 (0x0028 - 0x0000)
struct WBP_CreditParagraph_C_ExecuteUbergraph_WBP_CreditParagraph final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Duration;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CreditParagraph_C_ExecuteUbergraph_WBP_CreditParagraph) == 0x000008, "Wrong alignment on WBP_CreditParagraph_C_ExecuteUbergraph_WBP_CreditParagraph");
static_assert(sizeof(WBP_CreditParagraph_C_ExecuteUbergraph_WBP_CreditParagraph) == 0x000028, "Wrong size on WBP_CreditParagraph_C_ExecuteUbergraph_WBP_CreditParagraph");
static_assert(offsetof(WBP_CreditParagraph_C_ExecuteUbergraph_WBP_CreditParagraph, EntryPoint) == 0x000000, "Member 'WBP_CreditParagraph_C_ExecuteUbergraph_WBP_CreditParagraph::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CreditParagraph_C_ExecuteUbergraph_WBP_CreditParagraph, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_CreditParagraph_C_ExecuteUbergraph_WBP_CreditParagraph::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CreditParagraph_C_ExecuteUbergraph_WBP_CreditParagraph, K2Node_CustomEvent_Duration) == 0x000010, "Member 'WBP_CreditParagraph_C_ExecuteUbergraph_WBP_CreditParagraph::K2Node_CustomEvent_Duration' has a wrong offset!");
static_assert(offsetof(WBP_CreditParagraph_C_ExecuteUbergraph_WBP_CreditParagraph, CallFunc_PlayAnimation_ReturnValue_1) == 0x000018, "Member 'WBP_CreditParagraph_C_ExecuteUbergraph_WBP_CreditParagraph::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CreditParagraph_C_ExecuteUbergraph_WBP_CreditParagraph, CallFunc_Delay_Duration_ImplicitCast) == 0x000020, "Member 'WBP_CreditParagraph_C_ExecuteUbergraph_WBP_CreditParagraph::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

// Function WBP_CreditParagraph.WBP_CreditParagraph_C.FadeIn
// 0x0008 (0x0008 - 0x0000)
struct WBP_CreditParagraph_C_FadeIn final
{
public:
	double                                        Duration;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CreditParagraph_C_FadeIn) == 0x000008, "Wrong alignment on WBP_CreditParagraph_C_FadeIn");
static_assert(sizeof(WBP_CreditParagraph_C_FadeIn) == 0x000008, "Wrong size on WBP_CreditParagraph_C_FadeIn");
static_assert(offsetof(WBP_CreditParagraph_C_FadeIn, Duration) == 0x000000, "Member 'WBP_CreditParagraph_C_FadeIn::Duration' has a wrong offset!");

}

