#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BattleCard_EffectBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BattleCard_EffectBox.WBP_BattleCard_EffectBox_C
// 0x0030 (0x0310 - 0x02E0)
class UWBP_BattleCard_EffectBox_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BorderImage;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             NamedSlot;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OverchargedImage;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_BattleCard_EffectBox(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetEffectBoxParameters(bool IsOvercharged, bool bShowBackground, double Size);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BattleCard_EffectBox_C">();
	}
	static class UWBP_BattleCard_EffectBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BattleCard_EffectBox_C>();
	}
};
static_assert(alignof(UWBP_BattleCard_EffectBox_C) == 0x000008, "Wrong alignment on UWBP_BattleCard_EffectBox_C");
static_assert(sizeof(UWBP_BattleCard_EffectBox_C) == 0x000310, "Wrong size on UWBP_BattleCard_EffectBox_C");
static_assert(offsetof(UWBP_BattleCard_EffectBox_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_BattleCard_EffectBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_BattleCard_EffectBox_C, BorderImage) == 0x0002E8, "Member 'UWBP_BattleCard_EffectBox_C::BorderImage' has a wrong offset!");
static_assert(offsetof(UWBP_BattleCard_EffectBox_C, NamedSlot) == 0x0002F0, "Member 'UWBP_BattleCard_EffectBox_C::NamedSlot' has a wrong offset!");
static_assert(offsetof(UWBP_BattleCard_EffectBox_C, OverchargedImage) == 0x0002F8, "Member 'UWBP_BattleCard_EffectBox_C::OverchargedImage' has a wrong offset!");
static_assert(offsetof(UWBP_BattleCard_EffectBox_C, RetainerBox) == 0x000300, "Member 'UWBP_BattleCard_EffectBox_C::RetainerBox' has a wrong offset!");
static_assert(offsetof(UWBP_BattleCard_EffectBox_C, SizeBox) == 0x000308, "Member 'UWBP_BattleCard_EffectBox_C::SizeBox' has a wrong offset!");

}

