#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BattleLoot_Customization

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BattleLoot_Customization.WBP_BattleLoot_Customization_C
// 0x0040 (0x0348 - 0x0308)
class UWBP_BattleLoot_Customization_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewWeaponLoop;                                     // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewWeaponAppear;                                   // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_WrappingText_C*                    CustoName;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   NiagaraSystemWidget_Explosion;                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CustomizationIcon_C*               WBP_CustomizationIcon;                             // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    Data_Table_Row_Handle;                             // 0x0338(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void Construct();
	void ExecuteUbergraph_WBP_BattleLoot_Customization(int32 EntryPoint);
	void LoadCustomization(const struct FS_jRPG_Item_StaticData& CustomizationData);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BattleLoot_Customization_C">();
	}
	static class UWBP_BattleLoot_Customization_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BattleLoot_Customization_C>();
	}
};
static_assert(alignof(UWBP_BattleLoot_Customization_C) == 0x000008, "Wrong alignment on UWBP_BattleLoot_Customization_C");
static_assert(sizeof(UWBP_BattleLoot_Customization_C) == 0x000348, "Wrong size on UWBP_BattleLoot_Customization_C");
static_assert(offsetof(UWBP_BattleLoot_Customization_C, UberGraphFrame) == 0x000308, "Member 'UWBP_BattleLoot_Customization_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_BattleLoot_Customization_C, NewWeaponLoop) == 0x000310, "Member 'UWBP_BattleLoot_Customization_C::NewWeaponLoop' has a wrong offset!");
static_assert(offsetof(UWBP_BattleLoot_Customization_C, NewWeaponAppear) == 0x000318, "Member 'UWBP_BattleLoot_Customization_C::NewWeaponAppear' has a wrong offset!");
static_assert(offsetof(UWBP_BattleLoot_Customization_C, CustoName) == 0x000320, "Member 'UWBP_BattleLoot_Customization_C::CustoName' has a wrong offset!");
static_assert(offsetof(UWBP_BattleLoot_Customization_C, NiagaraSystemWidget_Explosion) == 0x000328, "Member 'UWBP_BattleLoot_Customization_C::NiagaraSystemWidget_Explosion' has a wrong offset!");
static_assert(offsetof(UWBP_BattleLoot_Customization_C, WBP_CustomizationIcon) == 0x000330, "Member 'UWBP_BattleLoot_Customization_C::WBP_CustomizationIcon' has a wrong offset!");
static_assert(offsetof(UWBP_BattleLoot_Customization_C, Data_Table_Row_Handle) == 0x000338, "Member 'UWBP_BattleLoot_Customization_C::Data_Table_Row_Handle' has a wrong offset!");

}

