#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_JournalEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_JournalEntry.WBP_JournalEntry_C
// 0x0068 (0x0370 - 0x0308)
class UWBP_JournalEntry_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Unlock;                                       // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_BaseButton_C*                      BaseButton;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       JournalEntryIndex;                                 // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   NiagaraSystemWidget_Explosion;                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UBP_JournalViewItem_C* InViewItem, bool IsSelected)> OnEntryNavigated; // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UAudioComponent*                        VoiceOverAudioComponent;                           // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UBP_JournalViewItem_C* JournalViewItem)> OnEntryUnlocked;    // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UBP_JournalViewItem_C* JournalViewItem, bool IsSelected)> OnEntryClicked; // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsClickForbidden;                                  // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_JournalEntry_BaseButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void Destruct();
	void ExecuteUbergraph_WBP_JournalEntry(int32 EntryPoint);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnUnlockJournal();
	void OnVoiceOverFinished();
	void PreConstruct(bool IsDesignTime);
	void SequenceEvent();
	void SequenceEvent__ENTRYPOINTWBP_JournalEntry();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_JournalEntry_C">();
	}
	static class UWBP_JournalEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_JournalEntry_C>();
	}
};
static_assert(alignof(UWBP_JournalEntry_C) == 0x000008, "Wrong alignment on UWBP_JournalEntry_C");
static_assert(sizeof(UWBP_JournalEntry_C) == 0x000370, "Wrong size on UWBP_JournalEntry_C");
static_assert(offsetof(UWBP_JournalEntry_C, UberGraphFrame) == 0x000308, "Member 'UWBP_JournalEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_JournalEntry_C, Anim_Unlock) == 0x000310, "Member 'UWBP_JournalEntry_C::Anim_Unlock' has a wrong offset!");
static_assert(offsetof(UWBP_JournalEntry_C, BaseButton) == 0x000318, "Member 'UWBP_JournalEntry_C::BaseButton' has a wrong offset!");
static_assert(offsetof(UWBP_JournalEntry_C, JournalEntryIndex) == 0x000320, "Member 'UWBP_JournalEntry_C::JournalEntryIndex' has a wrong offset!");
static_assert(offsetof(UWBP_JournalEntry_C, NiagaraSystemWidget_Explosion) == 0x000328, "Member 'UWBP_JournalEntry_C::NiagaraSystemWidget_Explosion' has a wrong offset!");
static_assert(offsetof(UWBP_JournalEntry_C, OnEntryNavigated) == 0x000330, "Member 'UWBP_JournalEntry_C::OnEntryNavigated' has a wrong offset!");
static_assert(offsetof(UWBP_JournalEntry_C, VoiceOverAudioComponent) == 0x000340, "Member 'UWBP_JournalEntry_C::VoiceOverAudioComponent' has a wrong offset!");
static_assert(offsetof(UWBP_JournalEntry_C, OnEntryUnlocked) == 0x000348, "Member 'UWBP_JournalEntry_C::OnEntryUnlocked' has a wrong offset!");
static_assert(offsetof(UWBP_JournalEntry_C, OnEntryClicked) == 0x000358, "Member 'UWBP_JournalEntry_C::OnEntryClicked' has a wrong offset!");
static_assert(offsetof(UWBP_JournalEntry_C, IsClickForbidden) == 0x000368, "Member 'UWBP_JournalEntry_C::IsClickForbidden' has a wrong offset!");

}

