#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PassiveEffectNotification

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_PassiveEffectNotification.WBP_PassiveEffectNotification_C.ExecuteUbergraph_WBP_PassiveEffectNotification
// 0x0088 (0x0088 - 0x0000)
struct WBP_PassiveEffectNotification_C_ExecuteUbergraph_WBP_PassiveEffectNotification final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0038(0x0014)()
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Text;                           // 0x0050(0x0010)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0060(0x0014)()
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PassiveEffectNotification_C_ExecuteUbergraph_WBP_PassiveEffectNotification) == 0x000008, "Wrong alignment on WBP_PassiveEffectNotification_C_ExecuteUbergraph_WBP_PassiveEffectNotification");
static_assert(sizeof(WBP_PassiveEffectNotification_C_ExecuteUbergraph_WBP_PassiveEffectNotification) == 0x000088, "Wrong size on WBP_PassiveEffectNotification_C_ExecuteUbergraph_WBP_PassiveEffectNotification");
static_assert(offsetof(WBP_PassiveEffectNotification_C_ExecuteUbergraph_WBP_PassiveEffectNotification, EntryPoint) == 0x000000, "Member 'WBP_PassiveEffectNotification_C_ExecuteUbergraph_WBP_PassiveEffectNotification::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PassiveEffectNotification_C_ExecuteUbergraph_WBP_PassiveEffectNotification, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_PassiveEffectNotification_C_ExecuteUbergraph_WBP_PassiveEffectNotification::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PassiveEffectNotification_C_ExecuteUbergraph_WBP_PassiveEffectNotification, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_PassiveEffectNotification_C_ExecuteUbergraph_WBP_PassiveEffectNotification::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PassiveEffectNotification_C_ExecuteUbergraph_WBP_PassiveEffectNotification, CallFunc_PlayAnimation_ReturnValue_1) == 0x000020, "Member 'WBP_PassiveEffectNotification_C_ExecuteUbergraph_WBP_PassiveEffectNotification::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PassiveEffectNotification_C_ExecuteUbergraph_WBP_PassiveEffectNotification, CallFunc_PlayAnimation_ReturnValue_2) == 0x000028, "Member 'WBP_PassiveEffectNotification_C_ExecuteUbergraph_WBP_PassiveEffectNotification::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PassiveEffectNotification_C_ExecuteUbergraph_WBP_PassiveEffectNotification, CallFunc_PlayAnimation_ReturnValue_3) == 0x000030, "Member 'WBP_PassiveEffectNotification_C_ExecuteUbergraph_WBP_PassiveEffectNotification::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PassiveEffectNotification_C_ExecuteUbergraph_WBP_PassiveEffectNotification, K2Node_MakeStruct_SlateColor) == 0x000038, "Member 'WBP_PassiveEffectNotification_C_ExecuteUbergraph_WBP_PassiveEffectNotification::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_PassiveEffectNotification_C_ExecuteUbergraph_WBP_PassiveEffectNotification, K2Node_CustomEvent_Text) == 0x000050, "Member 'WBP_PassiveEffectNotification_C_ExecuteUbergraph_WBP_PassiveEffectNotification::K2Node_CustomEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_PassiveEffectNotification_C_ExecuteUbergraph_WBP_PassiveEffectNotification, K2Node_MakeStruct_SlateColor_1) == 0x000060, "Member 'WBP_PassiveEffectNotification_C_ExecuteUbergraph_WBP_PassiveEffectNotification::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_PassiveEffectNotification_C_ExecuteUbergraph_WBP_PassiveEffectNotification, CallFunc_PlayAnimation_ReturnValue_4) == 0x000078, "Member 'WBP_PassiveEffectNotification_C_ExecuteUbergraph_WBP_PassiveEffectNotification::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_PassiveEffectNotification_C_ExecuteUbergraph_WBP_PassiveEffectNotification, CallFunc_Add_IntInt_ReturnValue) == 0x000080, "Member 'WBP_PassiveEffectNotification_C_ExecuteUbergraph_WBP_PassiveEffectNotification::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_PassiveEffectNotification.WBP_PassiveEffectNotification_C.LoadPassiveInfo
// 0x0010 (0x0010 - 0x0000)
struct WBP_PassiveEffectNotification_C_LoadPassiveInfo final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_PassiveEffectNotification_C_LoadPassiveInfo) == 0x000008, "Wrong alignment on WBP_PassiveEffectNotification_C_LoadPassiveInfo");
static_assert(sizeof(WBP_PassiveEffectNotification_C_LoadPassiveInfo) == 0x000010, "Wrong size on WBP_PassiveEffectNotification_C_LoadPassiveInfo");
static_assert(offsetof(WBP_PassiveEffectNotification_C_LoadPassiveInfo, Text) == 0x000000, "Member 'WBP_PassiveEffectNotification_C_LoadPassiveInfo::Text' has a wrong offset!");

// Function WBP_PassiveEffectNotification.WBP_PassiveEffectNotification_C.SetCount
// 0x0038 (0x0038 - 0x0000)
struct WBP_PassiveEffectNotification_C_SetCount final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          local_MustAppear;                                  // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          local_CounterMustAppear;                           // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0010)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PassiveEffectNotification_C_SetCount) == 0x000008, "Wrong alignment on WBP_PassiveEffectNotification_C_SetCount");
static_assert(sizeof(WBP_PassiveEffectNotification_C_SetCount) == 0x000038, "Wrong size on WBP_PassiveEffectNotification_C_SetCount");
static_assert(offsetof(WBP_PassiveEffectNotification_C_SetCount, Count) == 0x000000, "Member 'WBP_PassiveEffectNotification_C_SetCount::Count' has a wrong offset!");
static_assert(offsetof(WBP_PassiveEffectNotification_C_SetCount, local_MustAppear) == 0x000004, "Member 'WBP_PassiveEffectNotification_C_SetCount::local_MustAppear' has a wrong offset!");
static_assert(offsetof(WBP_PassiveEffectNotification_C_SetCount, local_CounterMustAppear) == 0x000005, "Member 'WBP_PassiveEffectNotification_C_SetCount::local_CounterMustAppear' has a wrong offset!");
static_assert(offsetof(WBP_PassiveEffectNotification_C_SetCount, CallFunc_Greater_IntInt_ReturnValue) == 0x000006, "Member 'WBP_PassiveEffectNotification_C_SetCount::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PassiveEffectNotification_C_SetCount, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000007, "Member 'WBP_PassiveEffectNotification_C_SetCount::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PassiveEffectNotification_C_SetCount, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'WBP_PassiveEffectNotification_C_SetCount::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PassiveEffectNotification_C_SetCount, CallFunc_BooleanAND_ReturnValue) == 0x000009, "Member 'WBP_PassiveEffectNotification_C_SetCount::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PassiveEffectNotification_C_SetCount, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'WBP_PassiveEffectNotification_C_SetCount::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PassiveEffectNotification_C_SetCount, CallFunc_PlayAnimation_ReturnValue_1) == 0x000018, "Member 'WBP_PassiveEffectNotification_C_SetCount::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PassiveEffectNotification_C_SetCount, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'WBP_PassiveEffectNotification_C_SetCount::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PassiveEffectNotification_C_SetCount, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000030, "Member 'WBP_PassiveEffectNotification_C_SetCount::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PassiveEffectNotification_C_SetCount, CallFunc_BooleanAND_ReturnValue_1) == 0x000031, "Member 'WBP_PassiveEffectNotification_C_SetCount::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

}

