#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_InputOptionsList

#include "Basic.hpp"

#include "WBP_Settings_OptionsList_Abstract_classes.hpp"
#include "Engine_structs.hpp"
#include "EModalUIResponse_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Settings_InputOptionsList.WBP_Settings_InputOptionsList_C
// 0x01B0 (0x05E8 - 0x0438)
class UWBP_Settings_InputOptionsList_C final : public UWBP_Settings_OptionsList_Abstract_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_Settings_InputOptionsList_C;    // 0x0438(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       HeaderDisplay_Battle;                              // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       HeaderDisplay_Exploration;                         // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       HeaderDisplay_Interface;                           // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox;                                         // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_Backward;          // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_BattleJump;        // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_BattleShoot;       // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_Dodge;             // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_EsquieBoost;       // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_EsquieFlyDown;     // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_EsquieFlyUp;       // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_EsquieTakeOff;     // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_FirstSlot;         // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_FirstSlot_1;       // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_FirstSlot_2;       // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_Flee;              // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_Forward;           // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_FreeAimEnter;      // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_FreeAimToggle;     // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_GoToCamp;          // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_GradientCounter;   // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_GradientCounter_1; // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_Grapple;           // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_HealParty;         // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_Interact;          // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_Items;             // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_Jump;              // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_JumpCounter;       // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_Left;              // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_MeleeAttack;       // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_MountEsquie;       // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_OpenExpeditionMenu; // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_OpenOverlay;       // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_Parry;             // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_QTE;               // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_RecenterCamera;    // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_Right;             // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_Run;               // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_Shoot;             // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_Skills;            // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_SkipTurn;          // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_Strike;            // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_SwapSkillPanel;    // 0x0590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_TargetLeft;        // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_TargetRight;       // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_ToggleCharacter;   // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_MappingOptionEntry_C*     WBP_Settings_MappingOptionEntry_ToggleWalk;        // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UWBP_Settings_MappingOptionEntry_C* MappingEntry)> OnEntryFocused; // 0x05B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UWBP_Settings_MappingOptionEntry_C*> ConflictingMappings;                           // 0x05C8(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	class UWBP_Settings_MappingOptionEntry_C*     CurrentSelectedMapping;                            // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IgnoreConflicts;                                   // 0x05E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ApplySettings();
	void AreMappingsDirty(bool* IsDirty);
	void AreMappingsValid(bool* IsValid);
	void BindOnOptionEntryFocused(const TDelegate<void(class UWBP_Settings_OptionEntry_C* Widget)>& Event);
	void CheckMappingConflict(class UWBP_Settings_MappingOptionEntry_C* MappingEntry, const struct FMapPlayerKeyArgs& NewMapping);
	void ExecuteUbergraph_WBP_Settings_InputOptionsList(int32 EntryPoint);
	void IsKeyConflictingWithCurrentMappings(const struct FMapPlayerKeyArgs& NewMapPlayerKeyArgs, const class UWBP_Settings_MappingOptionEntry_C*& MappingEntry, bool* IsConflicting);
	void IsKeyConflictingWithNewMappings(const struct FMapPlayerKeyArgs& NewMapPlayerKeyArgs, class UWBP_Settings_MappingOptionEntry_C* MappingEntry, bool* IsConflicting);
	void LoadUserSettings();
	void OnMappingEntryFocused(class UWBP_Settings_MappingOptionEntry_C* Widget);
	void OnUserResponseToInputConflict(EModalUIResponse InUserResponse);
	void ResetToDefault();
	void RevertSettings();
	void StartIgnoreConflicts();
	void UnbindOnOptionEntryFocused(const TDelegate<void(class UWBP_Settings_OptionEntry_C* Widget)>& Event);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Settings_InputOptionsList_C">();
	}
	static class UWBP_Settings_InputOptionsList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Settings_InputOptionsList_C>();
	}
};
static_assert(alignof(UWBP_Settings_InputOptionsList_C) == 0x000008, "Wrong alignment on UWBP_Settings_InputOptionsList_C");
static_assert(sizeof(UWBP_Settings_InputOptionsList_C) == 0x0005E8, "Wrong size on UWBP_Settings_InputOptionsList_C");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, UberGraphFrame_WBP_Settings_InputOptionsList_C) == 0x000438, "Member 'UWBP_Settings_InputOptionsList_C::UberGraphFrame_WBP_Settings_InputOptionsList_C' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, HeaderDisplay_Battle) == 0x000440, "Member 'UWBP_Settings_InputOptionsList_C::HeaderDisplay_Battle' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, HeaderDisplay_Exploration) == 0x000448, "Member 'UWBP_Settings_InputOptionsList_C::HeaderDisplay_Exploration' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, HeaderDisplay_Interface) == 0x000450, "Member 'UWBP_Settings_InputOptionsList_C::HeaderDisplay_Interface' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, ScrollBox) == 0x000458, "Member 'UWBP_Settings_InputOptionsList_C::ScrollBox' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_Backward) == 0x000460, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_Backward' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_BattleJump) == 0x000468, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_BattleJump' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_BattleShoot) == 0x000470, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_BattleShoot' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_Dodge) == 0x000478, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_Dodge' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_EsquieBoost) == 0x000480, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_EsquieBoost' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_EsquieFlyDown) == 0x000488, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_EsquieFlyDown' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_EsquieFlyUp) == 0x000490, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_EsquieFlyUp' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_EsquieTakeOff) == 0x000498, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_EsquieTakeOff' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_FirstSlot) == 0x0004A0, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_FirstSlot' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_FirstSlot_1) == 0x0004A8, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_FirstSlot_1' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_FirstSlot_2) == 0x0004B0, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_FirstSlot_2' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_Flee) == 0x0004B8, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_Flee' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_Forward) == 0x0004C0, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_Forward' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_FreeAimEnter) == 0x0004C8, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_FreeAimEnter' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_FreeAimToggle) == 0x0004D0, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_FreeAimToggle' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_GoToCamp) == 0x0004D8, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_GoToCamp' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_GradientCounter) == 0x0004E0, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_GradientCounter' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_GradientCounter_1) == 0x0004E8, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_GradientCounter_1' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_Grapple) == 0x0004F0, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_Grapple' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_HealParty) == 0x0004F8, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_HealParty' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_Interact) == 0x000500, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_Interact' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_Items) == 0x000508, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_Items' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_Jump) == 0x000510, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_Jump' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_JumpCounter) == 0x000518, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_JumpCounter' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_Left) == 0x000520, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_Left' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_MeleeAttack) == 0x000528, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_MeleeAttack' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_MountEsquie) == 0x000530, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_MountEsquie' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_OpenExpeditionMenu) == 0x000538, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_OpenExpeditionMenu' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_OpenOverlay) == 0x000540, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_OpenOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_Parry) == 0x000548, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_Parry' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_QTE) == 0x000550, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_QTE' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_RecenterCamera) == 0x000558, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_RecenterCamera' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_Right) == 0x000560, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_Right' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_Run) == 0x000568, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_Run' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_Shoot) == 0x000570, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_Shoot' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_Skills) == 0x000578, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_Skills' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_SkipTurn) == 0x000580, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_SkipTurn' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_Strike) == 0x000588, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_Strike' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_SwapSkillPanel) == 0x000590, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_SwapSkillPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_TargetLeft) == 0x000598, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_TargetLeft' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_TargetRight) == 0x0005A0, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_TargetRight' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_ToggleCharacter) == 0x0005A8, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_ToggleCharacter' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, WBP_Settings_MappingOptionEntry_ToggleWalk) == 0x0005B0, "Member 'UWBP_Settings_InputOptionsList_C::WBP_Settings_MappingOptionEntry_ToggleWalk' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, OnEntryFocused) == 0x0005B8, "Member 'UWBP_Settings_InputOptionsList_C::OnEntryFocused' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, ConflictingMappings) == 0x0005C8, "Member 'UWBP_Settings_InputOptionsList_C::ConflictingMappings' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, CurrentSelectedMapping) == 0x0005D8, "Member 'UWBP_Settings_InputOptionsList_C::CurrentSelectedMapping' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputOptionsList_C, IgnoreConflicts) == 0x0005E0, "Member 'UWBP_Settings_InputOptionsList_C::IgnoreConflicts' has a wrong offset!");

}

