#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_OptionTooltip

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Settings_OptionTooltip.WBP_Settings_OptionTooltip_C.SetOptionNameAndDesc
// 0x0160 (0x0160 - 0x0000)
struct WBP_Settings_OptionTooltip_C_SetOptionNameAndDesc final
{
public:
	class FText                                   InOptionName;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   InOptionDesc;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_1;                              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_Select_Default_1;                           // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0090(0x00D0)()
};
static_assert(alignof(WBP_Settings_OptionTooltip_C_SetOptionNameAndDesc) == 0x000010, "Wrong alignment on WBP_Settings_OptionTooltip_C_SetOptionNameAndDesc");
static_assert(sizeof(WBP_Settings_OptionTooltip_C_SetOptionNameAndDesc) == 0x000160, "Wrong size on WBP_Settings_OptionTooltip_C_SetOptionNameAndDesc");
static_assert(offsetof(WBP_Settings_OptionTooltip_C_SetOptionNameAndDesc, InOptionName) == 0x000000, "Member 'WBP_Settings_OptionTooltip_C_SetOptionNameAndDesc::InOptionName' has a wrong offset!");
static_assert(offsetof(WBP_Settings_OptionTooltip_C_SetOptionNameAndDesc, InOptionDesc) == 0x000010, "Member 'WBP_Settings_OptionTooltip_C_SetOptionNameAndDesc::InOptionDesc' has a wrong offset!");
static_assert(offsetof(WBP_Settings_OptionTooltip_C_SetOptionNameAndDesc, Temp_bool_Variable) == 0x000020, "Member 'WBP_Settings_OptionTooltip_C_SetOptionNameAndDesc::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Settings_OptionTooltip_C_SetOptionNameAndDesc, Temp_real_Variable) == 0x000024, "Member 'WBP_Settings_OptionTooltip_C_SetOptionNameAndDesc::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Settings_OptionTooltip_C_SetOptionNameAndDesc, Temp_bool_Variable_1) == 0x000028, "Member 'WBP_Settings_OptionTooltip_C_SetOptionNameAndDesc::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_OptionTooltip_C_SetOptionNameAndDesc, Temp_real_Variable_1) == 0x00002C, "Member 'WBP_Settings_OptionTooltip_C_SetOptionNameAndDesc::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_OptionTooltip_C_SetOptionNameAndDesc, K2Node_MakeStruct_Margin) == 0x000030, "Member 'WBP_Settings_OptionTooltip_C_SetOptionNameAndDesc::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_Settings_OptionTooltip_C_SetOptionNameAndDesc, K2Node_MakeStruct_Margin_1) == 0x000040, "Member 'WBP_Settings_OptionTooltip_C_SetOptionNameAndDesc::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_OptionTooltip_C_SetOptionNameAndDesc, CallFunc_GetDesiredSize_ReturnValue) == 0x000050, "Member 'WBP_Settings_OptionTooltip_C_SetOptionNameAndDesc::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_OptionTooltip_C_SetOptionNameAndDesc, CallFunc_BreakVector2D_X) == 0x000060, "Member 'WBP_Settings_OptionTooltip_C_SetOptionNameAndDesc::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_Settings_OptionTooltip_C_SetOptionNameAndDesc, CallFunc_BreakVector2D_Y) == 0x000068, "Member 'WBP_Settings_OptionTooltip_C_SetOptionNameAndDesc::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_Settings_OptionTooltip_C_SetOptionNameAndDesc, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000070, "Member 'WBP_Settings_OptionTooltip_C_SetOptionNameAndDesc::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_OptionTooltip_C_SetOptionNameAndDesc, K2Node_Select_Default) == 0x000074, "Member 'WBP_Settings_OptionTooltip_C_SetOptionNameAndDesc::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Settings_OptionTooltip_C_SetOptionNameAndDesc, K2Node_Select_Default_1) == 0x000078, "Member 'WBP_Settings_OptionTooltip_C_SetOptionNameAndDesc::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_OptionTooltip_C_SetOptionNameAndDesc, K2Node_MakeStruct_SlateBrush) == 0x000090, "Member 'WBP_Settings_OptionTooltip_C_SetOptionNameAndDesc::K2Node_MakeStruct_SlateBrush' has a wrong offset!");

}

