#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_DefenseButton

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_HUD_DefenseButton.WBP_HUD_DefenseButton_C.ExecuteUbergraph_WBP_HUD_DefenseButton
// 0x0038 (0x0038 - 0x0000)
struct WBP_HUD_DefenseButton_C_ExecuteUbergraph_WBP_HUD_DefenseButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetBrushResource_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_DefenseButton_C_ExecuteUbergraph_WBP_HUD_DefenseButton) == 0x000008, "Wrong alignment on WBP_HUD_DefenseButton_C_ExecuteUbergraph_WBP_HUD_DefenseButton");
static_assert(sizeof(WBP_HUD_DefenseButton_C_ExecuteUbergraph_WBP_HUD_DefenseButton) == 0x000038, "Wrong size on WBP_HUD_DefenseButton_C_ExecuteUbergraph_WBP_HUD_DefenseButton");
static_assert(offsetof(WBP_HUD_DefenseButton_C_ExecuteUbergraph_WBP_HUD_DefenseButton, EntryPoint) == 0x000000, "Member 'WBP_HUD_DefenseButton_C_ExecuteUbergraph_WBP_HUD_DefenseButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DefenseButton_C_ExecuteUbergraph_WBP_HUD_DefenseButton, Temp_bool_Variable) == 0x000004, "Member 'WBP_HUD_DefenseButton_C_ExecuteUbergraph_WBP_HUD_DefenseButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DefenseButton_C_ExecuteUbergraph_WBP_HUD_DefenseButton, Temp_byte_Variable) == 0x000005, "Member 'WBP_HUD_DefenseButton_C_ExecuteUbergraph_WBP_HUD_DefenseButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DefenseButton_C_ExecuteUbergraph_WBP_HUD_DefenseButton, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_HUD_DefenseButton_C_ExecuteUbergraph_WBP_HUD_DefenseButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DefenseButton_C_ExecuteUbergraph_WBP_HUD_DefenseButton, K2Node_Event_IsDesignTime) == 0x000007, "Member 'WBP_HUD_DefenseButton_C_ExecuteUbergraph_WBP_HUD_DefenseButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DefenseButton_C_ExecuteUbergraph_WBP_HUD_DefenseButton, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_HUD_DefenseButton_C_ExecuteUbergraph_WBP_HUD_DefenseButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DefenseButton_C_ExecuteUbergraph_WBP_HUD_DefenseButton, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WBP_HUD_DefenseButton_C_ExecuteUbergraph_WBP_HUD_DefenseButton::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DefenseButton_C_ExecuteUbergraph_WBP_HUD_DefenseButton, K2Node_Select_Default) == 0x000018, "Member 'WBP_HUD_DefenseButton_C_ExecuteUbergraph_WBP_HUD_DefenseButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DefenseButton_C_ExecuteUbergraph_WBP_HUD_DefenseButton, CallFunc_PlayAnimation_ReturnValue_2) == 0x000020, "Member 'WBP_HUD_DefenseButton_C_ExecuteUbergraph_WBP_HUD_DefenseButton::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DefenseButton_C_ExecuteUbergraph_WBP_HUD_DefenseButton, CallFunc_GetBrushResource_ReturnValue) == 0x000028, "Member 'WBP_HUD_DefenseButton_C_ExecuteUbergraph_WBP_HUD_DefenseButton::CallFunc_GetBrushResource_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_DefenseButton_C_ExecuteUbergraph_WBP_HUD_DefenseButton, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_HUD_DefenseButton_C_ExecuteUbergraph_WBP_HUD_DefenseButton::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_HUD_DefenseButton.WBP_HUD_DefenseButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_HUD_DefenseButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_DefenseButton_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_HUD_DefenseButton_C_PreConstruct");
static_assert(sizeof(WBP_HUD_DefenseButton_C_PreConstruct) == 0x000001, "Wrong size on WBP_HUD_DefenseButton_C_PreConstruct");
static_assert(offsetof(WBP_HUD_DefenseButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_HUD_DefenseButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

