#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EndBattle_CharacterEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_EndBattle_CharacterEntry.WBP_EndBattle_CharacterEntry_C
// 0x0098 (0x03A0 - 0x0308)
class UWBP_EndBattle_CharacterEntry_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_LuminaLearnt;                                 // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_LevelUpLoop;                                  // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_LevelUp;                                      // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonLazyImage*                       Background;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CharacterName;                                     // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDynamicEntryBox*                       DynamicEntryBox_Pictos;                            // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   FX_SmokePortrait;                                  // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background_Color;                            // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EndBattle_ExperienceBar_C*         WBP_BattleEnd_ExperienceBar;                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CharacterMarker_C*                 WBP_CharacterMarker;                               // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LuminaLearntFlag_C*                WBP_LuminaLearntFlag;                              // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   CharacterId;                                       // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    LevelUpAudio;                                      // 0x0378(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          IsAnyLuminaLearntThisBattle;                       // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    LuminaLearntAudio;                                 // 0x0390(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void BndEvt__WBP_EndBattle_CharacterEntry_WBP_BattleEnd_ExperienceBar_K2Node_ComponentBoundEvent_0_OnLevelUpTriggered__DelegateSignature();
	void BndEvt__WBP_EndBattle_CharacterEntry_WBP_BattleEnd_ExperienceBar_K2Node_ComponentBoundEvent_1_OnLevelUpFinished__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_EndBattle_CharacterEntry(int32 EntryPoint);
	void GetCharacterID(class FName* CharacterId_0);
	void LoadCharacter(class UBP_CharacterData_C* CharacterData);
	void LoadCharacterPictos(class UBP_CharacterData_C* CharacterData);
	void PreConstruct(bool IsDesignTime);
	void SequenceEvent__ENTRYPOINTWBP_EndBattle_CharacterEntry(class UWBP_EndBattle_ExperienceBar_C* WBP_BattleEnd_ExperienceBar_0);
	void SetCharacterDead(class UAC_jRPG_CharacterBattleStats_C* CharacterBattleStats);
	void TriggerProgressAnimations(class UAC_jRPG_CharacterBattleStats_C* CharacterBattleStats);
	void WBP_BattleEnd_ExperienceBar_Event(class UWBP_EndBattle_ExperienceBar_C* WBP_BattleEnd_ExperienceBar_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_EndBattle_CharacterEntry_C">();
	}
	static class UWBP_EndBattle_CharacterEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_EndBattle_CharacterEntry_C>();
	}
};
static_assert(alignof(UWBP_EndBattle_CharacterEntry_C) == 0x000008, "Wrong alignment on UWBP_EndBattle_CharacterEntry_C");
static_assert(sizeof(UWBP_EndBattle_CharacterEntry_C) == 0x0003A0, "Wrong size on UWBP_EndBattle_CharacterEntry_C");
static_assert(offsetof(UWBP_EndBattle_CharacterEntry_C, UberGraphFrame) == 0x000308, "Member 'UWBP_EndBattle_CharacterEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_CharacterEntry_C, Anim_LuminaLearnt) == 0x000310, "Member 'UWBP_EndBattle_CharacterEntry_C::Anim_LuminaLearnt' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_CharacterEntry_C, Anim_LevelUpLoop) == 0x000318, "Member 'UWBP_EndBattle_CharacterEntry_C::Anim_LevelUpLoop' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_CharacterEntry_C, Anim_LevelUp) == 0x000320, "Member 'UWBP_EndBattle_CharacterEntry_C::Anim_LevelUp' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_CharacterEntry_C, Background) == 0x000328, "Member 'UWBP_EndBattle_CharacterEntry_C::Background' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_CharacterEntry_C, CharacterName) == 0x000330, "Member 'UWBP_EndBattle_CharacterEntry_C::CharacterName' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_CharacterEntry_C, DynamicEntryBox_Pictos) == 0x000338, "Member 'UWBP_EndBattle_CharacterEntry_C::DynamicEntryBox_Pictos' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_CharacterEntry_C, FX_SmokePortrait) == 0x000340, "Member 'UWBP_EndBattle_CharacterEntry_C::FX_SmokePortrait' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_CharacterEntry_C, Image_Background_Color) == 0x000348, "Member 'UWBP_EndBattle_CharacterEntry_C::Image_Background_Color' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_CharacterEntry_C, RetainerBox) == 0x000350, "Member 'UWBP_EndBattle_CharacterEntry_C::RetainerBox' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_CharacterEntry_C, WBP_BattleEnd_ExperienceBar) == 0x000358, "Member 'UWBP_EndBattle_CharacterEntry_C::WBP_BattleEnd_ExperienceBar' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_CharacterEntry_C, WBP_CharacterMarker) == 0x000360, "Member 'UWBP_EndBattle_CharacterEntry_C::WBP_CharacterMarker' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_CharacterEntry_C, WBP_LuminaLearntFlag) == 0x000368, "Member 'UWBP_EndBattle_CharacterEntry_C::WBP_LuminaLearntFlag' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_CharacterEntry_C, CharacterId) == 0x000370, "Member 'UWBP_EndBattle_CharacterEntry_C::CharacterId' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_CharacterEntry_C, LevelUpAudio) == 0x000378, "Member 'UWBP_EndBattle_CharacterEntry_C::LevelUpAudio' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_CharacterEntry_C, IsAnyLuminaLearntThisBattle) == 0x000388, "Member 'UWBP_EndBattle_CharacterEntry_C::IsAnyLuminaLearntThisBattle' has a wrong offset!");
static_assert(offsetof(UWBP_EndBattle_CharacterEntry_C, LuminaLearntAudio) == 0x000390, "Member 'UWBP_EndBattle_CharacterEntry_C::LuminaLearntAudio' has a wrong offset!");

}

