#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TintUpgradePanel

#include "Basic.hpp"

#include "S_jRPG_Item_DynamicData_structs.hpp"


namespace SDK::Params
{

// Function WBP_TintUpgradePanel.WBP_TintUpgradePanel_C.ExecuteUbergraph_WBP_TintUpgradePanel
// 0x0004 (0x0004 - 0x0000)
struct WBP_TintUpgradePanel_C_ExecuteUbergraph_WBP_TintUpgradePanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TintUpgradePanel_C_ExecuteUbergraph_WBP_TintUpgradePanel) == 0x000004, "Wrong alignment on WBP_TintUpgradePanel_C_ExecuteUbergraph_WBP_TintUpgradePanel");
static_assert(sizeof(WBP_TintUpgradePanel_C_ExecuteUbergraph_WBP_TintUpgradePanel) == 0x000004, "Wrong size on WBP_TintUpgradePanel_C_ExecuteUbergraph_WBP_TintUpgradePanel");
static_assert(offsetof(WBP_TintUpgradePanel_C_ExecuteUbergraph_WBP_TintUpgradePanel, EntryPoint) == 0x000000, "Member 'WBP_TintUpgradePanel_C_ExecuteUbergraph_WBP_TintUpgradePanel::EntryPoint' has a wrong offset!");

// Function WBP_TintUpgradePanel.WBP_TintUpgradePanel_C.LoadTintUpgrades
// 0x0170 (0x0170 - 0x0000)
struct WBP_TintUpgradePanel_C_LoadTintUpgrades final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_InventoryManager_C*            CallFunc_GetInventoryManager_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_jRPG_Item_DynamicData>       CallFunc_GetConsumablesShards_FilteredArray;       // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FS_jRPG_Item_DynamicData               CallFunc_Array_Get_Item;                           // 0x0028(0x0138)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_TintUpgradeEntry_C*                CallFunc_BP_CreateEntryOfClass_ReturnValue;        // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TintUpgradePanel_C_LoadTintUpgrades) == 0x000008, "Wrong alignment on WBP_TintUpgradePanel_C_LoadTintUpgrades");
static_assert(sizeof(WBP_TintUpgradePanel_C_LoadTintUpgrades) == 0x000170, "Wrong size on WBP_TintUpgradePanel_C_LoadTintUpgrades");
static_assert(offsetof(WBP_TintUpgradePanel_C_LoadTintUpgrades, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_TintUpgradePanel_C_LoadTintUpgrades::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TintUpgradePanel_C_LoadTintUpgrades, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_TintUpgradePanel_C_LoadTintUpgrades::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TintUpgradePanel_C_LoadTintUpgrades, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_TintUpgradePanel_C_LoadTintUpgrades::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TintUpgradePanel_C_LoadTintUpgrades, CallFunc_GetInventoryManager_ReturnValue) == 0x000010, "Member 'WBP_TintUpgradePanel_C_LoadTintUpgrades::CallFunc_GetInventoryManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TintUpgradePanel_C_LoadTintUpgrades, CallFunc_GetConsumablesShards_FilteredArray) == 0x000018, "Member 'WBP_TintUpgradePanel_C_LoadTintUpgrades::CallFunc_GetConsumablesShards_FilteredArray' has a wrong offset!");
static_assert(offsetof(WBP_TintUpgradePanel_C_LoadTintUpgrades, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_TintUpgradePanel_C_LoadTintUpgrades::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_TintUpgradePanel_C_LoadTintUpgrades, CallFunc_Array_Length_ReturnValue) == 0x000160, "Member 'WBP_TintUpgradePanel_C_LoadTintUpgrades::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TintUpgradePanel_C_LoadTintUpgrades, CallFunc_Less_IntInt_ReturnValue) == 0x000164, "Member 'WBP_TintUpgradePanel_C_LoadTintUpgrades::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TintUpgradePanel_C_LoadTintUpgrades, CallFunc_BP_CreateEntryOfClass_ReturnValue) == 0x000168, "Member 'WBP_TintUpgradePanel_C_LoadTintUpgrades::CallFunc_BP_CreateEntryOfClass_ReturnValue' has a wrong offset!");

}

