#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SpawnPointEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SpawnPointEntry.WBP_SpawnPointEntry_C
// 0x0028 (0x0330 - 0x0308)
class UWBP_SpawnPointEntry_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_BaseButton_C*                      SpawnEntryButton;                                  // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WrappingText_C*                    SpawnPointText;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UWBP_SpawnPointEntry_C* ClickedEntry)> OnEntryClicked;       // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_SpawnPointEntry_SpawnEntryButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WBP_SpawnPointEntry(int32 EntryPoint);
	void SetSpawnPointText(const class FText& InSpawnPointText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SpawnPointEntry_C">();
	}
	static class UWBP_SpawnPointEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SpawnPointEntry_C>();
	}
};
static_assert(alignof(UWBP_SpawnPointEntry_C) == 0x000008, "Wrong alignment on UWBP_SpawnPointEntry_C");
static_assert(sizeof(UWBP_SpawnPointEntry_C) == 0x000330, "Wrong size on UWBP_SpawnPointEntry_C");
static_assert(offsetof(UWBP_SpawnPointEntry_C, UberGraphFrame) == 0x000308, "Member 'UWBP_SpawnPointEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnPointEntry_C, SpawnEntryButton) == 0x000310, "Member 'UWBP_SpawnPointEntry_C::SpawnEntryButton' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnPointEntry_C, SpawnPointText) == 0x000318, "Member 'UWBP_SpawnPointEntry_C::SpawnPointText' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnPointEntry_C, OnEntryClicked) == 0x000320, "Member 'UWBP_SpawnPointEntry_C::OnEntryClicked' has a wrong offset!");

}

