#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NamedIntPointSelector

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_NamedIntPointSelector.WBP_NamedIntPointSelector_C.DispatchOnValueChanged
// 0x0018 (0x0018 - 0x0000)
struct WBP_NamedIntPointSelector_C_DispatchOnValueChanged final
{
public:
	struct FIntPoint                              CallFunc_GetSelectedValue_Value;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetSelectedName_Name;                     // 0x0008(0x0010)()
};
static_assert(alignof(WBP_NamedIntPointSelector_C_DispatchOnValueChanged) == 0x000008, "Wrong alignment on WBP_NamedIntPointSelector_C_DispatchOnValueChanged");
static_assert(sizeof(WBP_NamedIntPointSelector_C_DispatchOnValueChanged) == 0x000018, "Wrong size on WBP_NamedIntPointSelector_C_DispatchOnValueChanged");
static_assert(offsetof(WBP_NamedIntPointSelector_C_DispatchOnValueChanged, CallFunc_GetSelectedValue_Value) == 0x000000, "Member 'WBP_NamedIntPointSelector_C_DispatchOnValueChanged::CallFunc_GetSelectedValue_Value' has a wrong offset!");
static_assert(offsetof(WBP_NamedIntPointSelector_C_DispatchOnValueChanged, CallFunc_GetSelectedName_Name) == 0x000008, "Member 'WBP_NamedIntPointSelector_C_DispatchOnValueChanged::CallFunc_GetSelectedName_Name' has a wrong offset!");

// Function WBP_NamedIntPointSelector.WBP_NamedIntPointSelector_C.GetSelectedValue
// 0x0014 (0x0014 - 0x0000)
struct WBP_NamedIntPointSelector_C_GetSelectedValue final
{
public:
	struct FIntPoint                              Value;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedEntryIndex_EntryIndex;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_Array_Get_Item;                           // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NamedIntPointSelector_C_GetSelectedValue) == 0x000004, "Wrong alignment on WBP_NamedIntPointSelector_C_GetSelectedValue");
static_assert(sizeof(WBP_NamedIntPointSelector_C_GetSelectedValue) == 0x000014, "Wrong size on WBP_NamedIntPointSelector_C_GetSelectedValue");
static_assert(offsetof(WBP_NamedIntPointSelector_C_GetSelectedValue, Value) == 0x000000, "Member 'WBP_NamedIntPointSelector_C_GetSelectedValue::Value' has a wrong offset!");
static_assert(offsetof(WBP_NamedIntPointSelector_C_GetSelectedValue, CallFunc_GetSelectedEntryIndex_EntryIndex) == 0x000008, "Member 'WBP_NamedIntPointSelector_C_GetSelectedValue::CallFunc_GetSelectedEntryIndex_EntryIndex' has a wrong offset!");
static_assert(offsetof(WBP_NamedIntPointSelector_C_GetSelectedValue, CallFunc_Array_Get_Item) == 0x00000C, "Member 'WBP_NamedIntPointSelector_C_GetSelectedValue::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WBP_NamedIntPointSelector.WBP_NamedIntPointSelector_C.SetAvailableValues
// 0x0070 (0x0070 - 0x0000)
struct WBP_NamedIntPointSelector_C_SetAvailableValues final
{
public:
	TMap<struct FIntPoint, class FText>           Values;                                            // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	TArray<struct FIntPoint>                      CallFunc_Map_Keys_Keys;                            // 0x0050(0x0010)(ReferenceParm)
	TArray<class FText>                           CallFunc_Map_Values_Values;                        // 0x0060(0x0010)(ReferenceParm)
};
static_assert(alignof(WBP_NamedIntPointSelector_C_SetAvailableValues) == 0x000008, "Wrong alignment on WBP_NamedIntPointSelector_C_SetAvailableValues");
static_assert(sizeof(WBP_NamedIntPointSelector_C_SetAvailableValues) == 0x000070, "Wrong size on WBP_NamedIntPointSelector_C_SetAvailableValues");
static_assert(offsetof(WBP_NamedIntPointSelector_C_SetAvailableValues, Values) == 0x000000, "Member 'WBP_NamedIntPointSelector_C_SetAvailableValues::Values' has a wrong offset!");
static_assert(offsetof(WBP_NamedIntPointSelector_C_SetAvailableValues, CallFunc_Map_Keys_Keys) == 0x000050, "Member 'WBP_NamedIntPointSelector_C_SetAvailableValues::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_NamedIntPointSelector_C_SetAvailableValues, CallFunc_Map_Values_Values) == 0x000060, "Member 'WBP_NamedIntPointSelector_C_SetAvailableValues::CallFunc_Map_Values_Values' has a wrong offset!");

// Function WBP_NamedIntPointSelector.WBP_NamedIntPointSelector_C.SetSelectedValue
// 0x0014 (0x0014 - 0x0000)
struct WBP_NamedIntPointSelector_C_SetSelectedValue final
{
public:
	struct FIntPoint                              Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_wildcard_Variable;                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NamedIntPointSelector_C_SetSelectedValue) == 0x000004, "Wrong alignment on WBP_NamedIntPointSelector_C_SetSelectedValue");
static_assert(sizeof(WBP_NamedIntPointSelector_C_SetSelectedValue) == 0x000014, "Wrong size on WBP_NamedIntPointSelector_C_SetSelectedValue");
static_assert(offsetof(WBP_NamedIntPointSelector_C_SetSelectedValue, Value) == 0x000000, "Member 'WBP_NamedIntPointSelector_C_SetSelectedValue::Value' has a wrong offset!");
static_assert(offsetof(WBP_NamedIntPointSelector_C_SetSelectedValue, Temp_wildcard_Variable) == 0x000008, "Member 'WBP_NamedIntPointSelector_C_SetSelectedValue::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NamedIntPointSelector_C_SetSelectedValue, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_NamedIntPointSelector_C_SetSelectedValue::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NamedIntPointSelector_C_SetSelectedValue, CallFunc_Array_Find_ReturnValue) == 0x000010, "Member 'WBP_NamedIntPointSelector_C_SetSelectedValue::CallFunc_Array_Find_ReturnValue' has a wrong offset!");

// Function WBP_NamedIntPointSelector.WBP_NamedIntPointSelector_C.SetSelectedValueAsArrayLastIndex
// 0x0010 (0x0010 - 0x0000)
struct WBP_NamedIntPointSelector_C_SetSelectedValueAsArrayLastIndex final
{
public:
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NamedIntPointSelector_C_SetSelectedValueAsArrayLastIndex) == 0x000004, "Wrong alignment on WBP_NamedIntPointSelector_C_SetSelectedValueAsArrayLastIndex");
static_assert(sizeof(WBP_NamedIntPointSelector_C_SetSelectedValueAsArrayLastIndex) == 0x000010, "Wrong size on WBP_NamedIntPointSelector_C_SetSelectedValueAsArrayLastIndex");
static_assert(offsetof(WBP_NamedIntPointSelector_C_SetSelectedValueAsArrayLastIndex, CallFunc_Array_LastIndex_ReturnValue) == 0x000000, "Member 'WBP_NamedIntPointSelector_C_SetSelectedValueAsArrayLastIndex::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NamedIntPointSelector_C_SetSelectedValueAsArrayLastIndex, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000004, "Member 'WBP_NamedIntPointSelector_C_SetSelectedValueAsArrayLastIndex::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NamedIntPointSelector_C_SetSelectedValueAsArrayLastIndex, CallFunc_Array_Get_Item) == 0x000008, "Member 'WBP_NamedIntPointSelector_C_SetSelectedValueAsArrayLastIndex::CallFunc_Array_Get_Item' has a wrong offset!");

}

