#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BattleWheel_Button

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_BattleWheel_Button.WBP_BattleWheel_Button_C.ActivateWidgetWithDelay
// 0x0004 (0x0004 - 0x0000)
struct WBP_BattleWheel_Button_C_ActivateWidgetWithDelay final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleWheel_Button_C_ActivateWidgetWithDelay) == 0x000004, "Wrong alignment on WBP_BattleWheel_Button_C_ActivateWidgetWithDelay");
static_assert(sizeof(WBP_BattleWheel_Button_C_ActivateWidgetWithDelay) == 0x000004, "Wrong size on WBP_BattleWheel_Button_C_ActivateWidgetWithDelay");
static_assert(offsetof(WBP_BattleWheel_Button_C_ActivateWidgetWithDelay, Duration) == 0x000000, "Member 'WBP_BattleWheel_Button_C_ActivateWidgetWithDelay::Duration' has a wrong offset!");

// Function WBP_BattleWheel_Button.WBP_BattleWheel_Button_C.BndEvt__WBP_BattleWheel_Button_WBP_ButtonBinding_BattleButton_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_BattleWheel_Button_C_BndEvt__WBP_BattleWheel_Button_WBP_ButtonBinding_BattleButton_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature final
{
public:
	class UWBP_ButtonBinding_C*                   PromptWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleWheel_Button_C_BndEvt__WBP_BattleWheel_Button_WBP_ButtonBinding_BattleButton_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_BattleWheel_Button_C_BndEvt__WBP_BattleWheel_Button_WBP_ButtonBinding_BattleButton_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_BattleWheel_Button_C_BndEvt__WBP_BattleWheel_Button_WBP_ButtonBinding_BattleButton_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature) == 0x000008, "Wrong size on WBP_BattleWheel_Button_C_BndEvt__WBP_BattleWheel_Button_WBP_ButtonBinding_BattleButton_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_BattleWheel_Button_C_BndEvt__WBP_BattleWheel_Button_WBP_ButtonBinding_BattleButton_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature, PromptWidget) == 0x000000, "Member 'WBP_BattleWheel_Button_C_BndEvt__WBP_BattleWheel_Button_WBP_ButtonBinding_BattleButton_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature::PromptWidget' has a wrong offset!");

// Function WBP_BattleWheel_Button.WBP_BattleWheel_Button_C.ExecuteUbergraph_WBP_BattleWheel_Button
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ButtonBinding_C*                   K2Node_ComponentBoundEvent_PromptWidget;           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidgetAnimation*>               K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ReferenceParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Duration;                       // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77[0x1];                                       // 0x0077(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0078(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   K2Node_CustomEvent_NiagaraSystemWidget_Appear;     // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button) == 0x000008, "Wrong alignment on WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button");
static_assert(sizeof(WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button) == 0x0000A8, "Wrong size on WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button");
static_assert(offsetof(WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button, EntryPoint) == 0x000000, "Member 'WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000028, "Member 'WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000030, "Member 'WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button, K2Node_ComponentBoundEvent_PromptWidget) == 0x000040, "Member 'WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button::K2Node_ComponentBoundEvent_PromptWidget' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button, K2Node_Event_IsDesignTime) == 0x000048, "Member 'WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button, CallFunc_PlayAnimation_ReturnValue) == 0x000050, "Member 'WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button, K2Node_MakeArray_Array) == 0x000058, "Member 'WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button, CallFunc_PlayAnimation_ReturnValue_1) == 0x000068, "Member 'WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button, K2Node_CustomEvent_Duration) == 0x000070, "Member 'WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button::K2Node_CustomEvent_Duration' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000074, "Member 'WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000075, "Member 'WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button, CallFunc_Not_PreBool_ReturnValue) == 0x000076, "Member 'WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000078, "Member 'WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button, K2Node_CustomEvent_NiagaraSystemWidget_Appear) == 0x000080, "Member 'WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button::K2Node_CustomEvent_NiagaraSystemWidget_Appear' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button, K2Node_CreateDelegate_OutputDelegate_2) == 0x000088, "Member 'WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button, CallFunc_Not_PreBool_ReturnValue_1) == 0x000098, "Member 'WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x0000A0, "Member 'WBP_BattleWheel_Button_C_ExecuteUbergraph_WBP_BattleWheel_Button::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_BattleWheel_Button.WBP_BattleWheel_Button_C.NiagaraSystemWidget_Appear_Event
// 0x0008 (0x0008 - 0x0000)
struct WBP_BattleWheel_Button_C_NiagaraSystemWidget_Appear_Event final
{
public:
	class UNiagaraSystemWidget*                   NiagaraSystemWidget_Appear_0;                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleWheel_Button_C_NiagaraSystemWidget_Appear_Event) == 0x000008, "Wrong alignment on WBP_BattleWheel_Button_C_NiagaraSystemWidget_Appear_Event");
static_assert(sizeof(WBP_BattleWheel_Button_C_NiagaraSystemWidget_Appear_Event) == 0x000008, "Wrong size on WBP_BattleWheel_Button_C_NiagaraSystemWidget_Appear_Event");
static_assert(offsetof(WBP_BattleWheel_Button_C_NiagaraSystemWidget_Appear_Event, NiagaraSystemWidget_Appear_0) == 0x000000, "Member 'WBP_BattleWheel_Button_C_NiagaraSystemWidget_Appear_Event::NiagaraSystemWidget_Appear_0' has a wrong offset!");

// Function WBP_BattleWheel_Button.WBP_BattleWheel_Button_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_BattleWheel_Button_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleWheel_Button_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_BattleWheel_Button_C_PreConstruct");
static_assert(sizeof(WBP_BattleWheel_Button_C_PreConstruct) == 0x000001, "Wrong size on WBP_BattleWheel_Button_C_PreConstruct");
static_assert(offsetof(WBP_BattleWheel_Button_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_BattleWheel_Button_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_BattleWheel_Button.WBP_BattleWheel_Button_C.SequenceEvent__ENTRYPOINTWBP_BattleWheel_Button
// 0x0008 (0x0008 - 0x0000)
struct WBP_BattleWheel_Button_C_SequenceEvent__ENTRYPOINTWBP_BattleWheel_Button final
{
public:
	class UNiagaraSystemWidget*                   NiagaraSystemWidget_Appear_0;                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleWheel_Button_C_SequenceEvent__ENTRYPOINTWBP_BattleWheel_Button) == 0x000008, "Wrong alignment on WBP_BattleWheel_Button_C_SequenceEvent__ENTRYPOINTWBP_BattleWheel_Button");
static_assert(sizeof(WBP_BattleWheel_Button_C_SequenceEvent__ENTRYPOINTWBP_BattleWheel_Button) == 0x000008, "Wrong size on WBP_BattleWheel_Button_C_SequenceEvent__ENTRYPOINTWBP_BattleWheel_Button");
static_assert(offsetof(WBP_BattleWheel_Button_C_SequenceEvent__ENTRYPOINTWBP_BattleWheel_Button, NiagaraSystemWidget_Appear_0) == 0x000000, "Member 'WBP_BattleWheel_Button_C_SequenceEvent__ENTRYPOINTWBP_BattleWheel_Button::NiagaraSystemWidget_Appear_0' has a wrong offset!");

// Function WBP_BattleWheel_Button.WBP_BattleWheel_Button_C.SetButtonPrevented
// 0x0002 (0x0002 - 0x0000)
struct WBP_BattleWheel_Button_C_SetButtonPrevented final
{
public:
	bool                                          Prevented;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleWheel_Button_C_SetButtonPrevented) == 0x000001, "Wrong alignment on WBP_BattleWheel_Button_C_SetButtonPrevented");
static_assert(sizeof(WBP_BattleWheel_Button_C_SetButtonPrevented) == 0x000002, "Wrong size on WBP_BattleWheel_Button_C_SetButtonPrevented");
static_assert(offsetof(WBP_BattleWheel_Button_C_SetButtonPrevented, Prevented) == 0x000000, "Member 'WBP_BattleWheel_Button_C_SetButtonPrevented::Prevented' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_Button_C_SetButtonPrevented, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'WBP_BattleWheel_Button_C_SetButtonPrevented::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_BattleWheel_Button.WBP_BattleWheel_Button_C.SetFXAlpha
// 0x0020 (0x0020 - 0x0000)
struct WBP_BattleWheel_Button_C_SetFXAlpha final
{
public:
	double                                        NewValue;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraUIComponent*                    CallFunc_GetNiagaraComponent_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast;     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleWheel_Button_C_SetFXAlpha) == 0x000008, "Wrong alignment on WBP_BattleWheel_Button_C_SetFXAlpha");
static_assert(sizeof(WBP_BattleWheel_Button_C_SetFXAlpha) == 0x000020, "Wrong size on WBP_BattleWheel_Button_C_SetFXAlpha");
static_assert(offsetof(WBP_BattleWheel_Button_C_SetFXAlpha, NewValue) == 0x000000, "Member 'WBP_BattleWheel_Button_C_SetFXAlpha::NewValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_Button_C_SetFXAlpha, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_BattleWheel_Button_C_SetFXAlpha::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_Button_C_SetFXAlpha, CallFunc_GetNiagaraComponent_ReturnValue) == 0x000010, "Member 'WBP_BattleWheel_Button_C_SetFXAlpha::CallFunc_GetNiagaraComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_Button_C_SetFXAlpha, CallFunc_SetFloatParameter_Param_ImplicitCast) == 0x000018, "Member 'WBP_BattleWheel_Button_C_SetFXAlpha::CallFunc_SetFloatParameter_Param_ImplicitCast' has a wrong offset!");

}

