#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Battle_Boss_OverheadState

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_Battle_CharacterOverheadState_Base_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Battle_Boss_OverheadState.WBP_Battle_Boss_OverheadState_C
// 0x0048 (0x0340 - 0x02F8)
class UWBP_Battle_Boss_OverheadState_C final : public UWBP_Battle_CharacterOverheadState_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_Battle_Boss_OverheadState_C;    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Appear_Life;                                  // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_BattleEffectsBox_C*                BattleBuffBox;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       BossOverheadBackground;                            // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_AdditionalIcons;                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ColorAppear;                                 // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BattleEffectsBox_C*                StatusEffectBox;                                   // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WrappingText_C*                    TextBlock_BossName;                                // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CharacterHealthBar_C*              WBP_JRPG_CharacterHealthBar;                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Appear();
	void EventAddLinkedBoss(class UAC_jRPG_CharacterBattleStats_C* InCharacterBattleStats);
	void ExecuteUbergraph_WBP_Battle_Boss_OverheadState(int32 EntryPoint);
	void GetBattleBuffContainer(class UWBP_BattleEffectsBox_C** BattleEffectBox);
	void GetCharacterHealthBar(class UWBP_CharacterHealthBar_C** HealthBar);
	void GetExtraIconsContainer(class UPanelWidget** Panel);
	void GetStatusEffectContainer(class UWBP_BattleEffectsBox_C** BattleEffectBox);
	void OnHoverStart();
	void SetCharacterBattleStats(class UAC_jRPG_CharacterBattleStats_C* BattleStats);
	void UpdateVisibility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Battle_Boss_OverheadState_C">();
	}
	static class UWBP_Battle_Boss_OverheadState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Battle_Boss_OverheadState_C>();
	}
};
static_assert(alignof(UWBP_Battle_Boss_OverheadState_C) == 0x000008, "Wrong alignment on UWBP_Battle_Boss_OverheadState_C");
static_assert(sizeof(UWBP_Battle_Boss_OverheadState_C) == 0x000340, "Wrong size on UWBP_Battle_Boss_OverheadState_C");
static_assert(offsetof(UWBP_Battle_Boss_OverheadState_C, UberGraphFrame_WBP_Battle_Boss_OverheadState_C) == 0x0002F8, "Member 'UWBP_Battle_Boss_OverheadState_C::UberGraphFrame_WBP_Battle_Boss_OverheadState_C' has a wrong offset!");
static_assert(offsetof(UWBP_Battle_Boss_OverheadState_C, Anim_Appear_Life) == 0x000300, "Member 'UWBP_Battle_Boss_OverheadState_C::Anim_Appear_Life' has a wrong offset!");
static_assert(offsetof(UWBP_Battle_Boss_OverheadState_C, BattleBuffBox) == 0x000308, "Member 'UWBP_Battle_Boss_OverheadState_C::BattleBuffBox' has a wrong offset!");
static_assert(offsetof(UWBP_Battle_Boss_OverheadState_C, BossOverheadBackground) == 0x000310, "Member 'UWBP_Battle_Boss_OverheadState_C::BossOverheadBackground' has a wrong offset!");
static_assert(offsetof(UWBP_Battle_Boss_OverheadState_C, HorizontalBox_AdditionalIcons) == 0x000318, "Member 'UWBP_Battle_Boss_OverheadState_C::HorizontalBox_AdditionalIcons' has a wrong offset!");
static_assert(offsetof(UWBP_Battle_Boss_OverheadState_C, Image_ColorAppear) == 0x000320, "Member 'UWBP_Battle_Boss_OverheadState_C::Image_ColorAppear' has a wrong offset!");
static_assert(offsetof(UWBP_Battle_Boss_OverheadState_C, StatusEffectBox) == 0x000328, "Member 'UWBP_Battle_Boss_OverheadState_C::StatusEffectBox' has a wrong offset!");
static_assert(offsetof(UWBP_Battle_Boss_OverheadState_C, TextBlock_BossName) == 0x000330, "Member 'UWBP_Battle_Boss_OverheadState_C::TextBlock_BossName' has a wrong offset!");
static_assert(offsetof(UWBP_Battle_Boss_OverheadState_C, WBP_JRPG_CharacterHealthBar) == 0x000338, "Member 'UWBP_Battle_Boss_OverheadState_C::WBP_JRPG_CharacterHealthBar' has a wrong offset!");

}

