#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ButtonBinding

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ButtonBinding.WBP_ButtonBinding_C
// 0x00A0 (0x1640 - 0x15A0)
class UWBP_ButtonBinding_C final : public UCommonButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x15A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_OnClick;                                      // 0x15A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_ClickFadeout;                                 // 0x15B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Appear;                                       // 0x15B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UScaleBox*                              BindingScaleBox;                                   // 0x15C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_DEBUG_LINE;                          // 0x15C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Debug_Enabled;                               // 0x15D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Debug_Focusable;                             // 0x15D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Debug_Interactive;                           // 0x15E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InputActionBinding_C*              WBP_InputActionBinding;                            // 0x15E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   BottomText;                                        // 0x15F0(0x0010)(Edit, BlueprintVisible)
	TMulticastInlineDelegate<void(class UWBP_ButtonBinding_C* PromptWidget)> OnPressed;              // 0x1600(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsActive;                                          // 0x1610(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1611[0x7];                                     // 0x1611(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UWBP_ButtonBinding_C* PromptWidget)> OnReleased;             // 0x1618(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          DEBUG_ShowState;                                   // 0x1628(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1629[0x7];                                     // 0x1629(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        BindingScale;                                      // 0x1630(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UInputMappingContext*                   BindingMappingContext;                             // 0x1638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void SetInputBindingParamters(const struct FS_InputBindingParameters& InputBindingParameters);
	void Activate();
	void Deactivate();
	void BP_OnReleased();
	void BP_OnClicked();
	void ActivateTriggeringInputAction(const struct FDataTableRowHandle& InputActionRow);
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void DEBUG_SetStateVisible();
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WBP_ButtonBinding(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ButtonBinding_C">();
	}
	static class UWBP_ButtonBinding_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ButtonBinding_C>();
	}
};
static_assert(alignof(UWBP_ButtonBinding_C) == 0x000010, "Wrong alignment on UWBP_ButtonBinding_C");
static_assert(sizeof(UWBP_ButtonBinding_C) == 0x001640, "Wrong size on UWBP_ButtonBinding_C");
static_assert(offsetof(UWBP_ButtonBinding_C, UberGraphFrame) == 0x0015A0, "Member 'UWBP_ButtonBinding_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ButtonBinding_C, Anim_OnClick) == 0x0015A8, "Member 'UWBP_ButtonBinding_C::Anim_OnClick' has a wrong offset!");
static_assert(offsetof(UWBP_ButtonBinding_C, Anim_ClickFadeout) == 0x0015B0, "Member 'UWBP_ButtonBinding_C::Anim_ClickFadeout' has a wrong offset!");
static_assert(offsetof(UWBP_ButtonBinding_C, Anim_Appear) == 0x0015B8, "Member 'UWBP_ButtonBinding_C::Anim_Appear' has a wrong offset!");
static_assert(offsetof(UWBP_ButtonBinding_C, BindingScaleBox) == 0x0015C0, "Member 'UWBP_ButtonBinding_C::BindingScaleBox' has a wrong offset!");
static_assert(offsetof(UWBP_ButtonBinding_C, HorizontalBox_DEBUG_LINE) == 0x0015C8, "Member 'UWBP_ButtonBinding_C::HorizontalBox_DEBUG_LINE' has a wrong offset!");
static_assert(offsetof(UWBP_ButtonBinding_C, Image_Debug_Enabled) == 0x0015D0, "Member 'UWBP_ButtonBinding_C::Image_Debug_Enabled' has a wrong offset!");
static_assert(offsetof(UWBP_ButtonBinding_C, Image_Debug_Focusable) == 0x0015D8, "Member 'UWBP_ButtonBinding_C::Image_Debug_Focusable' has a wrong offset!");
static_assert(offsetof(UWBP_ButtonBinding_C, Image_Debug_Interactive) == 0x0015E0, "Member 'UWBP_ButtonBinding_C::Image_Debug_Interactive' has a wrong offset!");
static_assert(offsetof(UWBP_ButtonBinding_C, WBP_InputActionBinding) == 0x0015E8, "Member 'UWBP_ButtonBinding_C::WBP_InputActionBinding' has a wrong offset!");
static_assert(offsetof(UWBP_ButtonBinding_C, BottomText) == 0x0015F0, "Member 'UWBP_ButtonBinding_C::BottomText' has a wrong offset!");
static_assert(offsetof(UWBP_ButtonBinding_C, OnPressed) == 0x001600, "Member 'UWBP_ButtonBinding_C::OnPressed' has a wrong offset!");
static_assert(offsetof(UWBP_ButtonBinding_C, IsActive) == 0x001610, "Member 'UWBP_ButtonBinding_C::IsActive' has a wrong offset!");
static_assert(offsetof(UWBP_ButtonBinding_C, OnReleased) == 0x001618, "Member 'UWBP_ButtonBinding_C::OnReleased' has a wrong offset!");
static_assert(offsetof(UWBP_ButtonBinding_C, DEBUG_ShowState) == 0x001628, "Member 'UWBP_ButtonBinding_C::DEBUG_ShowState' has a wrong offset!");
static_assert(offsetof(UWBP_ButtonBinding_C, BindingScale) == 0x001630, "Member 'UWBP_ButtonBinding_C::BindingScale' has a wrong offset!");
static_assert(offsetof(UWBP_ButtonBinding_C, BindingMappingContext) == 0x001638, "Member 'UWBP_ButtonBinding_C::BindingMappingContext' has a wrong offset!");

}

