#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MM_BackupSavesBox

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_MM_BackupSavesBox.WBP_MM_BackupSavesBox_C.OnBackUpSaveEntryClicked
// 0x0018 (0x0018 - 0x0000)
struct WBP_MM_BackupSavesBox_C_OnBackUpSaveEntryClicked final
{
public:
	class UWBP_MM_BackupSaveEntry_C*              BackUpSaveEntry;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetBackUpSave_BackUpSave;                 // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MM_BackupSavesBox_C_OnBackUpSaveEntryClicked) == 0x000008, "Wrong alignment on WBP_MM_BackupSavesBox_C_OnBackUpSaveEntryClicked");
static_assert(sizeof(WBP_MM_BackupSavesBox_C_OnBackUpSaveEntryClicked) == 0x000018, "Wrong size on WBP_MM_BackupSavesBox_C_OnBackUpSaveEntryClicked");
static_assert(offsetof(WBP_MM_BackupSavesBox_C_OnBackUpSaveEntryClicked, BackUpSaveEntry) == 0x000000, "Member 'WBP_MM_BackupSavesBox_C_OnBackUpSaveEntryClicked::BackUpSaveEntry' has a wrong offset!");
static_assert(offsetof(WBP_MM_BackupSavesBox_C_OnBackUpSaveEntryClicked, CallFunc_GetBackUpSave_BackUpSave) == 0x000008, "Member 'WBP_MM_BackupSavesBox_C_OnBackUpSaveEntryClicked::CallFunc_GetBackUpSave_BackUpSave' has a wrong offset!");

// Function WBP_MM_BackupSavesBox.WBP_MM_BackupSavesBox_C.OnBackUpSaveEntryFocused
// 0x0018 (0x0018 - 0x0000)
struct WBP_MM_BackupSavesBox_C_OnBackUpSaveEntryFocused final
{
public:
	class UWBP_MM_BackupSaveEntry_C*              BackUpSaveEntry;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetBackUpSave_BackUpSave;                 // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MM_BackupSavesBox_C_OnBackUpSaveEntryFocused) == 0x000008, "Wrong alignment on WBP_MM_BackupSavesBox_C_OnBackUpSaveEntryFocused");
static_assert(sizeof(WBP_MM_BackupSavesBox_C_OnBackUpSaveEntryFocused) == 0x000018, "Wrong size on WBP_MM_BackupSavesBox_C_OnBackUpSaveEntryFocused");
static_assert(offsetof(WBP_MM_BackupSavesBox_C_OnBackUpSaveEntryFocused, BackUpSaveEntry) == 0x000000, "Member 'WBP_MM_BackupSavesBox_C_OnBackUpSaveEntryFocused::BackUpSaveEntry' has a wrong offset!");
static_assert(offsetof(WBP_MM_BackupSavesBox_C_OnBackUpSaveEntryFocused, CallFunc_GetBackUpSave_BackUpSave) == 0x000008, "Member 'WBP_MM_BackupSavesBox_C_OnBackUpSaveEntryFocused::CallFunc_GetBackUpSave_BackUpSave' has a wrong offset!");

// Function WBP_MM_BackupSavesBox.WBP_MM_BackupSavesBox_C.SetBackUpSaves
// 0x0088 (0x0088 - 0x0000)
struct WBP_MM_BackupSavesBox_C_SetBackUpSaves final
{
public:
	TArray<class FString>                         BackupSaveStrings;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class UBP_SaveGameData_C*>             BackupSaveDatas;                                   // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_SaveGameData_C*                     CallFunc_Array_Get_Item_1;                         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_MM_BackupSaveEntry_C* BackUpSaveEntry)> K2Node_CreateDelegate_OutputDelegate; // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UWBP_MM_BackupSaveEntry_C* BackUpSaveEntry)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_MM_BackupSaveEntry_C*              CallFunc_BP_CreateEntryOfClass_ReturnValue;        // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MM_BackupSavesBox_C_SetBackUpSaves) == 0x000008, "Wrong alignment on WBP_MM_BackupSavesBox_C_SetBackUpSaves");
static_assert(sizeof(WBP_MM_BackupSavesBox_C_SetBackUpSaves) == 0x000088, "Wrong size on WBP_MM_BackupSavesBox_C_SetBackUpSaves");
static_assert(offsetof(WBP_MM_BackupSavesBox_C_SetBackUpSaves, BackupSaveStrings) == 0x000000, "Member 'WBP_MM_BackupSavesBox_C_SetBackUpSaves::BackupSaveStrings' has a wrong offset!");
static_assert(offsetof(WBP_MM_BackupSavesBox_C_SetBackUpSaves, BackupSaveDatas) == 0x000010, "Member 'WBP_MM_BackupSavesBox_C_SetBackUpSaves::BackupSaveDatas' has a wrong offset!");
static_assert(offsetof(WBP_MM_BackupSavesBox_C_SetBackUpSaves, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WBP_MM_BackupSavesBox_C_SetBackUpSaves::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MM_BackupSavesBox_C_SetBackUpSaves, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'WBP_MM_BackupSavesBox_C_SetBackUpSaves::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_BackupSavesBox_C_SetBackUpSaves, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_MM_BackupSavesBox_C_SetBackUpSaves::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MM_BackupSavesBox_C_SetBackUpSaves, CallFunc_Subtract_IntInt_ReturnValue) == 0x000038, "Member 'WBP_MM_BackupSavesBox_C_SetBackUpSaves::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_BackupSavesBox_C_SetBackUpSaves, CallFunc_IsEmpty_ReturnValue) == 0x00003C, "Member 'WBP_MM_BackupSavesBox_C_SetBackUpSaves::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_BackupSavesBox_C_SetBackUpSaves, CallFunc_Max_ReturnValue) == 0x000040, "Member 'WBP_MM_BackupSavesBox_C_SetBackUpSaves::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_BackupSavesBox_C_SetBackUpSaves, CallFunc_Not_PreBool_ReturnValue) == 0x000044, "Member 'WBP_MM_BackupSavesBox_C_SetBackUpSaves::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_BackupSavesBox_C_SetBackUpSaves, CallFunc_Array_Get_Item_1) == 0x000048, "Member 'WBP_MM_BackupSavesBox_C_SetBackUpSaves::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_MM_BackupSavesBox_C_SetBackUpSaves, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000050, "Member 'WBP_MM_BackupSavesBox_C_SetBackUpSaves::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_BackupSavesBox_C_SetBackUpSaves, Temp_int_Loop_Counter_Variable) == 0x000054, "Member 'WBP_MM_BackupSavesBox_C_SetBackUpSaves::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MM_BackupSavesBox_C_SetBackUpSaves, K2Node_CreateDelegate_OutputDelegate) == 0x000058, "Member 'WBP_MM_BackupSavesBox_C_SetBackUpSaves::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MM_BackupSavesBox_C_SetBackUpSaves, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000068, "Member 'WBP_MM_BackupSavesBox_C_SetBackUpSaves::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MM_BackupSavesBox_C_SetBackUpSaves, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00006C, "Member 'WBP_MM_BackupSavesBox_C_SetBackUpSaves::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_BackupSavesBox_C_SetBackUpSaves, K2Node_CreateDelegate_OutputDelegate_1) == 0x000070, "Member 'WBP_MM_BackupSavesBox_C_SetBackUpSaves::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_MM_BackupSavesBox_C_SetBackUpSaves, CallFunc_BP_CreateEntryOfClass_ReturnValue) == 0x000080, "Member 'WBP_MM_BackupSavesBox_C_SetBackUpSaves::CallFunc_BP_CreateEntryOfClass_ReturnValue' has a wrong offset!");

// Function WBP_MM_BackupSavesBox.WBP_MM_BackupSavesBox_C.BP_GetDesiredFocusTarget
// 0x0038 (0x0038 - 0x0000)
struct WBP_MM_BackupSavesBox_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    CallFunc_GetAllEntries_ReturnValue;                // 0x0008(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_MM_BackupSaveEntry_C*              K2Node_DynamicCast_AsWBP_MM_Backup_Save_Entry;     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MM_BackupSavesBox_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_MM_BackupSavesBox_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_MM_BackupSavesBox_C_BP_GetDesiredFocusTarget) == 0x000038, "Wrong size on WBP_MM_BackupSavesBox_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_MM_BackupSavesBox_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_MM_BackupSavesBox_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_BackupSavesBox_C_BP_GetDesiredFocusTarget, CallFunc_GetAllEntries_ReturnValue) == 0x000008, "Member 'WBP_MM_BackupSavesBox_C_BP_GetDesiredFocusTarget::CallFunc_GetAllEntries_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_BackupSavesBox_C_BP_GetDesiredFocusTarget, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000018, "Member 'WBP_MM_BackupSavesBox_C_BP_GetDesiredFocusTarget::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MM_BackupSavesBox_C_BP_GetDesiredFocusTarget, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_MM_BackupSavesBox_C_BP_GetDesiredFocusTarget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MM_BackupSavesBox_C_BP_GetDesiredFocusTarget, K2Node_DynamicCast_AsWBP_MM_Backup_Save_Entry) == 0x000028, "Member 'WBP_MM_BackupSavesBox_C_BP_GetDesiredFocusTarget::K2Node_DynamicCast_AsWBP_MM_Backup_Save_Entry' has a wrong offset!");
static_assert(offsetof(WBP_MM_BackupSavesBox_C_BP_GetDesiredFocusTarget, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_MM_BackupSavesBox_C_BP_GetDesiredFocusTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

