#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SortDropdown

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BlueprintSorting_structs.hpp"
#include "S_SortDropdownEntry_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SortDropdown.WBP_SortDropdown_C
// 0x00A8 (0x04D8 - 0x0430)
class UWBP_SortDropdown_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_BackgroundExpand;                             // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_InputActionBinding_C*              DirectionInputActionBinding;                       // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UExpandableArea*                        Dropdown;                                          // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       DropdownBackground;                                // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDynamicEntryBox*                       DropdownContent;                                   // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BaseButton_C*                      FocusAndDirectionHandler;                          // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BaseButton_C*                      HeaderButton;                                      // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WrappingText_C*                    HeaderText;                                        // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SortDirectionText;                                 // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InputActionBinding_C*              ToggleInputActionBinding;                          // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FS_SortDropdownEntry>           DropdownEntries;                                   // 0x0488(0x0010)(Edit, BlueprintVisible)
	struct FS_SortDropdownEntry                   ActiveDropdownEntry;                               // 0x0498(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	ESortDirection                                SortDirection;                                     // 0x04B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnActiveDropdownEntryChanged;                      // 0x04B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnSortDirectionChanged;                            // 0x04C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void CREATEDELEGATE_PROXYFUNCTION_0(const struct FS_SortDropdownEntry& SortDropdownEntry);
	void GetSortDirection(ESortDirection* SortDirection_0);
	void ToggleSortDirection();
	void SetActiveDropdownEntry(struct FS_SortDropdownEntry& InSortDropdownEntry);
	void GetActiveDropdownEntry(struct FS_SortDropdownEntry* ActiveDropdownEntry_0);
	void InitializeDropdownEntries();
	void BndEvt__WBP_SortDropdown_HeaderButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnDeactivated();
	void Construct();
	void BP_OnActivated();
	void OnRolloutAnimationFinished();
	void BndEvt__WBP_SortDropdown_FocusHandler_K2Node_ComponentBoundEvent_3_OnButtonBaseFocused__DelegateSignature(class UCommonButtonBase* Button);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void BndEvt__WBP_SortDropdown_FocusAndDirectionHandler_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_SortDropdown_HeaderButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature(class UCommonButtonBase* Button, bool Selected);
	void ExecuteUbergraph_WBP_SortDropdown(int32 EntryPoint);

	void GetActiveDropdownEntryWidget(class UWBP_SortDropdownEntry_C** AsWBP_Sort_Dropdown_Entry) const;
	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SortDropdown_C">();
	}
	static class UWBP_SortDropdown_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SortDropdown_C>();
	}
};
static_assert(alignof(UWBP_SortDropdown_C) == 0x000008, "Wrong alignment on UWBP_SortDropdown_C");
static_assert(sizeof(UWBP_SortDropdown_C) == 0x0004D8, "Wrong size on UWBP_SortDropdown_C");
static_assert(offsetof(UWBP_SortDropdown_C, UberGraphFrame) == 0x000430, "Member 'UWBP_SortDropdown_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SortDropdown_C, Anim_BackgroundExpand) == 0x000438, "Member 'UWBP_SortDropdown_C::Anim_BackgroundExpand' has a wrong offset!");
static_assert(offsetof(UWBP_SortDropdown_C, DirectionInputActionBinding) == 0x000440, "Member 'UWBP_SortDropdown_C::DirectionInputActionBinding' has a wrong offset!");
static_assert(offsetof(UWBP_SortDropdown_C, Dropdown) == 0x000448, "Member 'UWBP_SortDropdown_C::Dropdown' has a wrong offset!");
static_assert(offsetof(UWBP_SortDropdown_C, DropdownBackground) == 0x000450, "Member 'UWBP_SortDropdown_C::DropdownBackground' has a wrong offset!");
static_assert(offsetof(UWBP_SortDropdown_C, DropdownContent) == 0x000458, "Member 'UWBP_SortDropdown_C::DropdownContent' has a wrong offset!");
static_assert(offsetof(UWBP_SortDropdown_C, FocusAndDirectionHandler) == 0x000460, "Member 'UWBP_SortDropdown_C::FocusAndDirectionHandler' has a wrong offset!");
static_assert(offsetof(UWBP_SortDropdown_C, HeaderButton) == 0x000468, "Member 'UWBP_SortDropdown_C::HeaderButton' has a wrong offset!");
static_assert(offsetof(UWBP_SortDropdown_C, HeaderText) == 0x000470, "Member 'UWBP_SortDropdown_C::HeaderText' has a wrong offset!");
static_assert(offsetof(UWBP_SortDropdown_C, SortDirectionText) == 0x000478, "Member 'UWBP_SortDropdown_C::SortDirectionText' has a wrong offset!");
static_assert(offsetof(UWBP_SortDropdown_C, ToggleInputActionBinding) == 0x000480, "Member 'UWBP_SortDropdown_C::ToggleInputActionBinding' has a wrong offset!");
static_assert(offsetof(UWBP_SortDropdown_C, DropdownEntries) == 0x000488, "Member 'UWBP_SortDropdown_C::DropdownEntries' has a wrong offset!");
static_assert(offsetof(UWBP_SortDropdown_C, ActiveDropdownEntry) == 0x000498, "Member 'UWBP_SortDropdown_C::ActiveDropdownEntry' has a wrong offset!");
static_assert(offsetof(UWBP_SortDropdown_C, SortDirection) == 0x0004B0, "Member 'UWBP_SortDropdown_C::SortDirection' has a wrong offset!");
static_assert(offsetof(UWBP_SortDropdown_C, OnActiveDropdownEntryChanged) == 0x0004B8, "Member 'UWBP_SortDropdown_C::OnActiveDropdownEntryChanged' has a wrong offset!");
static_assert(offsetof(UWBP_SortDropdown_C, OnSortDirectionChanged) == 0x0004C8, "Member 'UWBP_SortDropdown_C::OnSortDirectionChanged' has a wrong offset!");

}

