#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LuminaNameItem

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_LuminaNameItem.WBP_LuminaNameItem_C.SetText
// 0x0078 (0x0078 - 0x0000)
struct WBP_LuminaNameItem_C_SetText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0010(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0068(0x0010)()
};
static_assert(alignof(WBP_LuminaNameItem_C_SetText) == 0x000008, "Wrong alignment on WBP_LuminaNameItem_C_SetText");
static_assert(sizeof(WBP_LuminaNameItem_C_SetText) == 0x000078, "Wrong size on WBP_LuminaNameItem_C_SetText");
static_assert(offsetof(WBP_LuminaNameItem_C_SetText, InText) == 0x000000, "Member 'WBP_LuminaNameItem_C_SetText::InText' has a wrong offset!");
static_assert(offsetof(WBP_LuminaNameItem_C_SetText, K2Node_MakeStruct_FormatArgumentData) == 0x000010, "Member 'WBP_LuminaNameItem_C_SetText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_LuminaNameItem_C_SetText, K2Node_MakeArray_Array) == 0x000058, "Member 'WBP_LuminaNameItem_C_SetText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_LuminaNameItem_C_SetText, CallFunc_Format_ReturnValue) == 0x000068, "Member 'WBP_LuminaNameItem_C_SetText::CallFunc_Format_ReturnValue' has a wrong offset!");

}

