#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_SkillList_Active

#include "Basic.hpp"

#include "EBattleForbiddenActionReason_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_HUD_SkillList-Active.WBP_HUD_SkillList-Active_C.ExecuteUbergraph_WBP_HUD_SkillList-Active
// 0x0218 (0x0218 - 0x0000)
struct WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_HUD_SkillButton_Big_C* Button)> K2Node_CreateDelegate_OutputDelegate;  // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_HUD_SkillButton_Big_C*>     CallFunc_GetAllButtons_Array;                      // 0x0068(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_HUD_SkillButton_Big_C*             CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_HUD_SkillButton_Big_C*>     CallFunc_GetAllButtons_Array_1;                    // 0x0088(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_HUD_SkillButton_Big_C*             CallFunc_Array_Get_Item_1;                         // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsButtonEnabled_ReturnValue;              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Active;                         // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue;              // 0x00B8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00C8(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0118(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class UWBP_HUD_SkillButton_Big_C*>     CallFunc_GetAllButtons_Array_2;                    // 0x0138(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_HUD_SkillButton_Big_C*             K2Node_CustomEvent_Button_1;                       // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_HUD_SkillButton_Big_C*             CallFunc_Array_Get_Item_2;                         // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue;               // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EBattleForbiddenActionReason                  K2Node_CustomEvent_ForbiddenReason;                // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_HUD_SkillButton_Big_C*             K2Node_CustomEvent_Button;                         // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_HUD_SkillButton_Big_C*>     CallFunc_GetAllButtons_Array_3;                    // 0x0188(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_HUD_SkillButton_Big_C*             CallFunc_Array_Get_Item_3;                         // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_HUD_SkillButton_Big_C*>     CallFunc_GetAllButtons_Array_4;                    // 0x01A8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_HUD_SkillButton_Big_C*             CallFunc_Array_Get_Item_4;                         // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x01C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C6[0x2];                                      // 0x01C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EBattleForbiddenActionReason ForbiddenReason, class UWBP_HUD_SkillButton_Big_C* Button)> K2Node_CreateDelegate_OutputDelegate_1; // 0x01C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Visible;                        // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_HUD_SkillButton_Big_C*>     CallFunc_GetAllButtons_Array_5;                    // 0x01E0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_HUD_SkillButton_Big_C*             CallFunc_Array_Get_Item_5;                         // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FD[0x3];                                      // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_HUD_SkillButton_Big_C*>     CallFunc_GetAllButtons_Array_6;                    // 0x0200(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active) == 0x000008, "Wrong alignment on WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active");
static_assert(sizeof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active) == 0x000218, "Wrong size on WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, EntryPoint) == 0x000000, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, Temp_int_Variable) == 0x000004, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, Temp_int_Variable_1) == 0x00001C, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_Add_IntInt_ReturnValue_1) == 0x000020, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, Temp_int_Array_Index_Variable) == 0x000024, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_Add_IntInt_ReturnValue_2) == 0x00002C, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, Temp_int_Loop_Counter_Variable_1) == 0x000030, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, Temp_int_Loop_Counter_Variable_2) == 0x000034, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_Add_IntInt_ReturnValue_3) == 0x000038, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_Add_IntInt_ReturnValue_4) == 0x00003C, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, Temp_int_Array_Index_Variable_1) == 0x000040, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, Temp_int_Array_Index_Variable_2) == 0x000044, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, Temp_int_Loop_Counter_Variable_3) == 0x000048, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_Add_IntInt_ReturnValue_5) == 0x00004C, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, Temp_int_Array_Index_Variable_3) == 0x000050, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, K2Node_Event_IsDesignTime) == 0x000054, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_PlayAnimation_ReturnValue) == 0x000058, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_PlayAnimation_ReturnValue_1) == 0x000060, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_GetAllButtons_Array) == 0x000068, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_GetAllButtons_Array' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_Array_Get_Item) == 0x000078, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_GetAllButtons_Array_1) == 0x000088, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_GetAllButtons_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_Less_IntInt_ReturnValue) == 0x000098, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_Array_Get_Item_1) == 0x0000A0, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_IsButtonEnabled_ReturnValue) == 0x0000A8, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_IsButtonEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_Array_Length_ReturnValue_1) == 0x0000AC, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, K2Node_CustomEvent_Active) == 0x0000B0, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::K2Node_CustomEvent_Active' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000B1, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_Conv_BoolToText_ReturnValue) == 0x0000B8, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_Conv_BoolToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, K2Node_MakeStruct_FormatArgumentData) == 0x0000C8, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_BooleanAND_ReturnValue) == 0x000110, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, K2Node_MakeArray_Array) == 0x000118, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_Format_ReturnValue) == 0x000128, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_GetAllButtons_Array_2) == 0x000138, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_GetAllButtons_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, K2Node_CustomEvent_Button_1) == 0x000148, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::K2Node_CustomEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_Array_Get_Item_2) == 0x000150, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_Array_Length_ReturnValue_2) == 0x000158, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_Less_IntInt_ReturnValue_2) == 0x00015C, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_PlayAnimation_ReturnValue_2) == 0x000160, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_PauseAnimation_ReturnValue) == 0x000168, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_PauseAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_PlayAnimation_ReturnValue_3) == 0x000170, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, K2Node_CustomEvent_ForbiddenReason) == 0x000178, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::K2Node_CustomEvent_ForbiddenReason' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, K2Node_CustomEvent_Button) == 0x000180, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_GetAllButtons_Array_3) == 0x000188, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_GetAllButtons_Array_3' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_Array_Get_Item_3) == 0x000198, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_Array_Length_ReturnValue_3) == 0x0001A0, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_Less_IntInt_ReturnValue_3) == 0x0001A4, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_GetAllButtons_Array_4) == 0x0001A8, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_GetAllButtons_Array_4' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_Array_Get_Item_4) == 0x0001B8, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_Array_Length_ReturnValue_4) == 0x0001C0, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0001C4, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_Less_IntInt_ReturnValue_4) == 0x0001C5, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001C8, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, K2Node_CustomEvent_Visible) == 0x0001D8, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::K2Node_CustomEvent_Visible' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_GetAllButtons_Array_5) == 0x0001E0, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_GetAllButtons_Array_5' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_Array_Get_Item_5) == 0x0001F0, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_Array_Length_ReturnValue_5) == 0x0001F8, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_Less_IntInt_ReturnValue_5) == 0x0001FC, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_Less_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_GetAllButtons_Array_6) == 0x000200, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_GetAllButtons_Array_6' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active, CallFunc_Array_Find_ReturnValue) == 0x000210, "Member 'WBP_HUD_SkillList_Active_C_ExecuteUbergraph_WBP_HUD_SkillList_Active::CallFunc_Array_Find_ReturnValue' has a wrong offset!");

// Function WBP_HUD_SkillList-Active.WBP_HUD_SkillList-Active_C.FindButtonBySkill
// 0x0040 (0x0040 - 0x0000)
struct WBP_HUD_SkillList_Active_C_FindButtonBySkill final
{
public:
	class UBP_DataAsset_Skill_C*                  SkillDefinition;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_HUD_SkillButton_Big_C*             SkillButton;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_HUD_SkillButton_Big_C*>     CallFunc_GetAllButtons_Array;                      // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_HUD_SkillButton_Big_C*             CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualsObjects_ReturnValue;                // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37[0x1];                                       // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_SkillList_Active_C_FindButtonBySkill) == 0x000008, "Wrong alignment on WBP_HUD_SkillList_Active_C_FindButtonBySkill");
static_assert(sizeof(WBP_HUD_SkillList_Active_C_FindButtonBySkill) == 0x000040, "Wrong size on WBP_HUD_SkillList_Active_C_FindButtonBySkill");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_FindButtonBySkill, SkillDefinition) == 0x000000, "Member 'WBP_HUD_SkillList_Active_C_FindButtonBySkill::SkillDefinition' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_FindButtonBySkill, SkillButton) == 0x000008, "Member 'WBP_HUD_SkillList_Active_C_FindButtonBySkill::SkillButton' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_FindButtonBySkill, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_HUD_SkillList_Active_C_FindButtonBySkill::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_FindButtonBySkill, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_HUD_SkillList_Active_C_FindButtonBySkill::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_FindButtonBySkill, CallFunc_GetAllButtons_Array) == 0x000018, "Member 'WBP_HUD_SkillList_Active_C_FindButtonBySkill::CallFunc_GetAllButtons_Array' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_FindButtonBySkill, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_HUD_SkillList_Active_C_FindButtonBySkill::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_FindButtonBySkill, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WBP_HUD_SkillList_Active_C_FindButtonBySkill::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_FindButtonBySkill, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'WBP_HUD_SkillList_Active_C_FindButtonBySkill::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_FindButtonBySkill, CallFunc_IsValid_ReturnValue) == 0x000035, "Member 'WBP_HUD_SkillList_Active_C_FindButtonBySkill::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_FindButtonBySkill, CallFunc_EqualsObjects_ReturnValue) == 0x000036, "Member 'WBP_HUD_SkillList_Active_C_FindButtonBySkill::CallFunc_EqualsObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_FindButtonBySkill, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'WBP_HUD_SkillList_Active_C_FindButtonBySkill::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_HUD_SkillList-Active.WBP_HUD_SkillList-Active_C.GetAllButtons
// 0x0020 (0x0020 - 0x0000)
struct WBP_HUD_SkillList_Active_C_GetAllButtons final
{
public:
	TArray<class UWBP_HUD_SkillButton_Big_C*>     Array;                                             // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UWBP_HUD_SkillButton_Big_C*>     K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_HUD_SkillList_Active_C_GetAllButtons) == 0x000008, "Wrong alignment on WBP_HUD_SkillList_Active_C_GetAllButtons");
static_assert(sizeof(WBP_HUD_SkillList_Active_C_GetAllButtons) == 0x000020, "Wrong size on WBP_HUD_SkillList_Active_C_GetAllButtons");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_GetAllButtons, Array) == 0x000000, "Member 'WBP_HUD_SkillList_Active_C_GetAllButtons::Array' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_GetAllButtons, K2Node_MakeArray_Array) == 0x000010, "Member 'WBP_HUD_SkillList_Active_C_GetAllButtons::K2Node_MakeArray_Array' has a wrong offset!");

// Function WBP_HUD_SkillList-Active.WBP_HUD_SkillList-Active_C.IsButtonEnabled
// 0x0010 (0x0010 - 0x0000)
struct WBP_HUD_SkillList_Active_C_IsButtonEnabled final
{
public:
	const class UWBP_HUD_SkillButton_Big_C*       Button;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_Value;                           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_SkillList_Active_C_IsButtonEnabled) == 0x000008, "Wrong alignment on WBP_HUD_SkillList_Active_C_IsButtonEnabled");
static_assert(sizeof(WBP_HUD_SkillList_Active_C_IsButtonEnabled) == 0x000010, "Wrong size on WBP_HUD_SkillList_Active_C_IsButtonEnabled");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_IsButtonEnabled, Button) == 0x000000, "Member 'WBP_HUD_SkillList_Active_C_IsButtonEnabled::Button' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_IsButtonEnabled, ReturnValue) == 0x000008, "Member 'WBP_HUD_SkillList_Active_C_IsButtonEnabled::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_IsButtonEnabled, CallFunc_Map_Find_Value) == 0x000009, "Member 'WBP_HUD_SkillList_Active_C_IsButtonEnabled::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_IsButtonEnabled, CallFunc_Map_Find_ReturnValue) == 0x00000A, "Member 'WBP_HUD_SkillList_Active_C_IsButtonEnabled::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function WBP_HUD_SkillList-Active.WBP_HUD_SkillList-Active_C.LoadSkillsData
// 0x0190 (0x0190 - 0x0000)
struct WBP_HUD_SkillList_Active_C_LoadSkillsData final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        CharacterStats;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_DataAsset_Skill_C*>          Skills;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         local_skillCost;                                   // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_SkillState_C*                       local_skillState;                                  // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_CharacterBattleStats_C*        local_characterStats;                              // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          local_canSpendAP;                                  // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DataAsset_Skill_C*                  local_currentSkillAsset;                           // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EBattleForbiddenActionReason                  Temp_byte_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattleForbiddenActionReason                  Temp_byte_Variable_1;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0049(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DataAsset_Skill_C*                  CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSkillCost_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0088(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0098(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue;             // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSkillsPerColumn_ReturnValue;           // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanAffordCharges_ReturnValue;             // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanSpendAP_ReturnValue;                   // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0113(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattleForbiddenActionReason                  K2Node_Select_Default;                             // 0x0116(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_117[0x1];                                      // 0x0117(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_ObjectToString_ReturnValue;          // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0128(0x0010)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_SkillState_C*                       CallFunc_GetSkillState_Value;                      // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_1;                           // 0x0148(0x0010)()
	bool                                          Temp_bool_Variable_4;                              // 0x0158(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15B[0x5];                                      // 0x015B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_2;                           // 0x0160(0x0010)()
	TArray<class UWBP_HUD_SkillButton_Big_C*>     CallFunc_GetAllButtons_Array;                      // 0x0170(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_HUD_SkillButton_Big_C*             CallFunc_Array_Get_Item_1;                         // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_SkillList_Active_C_LoadSkillsData) == 0x000008, "Wrong alignment on WBP_HUD_SkillList_Active_C_LoadSkillsData");
static_assert(sizeof(WBP_HUD_SkillList_Active_C_LoadSkillsData) == 0x000190, "Wrong size on WBP_HUD_SkillList_Active_C_LoadSkillsData");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, CharacterStats) == 0x000000, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::CharacterStats' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, Skills) == 0x000008, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::Skills' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, local_skillCost) == 0x000018, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::local_skillCost' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, local_skillState) == 0x000020, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::local_skillState' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, local_characterStats) == 0x000028, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::local_characterStats' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, local_canSpendAP) == 0x000030, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::local_canSpendAP' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, local_currentSkillAsset) == 0x000038, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::local_currentSkillAsset' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, Temp_byte_Variable) == 0x000040, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, Temp_byte_Variable_1) == 0x000048, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, Temp_bool_Variable) == 0x000049, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, Temp_int_Array_Index_Variable) == 0x000054, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, Temp_bool_Variable_1) == 0x000058, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, CallFunc_Array_Get_Item) == 0x000060, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000068, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, CallFunc_GetDisplayName_ReturnValue) == 0x000070, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, CallFunc_GetSkillCost_ReturnValue) == 0x000080, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::CallFunc_GetSkillCost_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, CallFunc_Conv_StringToText_ReturnValue) == 0x000088, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, K2Node_MakeStruct_FormatArgumentData) == 0x000098, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, K2Node_MakeArray_Array) == 0x0000E0, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, CallFunc_Format_ReturnValue) == 0x0000F0, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, CallFunc_GetBattleManager_ReturnValue) == 0x000100, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, Temp_bool_Variable_2) == 0x000108, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, CallFunc_GetSkillsPerColumn_ReturnValue) == 0x00010C, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::CallFunc_GetSkillsPerColumn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, CallFunc_CanAffordCharges_ReturnValue) == 0x000110, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::CallFunc_CanAffordCharges_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000111, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, CallFunc_CanSpendAP_ReturnValue) == 0x000112, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::CallFunc_CanSpendAP_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, K2Node_SwitchEnum_CmpSuccess) == 0x000113, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, Temp_bool_Variable_3) == 0x000114, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, CallFunc_IsValid_ReturnValue) == 0x000115, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, K2Node_Select_Default) == 0x000116, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, CallFunc_Conv_ObjectToString_ReturnValue) == 0x000118, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::CallFunc_Conv_ObjectToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000128, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, CallFunc_TextIsEmpty_ReturnValue) == 0x000138, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, CallFunc_GetSkillState_Value) == 0x000140, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::CallFunc_GetSkillState_Value' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, K2Node_Select_Default_1) == 0x000148, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, Temp_bool_Variable_4) == 0x000158, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, CallFunc_TextIsEmpty_ReturnValue_1) == 0x000159, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::CallFunc_TextIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, CallFunc_IsValid_ReturnValue_1) == 0x00015A, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, K2Node_Select_Default_2) == 0x000160, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, CallFunc_GetAllButtons_Array) == 0x000170, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::CallFunc_GetAllButtons_Array' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, CallFunc_Array_Get_Item_1) == 0x000180, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, CallFunc_Array_Length_ReturnValue_1) == 0x000188, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_SkillList_Active_C_LoadSkillsData, CallFunc_Less_IntInt_ReturnValue) == 0x00018C, "Member 'WBP_HUD_SkillList_Active_C_LoadSkillsData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_HUD_SkillList-Active.WBP_HUD_SkillList-Active_C.OnSkillButtonClicked
// 0x0008 (0x0008 - 0x0000)
