#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GM_COV_LuminaPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "E_jRPG_StatType_structs.hpp"
#include "BlueprintSorting_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GM_COV_LuminaPanel.WBP_GM_COV_LuminaPanel_C
// 0x0068 (0x0370 - 0x0308)
class UWBP_GM_COV_LuminaPanel_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonLazyImage*                       Background;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       BottomLeftLine;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonListView*                        LuminaListView;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GM_LuminaPoints_C*                 WBP_GM_LuminaPoints;                               // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class FName InPassiveEffectID)> OnLuminaEntryClicked;              // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UCommonButtonBase* Button)> OnLuminaEntryFocused;            // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UBP_PassiveEffectInstance_C* LuminaLhs, class UBP_PassiveEffectInstance_C* LuminaRhs, class UOrderingResult* OrderingResult)> Dummy_SortLuminas; // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UBP_PassiveEffectInstance_C*>    PictosPassiveEffectsInstances;                     // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void SortPictosPassiveEffectInstances(class UBP_CharacterData_C* CharacterData);
	void ScrollToPassiveEffect(class FName PassiveEffectID);
	void LuminasSortLambda(class UBP_PassiveEffectInstance_C* LuminaLhs, class UBP_PassiveEffectInstance_C* LuminaRhs, class UOrderingResult* OrderingResult);
	void ResetLuminaNavigation();
	void LoadCharacterData(class UBP_CharacterData_C* InCharacterData);
	void BndEvt__WBP_GM_COV_LuminaPanel_LuminaListView_K2Node_ComponentBoundEvent_2_OnListEntryInitializedDynamic__DelegateSignature(class UObject* Item, class UUserWidget* Widget);
	void OnLuminaElementShortClicked(class FName PassiveEffectID);
	void OnLuminaElementShortFocused(class UCommonButtonBase* Button);
	void OnLuminaElementShortUnfocused(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WBP_GM_COV_LuminaPanel(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GM_COV_LuminaPanel_C">();
	}
	static class UWBP_GM_COV_LuminaPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GM_COV_LuminaPanel_C>();
	}
};
static_assert(alignof(UWBP_GM_COV_LuminaPanel_C) == 0x000008, "Wrong alignment on UWBP_GM_COV_LuminaPanel_C");
static_assert(sizeof(UWBP_GM_COV_LuminaPanel_C) == 0x000370, "Wrong size on UWBP_GM_COV_LuminaPanel_C");
static_assert(offsetof(UWBP_GM_COV_LuminaPanel_C, UberGraphFrame) == 0x000308, "Member 'UWBP_GM_COV_LuminaPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GM_COV_LuminaPanel_C, Background) == 0x000310, "Member 'UWBP_GM_COV_LuminaPanel_C::Background' has a wrong offset!");
static_assert(offsetof(UWBP_GM_COV_LuminaPanel_C, BottomLeftLine) == 0x000318, "Member 'UWBP_GM_COV_LuminaPanel_C::BottomLeftLine' has a wrong offset!");
static_assert(offsetof(UWBP_GM_COV_LuminaPanel_C, LuminaListView) == 0x000320, "Member 'UWBP_GM_COV_LuminaPanel_C::LuminaListView' has a wrong offset!");
static_assert(offsetof(UWBP_GM_COV_LuminaPanel_C, WBP_GM_LuminaPoints) == 0x000328, "Member 'UWBP_GM_COV_LuminaPanel_C::WBP_GM_LuminaPoints' has a wrong offset!");
static_assert(offsetof(UWBP_GM_COV_LuminaPanel_C, OnLuminaEntryClicked) == 0x000330, "Member 'UWBP_GM_COV_LuminaPanel_C::OnLuminaEntryClicked' has a wrong offset!");
static_assert(offsetof(UWBP_GM_COV_LuminaPanel_C, OnLuminaEntryFocused) == 0x000340, "Member 'UWBP_GM_COV_LuminaPanel_C::OnLuminaEntryFocused' has a wrong offset!");
static_assert(offsetof(UWBP_GM_COV_LuminaPanel_C, Dummy_SortLuminas) == 0x000350, "Member 'UWBP_GM_COV_LuminaPanel_C::Dummy_SortLuminas' has a wrong offset!");
static_assert(offsetof(UWBP_GM_COV_LuminaPanel_C, PictosPassiveEffectsInstances) == 0x000360, "Member 'UWBP_GM_COV_LuminaPanel_C::PictosPassiveEffectsInstances' has a wrong offset!");

}

