#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ContextualActions

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_ContextualActions.WBP_ContextualActions_C.DisableInputs
// 0x0038 (0x0038 - 0x0000)
struct WBP_ContextualActions_C_DisableInputs final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_GM_PromptGeneric_C*>        CallFunc_Map_Values_Values;                        // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GM_PromptGeneric_C*                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ContextualActions_C_DisableInputs) == 0x000008, "Wrong alignment on WBP_ContextualActions_C_DisableInputs");
static_assert(sizeof(WBP_ContextualActions_C_DisableInputs) == 0x000038, "Wrong size on WBP_ContextualActions_C_DisableInputs");
static_assert(offsetof(WBP_ContextualActions_C_DisableInputs, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_ContextualActions_C_DisableInputs::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ContextualActions_C_DisableInputs, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_ContextualActions_C_DisableInputs::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ContextualActions_C_DisableInputs, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_ContextualActions_C_DisableInputs::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ContextualActions_C_DisableInputs, CallFunc_Map_Values_Values) == 0x000010, "Member 'WBP_ContextualActions_C_DisableInputs::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(WBP_ContextualActions_C_DisableInputs, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_ContextualActions_C_DisableInputs::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ContextualActions_C_DisableInputs, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_ContextualActions_C_DisableInputs::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ContextualActions_C_DisableInputs, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WBP_ContextualActions_C_DisableInputs::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_ContextualActions.WBP_ContextualActions_C.ExecuteUbergraph_WBP_ContextualActions
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UCommonUIHoldData>          Temp_class_Variable;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCommonUIHoldData>          Temp_class_Variable_1;                             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UWBP_GM_PromptGeneric_C*                K2Node_CustomEvent_PromptWidget;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FDataTableRowHandle>            K2Node_CustomEvent_TriggeringInputAction;          // 0x0058(0x0010)(ConstParm, ReferenceParm)
	TArray<class FText>                           K2Node_CustomEvent_ActionTexts;                    // 0x0068(0x0010)(ConstParm, ReferenceParm)
	TArray<bool>                                  K2Node_CustomEvent_ActionAllowed;                  // 0x0078(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(class UWBP_GM_PromptGeneric_C* PromptWidget)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    CallFunc_Array_Get_Item;                           // 0x0098(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AE[0x2];                                       // 0x00AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCommonUIHoldData>          K2Node_Select_Default;                             // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GM_PromptGeneric_C*                CallFunc_SpawnObject_ReturnValue;                  // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions) == 0x000008, "Wrong alignment on WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions");
static_assert(sizeof(WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions) == 0x0000D8, "Wrong size on WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions");
static_assert(offsetof(WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions, EntryPoint) == 0x000000, "Member 'WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions, Temp_class_Variable) == 0x000008, "Member 'WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions, Temp_class_Variable_1) == 0x000010, "Member 'WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions, K2Node_CustomEvent_PromptWidget) == 0x000018, "Member 'WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions::K2Node_CustomEvent_PromptWidget' has a wrong offset!");
static_assert(offsetof(WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions, Temp_bool_Variable) == 0x000020, "Member 'WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions, K2Node_CreateDelegate_OutputDelegate_1) == 0x000034, "Member 'WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions, CallFunc_PlayAnimation_ReturnValue) == 0x000048, "Member 'WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions, CallFunc_PlayAnimation_ReturnValue_1) == 0x000050, "Member 'WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions, K2Node_CustomEvent_TriggeringInputAction) == 0x000058, "Member 'WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions::K2Node_CustomEvent_TriggeringInputAction' has a wrong offset!");
static_assert(offsetof(WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions, K2Node_CustomEvent_ActionTexts) == 0x000068, "Member 'WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions::K2Node_CustomEvent_ActionTexts' has a wrong offset!");
static_assert(offsetof(WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions, K2Node_CustomEvent_ActionAllowed) == 0x000078, "Member 'WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions::K2Node_CustomEvent_ActionAllowed' has a wrong offset!");
static_assert(offsetof(WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions, K2Node_CreateDelegate_OutputDelegate_2) == 0x000088, "Member 'WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions, CallFunc_Array_Get_Item) == 0x000098, "Member 'WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions, CallFunc_Array_Length_ReturnValue) == 0x0000A8, "Member 'WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions, CallFunc_NotEqual_NameName_ReturnValue) == 0x0000AC, "Member 'WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000AD, "Member 'WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions, K2Node_Select_Default) == 0x0000B0, "Member 'WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions, Temp_int_Loop_Counter_Variable) == 0x0000B8, "Member 'WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions, CallFunc_Less_IntInt_ReturnValue) == 0x0000BC, "Member 'WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions, CallFunc_Add_IntInt_ReturnValue) == 0x0000C0, "Member 'WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions, CallFunc_SpawnObject_ReturnValue) == 0x0000C8, "Member 'WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x0000D0, "Member 'WBP_ContextualActions_C_ExecuteUbergraph_WBP_ContextualActions::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

// Function WBP_ContextualActions.WBP_ContextualActions_C.OnPromptClicked
// 0x0008 (0x0008 - 0x0000)
struct WBP_ContextualActions_C_OnPromptClicked final
{
public:
	class UWBP_GM_PromptGeneric_C*                PromptWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ContextualActions_C_OnPromptClicked) == 0x000008, "Wrong alignment on WBP_ContextualActions_C_OnPromptClicked");
static_assert(sizeof(WBP_ContextualActions_C_OnPromptClicked) == 0x000008, "Wrong size on WBP_ContextualActions_C_OnPromptClicked");
static_assert(offsetof(WBP_ContextualActions_C_OnPromptClicked, PromptWidget) == 0x000000, "Member 'WBP_ContextualActions_C_OnPromptClicked::PromptWidget' has a wrong offset!");

// Function WBP_ContextualActions.WBP_ContextualActions_C.SetActionsCommonUI
// 0x0030 (0x0030 - 0x0000)
struct WBP_ContextualActions_C_SetActionsCommonUI final
{
public:
	TArray<struct FDataTableRowHandle>            TriggeringInputAction;                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class FText>                           ActionTexts;                                       // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<bool>                                  ActionAllowed;                                     // 0x0020(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ContextualActions_C_SetActionsCommonUI) == 0x000008, "Wrong alignment on WBP_ContextualActions_C_SetActionsCommonUI");
static_assert(sizeof(WBP_ContextualActions_C_SetActionsCommonUI) == 0x000030, "Wrong size on WBP_ContextualActions_C_SetActionsCommonUI");
static_assert(offsetof(WBP_ContextualActions_C_SetActionsCommonUI, TriggeringInputAction) == 0x000000, "Member 'WBP_ContextualActions_C_SetActionsCommonUI::TriggeringInputAction' has a wrong offset!");
static_assert(offsetof(WBP_ContextualActions_C_SetActionsCommonUI, ActionTexts) == 0x000010, "Member 'WBP_ContextualActions_C_SetActionsCommonUI::ActionTexts' has a wrong offset!");
static_assert(offsetof(WBP_ContextualActions_C_SetActionsCommonUI, ActionAllowed) == 0x000020, "Member 'WBP_ContextualActions_C_SetActionsCommonUI::ActionAllowed' has a wrong offset!");

}

