#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Debug_UINavigation

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "FUINavigationNode_structs.hpp"
#include "Engine_structs.hpp"
#include "RigLogicModule_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Debug_UINavigation.WBP_Debug_UINavigation_C.Draw Arrow
// 0x03B8 (0x03B8 - 0x0000)
struct WBP_Debug_UINavigation_C_Draw_Arrow final
{
public:
	struct FPaintContext                          Context;                                           // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FVector2D                              Start;                                             // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              End;                                               // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Tint;                                              // 0x0050(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0060(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UCurveFloat*                            local_ArrowCurve;                                  // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              local_Mid;                                         // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Normal2D_ReturnValue;                     // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetAbs2D_ReturnValue;                     // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Negated2D_ReturnValue;                    // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetRotated2D_ReturnValue;                 // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue_1;     // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue_2;     // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_1;       // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue_1;  // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_2;       // 0x0168(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_3;           // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue;        // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue_1;      // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_1;             // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D5[0x3];                                      // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue_2;      // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_1;              // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_4;           // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x0238(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue_3;     // 0x0248(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_3;       // 0x0260(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_1;              // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue_4;     // 0x0280(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue_3;      // 0x0290(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_1;                      // 0x02A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_1;      // 0x02C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_4;       // 0x02D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue_2;  // 0x02E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Normal2D_ReturnValue_1;                   // 0x02F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetRotated2D_ReturnValue_1;               // 0x0300(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetRotated2D_ReturnValue_2;               // 0x0310(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue_5;     // 0x0320(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue_6;     // 0x0330(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_5;       // 0x0340(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_6;       // 0x0350(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0360(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue_7;     // 0x0370(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue_3;  // 0x0380(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DrawTextFormatted_FontSize_ImplicitCast;  // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VLerp_Alpha_ImplicitCast;                 // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast;        // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VLerp_Alpha_ImplicitCast_1;               // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast_1;      // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_UINavigation_C_Draw_Arrow) == 0x000008, "Wrong alignment on WBP_Debug_UINavigation_C_Draw_Arrow");
static_assert(sizeof(WBP_Debug_UINavigation_C_Draw_Arrow) == 0x0003B8, "Wrong size on WBP_Debug_UINavigation_C_Draw_Arrow");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, Context) == 0x000000, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::Context' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, Start) == 0x000030, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::Start' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, End) == 0x000040, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::End' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, Tint) == 0x000050, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::Tint' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, Text) == 0x000060, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::Text' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, local_ArrowCurve) == 0x000070, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::local_ArrowCurve' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, local_Mid) == 0x000078, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::local_Mid' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x000088, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_MakeLiteralInt_ReturnValue) == 0x000098, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x0000A0, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Conv_IntToDouble_ReturnValue) == 0x0000B0, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Divide_IntInt_ReturnValue) == 0x0000B8, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Normal2D_ReturnValue) == 0x0000C0, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Normal2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x0000D0, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_GetAbs2D_ReturnValue) == 0x0000D8, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_GetAbs2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_MakeVector2D_ReturnValue) == 0x0000E8, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Negated2D_ReturnValue) == 0x0000F8, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Negated2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_GetRotated2D_ReturnValue) == 0x000108, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_GetRotated2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Multiply_Vector2DFloat_ReturnValue_1) == 0x000118, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Multiply_Vector2DFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Multiply_Vector2DFloat_ReturnValue_2) == 0x000128, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Multiply_Vector2DFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000138, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Add_Vector2DVector2D_ReturnValue_1) == 0x000148, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Add_Vector2DVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Subtract_Vector2DVector2D_ReturnValue_1) == 0x000158, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Subtract_Vector2DVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Add_Vector2DVector2D_ReturnValue_2) == 0x000168, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Add_Vector2DVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, Temp_int_Variable) == 0x000178, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Subtract_IntInt_ReturnValue) == 0x00017C, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000180, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Conv_IntToDouble_ReturnValue_3) == 0x000188, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Conv_IntToDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Add_IntInt_ReturnValue) == 0x000190, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_MakeLiteralDouble_ReturnValue) == 0x000198, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_MakeLiteralDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Conv_Vector2DToVector_ReturnValue) == 0x0001A0, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Conv_Vector2DToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Conv_Vector2DToVector_ReturnValue_1) == 0x0001B8, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Conv_Vector2DToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_MakeLiteralInt_ReturnValue_1) == 0x0001D0, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_MakeLiteralInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0001D4, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Conv_Vector2DToVector_ReturnValue_2) == 0x0001D8, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Conv_Vector2DToVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Divide_IntInt_ReturnValue_1) == 0x0001F0, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Divide_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Conv_IntToDouble_ReturnValue_4) == 0x0001F8, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Conv_IntToDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000200, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000208, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_GetFloatValue_ReturnValue) == 0x000210, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_VLerp_ReturnValue) == 0x000218, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000230, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x000238, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Multiply_Vector2DFloat_ReturnValue_3) == 0x000248, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Multiply_Vector2DFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000258, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Add_Vector2DVector2D_ReturnValue_3) == 0x000260, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Add_Vector2DVector2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_GetFloatValue_ReturnValue_1) == 0x000270, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_GetFloatValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000278, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Multiply_Vector2DFloat_ReturnValue_4) == 0x000280, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Multiply_Vector2DFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Conv_Vector2DToVector_ReturnValue_3) == 0x000290, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Conv_Vector2DToVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_VLerp_ReturnValue_1) == 0x0002A8, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_VLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Conv_VectorToVector2D_ReturnValue_1) == 0x0002C0, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Conv_VectorToVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Add_Vector2DVector2D_ReturnValue_4) == 0x0002D0, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Add_Vector2DVector2D_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Subtract_Vector2DVector2D_ReturnValue_2) == 0x0002E0, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Subtract_Vector2DVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Normal2D_ReturnValue_1) == 0x0002F0, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Normal2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_GetRotated2D_ReturnValue_1) == 0x000300, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_GetRotated2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_GetRotated2D_ReturnValue_2) == 0x000310, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_GetRotated2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Multiply_Vector2DFloat_ReturnValue_5) == 0x000320, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Multiply_Vector2DFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Multiply_Vector2DFloat_ReturnValue_6) == 0x000330, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Multiply_Vector2DFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Add_Vector2DVector2D_ReturnValue_5) == 0x000340, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Add_Vector2DVector2D_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Add_Vector2DVector2D_ReturnValue_6) == 0x000350, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Add_Vector2DVector2D_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_MakeVector2D_ReturnValue_1) == 0x000360, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Multiply_Vector2DFloat_ReturnValue_7) == 0x000370, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Multiply_Vector2DFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Subtract_Vector2DVector2D_ReturnValue_3) == 0x000380, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Subtract_Vector2DVector2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_DrawTextFormatted_FontSize_ImplicitCast) == 0x000390, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_DrawTextFormatted_FontSize_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_VLerp_Alpha_ImplicitCast) == 0x000394, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_VLerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_GetFloatValue_InTime_ImplicitCast) == 0x000398, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_GetFloatValue_InTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0003A0, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_VLerp_Alpha_ImplicitCast_1) == 0x0003A8, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_VLerp_Alpha_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_GetFloatValue_InTime_ImplicitCast_1) == 0x0003AC, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_GetFloatValue_InTime_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Draw_Arrow, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x0003B0, "Member 'WBP_Debug_UINavigation_C_Draw_Arrow::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");

// Function WBP_Debug_UINavigation.WBP_Debug_UINavigation_C.Get Node Position
// 0x0148 (0x0148 - 0x0000)
struct WBP_Debug_UINavigation_C_Get_Node_Position final
{
public:
	struct FFUINavigationNode                     NavigationNode;                                    // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              position;                                          // 0x0040(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Size;                                              // 0x0050(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetViewportWidgetGeometry_ReturnValue;    // 0x0060(0x0038)(IsPlainOldData, NoDestructor)
	class UObject*                                CallFunc_GetTiedObject_Object;                     // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_DynamicCast_AsWidget;                       // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              CallFunc_GetTickSpaceGeometry_ReturnValue;         // 0x00BC(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue;                 // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToAbsolute_ReturnValue;              // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToAbsolute_ReturnValue_1;            // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_AbsoluteToLocal_ReturnValue;              // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_AbsoluteToLocal_ReturnValue_1;            // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_UINavigation_C_Get_Node_Position) == 0x000008, "Wrong alignment on WBP_Debug_UINavigation_C_Get_Node_Position");
static_assert(sizeof(WBP_Debug_UINavigation_C_Get_Node_Position) == 0x000148, "Wrong size on WBP_Debug_UINavigation_C_Get_Node_Position");
static_assert(offsetof(WBP_Debug_UINavigation_C_Get_Node_Position, NavigationNode) == 0x000000, "Member 'WBP_Debug_UINavigation_C_Get_Node_Position::NavigationNode' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Get_Node_Position, position) == 0x000040, "Member 'WBP_Debug_UINavigation_C_Get_Node_Position::position' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Get_Node_Position, Size) == 0x000050, "Member 'WBP_Debug_UINavigation_C_Get_Node_Position::Size' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Get_Node_Position, CallFunc_GetViewportWidgetGeometry_ReturnValue) == 0x000060, "Member 'WBP_Debug_UINavigation_C_Get_Node_Position::CallFunc_GetViewportWidgetGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Get_Node_Position, CallFunc_GetTiedObject_Object) == 0x000098, "Member 'WBP_Debug_UINavigation_C_Get_Node_Position::CallFunc_GetTiedObject_Object' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Get_Node_Position, K2Node_DynamicCast_AsWidget) == 0x0000A0, "Member 'WBP_Debug_UINavigation_C_Get_Node_Position::K2Node_DynamicCast_AsWidget' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Get_Node_Position, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'WBP_Debug_UINavigation_C_Get_Node_Position::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Get_Node_Position, K2Node_DynamicCast_AsActor) == 0x0000B0, "Member 'WBP_Debug_UINavigation_C_Get_Node_Position::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Get_Node_Position, K2Node_DynamicCast_bSuccess_1) == 0x0000B8, "Member 'WBP_Debug_UINavigation_C_Get_Node_Position::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Get_Node_Position, CallFunc_GetTickSpaceGeometry_ReturnValue) == 0x0000BC, "Member 'WBP_Debug_UINavigation_C_Get_Node_Position::CallFunc_GetTickSpaceGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Get_Node_Position, CallFunc_GetLocalSize_ReturnValue) == 0x0000F8, "Member 'WBP_Debug_UINavigation_C_Get_Node_Position::CallFunc_GetLocalSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Get_Node_Position, CallFunc_LocalToAbsolute_ReturnValue) == 0x000108, "Member 'WBP_Debug_UINavigation_C_Get_Node_Position::CallFunc_LocalToAbsolute_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Get_Node_Position, CallFunc_LocalToAbsolute_ReturnValue_1) == 0x000118, "Member 'WBP_Debug_UINavigation_C_Get_Node_Position::CallFunc_LocalToAbsolute_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Get_Node_Position, CallFunc_AbsoluteToLocal_ReturnValue) == 0x000128, "Member 'WBP_Debug_UINavigation_C_Get_Node_Position::CallFunc_AbsoluteToLocal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_Get_Node_Position, CallFunc_AbsoluteToLocal_ReturnValue_1) == 0x000138, "Member 'WBP_Debug_UINavigation_C_Get_Node_Position::CallFunc_AbsoluteToLocal_ReturnValue_1' has a wrong offset!");

// Function WBP_Debug_UINavigation.WBP_Debug_UINavigation_C.GetDirectionsPointingToNode
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_Debug_UINavigation_C_GetDirectionsPointingToNode final
{
public:
	struct FFUINavigationNode                     SourceNode;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	int32                                         TargetNode;                                        // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EDirection>                            Directions;                                        // 0x0048(0x0010)(Parm, OutParm)
	TArray<EDirection>                            local_directions;                                  // 0x0058(0x0010)(Edit, BlueprintVisible)
	EDirection                                    Temp_byte_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EDirection>                            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	EDirection                                    CallFunc_Array_Get_Item;                           // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_UINavigation_C_GetDirectionsPointingToNode) == 0x000008, "Wrong alignment on WBP_Debug_UINavigation_C_GetDirectionsPointingToNode");
static_assert(sizeof(WBP_Debug_UINavigation_C_GetDirectionsPointingToNode) == 0x0000A8, "Wrong size on WBP_Debug_UINavigation_C_GetDirectionsPointingToNode");
static_assert(offsetof(WBP_Debug_UINavigation_C_GetDirectionsPointingToNode, SourceNode) == 0x000000, "Member 'WBP_Debug_UINavigation_C_GetDirectionsPointingToNode::SourceNode' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_GetDirectionsPointingToNode, TargetNode) == 0x000040, "Member 'WBP_Debug_UINavigation_C_GetDirectionsPointingToNode::TargetNode' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_GetDirectionsPointingToNode, Directions) == 0x000048, "Member 'WBP_Debug_UINavigation_C_GetDirectionsPointingToNode::Directions' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_GetDirectionsPointingToNode, local_directions) == 0x000058, "Member 'WBP_Debug_UINavigation_C_GetDirectionsPointingToNode::local_directions' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_GetDirectionsPointingToNode, Temp_byte_Variable) == 0x000068, "Member 'WBP_Debug_UINavigation_C_GetDirectionsPointingToNode::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_GetDirectionsPointingToNode, Temp_int_Variable) == 0x00006C, "Member 'WBP_Debug_UINavigation_C_GetDirectionsPointingToNode::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_GetDirectionsPointingToNode, Temp_int_Variable_1) == 0x000070, "Member 'WBP_Debug_UINavigation_C_GetDirectionsPointingToNode::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_GetDirectionsPointingToNode, Temp_int_Array_Index_Variable) == 0x000074, "Member 'WBP_Debug_UINavigation_C_GetDirectionsPointingToNode::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_GetDirectionsPointingToNode, Temp_int_Loop_Counter_Variable) == 0x000078, "Member 'WBP_Debug_UINavigation_C_GetDirectionsPointingToNode::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_GetDirectionsPointingToNode, CallFunc_Add_IntInt_ReturnValue) == 0x00007C, "Member 'WBP_Debug_UINavigation_C_GetDirectionsPointingToNode::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_GetDirectionsPointingToNode, K2Node_MakeArray_Array) == 0x000080, "Member 'WBP_Debug_UINavigation_C_GetDirectionsPointingToNode::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_GetDirectionsPointingToNode, CallFunc_Array_Get_Item) == 0x000090, "Member 'WBP_Debug_UINavigation_C_GetDirectionsPointingToNode::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_GetDirectionsPointingToNode, CallFunc_Array_Add_ReturnValue) == 0x000094, "Member 'WBP_Debug_UINavigation_C_GetDirectionsPointingToNode::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_GetDirectionsPointingToNode, K2Node_Select_Default) == 0x000098, "Member 'WBP_Debug_UINavigation_C_GetDirectionsPointingToNode::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_GetDirectionsPointingToNode, CallFunc_Array_Length_ReturnValue) == 0x00009C, "Member 'WBP_Debug_UINavigation_C_GetDirectionsPointingToNode::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_GetDirectionsPointingToNode, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000A0, "Member 'WBP_Debug_UINavigation_C_GetDirectionsPointingToNode::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_GetDirectionsPointingToNode, CallFunc_Less_IntInt_ReturnValue) == 0x0000A1, "Member 'WBP_Debug_UINavigation_C_GetDirectionsPointingToNode::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Debug_UINavigation.WBP_Debug_UINavigation_C.GetNodeCenter
// 0x0050 (0x0050 - 0x0000)
struct WBP_Debug_UINavigation_C_GetNodeCenter final
{
public:
	struct FVector2D                              position;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Size;                                              // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_UINavigation_C_GetNodeCenter) == 0x000008, "Wrong alignment on WBP_Debug_UINavigation_C_GetNodeCenter");
static_assert(sizeof(WBP_Debug_UINavigation_C_GetNodeCenter) == 0x000050, "Wrong size on WBP_Debug_UINavigation_C_GetNodeCenter");
static_assert(offsetof(WBP_Debug_UINavigation_C_GetNodeCenter, position) == 0x000000, "Member 'WBP_Debug_UINavigation_C_GetNodeCenter::position' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_GetNodeCenter, Size) == 0x000010, "Member 'WBP_Debug_UINavigation_C_GetNodeCenter::Size' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_GetNodeCenter, ReturnValue) == 0x000020, "Member 'WBP_Debug_UINavigation_C_GetNodeCenter::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_GetNodeCenter, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x000030, "Member 'WBP_Debug_UINavigation_C_GetNodeCenter::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_GetNodeCenter, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000040, "Member 'WBP_Debug_UINavigation_C_GetNodeCenter::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");

// Function WBP_Debug_UINavigation.WBP_Debug_UINavigation_C.OnPaint
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_Debug_UINavigation_C_OnPaint final
{
public:
	struct FPaintContext                          Context;                                           // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FVector2D                              local_currentSize;                                 // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CurrentPosition;                                   // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector2D>                      usedPositionsViewport;                             // 0x0050(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFUINavigationNode>             CallFunc_GetRootNavigationNodes_RootNodes;         // 0x0068(0x0010)(ReferenceParm)
	struct FFUINavigationNode                     CallFunc_Array_Get_Item;                           // 0x0078(0x0040)(NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_Map_Keys_Keys;                            // 0x00B8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedBuild_ReturnValue;              // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D6[0x2];                                       // 0x00D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_UINavigation_C_OnPaint) == 0x000008, "Wrong alignment on WBP_Debug_UINavigation_C_OnPaint");
static_assert(sizeof(WBP_Debug_UINavigation_C_OnPaint) == 0x0000E0, "Wrong size on WBP_Debug_UINavigation_C_OnPaint");
static_assert(offsetof(WBP_Debug_UINavigation_C_OnPaint, Context) == 0x000000, "Member 'WBP_Debug_UINavigation_C_OnPaint::Context' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_OnPaint, local_currentSize) == 0x000030, "Member 'WBP_Debug_UINavigation_C_OnPaint::local_currentSize' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_OnPaint, CurrentPosition) == 0x000040, "Member 'WBP_Debug_UINavigation_C_OnPaint::CurrentPosition' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_OnPaint, usedPositionsViewport) == 0x000050, "Member 'WBP_Debug_UINavigation_C_OnPaint::usedPositionsViewport' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_OnPaint, Temp_int_Array_Index_Variable) == 0x000060, "Member 'WBP_Debug_UINavigation_C_OnPaint::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_OnPaint, CallFunc_GetRootNavigationNodes_RootNodes) == 0x000068, "Member 'WBP_Debug_UINavigation_C_OnPaint::CallFunc_GetRootNavigationNodes_RootNodes' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_OnPaint, CallFunc_Array_Get_Item) == 0x000078, "Member 'WBP_Debug_UINavigation_C_OnPaint::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_OnPaint, CallFunc_Map_Keys_Keys) == 0x0000B8, "Member 'WBP_Debug_UINavigation_C_OnPaint::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_OnPaint, CallFunc_Array_Length_ReturnValue) == 0x0000C8, "Member 'WBP_Debug_UINavigation_C_OnPaint::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_OnPaint, CallFunc_IsPackagedBuild_ReturnValue) == 0x0000CC, "Member 'WBP_Debug_UINavigation_C_OnPaint::CallFunc_IsPackagedBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_OnPaint, Temp_int_Loop_Counter_Variable) == 0x0000D0, "Member 'WBP_Debug_UINavigation_C_OnPaint::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_OnPaint, CallFunc_IsValid_ReturnValue) == 0x0000D4, "Member 'WBP_Debug_UINavigation_C_OnPaint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_OnPaint, CallFunc_Less_IntInt_ReturnValue) == 0x0000D5, "Member 'WBP_Debug_UINavigation_C_OnPaint::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UINavigation_C_OnPaint, CallFunc_Add_IntInt_ReturnValue) == 0x0000D8, "Member 'WBP_Debug_UINavigation_C_OnPaint::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Debug_UINavigation.WBP_Debug_UINavigation_C.PaintNodeRecursive
// 0x0628 (0x0628 - 0x0000)
struct WBP_Debug_UINavigation_C_PaintNodeRecursive final
{
public:
	struct FPaintContext                          Context;                                           // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FFUINavigationNode                     FUINavigationNode;                                 // 0x0030(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	int32                                         Depth;                                             // 0x0070(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          local_verbosePaint;                                // 0x0074(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 local_targetedNodes;                               // 0x0078(0x0010)(Edit, BlueprintVisible)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Get_Node_Position_Position;               // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Get_Node_Position_Size;                   // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetNodeCenter_ReturnValue;                // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue_1;     // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_1;       // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0130(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0178(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01C0(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01E0(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01F0(0x0010)()
	bool                                          Temp_bool_Variable;                                // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0204(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_215[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
