#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BattleWheelButton_Background

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BattleWheelButton_Background.WBP_BattleWheelButton_Background_C
// 0x00A8 (0x0388 - 0x02E0)
class UWBP_BattleWheelButton_Background_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Appear;                                       // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_GlobalContainer;                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG_Paint_Brown;                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG_Paint_Left;                               // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG_PatternLeft;                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG_PatternRight;                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LineBottom;                                  // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LineTop;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PaintRight;                                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PatternInput;                                // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             NamedSlot_Full;                                    // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             Param_Image_PatternBackground;                     // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Param_LineTop;                                     // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Param_LineBottom;                                  // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Param_BrownBackground;                             // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Param_BrownBackground_Left;                        // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Param_PaintSlash_Left;                             // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Param_PaintSlash_Right;                            // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Param_Pattern_Left;                                // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Param_Pattern_Right;                               // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void Appear_Background_Button_WheelBattle();
	void Desppear_Background_Button_WheelBattle();
	void ExecuteUbergraph_WBP_BattleWheelButton_Background(int32 EntryPoint);
	void LoadParameter(class UImage* Image, class UTexture2D* Texture);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BattleWheelButton_Background_C">();
	}
	static class UWBP_BattleWheelButton_Background_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BattleWheelButton_Background_C>();
	}
};
static_assert(alignof(UWBP_BattleWheelButton_Background_C) == 0x000008, "Wrong alignment on UWBP_BattleWheelButton_Background_C");
static_assert(sizeof(UWBP_BattleWheelButton_Background_C) == 0x000388, "Wrong size on UWBP_BattleWheelButton_Background_C");
static_assert(offsetof(UWBP_BattleWheelButton_Background_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_BattleWheelButton_Background_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_BattleWheelButton_Background_C, Anim_Appear) == 0x0002E8, "Member 'UWBP_BattleWheelButton_Background_C::Anim_Appear' has a wrong offset!");
static_assert(offsetof(UWBP_BattleWheelButton_Background_C, CanvasPanel_GlobalContainer) == 0x0002F0, "Member 'UWBP_BattleWheelButton_Background_C::CanvasPanel_GlobalContainer' has a wrong offset!");
static_assert(offsetof(UWBP_BattleWheelButton_Background_C, Image_BG_Paint_Brown) == 0x0002F8, "Member 'UWBP_BattleWheelButton_Background_C::Image_BG_Paint_Brown' has a wrong offset!");
static_assert(offsetof(UWBP_BattleWheelButton_Background_C, Image_BG_Paint_Left) == 0x000300, "Member 'UWBP_BattleWheelButton_Background_C::Image_BG_Paint_Left' has a wrong offset!");
static_assert(offsetof(UWBP_BattleWheelButton_Background_C, Image_BG_PatternLeft) == 0x000308, "Member 'UWBP_BattleWheelButton_Background_C::Image_BG_PatternLeft' has a wrong offset!");
static_assert(offsetof(UWBP_BattleWheelButton_Background_C, Image_BG_PatternRight) == 0x000310, "Member 'UWBP_BattleWheelButton_Background_C::Image_BG_PatternRight' has a wrong offset!");
static_assert(offsetof(UWBP_BattleWheelButton_Background_C, Image_LineBottom) == 0x000318, "Member 'UWBP_BattleWheelButton_Background_C::Image_LineBottom' has a wrong offset!");
static_assert(offsetof(UWBP_BattleWheelButton_Background_C, Image_LineTop) == 0x000320, "Member 'UWBP_BattleWheelButton_Background_C::Image_LineTop' has a wrong offset!");
static_assert(offsetof(UWBP_BattleWheelButton_Background_C, Image_PaintRight) == 0x000328, "Member 'UWBP_BattleWheelButton_Background_C::Image_PaintRight' has a wrong offset!");
static_assert(offsetof(UWBP_BattleWheelButton_Background_C, Image_PatternInput) == 0x000330, "Member 'UWBP_BattleWheelButton_Background_C::Image_PatternInput' has a wrong offset!");
static_assert(offsetof(UWBP_BattleWheelButton_Background_C, NamedSlot_Full) == 0x000338, "Member 'UWBP_BattleWheelButton_Background_C::NamedSlot_Full' has a wrong offset!");
static_assert(offsetof(UWBP_BattleWheelButton_Background_C, Param_Image_PatternBackground) == 0x000340, "Member 'UWBP_BattleWheelButton_Background_C::Param_Image_PatternBackground' has a wrong offset!");
static_assert(offsetof(UWBP_BattleWheelButton_Background_C, Param_LineTop) == 0x000348, "Member 'UWBP_BattleWheelButton_Background_C::Param_LineTop' has a wrong offset!");
static_assert(offsetof(UWBP_BattleWheelButton_Background_C, Param_LineBottom) == 0x000350, "Member 'UWBP_BattleWheelButton_Background_C::Param_LineBottom' has a wrong offset!");
static_assert(offsetof(UWBP_BattleWheelButton_Background_C, Param_BrownBackground) == 0x000358, "Member 'UWBP_BattleWheelButton_Background_C::Param_BrownBackground' has a wrong offset!");
static_assert(offsetof(UWBP_BattleWheelButton_Background_C, Param_BrownBackground_Left) == 0x000360, "Member 'UWBP_BattleWheelButton_Background_C::Param_BrownBackground_Left' has a wrong offset!");
static_assert(offsetof(UWBP_BattleWheelButton_Background_C, Param_PaintSlash_Left) == 0x000368, "Member 'UWBP_BattleWheelButton_Background_C::Param_PaintSlash_Left' has a wrong offset!");
static_assert(offsetof(UWBP_BattleWheelButton_Background_C, Param_PaintSlash_Right) == 0x000370, "Member 'UWBP_BattleWheelButton_Background_C::Param_PaintSlash_Right' has a wrong offset!");
static_assert(offsetof(UWBP_BattleWheelButton_Background_C, Param_Pattern_Left) == 0x000378, "Member 'UWBP_BattleWheelButton_Background_C::Param_Pattern_Left' has a wrong offset!");
static_assert(offsetof(UWBP_BattleWheelButton_Background_C, Param_Pattern_Right) == 0x000380, "Member 'UWBP_BattleWheelButton_Background_C::Param_Pattern_Right' has a wrong offset!");

}

