#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ExplorationPromptHint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ExplorationPromptHint.WBP_ExplorationPromptHint_C
// 0x0038 (0x0318 - 0x02E0)
class UWBP_ExplorationPromptHint_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Disappear;                                    // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Appear;                                       // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_InteractBulletInner;                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_InteractBulletOuter;                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UWBP_ExplorationPromptHint_C* Widget)> OnWidgetDisappeared;  // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Appear();
	void Disappear();
	void ExecuteUbergraph_WBP_ExplorationPromptHint(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ExplorationPromptHint_C">();
	}
	static class UWBP_ExplorationPromptHint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ExplorationPromptHint_C>();
	}
};
static_assert(alignof(UWBP_ExplorationPromptHint_C) == 0x000008, "Wrong alignment on UWBP_ExplorationPromptHint_C");
static_assert(sizeof(UWBP_ExplorationPromptHint_C) == 0x000318, "Wrong size on UWBP_ExplorationPromptHint_C");
static_assert(offsetof(UWBP_ExplorationPromptHint_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_ExplorationPromptHint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ExplorationPromptHint_C, Anim_Disappear) == 0x0002E8, "Member 'UWBP_ExplorationPromptHint_C::Anim_Disappear' has a wrong offset!");
static_assert(offsetof(UWBP_ExplorationPromptHint_C, Anim_Appear) == 0x0002F0, "Member 'UWBP_ExplorationPromptHint_C::Anim_Appear' has a wrong offset!");
static_assert(offsetof(UWBP_ExplorationPromptHint_C, Image_InteractBulletInner) == 0x0002F8, "Member 'UWBP_ExplorationPromptHint_C::Image_InteractBulletInner' has a wrong offset!");
static_assert(offsetof(UWBP_ExplorationPromptHint_C, Image_InteractBulletOuter) == 0x000300, "Member 'UWBP_ExplorationPromptHint_C::Image_InteractBulletOuter' has a wrong offset!");
static_assert(offsetof(UWBP_ExplorationPromptHint_C, OnWidgetDisappeared) == 0x000308, "Member 'UWBP_ExplorationPromptHint_C::OnWidgetDisappeared' has a wrong offset!");

}

