#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_Battle_CharacterPortrait

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "S_jRPG_CharacterDefinition_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_HUD_Battle_CharacterPortrait.WBP_HUD_Battle_CharacterPortrait_C.ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait
// 0x0510 (0x0510 - 0x0000)
struct WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(double NewHP, double PreviousHP)> K2Node_CreateDelegate_OutputDelegate;           // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_HP;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_MaxHP;                          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentShieldPoints_ShieldPoints;      // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetMaxHP_MaxHP;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_NewHP_1;                        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_PreviousHP_1;                   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_2;                     // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetMaxHP_MaxHP_1;                         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_3;                     // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewAP;                          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PreviousAP;                     // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_CharacterBattleStats_C*        K2Node_CustomEvent_CharacterStats_1;               // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetMaxAP_MaxMP;                           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_4;                     // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_5;                     // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_NewHP;                          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_PreviousHP;                     // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConsoleVariableBoolValue_ReturnValue;  // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetMaxHP_MaxHP_2;                         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_jRPG_CharacterDefinition            CallFunc_GetDataTableRowFromName_OutRow;           // 0x00F8(0x0328)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_422[0x6];                                      // 0x0422(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0431(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_432[0x6];                                      // 0x0432(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0438(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_2;     // 0x0441(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_442[0x6];                                      // 0x0442(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Character_Battle_Base_C*       CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase; // 0x0448(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCharacterBattleBase_IsValid;           // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_451[0x7];                                      // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UActorComponent*>                CallFunc_GetComponentsByInterface_ReturnValue;     // 0x0458(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UActorComponent*                        CallFunc_Array_Get_Item;                           // 0x0468(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_471[0x7];                                      // 0x0471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UniqueMechanicComponent_C> K2Node_DynamicCast_AsBPI_Unique_Mechanic_Component; // 0x0478(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_CreatePortraitWidget_CreatedUserWidget;   // 0x0490(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CreatePortraitWidget_SlotIndex;           // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UAC_jRPG_CharacterBattleStats_C*  K2Node_CustomEvent_CharacterStats;                 // 0x04A8(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_LowHealth;                      // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x04B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B2[0x2];                                      // 0x04B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 CurrentValue, int32 PreviousValue)> K2Node_CreateDelegate_OutputDelegate_1; // 0x04B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x04C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x04C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C6[0x2];                                      // 0x04C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_CurrentValue;                   // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PreviousValue;                  // 0x04CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D1[0x3];                                      // 0x04D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 NewAP, int32 PreviousAP, class UAC_jRPG_CharacterBattleStats_C* CharacterStats)> K2Node_CreateDelegate_OutputDelegate_2; // 0x04D4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E4[0x4];                                      // 0x04E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UNamedSlot*>                     K2Node_MakeArray_Array;                            // 0x04E8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UNamedSlot*                             CallFunc_Array_Get_Item_1;                         // 0x04F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_SetContent_ReturnValue;                   // 0x0500(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0508(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait) == 0x000008, "Wrong alignment on WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait");
static_assert(sizeof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait) == 0x000510, "Wrong size on WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, EntryPoint) == 0x000000, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, K2Node_CustomEvent_HP) == 0x000028, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::K2Node_CustomEvent_HP' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, K2Node_CustomEvent_MaxHP) == 0x00002C, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::K2Node_CustomEvent_MaxHP' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000030, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000038, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000040, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_GetCurrentShieldPoints_ShieldPoints) == 0x000048, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_GetCurrentShieldPoints_ShieldPoints' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000050, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000058, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_GetMaxHP_MaxHP) == 0x000060, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_GetMaxHP_MaxHP' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_FTrunc_ReturnValue) == 0x000068, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, K2Node_CustomEvent_NewHP_1) == 0x000070, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::K2Node_CustomEvent_NewHP_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, K2Node_CustomEvent_PreviousHP_1) == 0x000078, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::K2Node_CustomEvent_PreviousHP_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_FTrunc_ReturnValue_1) == 0x000080, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_FTrunc_ReturnValue_2) == 0x000084, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_FTrunc_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_GetMaxHP_MaxHP_1) == 0x000088, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_GetMaxHP_MaxHP_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_FTrunc_ReturnValue_3) == 0x000090, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_FTrunc_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_PlayAnimation_ReturnValue_1) == 0x000098, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, K2Node_CustomEvent_NewAP) == 0x0000A0, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::K2Node_CustomEvent_NewAP' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, K2Node_CustomEvent_PreviousAP) == 0x0000A4, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::K2Node_CustomEvent_PreviousAP' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, K2Node_CustomEvent_CharacterStats_1) == 0x0000A8, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::K2Node_CustomEvent_CharacterStats_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_GetMaxAP_MaxMP) == 0x0000B0, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_GetMaxAP_MaxMP' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_FTrunc_ReturnValue_4) == 0x0000B8, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_FTrunc_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_FTrunc_ReturnValue_5) == 0x0000BC, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_FTrunc_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_PlayAnimation_ReturnValue_2) == 0x0000C0, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, K2Node_CustomEvent_NewHP) == 0x0000C8, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::K2Node_CustomEvent_NewHP' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, K2Node_CustomEvent_PreviousHP) == 0x0000D0, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::K2Node_CustomEvent_PreviousHP' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_PlayAnimation_ReturnValue_3) == 0x0000D8, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0000E0, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000E1, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x0000E2, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_GetConsoleVariableBoolValue_ReturnValue) == 0x0000E3, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_GetConsoleVariableBoolValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_GetMaxHP_MaxHP_2) == 0x0000E8, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_GetMaxHP_MaxHP_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, Temp_byte_Variable) == 0x0000F0, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000F8, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000420, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, Temp_byte_Variable_1) == 0x000421, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000428, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_LessEqual_DoubleDouble_ReturnValue_1) == 0x000430, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_LessEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, Temp_bool_Variable) == 0x000431, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_PlayAnimation_ReturnValue_4) == 0x000438, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, Temp_byte_Variable_2) == 0x000440, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_LessEqual_DoubleDouble_ReturnValue_2) == 0x000441, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_LessEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase) == 0x000448, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_GetCharacterBattleBase_jRPG_CharacterBattleBase' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_GetCharacterBattleBase_IsValid) == 0x000450, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_GetCharacterBattleBase_IsValid' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_GetComponentsByInterface_ReturnValue) == 0x000458, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_GetComponentsByInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_Array_Get_Item) == 0x000468, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_IsValid_ReturnValue) == 0x000470, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, K2Node_DynamicCast_AsBPI_Unique_Mechanic_Component) == 0x000478, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::K2Node_DynamicCast_AsBPI_Unique_Mechanic_Component' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, K2Node_DynamicCast_bSuccess) == 0x000488, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_CreatePortraitWidget_CreatedUserWidget) == 0x000490, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_CreatePortraitWidget_CreatedUserWidget' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_CreatePortraitWidget_SlotIndex) == 0x000498, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_CreatePortraitWidget_SlotIndex' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_Array_Length_ReturnValue) == 0x00049C, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_Less_IntInt_ReturnValue) == 0x0004A0, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, K2Node_CustomEvent_CharacterStats) == 0x0004A8, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::K2Node_CustomEvent_CharacterStats' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, K2Node_CustomEvent_LowHealth) == 0x0004B0, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::K2Node_CustomEvent_LowHealth' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, K2Node_Select_Default) == 0x0004B1, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, K2Node_CreateDelegate_OutputDelegate_1) == 0x0004B4, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, Temp_byte_Variable_3) == 0x0004C4, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, Temp_bool_Variable_1) == 0x0004C5, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, K2Node_CustomEvent_CurrentValue) == 0x0004C8, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::K2Node_CustomEvent_CurrentValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, K2Node_CustomEvent_PreviousValue) == 0x0004CC, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::K2Node_CustomEvent_PreviousValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, K2Node_Select_Default_1) == 0x0004D0, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, K2Node_CreateDelegate_OutputDelegate_2) == 0x0004D4, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, K2Node_MakeArray_Array) == 0x0004E8, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_Array_Get_Item_1) == 0x0004F8, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_SetContent_ReturnValue) == 0x000500, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_SetContent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait, CallFunc_Delay_Duration_ImplicitCast) == 0x000508, "Member 'WBP_HUD_Battle_CharacterPortrait_C_ExecuteUbergraph_WBP_HUD_Battle_CharacterPortrait::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

// Function WBP_HUD_Battle_CharacterPortrait.WBP_HUD_Battle_CharacterPortrait_C.OnAPChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_HUD_Battle_CharacterPortrait_C_OnAPChanged final
{
public:
	int32                                         NewAP;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PreviousAP;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_CharacterBattleStats_C*        CharacterStats;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_Battle_CharacterPortrait_C_OnAPChanged) == 0x000008, "Wrong alignment on WBP_HUD_Battle_CharacterPortrait_C_OnAPChanged");
static_assert(sizeof(WBP_HUD_Battle_CharacterPortrait_C_OnAPChanged) == 0x000010, "Wrong size on WBP_HUD_Battle_CharacterPortrait_C_OnAPChanged");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_OnAPChanged, NewAP) == 0x000000, "Member 'WBP_HUD_Battle_CharacterPortrait_C_OnAPChanged::NewAP' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_OnAPChanged, PreviousAP) == 0x000004, "Member 'WBP_HUD_Battle_CharacterPortrait_C_OnAPChanged::PreviousAP' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_OnAPChanged, CharacterStats) == 0x000008, "Member 'WBP_HUD_Battle_CharacterPortrait_C_OnAPChanged::CharacterStats' has a wrong offset!");

// Function WBP_HUD_Battle_CharacterPortrait.WBP_HUD_Battle_CharacterPortrait_C.OnCharacterTurnStart
// 0x0030 (0x0030 - 0x0000)
struct WBP_HUD_Battle_CharacterPortrait_C_OnCharacterTurnStart final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_Battle_CharacterPortrait_C_OnCharacterTurnStart) == 0x000008, "Wrong alignment on WBP_HUD_Battle_CharacterPortrait_C_OnCharacterTurnStart");
static_assert(sizeof(WBP_HUD_Battle_CharacterPortrait_C_OnCharacterTurnStart) == 0x000030, "Wrong size on WBP_HUD_Battle_CharacterPortrait_C_OnCharacterTurnStart");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_OnCharacterTurnStart, Character) == 0x000000, "Member 'WBP_HUD_Battle_CharacterPortrait_C_OnCharacterTurnStart::Character' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_OnCharacterTurnStart, Temp_bool_Variable) == 0x000008, "Member 'WBP_HUD_Battle_CharacterPortrait_C_OnCharacterTurnStart::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_OnCharacterTurnStart, K2Node_Select_Default) == 0x000010, "Member 'WBP_HUD_Battle_CharacterPortrait_C_OnCharacterTurnStart::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_OnCharacterTurnStart, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000018, "Member 'WBP_HUD_Battle_CharacterPortrait_C_OnCharacterTurnStart::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_OnCharacterTurnStart, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'WBP_HUD_Battle_CharacterPortrait_C_OnCharacterTurnStart::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_OnCharacterTurnStart, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000028, "Member 'WBP_HUD_Battle_CharacterPortrait_C_OnCharacterTurnStart::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function WBP_HUD_Battle_CharacterPortrait.WBP_HUD_Battle_CharacterPortrait_C.OnHPChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_HUD_Battle_CharacterPortrait_C_OnHPChanged final
{
public:
	double                                        NewHP;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PreviousHP;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_Battle_CharacterPortrait_C_OnHPChanged) == 0x000008, "Wrong alignment on WBP_HUD_Battle_CharacterPortrait_C_OnHPChanged");
static_assert(sizeof(WBP_HUD_Battle_CharacterPortrait_C_OnHPChanged) == 0x000010, "Wrong size on WBP_HUD_Battle_CharacterPortrait_C_OnHPChanged");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_OnHPChanged, NewHP) == 0x000000, "Member 'WBP_HUD_Battle_CharacterPortrait_C_OnHPChanged::NewHP' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_OnHPChanged, PreviousHP) == 0x000008, "Member 'WBP_HUD_Battle_CharacterPortrait_C_OnHPChanged::PreviousHP' has a wrong offset!");

// Function WBP_HUD_Battle_CharacterPortrait.WBP_HUD_Battle_CharacterPortrait_C.OnReintegratesBattle
// 0x0008 (0x0008 - 0x0000)
struct WBP_HUD_Battle_CharacterPortrait_C_OnReintegratesBattle final
{
public:
	const class UAC_jRPG_CharacterBattleStats_C*  CharacterStats;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_Battle_CharacterPortrait_C_OnReintegratesBattle) == 0x000008, "Wrong alignment on WBP_HUD_Battle_CharacterPortrait_C_OnReintegratesBattle");
static_assert(sizeof(WBP_HUD_Battle_CharacterPortrait_C_OnReintegratesBattle) == 0x000008, "Wrong size on WBP_HUD_Battle_CharacterPortrait_C_OnReintegratesBattle");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_OnReintegratesBattle, CharacterStats) == 0x000000, "Member 'WBP_HUD_Battle_CharacterPortrait_C_OnReintegratesBattle::CharacterStats' has a wrong offset!");

// Function WBP_HUD_Battle_CharacterPortrait.WBP_HUD_Battle_CharacterPortrait_C.OnShieldPointsChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_HUD_Battle_CharacterPortrait_C_OnShieldPointsChanged final
{
public:
	int32                                         CurrentValue;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PreviousValue;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_Battle_CharacterPortrait_C_OnShieldPointsChanged) == 0x000004, "Wrong alignment on WBP_HUD_Battle_CharacterPortrait_C_OnShieldPointsChanged");
static_assert(sizeof(WBP_HUD_Battle_CharacterPortrait_C_OnShieldPointsChanged) == 0x000008, "Wrong size on WBP_HUD_Battle_CharacterPortrait_C_OnShieldPointsChanged");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_OnShieldPointsChanged, CurrentValue) == 0x000000, "Member 'WBP_HUD_Battle_CharacterPortrait_C_OnShieldPointsChanged::CurrentValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_OnShieldPointsChanged, PreviousValue) == 0x000004, "Member 'WBP_HUD_Battle_CharacterPortrait_C_OnShieldPointsChanged::PreviousValue' has a wrong offset!");

// Function WBP_HUD_Battle_CharacterPortrait.WBP_HUD_Battle_CharacterPortrait_C.SetHPValue
// 0x0008 (0x0008 - 0x0000)
struct WBP_HUD_Battle_CharacterPortrait_C_SetHPValue final
{
public:
	int32                                         HP;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxHP;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_Battle_CharacterPortrait_C_SetHPValue) == 0x000004, "Wrong alignment on WBP_HUD_Battle_CharacterPortrait_C_SetHPValue");
static_assert(sizeof(WBP_HUD_Battle_CharacterPortrait_C_SetHPValue) == 0x000008, "Wrong size on WBP_HUD_Battle_CharacterPortrait_C_SetHPValue");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_SetHPValue, HP) == 0x000000, "Member 'WBP_HUD_Battle_CharacterPortrait_C_SetHPValue::HP' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_SetHPValue, MaxHP) == 0x000004, "Member 'WBP_HUD_Battle_CharacterPortrait_C_SetHPValue::MaxHP' has a wrong offset!");

// Function WBP_HUD_Battle_CharacterPortrait.WBP_HUD_Battle_CharacterPortrait_C.SetLowHealthFeedback
// 0x0001 (0x0001 - 0x0000)
struct WBP_HUD_Battle_CharacterPortrait_C_SetLowHealthFeedback final
{
public:
	bool                                          LowHealth;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_Battle_CharacterPortrait_C_SetLowHealthFeedback) == 0x000001, "Wrong alignment on WBP_HUD_Battle_CharacterPortrait_C_SetLowHealthFeedback");
static_assert(sizeof(WBP_HUD_Battle_CharacterPortrait_C_SetLowHealthFeedback) == 0x000001, "Wrong size on WBP_HUD_Battle_CharacterPortrait_C_SetLowHealthFeedback");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_SetLowHealthFeedback, LowHealth) == 0x000000, "Member 'WBP_HUD_Battle_CharacterPortrait_C_SetLowHealthFeedback::LowHealth' has a wrong offset!");

// Function WBP_HUD_Battle_CharacterPortrait.WBP_HUD_Battle_CharacterPortrait_C.SetPortrait
// 0x0010 (0x0010 - 0x0000)
struct WBP_HUD_Battle_CharacterPortrait_C_SetPortrait final
{
public:
	double                                        NewHP;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PreviousHP;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_Battle_CharacterPortrait_C_SetPortrait) == 0x000008, "Wrong alignment on WBP_HUD_Battle_CharacterPortrait_C_SetPortrait");
static_assert(sizeof(WBP_HUD_Battle_CharacterPortrait_C_SetPortrait) == 0x000010, "Wrong size on WBP_HUD_Battle_CharacterPortrait_C_SetPortrait");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_SetPortrait, NewHP) == 0x000000, "Member 'WBP_HUD_Battle_CharacterPortrait_C_SetPortrait::NewHP' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_SetPortrait, PreviousHP) == 0x000008, "Member 'WBP_HUD_Battle_CharacterPortrait_C_SetPortrait::PreviousHP' has a wrong offset!");

// Function WBP_HUD_Battle_CharacterPortrait.WBP_HUD_Battle_CharacterPortrait_C.SetPortraitImage
// 0x03A8 (0x03A8 - 0x0000)
struct WBP_HUD_Battle_CharacterPortrait_C_SetPortraitImage final
{
public:
	struct FS_jRPG_CharacterDefinition            CallFunc_GetDataTableRowFromName_OutRow;           // 0x0000(0x0328)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0330(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0340(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0388(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0398(0x0010)()
};
static_assert(alignof(WBP_HUD_Battle_CharacterPortrait_C_SetPortraitImage) == 0x000008, "Wrong alignment on WBP_HUD_Battle_CharacterPortrait_C_SetPortraitImage");
static_assert(sizeof(WBP_HUD_Battle_CharacterPortrait_C_SetPortraitImage) == 0x0003A8, "Wrong size on WBP_HUD_Battle_CharacterPortrait_C_SetPortraitImage");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_SetPortraitImage, CallFunc_GetDataTableRowFromName_OutRow) == 0x000000, "Member 'WBP_HUD_Battle_CharacterPortrait_C_SetPortraitImage::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_CharacterPortrait_C_SetPortraitImage, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000328, "Member 'WBP_HUD_Battle_CharacterPortrait_C_SetPortraitImage::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
