#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WeaponLevel

#include "Basic.hpp"

#include "EWeaponQuality_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_WeaponLevel.WBP_WeaponLevel_C
// 0x0018 (0x02F8 - 0x02E0)
class UWBP_WeaponLevel_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       Level;                                             // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       LevelTitle;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetLevel(int32 Level_0, EWeaponQuality Quality);
	void ExecuteUbergraph_WBP_WeaponLevel(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_WeaponLevel_C">();
	}
	static class UWBP_WeaponLevel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_WeaponLevel_C>();
	}
};
static_assert(alignof(UWBP_WeaponLevel_C) == 0x000008, "Wrong alignment on UWBP_WeaponLevel_C");
static_assert(sizeof(UWBP_WeaponLevel_C) == 0x0002F8, "Wrong size on UWBP_WeaponLevel_C");
static_assert(offsetof(UWBP_WeaponLevel_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_WeaponLevel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponLevel_C, Level) == 0x0002E8, "Member 'UWBP_WeaponLevel_C::Level' has a wrong offset!");
static_assert(offsetof(UWBP_WeaponLevel_C, LevelTitle) == 0x0002F0, "Member 'UWBP_WeaponLevel_C::LevelTitle' has a wrong offset!");

}

