#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_LootEntry

#include "Basic.hpp"

#include "EWeaponQuality_structs.hpp"
#include "Engine_structs.hpp"
#include "FSoundEvent_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "E_jRPG_ItemType_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUD_LootEntry.WBP_HUD_LootEntry_C
// 0x0100 (0x03E0 - 0x02E0)
class UWBP_HUD_LootEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_AppearWeapons;                                // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Pictos_Desappear;                             // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_AppearPictos;                                 // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_AppearRegular;                                // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           Canvas_LootContainer;                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_QuantityContainer;                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Unlock;                              // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Upgrade;                             // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background_Center;                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BackgroundLeft;                              // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BackgroundRight;                             // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ColorAppear;                                 // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Flash;                                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Flash_paint;                                 // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Flash_Spike;                                 // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LootIcon;                                    // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LootIcon_Stone;                              // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_TextureLeft;                                 // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_TextureRight;                                // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_LootName;                                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_LootName_1;                                   // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_LootQuantity;                                 // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WeaponLevel_C*                     WBP_WeaponLevel_Next;                              // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WeaponLevel_C*                     WBP_WeaponLevel_Previous;                          // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WeaponLevel_C*                     WBP_WeaponLevel_Unlock;                            // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_ItemLevel;                          // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FFSoundEvent                           SD_RegularLoot;                                    // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFSoundEvent                           SD_WeaponLoot;                                     // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFSoundEvent                           SD_PictosLoot;                                     // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FLinearColor                           WeaponColorOverride;                               // 0x03D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Appear();
	void Disappear();
	void ExecuteUbergraph_WBP_HUD_LootEntry(int32 EntryPoint);
	void FeedbackPictosLoot();
	void FeedbackRegularLoot();
	void FeedbackWeaponLoot();
	void LoadGeneratedItemInfo(class UBP_GeneratedItemInfo_Base_C* GeneratedItem);
	void LoadItemInfo(const struct FS_jRPG_Item_StaticData& ItemDefinition, int32 ItemQuantity);
	void OnDisappearAnimationFinished();
	void OnLoaded_8E5C5A044B17B50EA0A0DEBFE9D6479F(class UObject* Loaded);
	void OnLoaded_966BBD7B4084FEC0E84A98A58576955D(class UObject* Loaded);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUD_LootEntry_C">();
	}
	static class UWBP_HUD_LootEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_LootEntry_C>();
	}
};
static_assert(alignof(UWBP_HUD_LootEntry_C) == 0x000008, "Wrong alignment on UWBP_HUD_LootEntry_C");
static_assert(sizeof(UWBP_HUD_LootEntry_C) == 0x0003E0, "Wrong size on UWBP_HUD_LootEntry_C");
static_assert(offsetof(UWBP_HUD_LootEntry_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_HUD_LootEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootEntry_C, Anim_AppearWeapons) == 0x0002E8, "Member 'UWBP_HUD_LootEntry_C::Anim_AppearWeapons' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootEntry_C, Anim_Pictos_Desappear) == 0x0002F0, "Member 'UWBP_HUD_LootEntry_C::Anim_Pictos_Desappear' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootEntry_C, Anim_AppearPictos) == 0x0002F8, "Member 'UWBP_HUD_LootEntry_C::Anim_AppearPictos' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootEntry_C, Anim_AppearRegular) == 0x000300, "Member 'UWBP_HUD_LootEntry_C::Anim_AppearRegular' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootEntry_C, Canvas_LootContainer) == 0x000308, "Member 'UWBP_HUD_LootEntry_C::Canvas_LootContainer' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootEntry_C, HorizontalBox_QuantityContainer) == 0x000310, "Member 'UWBP_HUD_LootEntry_C::HorizontalBox_QuantityContainer' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootEntry_C, HorizontalBox_Unlock) == 0x000318, "Member 'UWBP_HUD_LootEntry_C::HorizontalBox_Unlock' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootEntry_C, HorizontalBox_Upgrade) == 0x000320, "Member 'UWBP_HUD_LootEntry_C::HorizontalBox_Upgrade' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootEntry_C, Image_Background_Center) == 0x000328, "Member 'UWBP_HUD_LootEntry_C::Image_Background_Center' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootEntry_C, Image_BackgroundLeft) == 0x000330, "Member 'UWBP_HUD_LootEntry_C::Image_BackgroundLeft' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootEntry_C, Image_BackgroundRight) == 0x000338, "Member 'UWBP_HUD_LootEntry_C::Image_BackgroundRight' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootEntry_C, Image_ColorAppear) == 0x000340, "Member 'UWBP_HUD_LootEntry_C::Image_ColorAppear' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootEntry_C, Image_Flash) == 0x000348, "Member 'UWBP_HUD_LootEntry_C::Image_Flash' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootEntry_C, Image_Flash_paint) == 0x000350, "Member 'UWBP_HUD_LootEntry_C::Image_Flash_paint' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootEntry_C, Image_Flash_Spike) == 0x000358, "Member 'UWBP_HUD_LootEntry_C::Image_Flash_Spike' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootEntry_C, Image_LootIcon) == 0x000360, "Member 'UWBP_HUD_LootEntry_C::Image_LootIcon' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootEntry_C, Image_LootIcon_Stone) == 0x000368, "Member 'UWBP_HUD_LootEntry_C::Image_LootIcon_Stone' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootEntry_C, Image_TextureLeft) == 0x000370, "Member 'UWBP_HUD_LootEntry_C::Image_TextureLeft' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootEntry_C, Image_TextureRight) == 0x000378, "Member 'UWBP_HUD_LootEntry_C::Image_TextureRight' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootEntry_C, Text_LootName) == 0x000380, "Member 'UWBP_HUD_LootEntry_C::Text_LootName' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootEntry_C, Text_LootName_1) == 0x000388, "Member 'UWBP_HUD_LootEntry_C::Text_LootName_1' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootEntry_C, Text_LootQuantity) == 0x000390, "Member 'UWBP_HUD_LootEntry_C::Text_LootQuantity' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootEntry_C, WBP_WeaponLevel_Next) == 0x000398, "Member 'UWBP_HUD_LootEntry_C::WBP_WeaponLevel_Next' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootEntry_C, WBP_WeaponLevel_Previous) == 0x0003A0, "Member 'UWBP_HUD_LootEntry_C::WBP_WeaponLevel_Previous' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootEntry_C, WBP_WeaponLevel_Unlock) == 0x0003A8, "Member 'UWBP_HUD_LootEntry_C::WBP_WeaponLevel_Unlock' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootEntry_C, WidgetSwitcher_ItemLevel) == 0x0003B0, "Member 'UWBP_HUD_LootEntry_C::WidgetSwitcher_ItemLevel' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootEntry_C, SD_RegularLoot) == 0x0003B8, "Member 'UWBP_HUD_LootEntry_C::SD_RegularLoot' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootEntry_C, SD_WeaponLoot) == 0x0003C0, "Member 'UWBP_HUD_LootEntry_C::SD_WeaponLoot' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootEntry_C, SD_PictosLoot) == 0x0003C8, "Member 'UWBP_HUD_LootEntry_C::SD_PictosLoot' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootEntry_C, WeaponColorOverride) == 0x0003D0, "Member 'UWBP_HUD_LootEntry_C::WeaponColorOverride' has a wrong offset!");

}

