#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Exploration_HUD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Exploration_HUD.WBP_Exploration_HUD_C
// 0x0118 (0x03F8 - 0x02E0)
class UWBP_Exploration_HUD_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_MiniMapTransition;                            // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_ShowQuestObjective;                           // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_ShowOverlay;                                  // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBackgroundBlur*                        BackgroundBlur;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ExplorationCanvas;                                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             ExternalSlot;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               HUDOverlay;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WorldMapCompass_C*                 OverlayCompass;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              OverlaySafeZone;                                   // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       PersistentCenterDot;                               // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           PromptBox;                                         // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       QuestObjectiveBackground;                          // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CrossHair_C*                       WBP_CrossHair;                                     // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DialogueOverlay_C*                 WBP_DialogueOverlay;                               // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HintOverlay_C*                     WBP_HintOverlay;                                   // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_LevelNameAnnounceQueue_C*      WBP_HUD_LevelNameAnnounceQueue;                    // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_LootList_C*                    WBP_HUD_LootList;                                  // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_LootQueue_C*                   WBP_HUD_LootQueue;                                 // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_TeamStatus_C*                  WBP_HUD_TeamStatus;                                // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OverlayQuestObjective_C*           WBP_OverlayQuestObjective;                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PromptContainer_C*                 WBP_PromptContainer;                               // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScreenPromptsContainer_C*          WBP_ScreenPromptsContainer;                        // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Subtitle_C*                        WBP_Subtitle;                                      // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WorldMapLevelNameContainer_C*      WBP_WorldMapLevelNameContainer;                    // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WorldMapPromptContainer_C*         WBP_WorldMapPromptContainer;                       // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WorldMapCompass_C*                 WorldMapCompass;                                   // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           WorldMapHUDContainer;                              // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           OverlayTimer;                                      // 0x03C0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWBP_MiniMap_Main_C*                    MiniMapWidget;                                     // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   DEBUG_OverlayWidgetClass;                          // 0x03D0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Exploration_HUD_WBP_HUD_TeamStatus_K2Node_ComponentBoundEvent_0_OnHealSuccess__DelegateSignature();
	void CloseOverlay();
	void Construct();
	void CreateMiniMap();
	void DEBUG_OnCvarChanged_HideUI(bool NewValue);
	void DeleteMiniMap();
	void Destruct();
	void ExecuteUbergraph_WBP_Exploration_HUD(int32 EntryPoint);
	void HideHUD();
	void HideMiniMap();
	void HideMiniMapInternal();
	void HideOverlay();
	void OnAfterPostCinematic();
	void OnBattleEnd();
	void OnBattleStart();
	void OnChangeMap(bool IsWorldMap);
	void OnChangeMapProcessFinished(class FName LevelName);
	void OnCinematicRequested();
	void OnGameMenuVisibilityChanged(bool IsVisible_0);
	void OnMiniMapTransitionTrigger();
	void OnShowOverlayTrigger();
	void OnTriggeringCinematic();
	void PauseHUDQueues();
	void ResumeHUDQueues();
	void SequenceEvent__ENTRYPOINTWBP_Exploration_HUD();
	void SequenceEvent__ENTRYPOINTWBP_Exploration_HUD_0();
	void SetPersistentCenterDotVisible(bool IsVisible_0);
	void SetWorldMapPromptContainerVisible(bool Visible);
	void ShowHUD();
	void ShowMiniMap();
	void ShowMiniMapInternal();
	void ShowTeamOverlay();
	void UpdatePersistentDotVisibility(class UConfigurableGameUserSettings* Settings);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Exploration_HUD_C">();
	}
	static class UWBP_Exploration_HUD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Exploration_HUD_C>();
	}
};
static_assert(alignof(UWBP_Exploration_HUD_C) == 0x000008, "Wrong alignment on UWBP_Exploration_HUD_C");
static_assert(sizeof(UWBP_Exploration_HUD_C) == 0x0003F8, "Wrong size on UWBP_Exploration_HUD_C");
static_assert(offsetof(UWBP_Exploration_HUD_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_Exploration_HUD_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Exploration_HUD_C, Anim_MiniMapTransition) == 0x0002E8, "Member 'UWBP_Exploration_HUD_C::Anim_MiniMapTransition' has a wrong offset!");
static_assert(offsetof(UWBP_Exploration_HUD_C, Anim_ShowQuestObjective) == 0x0002F0, "Member 'UWBP_Exploration_HUD_C::Anim_ShowQuestObjective' has a wrong offset!");
static_assert(offsetof(UWBP_Exploration_HUD_C, Anim_ShowOverlay) == 0x0002F8, "Member 'UWBP_Exploration_HUD_C::Anim_ShowOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_Exploration_HUD_C, BackgroundBlur) == 0x000300, "Member 'UWBP_Exploration_HUD_C::BackgroundBlur' has a wrong offset!");
static_assert(offsetof(UWBP_Exploration_HUD_C, ExplorationCanvas) == 0x000308, "Member 'UWBP_Exploration_HUD_C::ExplorationCanvas' has a wrong offset!");
static_assert(offsetof(UWBP_Exploration_HUD_C, ExternalSlot) == 0x000310, "Member 'UWBP_Exploration_HUD_C::ExternalSlot' has a wrong offset!");
static_assert(offsetof(UWBP_Exploration_HUD_C, HUDOverlay) == 0x000318, "Member 'UWBP_Exploration_HUD_C::HUDOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_Exploration_HUD_C, OverlayCompass) == 0x000320, "Member 'UWBP_Exploration_HUD_C::OverlayCompass' has a wrong offset!");
static_assert(offsetof(UWBP_Exploration_HUD_C, OverlaySafeZone) == 0x000328, "Member 'UWBP_Exploration_HUD_C::OverlaySafeZone' has a wrong offset!");
static_assert(offsetof(UWBP_Exploration_HUD_C, PersistentCenterDot) == 0x000330, "Member 'UWBP_Exploration_HUD_C::PersistentCenterDot' has a wrong offset!");
static_assert(offsetof(UWBP_Exploration_HUD_C, PromptBox) == 0x000338, "Member 'UWBP_Exploration_HUD_C::PromptBox' has a wrong offset!");
static_assert(offsetof(UWBP_Exploration_HUD_C, QuestObjectiveBackground) == 0x000340, "Member 'UWBP_Exploration_HUD_C::QuestObjectiveBackground' has a wrong offset!");
static_assert(offsetof(UWBP_Exploration_HUD_C, WBP_CrossHair) == 0x000348, "Member 'UWBP_Exploration_HUD_C::WBP_CrossHair' has a wrong offset!");
static_assert(offsetof(UWBP_Exploration_HUD_C, WBP_DialogueOverlay) == 0x000350, "Member 'UWBP_Exploration_HUD_C::WBP_DialogueOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_Exploration_HUD_C, WBP_HintOverlay) == 0x000358, "Member 'UWBP_Exploration_HUD_C::WBP_HintOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_Exploration_HUD_C, WBP_HUD_LevelNameAnnounceQueue) == 0x000360, "Member 'UWBP_Exploration_HUD_C::WBP_HUD_LevelNameAnnounceQueue' has a wrong offset!");
static_assert(offsetof(UWBP_Exploration_HUD_C, WBP_HUD_LootList) == 0x000368, "Member 'UWBP_Exploration_HUD_C::WBP_HUD_LootList' has a wrong offset!");
static_assert(offsetof(UWBP_Exploration_HUD_C, WBP_HUD_LootQueue) == 0x000370, "Member 'UWBP_Exploration_HUD_C::WBP_HUD_LootQueue' has a wrong offset!");
static_assert(offsetof(UWBP_Exploration_HUD_C, WBP_HUD_TeamStatus) == 0x000378, "Member 'UWBP_Exploration_HUD_C::WBP_HUD_TeamStatus' has a wrong offset!");
static_assert(offsetof(UWBP_Exploration_HUD_C, WBP_OverlayQuestObjective) == 0x000380, "Member 'UWBP_Exploration_HUD_C::WBP_OverlayQuestObjective' has a wrong offset!");
static_assert(offsetof(UWBP_Exploration_HUD_C, WBP_PromptContainer) == 0x000388, "Member 'UWBP_Exploration_HUD_C::WBP_PromptContainer' has a wrong offset!");
static_assert(offsetof(UWBP_Exploration_HUD_C, WBP_ScreenPromptsContainer) == 0x000390, "Member 'UWBP_Exploration_HUD_C::WBP_ScreenPromptsContainer' has a wrong offset!");
static_assert(offsetof(UWBP_Exploration_HUD_C, WBP_Subtitle) == 0x000398, "Member 'UWBP_Exploration_HUD_C::WBP_Subtitle' has a wrong offset!");
static_assert(offsetof(UWBP_Exploration_HUD_C, WBP_WorldMapLevelNameContainer) == 0x0003A0, "Member 'UWBP_Exploration_HUD_C::WBP_WorldMapLevelNameContainer' has a wrong offset!");
static_assert(offsetof(UWBP_Exploration_HUD_C, WBP_WorldMapPromptContainer) == 0x0003A8, "Member 'UWBP_Exploration_HUD_C::WBP_WorldMapPromptContainer' has a wrong offset!");
static_assert(offsetof(UWBP_Exploration_HUD_C, WorldMapCompass) == 0x0003B0, "Member 'UWBP_Exploration_HUD_C::WorldMapCompass' has a wrong offset!");
static_assert(offsetof(UWBP_Exploration_HUD_C, WorldMapHUDContainer) == 0x0003B8, "Member 'UWBP_Exploration_HUD_C::WorldMapHUDContainer' has a wrong offset!");
static_assert(offsetof(UWBP_Exploration_HUD_C, OverlayTimer) == 0x0003C0, "Member 'UWBP_Exploration_HUD_C::OverlayTimer' has a wrong offset!");
static_assert(offsetof(UWBP_Exploration_HUD_C, MiniMapWidget) == 0x0003C8, "Member 'UWBP_Exploration_HUD_C::MiniMapWidget' has a wrong offset!");
static_assert(offsetof(UWBP_Exploration_HUD_C, DEBUG_OverlayWidgetClass) == 0x0003D0, "Member 'UWBP_Exploration_HUD_C::DEBUG_OverlayWidgetClass' has a wrong offset!");

}

