#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_GraphicsOptionsList

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_Settings_GraphicsOptionsList.WBP_Settings_GraphicsOptionsList_C.BindOnOptionEntryFocused
// 0x0010 (0x0010 - 0x0000)
struct WBP_Settings_GraphicsOptionsList_C_BindOnOptionEntryFocused final
{
public:
	TDelegate<void(class UWBP_Settings_OptionEntry_C* Widget)> Event;                                // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_GraphicsOptionsList_C_BindOnOptionEntryFocused) == 0x000004, "Wrong alignment on WBP_Settings_GraphicsOptionsList_C_BindOnOptionEntryFocused");
static_assert(sizeof(WBP_Settings_GraphicsOptionsList_C_BindOnOptionEntryFocused) == 0x000010, "Wrong size on WBP_Settings_GraphicsOptionsList_C_BindOnOptionEntryFocused");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BindOnOptionEntryFocused, Event) == 0x000000, "Member 'WBP_Settings_GraphicsOptionsList_C_BindOnOptionEntryFocused::Event' has a wrong offset!");

// Function WBP_Settings_GraphicsOptionsList.WBP_Settings_GraphicsOptionsList_C.BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_AntiAliasing_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_AntiAliasing_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_0;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUserWidget*                            Widget;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_AntiAliasing_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_AntiAliasing_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_AntiAliasing_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_AntiAliasing_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_AntiAliasing_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_AntiAliasing_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_AntiAliasing_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature, Name_0) == 0x000008, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_AntiAliasing_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature::Name_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_AntiAliasing_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature, Widget) == 0x000018, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_AntiAliasing_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_GraphicsOptionsList.WBP_Settings_GraphicsOptionsList_C.BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_EffectsQuality_K2Node_ComponentBoundEvent_9_OnValueChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_EffectsQuality_K2Node_ComponentBoundEvent_9_OnValueChanged__DelegateSignature final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_0;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUserWidget*                            Widget;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_EffectsQuality_K2Node_ComponentBoundEvent_9_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_EffectsQuality_K2Node_ComponentBoundEvent_9_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_EffectsQuality_K2Node_ComponentBoundEvent_9_OnValueChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_EffectsQuality_K2Node_ComponentBoundEvent_9_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_EffectsQuality_K2Node_ComponentBoundEvent_9_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_EffectsQuality_K2Node_ComponentBoundEvent_9_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_EffectsQuality_K2Node_ComponentBoundEvent_9_OnValueChanged__DelegateSignature, Name_0) == 0x000008, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_EffectsQuality_K2Node_ComponentBoundEvent_9_OnValueChanged__DelegateSignature::Name_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_EffectsQuality_K2Node_ComponentBoundEvent_9_OnValueChanged__DelegateSignature, Widget) == 0x000018, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_EffectsQuality_K2Node_ComponentBoundEvent_9_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_GraphicsOptionsList.WBP_Settings_GraphicsOptionsList_C.BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_FoliageQuality_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_FoliageQuality_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_0;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUserWidget*                            Widget;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_FoliageQuality_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_FoliageQuality_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_FoliageQuality_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_FoliageQuality_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_FoliageQuality_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_FoliageQuality_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_FoliageQuality_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature, Name_0) == 0x000008, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_FoliageQuality_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature::Name_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_FoliageQuality_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature, Widget) == 0x000018, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_FoliageQuality_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_GraphicsOptionsList.WBP_Settings_GraphicsOptionsList_C.BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_GlobalIlluminationQuality_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_GlobalIlluminationQuality_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_0;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUserWidget*                            Widget;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_GlobalIlluminationQuality_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_GlobalIlluminationQuality_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_GlobalIlluminationQuality_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_GlobalIlluminationQuality_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_GlobalIlluminationQuality_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_GlobalIlluminationQuality_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_GlobalIlluminationQuality_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature, Name_0) == 0x000008, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_GlobalIlluminationQuality_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature::Name_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_GlobalIlluminationQuality_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature, Widget) == 0x000018, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_GlobalIlluminationQuality_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_GraphicsOptionsList.WBP_Settings_GraphicsOptionsList_C.BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_PostProcessQuality_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_PostProcessQuality_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_0;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUserWidget*                            Widget;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_PostProcessQuality_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_PostProcessQuality_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_PostProcessQuality_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_PostProcessQuality_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_PostProcessQuality_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_PostProcessQuality_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_PostProcessQuality_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature, Name_0) == 0x000008, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_PostProcessQuality_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature::Name_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_PostProcessQuality_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature, Widget) == 0x000018, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_PostProcessQuality_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_GraphicsOptionsList.WBP_Settings_GraphicsOptionsList_C.BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_QuickPreset_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_QuickPreset_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_0;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUserWidget*                            Widget;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_QuickPreset_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_QuickPreset_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_QuickPreset_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_QuickPreset_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_QuickPreset_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_QuickPreset_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_QuickPreset_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature, Name_0) == 0x000008, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_QuickPreset_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature::Name_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_QuickPreset_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature, Widget) == 0x000018, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_QuickPreset_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_GraphicsOptionsList.WBP_Settings_GraphicsOptionsList_C.BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_ReflectionQuality_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_ReflectionQuality_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_0;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUserWidget*                            Widget;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_ReflectionQuality_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_ReflectionQuality_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_ReflectionQuality_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_ReflectionQuality_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_ReflectionQuality_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_ReflectionQuality_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_ReflectionQuality_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature, Name_0) == 0x000008, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_ReflectionQuality_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature::Name_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_ReflectionQuality_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature, Widget) == 0x000018, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_ReflectionQuality_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_GraphicsOptionsList.WBP_Settings_GraphicsOptionsList_C.BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_ShadingQuality_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_ShadingQuality_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_0;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUserWidget*                            Widget;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_ShadingQuality_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_ShadingQuality_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_ShadingQuality_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_ShadingQuality_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_ShadingQuality_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_ShadingQuality_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_ShadingQuality_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature, Name_0) == 0x000008, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_ShadingQuality_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature::Name_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_ShadingQuality_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature, Widget) == 0x000018, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_ShadingQuality_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_GraphicsOptionsList.WBP_Settings_GraphicsOptionsList_C.BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_ShadowsQuality_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_ShadowsQuality_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_0;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUserWidget*                            Widget;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_ShadowsQuality_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_ShadowsQuality_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_ShadowsQuality_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_ShadowsQuality_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_ShadowsQuality_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_ShadowsQuality_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_ShadowsQuality_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature, Name_0) == 0x000008, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_ShadowsQuality_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature::Name_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_ShadowsQuality_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature, Widget) == 0x000018, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_ShadowsQuality_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_GraphicsOptionsList.WBP_Settings_GraphicsOptionsList_C.BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_TextureQuality_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_TextureQuality_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_0;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUserWidget*                            Widget;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_TextureQuality_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_TextureQuality_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_TextureQuality_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_TextureQuality_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_TextureQuality_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_TextureQuality_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_TextureQuality_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature, Name_0) == 0x000008, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_TextureQuality_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature::Name_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_TextureQuality_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature, Widget) == 0x000018, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptions1_WBP_NamedIntegerSelector_TextureQuality_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_GraphicsOptionsList.WBP_Settings_GraphicsOptionsList_C.BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_ChromaticAberration_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_ChromaticAberration_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_0;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUserWidget*                            Widget;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_ChromaticAberration_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_ChromaticAberration_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_ChromaticAberration_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_ChromaticAberration_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_ChromaticAberration_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_ChromaticAberration_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_ChromaticAberration_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature, Name_0) == 0x000008, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_ChromaticAberration_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature::Name_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_ChromaticAberration_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature, Widget) == 0x000018, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_ChromaticAberration_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_GraphicsOptionsList.WBP_Settings_GraphicsOptionsList_C.BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_FilmGrain_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_FilmGrain_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_0;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUserWidget*                            Widget;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_FilmGrain_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_FilmGrain_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_FilmGrain_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_FilmGrain_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_FilmGrain_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_FilmGrain_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_FilmGrain_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature, Name_0) == 0x000008, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_FilmGrain_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature::Name_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_FilmGrain_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature, Widget) == 0x000018, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_FilmGrain_K2Node_ComponentBoundEvent_11_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_GraphicsOptionsList.WBP_Settings_GraphicsOptionsList_C.BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_MotionBlur_K2Node_ComponentBoundEvent_12_OnValueChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_MotionBlur_K2Node_ComponentBoundEvent_12_OnValueChanged__DelegateSignature final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_0;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUserWidget*                            Widget;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_MotionBlur_K2Node_ComponentBoundEvent_12_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_MotionBlur_K2Node_ComponentBoundEvent_12_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_MotionBlur_K2Node_ComponentBoundEvent_12_OnValueChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_MotionBlur_K2Node_ComponentBoundEvent_12_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_MotionBlur_K2Node_ComponentBoundEvent_12_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_MotionBlur_K2Node_ComponentBoundEvent_12_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_MotionBlur_K2Node_ComponentBoundEvent_12_OnValueChanged__DelegateSignature, Name_0) == 0x000008, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_MotionBlur_K2Node_ComponentBoundEvent_12_OnValueChanged__DelegateSignature::Name_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_MotionBlur_K2Node_ComponentBoundEvent_12_OnValueChanged__DelegateSignature, Widget) == 0x000018, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_MotionBlur_K2Node_ComponentBoundEvent_12_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_GraphicsOptionsList.WBP_Settings_GraphicsOptionsList_C.BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_Vignette_K2Node_ComponentBoundEvent_13_OnValueChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_Vignette_K2Node_ComponentBoundEvent_13_OnValueChanged__DelegateSignature final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_0;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUserWidget*                            Widget;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_Vignette_K2Node_ComponentBoundEvent_13_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_Vignette_K2Node_ComponentBoundEvent_13_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_Vignette_K2Node_ComponentBoundEvent_13_OnValueChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_Vignette_K2Node_ComponentBoundEvent_13_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_Vignette_K2Node_ComponentBoundEvent_13_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_Vignette_K2Node_ComponentBoundEvent_13_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_Vignette_K2Node_ComponentBoundEvent_13_OnValueChanged__DelegateSignature, Name_0) == 0x000008, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_Vignette_K2Node_ComponentBoundEvent_13_OnValueChanged__DelegateSignature::Name_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_Vignette_K2Node_ComponentBoundEvent_13_OnValueChanged__DelegateSignature, Widget) == 0x000018, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_Vignette_K2Node_ComponentBoundEvent_13_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_GraphicsOptionsList.WBP_Settings_GraphicsOptionsList_C.BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_VSync_K2Node_ComponentBoundEvent_17_OnValueChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_VSync_K2Node_ComponentBoundEvent_17_OnValueChanged__DelegateSignature final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_0;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUserWidget*                            Widget;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_VSync_K2Node_ComponentBoundEvent_17_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_VSync_K2Node_ComponentBoundEvent_17_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_VSync_K2Node_ComponentBoundEvent_17_OnValueChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_VSync_K2Node_ComponentBoundEvent_17_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_VSync_K2Node_ComponentBoundEvent_17_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_VSync_K2Node_ComponentBoundEvent_17_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_VSync_K2Node_ComponentBoundEvent_17_OnValueChanged__DelegateSignature, Name_0) == 0x000008, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_VSync_K2Node_ComponentBoundEvent_17_OnValueChanged__DelegateSignature::Name_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_VSync_K2Node_ComponentBoundEvent_17_OnValueChanged__DelegateSignature, Widget) == 0x000018, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedBoolSelector_VSync_K2Node_ComponentBoundEvent_17_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_GraphicsOptionsList.WBP_Settings_GraphicsOptionsList_C.BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedFloatSelector_MaxFPS_K2Node_ComponentBoundEvent_19_OnValueChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedFloatSelector_MaxFPS_K2Node_ComponentBoundEvent_19_OnValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Name_0;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUserWidget*                            Widget;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedFloatSelector_MaxFPS_K2Node_ComponentBoundEvent_19_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedFloatSelector_MaxFPS_K2Node_ComponentBoundEvent_19_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedFloatSelector_MaxFPS_K2Node_ComponentBoundEvent_19_OnValueChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedFloatSelector_MaxFPS_K2Node_ComponentBoundEvent_19_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedFloatSelector_MaxFPS_K2Node_ComponentBoundEvent_19_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedFloatSelector_MaxFPS_K2Node_ComponentBoundEvent_19_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedFloatSelector_MaxFPS_K2Node_ComponentBoundEvent_19_OnValueChanged__DelegateSignature, Name_0) == 0x000008, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedFloatSelector_MaxFPS_K2Node_ComponentBoundEvent_19_OnValueChanged__DelegateSignature::Name_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedFloatSelector_MaxFPS_K2Node_ComponentBoundEvent_19_OnValueChanged__DelegateSignature, Widget) == 0x000018, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedFloatSelector_MaxFPS_K2Node_ComponentBoundEvent_19_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_GraphicsOptionsList.WBP_Settings_GraphicsOptionsList_C.BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedIntegerSelector_ActiveMonitor_K2Node_ComponentBoundEvent_23_OnValueChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedIntegerSelector_ActiveMonitor_K2Node_ComponentBoundEvent_23_OnValueChanged__DelegateSignature final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_0;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUserWidget*                            Widget;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedIntegerSelector_ActiveMonitor_K2Node_ComponentBoundEvent_23_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedIntegerSelector_ActiveMonitor_K2Node_ComponentBoundEvent_23_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedIntegerSelector_ActiveMonitor_K2Node_ComponentBoundEvent_23_OnValueChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedIntegerSelector_ActiveMonitor_K2Node_ComponentBoundEvent_23_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedIntegerSelector_ActiveMonitor_K2Node_ComponentBoundEvent_23_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedIntegerSelector_ActiveMonitor_K2Node_ComponentBoundEvent_23_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedIntegerSelector_ActiveMonitor_K2Node_ComponentBoundEvent_23_OnValueChanged__DelegateSignature, Name_0) == 0x000008, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedIntegerSelector_ActiveMonitor_K2Node_ComponentBoundEvent_23_OnValueChanged__DelegateSignature::Name_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedIntegerSelector_ActiveMonitor_K2Node_ComponentBoundEvent_23_OnValueChanged__DelegateSignature, Widget) == 0x000018, "Member 'WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedIntegerSelector_ActiveMonitor_K2Node_ComponentBoundEvent_23_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_GraphicsOptionsList.WBP_Settings_GraphicsOptionsList_C.BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedIntegerSelector_ConsolePreset_K2Node_ComponentBoundEvent_20_OnValueChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedIntegerSelector_ConsolePreset_K2Node_ComponentBoundEvent_20_OnValueChanged__DelegateSignature final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_0;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUserWidget*                            Widget;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedIntegerSelector_ConsolePreset_K2Node_ComponentBoundEvent_20_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_GraphicsOptionsList_C_BndEvt__WBP_Settings_GraphicsOptionsList_WBP_NamedIntegerSelector_ConsolePreset_K2Node_ComponentBoundEvent_20_OnValueChanged__DelegateSignature");
