#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_LootList

#include "Basic.hpp"

#include "S_jRPG_Item_StaticData_structs.hpp"


namespace SDK::Params
{

// Function WBP_HUD_LootList.WBP_HUD_LootList_C.AddLoot
// 0x0050 (0x0050 - 0x0000)
struct WBP_HUD_LootList_C_AddLoot final
{
public:
	TMap<class FName, int32>                      ItemTypeAndQuantity;                               // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_HUD_LootList_C_AddLoot) == 0x000008, "Wrong alignment on WBP_HUD_LootList_C_AddLoot");
static_assert(sizeof(WBP_HUD_LootList_C_AddLoot) == 0x000050, "Wrong size on WBP_HUD_LootList_C_AddLoot");
static_assert(offsetof(WBP_HUD_LootList_C_AddLoot, ItemTypeAndQuantity) == 0x000000, "Member 'WBP_HUD_LootList_C_AddLoot::ItemTypeAndQuantity' has a wrong offset!");

// Function WBP_HUD_LootList.WBP_HUD_LootList_C.AddLootFromGeneratedItems
// 0x0010 (0x0010 - 0x0000)
struct WBP_HUD_LootList_C_AddLootFromGeneratedItems final
{
public:
	TArray<class UBP_GeneratedItemInfo_Base_C*>   GeneratedItems;                                    // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_HUD_LootList_C_AddLootFromGeneratedItems) == 0x000008, "Wrong alignment on WBP_HUD_LootList_C_AddLootFromGeneratedItems");
static_assert(sizeof(WBP_HUD_LootList_C_AddLootFromGeneratedItems) == 0x000010, "Wrong size on WBP_HUD_LootList_C_AddLootFromGeneratedItems");
static_assert(offsetof(WBP_HUD_LootList_C_AddLootFromGeneratedItems, GeneratedItems) == 0x000000, "Member 'WBP_HUD_LootList_C_AddLootFromGeneratedItems::GeneratedItems' has a wrong offset!");

// Function WBP_HUD_LootList.WBP_HUD_LootList_C.ExecuteUbergraph_WBP_HUD_LootList
// 0x02E0 (0x02E0 - 0x0000)
struct WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_HUD_LootEntry_C*                   CallFunc_SpawnObject_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, int32>                      K2Node_CustomEvent_ItemTypeAndQuantity_1;          // 0x0038(0x0050)()
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x0088(0x0010)(ReferenceParm)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetItemStaticDefinitionFromID_Found;      // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_jRPG_Item_StaticData                CallFunc_GetItemStaticDefinitionFromID_ReturnValue; // 0x00A8(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Find_Value;                           // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E5[0x3];                                      // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, int32>                      K2Node_CustomEvent_ItemTypeAndQuantity;            // 0x01E8(0x0050)()
	class UWBP_HUD_LootEntry_C*                   CallFunc_SpawnObject_ReturnValue_1;                // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_HUD_LootEntry_C*                   CallFunc_Array_Get_Item_1;                         // 0x0248(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25A[0x6];                                      // 0x025A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0270(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0278(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_2;                         // 0x0290(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_HUD_LootEntry_C*                   K2Node_DynamicCast_AsWBP_HUD_Loot_Entry;           // 0x0298(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AA[0x6];                                      // 0x02AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_GeneratedItemInfo_Base_C*>   K2Node_CustomEvent_GeneratedItems;                 // 0x02B0(0x0010)(ConstParm, ReferenceParm)
	class UBP_GeneratedItemInfo_Base_C*           CallFunc_Array_Get_Item_3;                         // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x02CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CE[0x2];                                      // 0x02CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_1;      // 0x02D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList) == 0x000008, "Wrong alignment on WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList");
static_assert(sizeof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList) == 0x0002E0, "Wrong size on WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, EntryPoint) == 0x000000, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, CallFunc_SpawnObject_ReturnValue) == 0x000008, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, Temp_int_Loop_Counter_Variable_1) == 0x000018, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, Temp_int_Array_Index_Variable_1) == 0x000024, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, Temp_int_Loop_Counter_Variable_2) == 0x000028, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, CallFunc_Add_IntInt_ReturnValue_2) == 0x00002C, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, Temp_int_Array_Index_Variable_2) == 0x000030, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, Temp_bool_IsClosed_Variable) == 0x000034, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, K2Node_CustomEvent_ItemTypeAndQuantity_1) == 0x000038, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::K2Node_CustomEvent_ItemTypeAndQuantity_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, CallFunc_Map_Keys_Keys) == 0x000088, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000098, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, CallFunc_Array_Get_Item) == 0x00009C, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, CallFunc_GetItemStaticDefinitionFromID_Found) == 0x0000A4, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::CallFunc_GetItemStaticDefinitionFromID_Found' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, CallFunc_GetItemStaticDefinitionFromID_ReturnValue) == 0x0000A8, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::CallFunc_GetItemStaticDefinitionFromID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, CallFunc_Map_Find_Value) == 0x0001D8, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, CallFunc_Map_Find_ReturnValue) == 0x0001DC, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, CallFunc_Array_Length_ReturnValue) == 0x0001E0, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, CallFunc_Less_IntInt_ReturnValue) == 0x0001E4, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, K2Node_CustomEvent_ItemTypeAndQuantity) == 0x0001E8, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::K2Node_CustomEvent_ItemTypeAndQuantity' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, CallFunc_SpawnObject_ReturnValue_1) == 0x000238, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::CallFunc_SpawnObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, CallFunc_Array_Add_ReturnValue) == 0x000240, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, CallFunc_Array_Get_Item_1) == 0x000248, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, Temp_bool_Has_Been_Initd_Variable) == 0x000250, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, CallFunc_Array_Length_ReturnValue_1) == 0x000254, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, CallFunc_Greater_IntInt_ReturnValue) == 0x000258, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, Temp_bool_Has_Been_Initd_Variable_1) == 0x000259, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, CallFunc_PlayAnimation_ReturnValue) == 0x000260, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, CallFunc_PlayAnimation_ReturnValue_1) == 0x000268, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000270, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, CallFunc_GetAllChildren_ReturnValue) == 0x000278, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, Temp_bool_IsClosed_Variable_1) == 0x000288, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, CallFunc_Array_Get_Item_2) == 0x000290, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, K2Node_DynamicCast_AsWBP_HUD_Loot_Entry) == 0x000298, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::K2Node_DynamicCast_AsWBP_HUD_Loot_Entry' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, K2Node_DynamicCast_bSuccess) == 0x0002A0, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, CallFunc_Array_Length_ReturnValue_2) == 0x0002A4, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, CallFunc_Less_IntInt_ReturnValue_1) == 0x0002A8, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, CallFunc_Not_PreBool_ReturnValue) == 0x0002A9, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, K2Node_CustomEvent_GeneratedItems) == 0x0002B0, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::K2Node_CustomEvent_GeneratedItems' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, CallFunc_Array_Get_Item_3) == 0x0002C0, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, CallFunc_Array_Length_ReturnValue_3) == 0x0002C8, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, CallFunc_Less_IntInt_ReturnValue_2) == 0x0002CC, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x0002CD, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, CallFunc_Array_Add_ReturnValue_1) == 0x0002D0, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList, CallFunc_AddChildToVerticalBox_ReturnValue_1) == 0x0002D8, "Member 'WBP_HUD_LootList_C_ExecuteUbergraph_WBP_HUD_LootList::CallFunc_AddChildToVerticalBox_ReturnValue_1' has a wrong offset!");

// Function WBP_HUD_LootList.WBP_HUD_LootList_C.PostBattleLootList
// 0x0050 (0x0050 - 0x0000)
struct WBP_HUD_LootList_C_PostBattleLootList final
{
public:
	TMap<class FName, int32>                      ItemTypeAndQuantity;                               // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_HUD_LootList_C_PostBattleLootList) == 0x000008, "Wrong alignment on WBP_HUD_LootList_C_PostBattleLootList");
static_assert(sizeof(WBP_HUD_LootList_C_PostBattleLootList) == 0x000050, "Wrong size on WBP_HUD_LootList_C_PostBattleLootList");
static_assert(offsetof(WBP_HUD_LootList_C_PostBattleLootList, ItemTypeAndQuantity) == 0x000000, "Member 'WBP_HUD_LootList_C_PostBattleLootList::ItemTypeAndQuantity' has a wrong offset!");

}

