#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RelationshipNumber

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SandFall_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RelationshipNumber.WBP_RelationshipNumber_C
// 0x0058 (0x0338 - 0x02E0)
class UWBP_RelationshipNumber_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_AppearNextText;                               // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               CurrentText;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       CurrentTextBackground;                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               NextText;                                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WrappingText_C*                    TextBlock_CurrentText;                             // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WrappingText_C*                    TextBlock_NextText;                                // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnAnimationAppearNextTextFinished;                 // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FSoundEventDataTableRowHandle          SD_NumberUp;                                       // 0x0328(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void Construct();
	void ExecuteUbergraph_WBP_RelationshipNumber(int32 EntryPoint);
	void OnPlayNextNextAnimationFinished();
	void PlayNextTextAnimation();
	void SetNextText(const class FText& InText, bool IsMax);
	void SetText(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RelationshipNumber_C">();
	}
	static class UWBP_RelationshipNumber_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RelationshipNumber_C>();
	}
};
static_assert(alignof(UWBP_RelationshipNumber_C) == 0x000008, "Wrong alignment on UWBP_RelationshipNumber_C");
static_assert(sizeof(UWBP_RelationshipNumber_C) == 0x000338, "Wrong size on UWBP_RelationshipNumber_C");
static_assert(offsetof(UWBP_RelationshipNumber_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_RelationshipNumber_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_RelationshipNumber_C, Anim_AppearNextText) == 0x0002E8, "Member 'UWBP_RelationshipNumber_C::Anim_AppearNextText' has a wrong offset!");
static_assert(offsetof(UWBP_RelationshipNumber_C, CurrentText) == 0x0002F0, "Member 'UWBP_RelationshipNumber_C::CurrentText' has a wrong offset!");
static_assert(offsetof(UWBP_RelationshipNumber_C, CurrentTextBackground) == 0x0002F8, "Member 'UWBP_RelationshipNumber_C::CurrentTextBackground' has a wrong offset!");
static_assert(offsetof(UWBP_RelationshipNumber_C, NextText) == 0x000300, "Member 'UWBP_RelationshipNumber_C::NextText' has a wrong offset!");
static_assert(offsetof(UWBP_RelationshipNumber_C, TextBlock_CurrentText) == 0x000308, "Member 'UWBP_RelationshipNumber_C::TextBlock_CurrentText' has a wrong offset!");
static_assert(offsetof(UWBP_RelationshipNumber_C, TextBlock_NextText) == 0x000310, "Member 'UWBP_RelationshipNumber_C::TextBlock_NextText' has a wrong offset!");
static_assert(offsetof(UWBP_RelationshipNumber_C, OnAnimationAppearNextTextFinished) == 0x000318, "Member 'UWBP_RelationshipNumber_C::OnAnimationAppearNextTextFinished' has a wrong offset!");
static_assert(offsetof(UWBP_RelationshipNumber_C, SD_NumberUp) == 0x000328, "Member 'UWBP_RelationshipNumber_C::SD_NumberUp' has a wrong offset!");

}

