#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_WheelsContainer

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "EBattleForbiddenActionReason_structs.hpp"
#include "EBattleTurnState_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_HUD_WheelsContainer.WBP_HUD_WheelsContainer_C.GetItemsPage
// 0x0010 (0x0010 - 0x0000)
struct WBP_HUD_WheelsContainer_C_GetItemsPage final
{
public:
	TScriptInterface<class IWBPI_WheelPage_C>     Page;                                              // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_WheelsContainer_C_GetItemsPage) == 0x000008, "Wrong alignment on WBP_HUD_WheelsContainer_C_GetItemsPage");
static_assert(sizeof(WBP_HUD_WheelsContainer_C_GetItemsPage) == 0x000010, "Wrong size on WBP_HUD_WheelsContainer_C_GetItemsPage");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_GetItemsPage, Page) == 0x000000, "Member 'WBP_HUD_WheelsContainer_C_GetItemsPage::Page' has a wrong offset!");

// Function WBP_HUD_WheelsContainer.WBP_HUD_WheelsContainer_C.FindActiveWheelTag
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_HUD_WheelsContainer_C_FindActiveWheelTag final
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0000(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<struct FGameplayTag, TScriptInterface<class IWBPI_WheelPage_C>> K2Node_MakeMap_Map;         // 0x0020(0x0050)(ConstParm)
	TArray<struct FGameplayTag>                   CallFunc_Map_Keys_Keys;                            // 0x0070(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x0084(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IWBPI_WheelPage_C>     CallFunc_Map_Find_Value;                           // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue_1;     // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_WheelsContainer_C_FindActiveWheelTag) == 0x000008, "Wrong alignment on WBP_HUD_WheelsContainer_C_FindActiveWheelTag");
static_assert(sizeof(WBP_HUD_WheelsContainer_C_FindActiveWheelTag) == 0x0000B8, "Wrong size on WBP_HUD_WheelsContainer_C_FindActiveWheelTag");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_FindActiveWheelTag, GameplayTag) == 0x000000, "Member 'WBP_HUD_WheelsContainer_C_FindActiveWheelTag::GameplayTag' has a wrong offset!");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_FindActiveWheelTag, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_HUD_WheelsContainer_C_FindActiveWheelTag::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_FindActiveWheelTag, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_HUD_WheelsContainer_C_FindActiveWheelTag::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_FindActiveWheelTag, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_HUD_WheelsContainer_C_FindActiveWheelTag::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_FindActiveWheelTag, CallFunc_Conv_InterfaceToObject_ReturnValue) == 0x000018, "Member 'WBP_HUD_WheelsContainer_C_FindActiveWheelTag::CallFunc_Conv_InterfaceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_FindActiveWheelTag, K2Node_MakeMap_Map) == 0x000020, "Member 'WBP_HUD_WheelsContainer_C_FindActiveWheelTag::K2Node_MakeMap_Map' has a wrong offset!");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_FindActiveWheelTag, CallFunc_Map_Keys_Keys) == 0x000070, "Member 'WBP_HUD_WheelsContainer_C_FindActiveWheelTag::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_FindActiveWheelTag, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'WBP_HUD_WheelsContainer_C_FindActiveWheelTag::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_FindActiveWheelTag, CallFunc_Array_Get_Item) == 0x000084, "Member 'WBP_HUD_WheelsContainer_C_FindActiveWheelTag::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_FindActiveWheelTag, CallFunc_Less_IntInt_ReturnValue) == 0x00008C, "Member 'WBP_HUD_WheelsContainer_C_FindActiveWheelTag::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_FindActiveWheelTag, CallFunc_Map_Find_Value) == 0x000090, "Member 'WBP_HUD_WheelsContainer_C_FindActiveWheelTag::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_FindActiveWheelTag, CallFunc_Map_Find_ReturnValue) == 0x0000A0, "Member 'WBP_HUD_WheelsContainer_C_FindActiveWheelTag::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_FindActiveWheelTag, CallFunc_Conv_InterfaceToObject_ReturnValue_1) == 0x0000A8, "Member 'WBP_HUD_WheelsContainer_C_FindActiveWheelTag::CallFunc_Conv_InterfaceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_FindActiveWheelTag, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000B0, "Member 'WBP_HUD_WheelsContainer_C_FindActiveWheelTag::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WBP_HUD_WheelsContainer.WBP_HUD_WheelsContainer_C.GetActiveWheelAsObject
// 0x0010 (0x0010 - 0x0000)
struct WBP_HUD_WheelsContainer_C_GetActiveWheelAsObject final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_WheelsContainer_C_GetActiveWheelAsObject) == 0x000008, "Wrong alignment on WBP_HUD_WheelsContainer_C_GetActiveWheelAsObject");
static_assert(sizeof(WBP_HUD_WheelsContainer_C_GetActiveWheelAsObject) == 0x000010, "Wrong size on WBP_HUD_WheelsContainer_C_GetActiveWheelAsObject");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_GetActiveWheelAsObject, ReturnValue) == 0x000000, "Member 'WBP_HUD_WheelsContainer_C_GetActiveWheelAsObject::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_GetActiveWheelAsObject, CallFunc_Conv_InterfaceToObject_ReturnValue) == 0x000008, "Member 'WBP_HUD_WheelsContainer_C_GetActiveWheelAsObject::CallFunc_Conv_InterfaceToObject_ReturnValue' has a wrong offset!");

// Function WBP_HUD_WheelsContainer.WBP_HUD_WheelsContainer_C.GetActiveWheel
// 0x0010 (0x0010 - 0x0000)
struct WBP_HUD_WheelsContainer_C_GetActiveWheel final
{
public:
	TScriptInterface<class IWBPI_WheelPage_C>     ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_WheelsContainer_C_GetActiveWheel) == 0x000008, "Wrong alignment on WBP_HUD_WheelsContainer_C_GetActiveWheel");
static_assert(sizeof(WBP_HUD_WheelsContainer_C_GetActiveWheel) == 0x000010, "Wrong size on WBP_HUD_WheelsContainer_C_GetActiveWheel");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_GetActiveWheel, ReturnValue) == 0x000000, "Member 'WBP_HUD_WheelsContainer_C_GetActiveWheel::ReturnValue' has a wrong offset!");

// Function WBP_HUD_WheelsContainer.WBP_HUD_WheelsContainer_C.GetVirtualTreeParent
// 0x0010 (0x0010 - 0x0000)
struct WBP_HUD_WheelsContainer_C_GetVirtualTreeParent final
{
public:
	class UCommonActivatableWidget*               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_WheelsContainer_C_GetVirtualTreeParent) == 0x000008, "Wrong alignment on WBP_HUD_WheelsContainer_C_GetVirtualTreeParent");
static_assert(sizeof(WBP_HUD_WheelsContainer_C_GetVirtualTreeParent) == 0x000010, "Wrong size on WBP_HUD_WheelsContainer_C_GetVirtualTreeParent");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_GetVirtualTreeParent, ReturnValue) == 0x000000, "Member 'WBP_HUD_WheelsContainer_C_GetVirtualTreeParent::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_GetVirtualTreeParent, CallFunc_GetBattleManager_ReturnValue) == 0x000008, "Member 'WBP_HUD_WheelsContainer_C_GetVirtualTreeParent::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");

// Function WBP_HUD_WheelsContainer.WBP_HUD_WheelsContainer_C.RegisterSkillWheelEvents
// 0x0038 (0x0038 - 0x0000)
struct WBP_HUD_WheelsContainer_C_RegisterSkillWheelEvents final
{
public:
	class UWBP_HUD_SkillWheel_C*                  SkillWheelWidget;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EBattleForbiddenActionReason Reason)> K2Node_CreateDelegate_OutputDelegate;       // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName SkillID)>          K2Node_CreateDelegate_OutputDelegate_2;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_WheelsContainer_C_RegisterSkillWheelEvents) == 0x000008, "Wrong alignment on WBP_HUD_WheelsContainer_C_RegisterSkillWheelEvents");
static_assert(sizeof(WBP_HUD_WheelsContainer_C_RegisterSkillWheelEvents) == 0x000038, "Wrong size on WBP_HUD_WheelsContainer_C_RegisterSkillWheelEvents");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_RegisterSkillWheelEvents, SkillWheelWidget) == 0x000000, "Member 'WBP_HUD_WheelsContainer_C_RegisterSkillWheelEvents::SkillWheelWidget' has a wrong offset!");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_RegisterSkillWheelEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_HUD_WheelsContainer_C_RegisterSkillWheelEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_RegisterSkillWheelEvents, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'WBP_HUD_WheelsContainer_C_RegisterSkillWheelEvents::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_RegisterSkillWheelEvents, K2Node_CreateDelegate_OutputDelegate_2) == 0x000028, "Member 'WBP_HUD_WheelsContainer_C_RegisterSkillWheelEvents::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function WBP_HUD_WheelsContainer.WBP_HUD_WheelsContainer_C.GetSkillWheel
// 0x0008 (0x0008 - 0x0000)
struct WBP_HUD_WheelsContainer_C_GetSkillWheel final
{
public:
	class UWBP_HUD_SkillWheel_C*                  SkillWheel;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_WheelsContainer_C_GetSkillWheel) == 0x000008, "Wrong alignment on WBP_HUD_WheelsContainer_C_GetSkillWheel");
static_assert(sizeof(WBP_HUD_WheelsContainer_C_GetSkillWheel) == 0x000008, "Wrong size on WBP_HUD_WheelsContainer_C_GetSkillWheel");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_GetSkillWheel, SkillWheel) == 0x000000, "Member 'WBP_HUD_WheelsContainer_C_GetSkillWheel::SkillWheel' has a wrong offset!");

// Function WBP_HUD_WheelsContainer.WBP_HUD_WheelsContainer_C.TriggerSkillFromWheel
// 0x0008 (0x0008 - 0x0000)
struct WBP_HUD_WheelsContainer_C_TriggerSkillFromWheel final
{
public:
	class FName                                   SecondaryAction;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_WheelsContainer_C_TriggerSkillFromWheel) == 0x000004, "Wrong alignment on WBP_HUD_WheelsContainer_C_TriggerSkillFromWheel");
static_assert(sizeof(WBP_HUD_WheelsContainer_C_TriggerSkillFromWheel) == 0x000008, "Wrong size on WBP_HUD_WheelsContainer_C_TriggerSkillFromWheel");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_TriggerSkillFromWheel, SecondaryAction) == 0x000000, "Member 'WBP_HUD_WheelsContainer_C_TriggerSkillFromWheel::SecondaryAction' has a wrong offset!");

// Function WBP_HUD_WheelsContainer.WBP_HUD_WheelsContainer_C.UpdateItemsWheel
// 0x0018 (0x0018 - 0x0000)
struct WBP_HUD_WheelsContainer_C_UpdateItemsWheel final
{
public:
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_DataAsset_Skill_C*>          CallFunc_GetBattleItemSkills_ItemSkills;           // 0x0008(0x0010)(ReferenceParm)
};
static_assert(alignof(WBP_HUD_WheelsContainer_C_UpdateItemsWheel) == 0x000008, "Wrong alignment on WBP_HUD_WheelsContainer_C_UpdateItemsWheel");
static_assert(sizeof(WBP_HUD_WheelsContainer_C_UpdateItemsWheel) == 0x000018, "Wrong size on WBP_HUD_WheelsContainer_C_UpdateItemsWheel");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_UpdateItemsWheel, CallFunc_GetBattleManager_ReturnValue) == 0x000000, "Member 'WBP_HUD_WheelsContainer_C_UpdateItemsWheel::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_UpdateItemsWheel, CallFunc_GetBattleItemSkills_ItemSkills) == 0x000008, "Member 'WBP_HUD_WheelsContainer_C_UpdateItemsWheel::CallFunc_GetBattleItemSkills_ItemSkills' has a wrong offset!");

// Function WBP_HUD_WheelsContainer.WBP_HUD_WheelsContainer_C.UpdateCharacterSkillWheels
// 0x0020 (0x0020 - 0x0000)
struct WBP_HUD_WheelsContainer_C_UpdateCharacterSkillWheels final
{
public:
	int32                                         local_ChunkSize;                                   // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_HUD_SkillWheel_C*                  CallFunc_GetSkillWheel_SkillWheel;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_DataAsset_Skill_C*>          CallFunc_GetEquippedCharacterSkills_EquippedSkills; // 0x0010(0x0010)(ReferenceParm)
};
static_assert(alignof(WBP_HUD_WheelsContainer_C_UpdateCharacterSkillWheels) == 0x000008, "Wrong alignment on WBP_HUD_WheelsContainer_C_UpdateCharacterSkillWheels");
static_assert(sizeof(WBP_HUD_WheelsContainer_C_UpdateCharacterSkillWheels) == 0x000020, "Wrong size on WBP_HUD_WheelsContainer_C_UpdateCharacterSkillWheels");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_UpdateCharacterSkillWheels, local_ChunkSize) == 0x000000, "Member 'WBP_HUD_WheelsContainer_C_UpdateCharacterSkillWheels::local_ChunkSize' has a wrong offset!");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_UpdateCharacterSkillWheels, CallFunc_GetSkillWheel_SkillWheel) == 0x000008, "Member 'WBP_HUD_WheelsContainer_C_UpdateCharacterSkillWheels::CallFunc_GetSkillWheel_SkillWheel' has a wrong offset!");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_UpdateCharacterSkillWheels, CallFunc_GetEquippedCharacterSkills_EquippedSkills) == 0x000010, "Member 'WBP_HUD_WheelsContainer_C_UpdateCharacterSkillWheels::CallFunc_GetEquippedCharacterSkills_EquippedSkills' has a wrong offset!");

// Function WBP_HUD_WheelsContainer.WBP_HUD_WheelsContainer_C.ChangeWheelPage
// 0x0010 (0x0010 - 0x0000)
struct WBP_HUD_WheelsContainer_C_ChangeWheelPage final
{
public:
	TScriptInterface<class IWBPI_WheelPage_C>     IWheelPage;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_WheelsContainer_C_ChangeWheelPage) == 0x000008, "Wrong alignment on WBP_HUD_WheelsContainer_C_ChangeWheelPage");
static_assert(sizeof(WBP_HUD_WheelsContainer_C_ChangeWheelPage) == 0x000010, "Wrong size on WBP_HUD_WheelsContainer_C_ChangeWheelPage");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_ChangeWheelPage, IWheelPage) == 0x000000, "Member 'WBP_HUD_WheelsContainer_C_ChangeWheelPage::IWheelPage' has a wrong offset!");

// Function WBP_HUD_WheelsContainer.WBP_HUD_WheelsContainer_C.OnPlayerTurnStart
// 0x0001 (0x0001 - 0x0000)
struct WBP_HUD_WheelsContainer_C_OnPlayerTurnStart final
{
public:
	bool                                          HasChanged;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_WheelsContainer_C_OnPlayerTurnStart) == 0x000001, "Wrong alignment on WBP_HUD_WheelsContainer_C_OnPlayerTurnStart");
static_assert(sizeof(WBP_HUD_WheelsContainer_C_OnPlayerTurnStart) == 0x000001, "Wrong size on WBP_HUD_WheelsContainer_C_OnPlayerTurnStart");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_OnPlayerTurnStart, HasChanged) == 0x000000, "Member 'WBP_HUD_WheelsContainer_C_OnPlayerTurnStart::HasChanged' has a wrong offset!");

// Function WBP_HUD_WheelsContainer.WBP_HUD_WheelsContainer_C.OnWheelChoiceDenied
// 0x0001 (0x0001 - 0x0000)
struct WBP_HUD_WheelsContainer_C_OnWheelChoiceDenied final
{
public:
	EBattleForbiddenActionReason                  Reason;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_WheelsContainer_C_OnWheelChoiceDenied) == 0x000001, "Wrong alignment on WBP_HUD_WheelsContainer_C_OnWheelChoiceDenied");
static_assert(sizeof(WBP_HUD_WheelsContainer_C_OnWheelChoiceDenied) == 0x000001, "Wrong size on WBP_HUD_WheelsContainer_C_OnWheelChoiceDenied");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_OnWheelChoiceDenied, Reason) == 0x000000, "Member 'WBP_HUD_WheelsContainer_C_OnWheelChoiceDenied::Reason' has a wrong offset!");

// Function WBP_HUD_WheelsContainer.WBP_HUD_WheelsContainer_C.OnSkillChosenFromList
// 0x0008 (0x0008 - 0x0000)
struct WBP_HUD_WheelsContainer_C_OnSkillChosenFromList final
{
public:
	class FName                                   SkillID;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_WheelsContainer_C_OnSkillChosenFromList) == 0x000004, "Wrong alignment on WBP_HUD_WheelsContainer_C_OnSkillChosenFromList");
static_assert(sizeof(WBP_HUD_WheelsContainer_C_OnSkillChosenFromList) == 0x000008, "Wrong size on WBP_HUD_WheelsContainer_C_OnSkillChosenFromList");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_OnSkillChosenFromList, SkillID) == 0x000000, "Member 'WBP_HUD_WheelsContainer_C_OnSkillChosenFromList::SkillID' has a wrong offset!");

// Function WBP_HUD_WheelsContainer.WBP_HUD_WheelsContainer_C.BndEvt__WBP_HUD_WheelsContainer_WBP_BattleWheel_Action_K2Node_ComponentBoundEvent_10_OnButtonClicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_HUD_WheelsContainer_C_BndEvt__WBP_HUD_WheelsContainer_WBP_BattleWheel_Action_K2Node_ComponentBoundEvent_10_OnButtonClicked__DelegateSignature final
{
public:
	int32                                         ButtonIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_WheelsContainer_C_BndEvt__WBP_HUD_WheelsContainer_WBP_BattleWheel_Action_K2Node_ComponentBoundEvent_10_OnButtonClicked__DelegateSignature) == 0x000004, "Wrong alignment on WBP_HUD_WheelsContainer_C_BndEvt__WBP_HUD_WheelsContainer_WBP_BattleWheel_Action_K2Node_ComponentBoundEvent_10_OnButtonClicked__DelegateSignature");
static_assert(sizeof(WBP_HUD_WheelsContainer_C_BndEvt__WBP_HUD_WheelsContainer_WBP_BattleWheel_Action_K2Node_ComponentBoundEvent_10_OnButtonClicked__DelegateSignature) == 0x000004, "Wrong size on WBP_HUD_WheelsContainer_C_BndEvt__WBP_HUD_WheelsContainer_WBP_BattleWheel_Action_K2Node_ComponentBoundEvent_10_OnButtonClicked__DelegateSignature");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_BndEvt__WBP_HUD_WheelsContainer_WBP_BattleWheel_Action_K2Node_ComponentBoundEvent_10_OnButtonClicked__DelegateSignature, ButtonIndex) == 0x000000, "Member 'WBP_HUD_WheelsContainer_C_BndEvt__WBP_HUD_WheelsContainer_WBP_BattleWheel_Action_K2Node_ComponentBoundEvent_10_OnButtonClicked__DelegateSignature::ButtonIndex' has a wrong offset!");

// Function WBP_HUD_WheelsContainer.WBP_HUD_WheelsContainer_C.BndEvt__WBP_HUD_WheelsContainer_WBP_HUD_SkillWheel_Items_K2Node_ComponentBoundEvent_12_OnSkillChosen__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_HUD_WheelsContainer_C_BndEvt__WBP_HUD_WheelsContainer_WBP_HUD_SkillWheel_Items_K2Node_ComponentBoundEvent_12_OnSkillChosen__DelegateSignature final
{
public:
	class FName                                   SkillID;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_WheelsContainer_C_BndEvt__WBP_HUD_WheelsContainer_WBP_HUD_SkillWheel_Items_K2Node_ComponentBoundEvent_12_OnSkillChosen__DelegateSignature) == 0x000004, "Wrong alignment on WBP_HUD_WheelsContainer_C_BndEvt__WBP_HUD_WheelsContainer_WBP_HUD_SkillWheel_Items_K2Node_ComponentBoundEvent_12_OnSkillChosen__DelegateSignature");
static_assert(sizeof(WBP_HUD_WheelsContainer_C_BndEvt__WBP_HUD_WheelsContainer_WBP_HUD_SkillWheel_Items_K2Node_ComponentBoundEvent_12_OnSkillChosen__DelegateSignature) == 0x000008, "Wrong size on WBP_HUD_WheelsContainer_C_BndEvt__WBP_HUD_WheelsContainer_WBP_HUD_SkillWheel_Items_K2Node_ComponentBoundEvent_12_OnSkillChosen__DelegateSignature");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_BndEvt__WBP_HUD_WheelsContainer_WBP_HUD_SkillWheel_Items_K2Node_ComponentBoundEvent_12_OnSkillChosen__DelegateSignature, SkillID) == 0x000000, "Member 'WBP_HUD_WheelsContainer_C_BndEvt__WBP_HUD_WheelsContainer_WBP_HUD_SkillWheel_Items_K2Node_ComponentBoundEvent_12_OnSkillChosen__DelegateSignature::SkillID' has a wrong offset!");

// Function WBP_HUD_WheelsContainer.WBP_HUD_WheelsContainer_C.ExecuteUbergraph_WBP_HUD_WheelsContainer
// 0x0358 (0x0358 - 0x0000)
struct WBP_HUD_WheelsContainer_C_ExecuteUbergraph_WBP_HUD_WheelsContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IWBPI_WheelPage_C>     K2Node_CustomEvent_IWheelPage;                     // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue_1;     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue_2;     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_ObjectToText_ReturnValue;            // 0x0030(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0048(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0090(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00A0(0x0010)()
	EBattleTurnState                              CallFunc_GetCurrentBattleTurnState_ReturnValue;    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_HasChanged;                     // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBattleForbiddenActionReason                  K2Node_CustomEvent_Reason;                         // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShowingTooltip_IsShowingTooltip;        // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B6[0x2];                                       // 0x00B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue_3;     // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_DynamicCast_AsUser_Widget;                  // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue_4;     // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_HUD_SkillWheel_C*                  CallFunc_GetSkillWheel_SkillWheel;                 // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_SkillID;                        // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IWBPI_WheelPage_C>     CallFunc_ChangeWheelPage_IWheelPage_CastInput;     // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_HUD_SkillWheel_C*                  CallFunc_GetSkillWheel_SkillWheel_1;               // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IWBPI_WheelPage_C>     CallFunc_ChangeWheelPage_IWheelPage_CastInput_1;   // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_ButtonIndex;            // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IWBPI_WheelPage_C>     CallFunc_ChangeWheelPage_IWheelPage_CastInput_2;   // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0160(0x0048)(HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue;             // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01B0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01C0(0x0010)()
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0230(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0248(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0260(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0280(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0298(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x02B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x02C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IWBPI_WheelPage_C>     CallFunc_ChangeWheelPage_IWheelPage_CastInput_3;   // 0x02E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue_1;            // 0x0308(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0320(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_DataAsset_Skill_C*>          CallFunc_GetEquippedCharacterGradientAttacks_EquippedSkills; // 0x0328(0x0010)(ReferenceParm)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue_1;           // 0x0338(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IWBPI_WheelPage_C>     CallFunc_ChangeWheelPage_IWheelPage_CastInput_4;   // 0x0340(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_SkillID;                // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_WheelsContainer_C_ExecuteUbergraph_WBP_HUD_WheelsContainer) == 0x000008, "Wrong alignment on WBP_HUD_WheelsContainer_C_ExecuteUbergraph_WBP_HUD_WheelsContainer");
static_assert(sizeof(WBP_HUD_WheelsContainer_C_ExecuteUbergraph_WBP_HUD_WheelsContainer) == 0x000358, "Wrong size on WBP_HUD_WheelsContainer_C_ExecuteUbergraph_WBP_HUD_WheelsContainer");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_ExecuteUbergraph_WBP_HUD_WheelsContainer, EntryPoint) == 0x000000, "Member 'WBP_HUD_WheelsContainer_C_ExecuteUbergraph_WBP_HUD_WheelsContainer::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HUD_WheelsContainer_C_ExecuteUbergraph_WBP_HUD_WheelsContainer, K2Node_CustomEvent_IWheelPage) == 0x000008, "Member 'WBP_HUD_WheelsContainer_C_ExecuteUbergraph_WBP_HUD_WheelsContainer::K2Node_CustomEvent_IWheelPage' has a wrong offset!");
