#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_JournalEntriesList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_JournalEntriesList.WBP_JournalEntriesList_C
// 0x0070 (0x04A0 - 0x0430)
class UWBP_JournalEntriesList_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonLazyImage*                       Background;                                        // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTileView*                              JournalTileView;                                   // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UBP_JournalViewItem_C* JournalViewItem, bool IsSelected)> OnJournalItemNavigated; // 0x0448(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UDataTable*                             JournalItemsDataTable;                             // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_JournalViewItem_C*                  UnlockedJournal;                                   // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UBP_JournalViewItem_C* JournalViewItem)> OnJournalItemUnlocked; // 0x0468(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(bool IsSelected)> OnJournalItemClicked;                            // 0x0478(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UAudioComponent*                        VoiceOverAudioComponent;                           // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_JournalViewItem_C*                  CurrentlyPlayingJournal;                           // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_JournalViewItem_C*                  NextPlayingJournal;                                // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_PictosList_PictosTileView_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature(class UUserWidget* Widget);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void ExecuteUbergraph_WBP_JournalEntriesList(int32 EntryPoint);
	void LoadJournalEntries();
	void OnAudioFinished();
	void OnEntryClicked(class UBP_JournalViewItem_C* JournalViewItem, bool bIsSelected);
	void OnJournalEntryClicked(class UBP_JournalViewItem_C* JournalViewItem, bool IsSelected);
	void OnJournalEntryNavigated(class UBP_JournalViewItem_C* InViewItem, bool IsSelected);
	void OnJournalEntryUnlocked(class UBP_JournalViewItem_C* JournalViewItem);
	void OnNextTick();
	void PlayJournal(class UBP_JournalViewItem_C* JournalViewItem);
	void ResetVoiceOver();
	void SetUnlockedJournal(class UBP_JournalViewItem_C* UnlockedJournal_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_JournalEntriesList_C">();
	}
	static class UWBP_JournalEntriesList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_JournalEntriesList_C>();
	}
};
static_assert(alignof(UWBP_JournalEntriesList_C) == 0x000008, "Wrong alignment on UWBP_JournalEntriesList_C");
static_assert(sizeof(UWBP_JournalEntriesList_C) == 0x0004A0, "Wrong size on UWBP_JournalEntriesList_C");
static_assert(offsetof(UWBP_JournalEntriesList_C, UberGraphFrame) == 0x000430, "Member 'UWBP_JournalEntriesList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_JournalEntriesList_C, Background) == 0x000438, "Member 'UWBP_JournalEntriesList_C::Background' has a wrong offset!");
static_assert(offsetof(UWBP_JournalEntriesList_C, JournalTileView) == 0x000440, "Member 'UWBP_JournalEntriesList_C::JournalTileView' has a wrong offset!");
static_assert(offsetof(UWBP_JournalEntriesList_C, OnJournalItemNavigated) == 0x000448, "Member 'UWBP_JournalEntriesList_C::OnJournalItemNavigated' has a wrong offset!");
static_assert(offsetof(UWBP_JournalEntriesList_C, JournalItemsDataTable) == 0x000458, "Member 'UWBP_JournalEntriesList_C::JournalItemsDataTable' has a wrong offset!");
static_assert(offsetof(UWBP_JournalEntriesList_C, UnlockedJournal) == 0x000460, "Member 'UWBP_JournalEntriesList_C::UnlockedJournal' has a wrong offset!");
static_assert(offsetof(UWBP_JournalEntriesList_C, OnJournalItemUnlocked) == 0x000468, "Member 'UWBP_JournalEntriesList_C::OnJournalItemUnlocked' has a wrong offset!");
static_assert(offsetof(UWBP_JournalEntriesList_C, OnJournalItemClicked) == 0x000478, "Member 'UWBP_JournalEntriesList_C::OnJournalItemClicked' has a wrong offset!");
static_assert(offsetof(UWBP_JournalEntriesList_C, VoiceOverAudioComponent) == 0x000488, "Member 'UWBP_JournalEntriesList_C::VoiceOverAudioComponent' has a wrong offset!");
static_assert(offsetof(UWBP_JournalEntriesList_C, CurrentlyPlayingJournal) == 0x000490, "Member 'UWBP_JournalEntriesList_C::CurrentlyPlayingJournal' has a wrong offset!");
static_assert(offsetof(UWBP_JournalEntriesList_C, NextPlayingJournal) == 0x000498, "Member 'UWBP_JournalEntriesList_C::NextPlayingJournal' has a wrong offset!");

}

