#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MedialPlayerWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_MedialPlayerWidget.WBP_MedialPlayerWidget_C.ExecuteUbergraph_WBP_MedialPlayerWidget
// 0x0020 (0x0020 - 0x0000)
struct WBP_MedialPlayerWidget_C_ExecuteUbergraph_WBP_MedialPlayerWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& OpenedUrl)> K2Node_CreateDelegate_OutputDelegate;            // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMediaPlayer*                           CallFunc_GetInternalMediaPlayer_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MedialPlayerWidget_C_ExecuteUbergraph_WBP_MedialPlayerWidget) == 0x000008, "Wrong alignment on WBP_MedialPlayerWidget_C_ExecuteUbergraph_WBP_MedialPlayerWidget");
static_assert(sizeof(WBP_MedialPlayerWidget_C_ExecuteUbergraph_WBP_MedialPlayerWidget) == 0x000020, "Wrong size on WBP_MedialPlayerWidget_C_ExecuteUbergraph_WBP_MedialPlayerWidget");
static_assert(offsetof(WBP_MedialPlayerWidget_C_ExecuteUbergraph_WBP_MedialPlayerWidget, EntryPoint) == 0x000000, "Member 'WBP_MedialPlayerWidget_C_ExecuteUbergraph_WBP_MedialPlayerWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MedialPlayerWidget_C_ExecuteUbergraph_WBP_MedialPlayerWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_MedialPlayerWidget_C_ExecuteUbergraph_WBP_MedialPlayerWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MedialPlayerWidget_C_ExecuteUbergraph_WBP_MedialPlayerWidget, CallFunc_GetInternalMediaPlayer_ReturnValue) == 0x000018, "Member 'WBP_MedialPlayerWidget_C_ExecuteUbergraph_WBP_MedialPlayerWidget::CallFunc_GetInternalMediaPlayer_ReturnValue' has a wrong offset!");

// Function WBP_MedialPlayerWidget.WBP_MedialPlayerWidget_C.OnMediaOpened
// 0x0010 (0x0010 - 0x0000)
struct WBP_MedialPlayerWidget_C_OnMediaOpened final
{
public:
	class FString                                 OpenedUrl;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MedialPlayerWidget_C_OnMediaOpened) == 0x000008, "Wrong alignment on WBP_MedialPlayerWidget_C_OnMediaOpened");
static_assert(sizeof(WBP_MedialPlayerWidget_C_OnMediaOpened) == 0x000010, "Wrong size on WBP_MedialPlayerWidget_C_OnMediaOpened");
static_assert(offsetof(WBP_MedialPlayerWidget_C_OnMediaOpened, OpenedUrl) == 0x000000, "Member 'WBP_MedialPlayerWidget_C_OnMediaOpened::OpenedUrl' has a wrong offset!");

// Function WBP_MedialPlayerWidget.WBP_MedialPlayerWidget_C.OpenMediaSource
// 0x0008 (0x0008 - 0x0000)
struct WBP_MedialPlayerWidget_C_OpenMediaSource final
{
public:
	class UMediaSource*                           MediaSource_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MedialPlayerWidget_C_OpenMediaSource) == 0x000008, "Wrong alignment on WBP_MedialPlayerWidget_C_OpenMediaSource");
static_assert(sizeof(WBP_MedialPlayerWidget_C_OpenMediaSource) == 0x000008, "Wrong size on WBP_MedialPlayerWidget_C_OpenMediaSource");
static_assert(offsetof(WBP_MedialPlayerWidget_C_OpenMediaSource, MediaSource_0) == 0x000000, "Member 'WBP_MedialPlayerWidget_C_OpenMediaSource::MediaSource_0' has a wrong offset!");

// Function WBP_MedialPlayerWidget.WBP_MedialPlayerWidget_C.SetIsMuted
// 0x0001 (0x0001 - 0x0000)
struct WBP_MedialPlayerWidget_C_SetIsMuted final
{
public:
	bool                                          bInIsMuted;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MedialPlayerWidget_C_SetIsMuted) == 0x000001, "Wrong alignment on WBP_MedialPlayerWidget_C_SetIsMuted");
static_assert(sizeof(WBP_MedialPlayerWidget_C_SetIsMuted) == 0x000001, "Wrong size on WBP_MedialPlayerWidget_C_SetIsMuted");
static_assert(offsetof(WBP_MedialPlayerWidget_C_SetIsMuted, bInIsMuted) == 0x000000, "Member 'WBP_MedialPlayerWidget_C_SetIsMuted::bInIsMuted' has a wrong offset!");

// Function WBP_MedialPlayerWidget.WBP_MedialPlayerWidget_C.SetPauseMediaSource
// 0x0001 (0x0001 - 0x0000)
struct WBP_MedialPlayerWidget_C_SetPauseMediaSource final
{
public:
	bool                                          Pause;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MedialPlayerWidget_C_SetPauseMediaSource) == 0x000001, "Wrong alignment on WBP_MedialPlayerWidget_C_SetPauseMediaSource");
static_assert(sizeof(WBP_MedialPlayerWidget_C_SetPauseMediaSource) == 0x000001, "Wrong size on WBP_MedialPlayerWidget_C_SetPauseMediaSource");
static_assert(offsetof(WBP_MedialPlayerWidget_C_SetPauseMediaSource, Pause) == 0x000000, "Member 'WBP_MedialPlayerWidget_C_SetPauseMediaSource::Pause' has a wrong offset!");

}

