#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Panel_Blacksmith_Consumables

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "S_TutorialCardParameters_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Panel_Blacksmith_Consumables.WBP_Panel_Blacksmith_Consumables_C
// 0x00B0 (0x04E0 - 0x0430)
class UWBP_Panel_Blacksmith_Consumables_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_FadeIN;                                       // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBackgroundBlur*                        BackgroundBlur;                                    // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       BackgroundImage;                                   // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       BackgroundNPC;                                     // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone;                                          // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               UpgradeOverlay;                                    // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonActionBarContainer_C*        WBP_CommonActionBarContainer;                      // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HeadingText_C*                     WBP_HeadingText;                                   // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LuminaConsumablePanel_C*           WBP_LuminaConsumablePanel;                         // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TintUpgradePanel_C*                WBP_TintUpgradePanel;                              // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_CharacterData_C*                    CurrentCharacterData;                              // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnClosed;                                          // 0x0490(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FDataTableRowHandle                    SD_OnWindowClosed;                                 // 0x04A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          IsBackAllowed;                                     // 0x04B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSavePoint;                                       // 0x04B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_4B2[0x6];                                      // 0x04B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_TutorialCardParameters>      Tutorials;                                         // 0x04B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         CurrentTutorialIndex;                              // 0x04C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CC[0x4];                                      // 0x04CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Tuto_BlurIndicator_C*              Area_Highlight_Widget;                             // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMaelle;                                          // 0x04D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	bool BP_OnHandleBackAction();
	void Construct();
	void EndCuratorExpeditionMenuTutorials();
	void ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables(int32 EntryPoint);
	void Finished_677E5454495EDD6690C8C49CFA011F35();
	void Finished_6E85C0ED4AA6D44B80DC95A2EE7E4812();
	void Finished_6EC34383450FE30EFE465380D1B12E9D();
	void Finished_9C91B3014EE36400609BF1939DE1993A();
	void OnFadeInFinished();
	void OnTutorialEnd();
	void OpenFromSavePoint();
	void StartCuratorExpeditionMenuTutorials();
	void StartFadeIn();
	void StartFadeOut();
	void StartTutorial();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Panel_Blacksmith_Consumables_C">();
	}
	static class UWBP_Panel_Blacksmith_Consumables_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Panel_Blacksmith_Consumables_C>();
	}
};
static_assert(alignof(UWBP_Panel_Blacksmith_Consumables_C) == 0x000008, "Wrong alignment on UWBP_Panel_Blacksmith_Consumables_C");
static_assert(sizeof(UWBP_Panel_Blacksmith_Consumables_C) == 0x0004E0, "Wrong size on UWBP_Panel_Blacksmith_Consumables_C");
static_assert(offsetof(UWBP_Panel_Blacksmith_Consumables_C, UberGraphFrame) == 0x000430, "Member 'UWBP_Panel_Blacksmith_Consumables_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_Blacksmith_Consumables_C, Anim_FadeIN) == 0x000438, "Member 'UWBP_Panel_Blacksmith_Consumables_C::Anim_FadeIN' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_Blacksmith_Consumables_C, BackgroundBlur) == 0x000440, "Member 'UWBP_Panel_Blacksmith_Consumables_C::BackgroundBlur' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_Blacksmith_Consumables_C, BackgroundImage) == 0x000448, "Member 'UWBP_Panel_Blacksmith_Consumables_C::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_Blacksmith_Consumables_C, BackgroundNPC) == 0x000450, "Member 'UWBP_Panel_Blacksmith_Consumables_C::BackgroundNPC' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_Blacksmith_Consumables_C, SafeZone) == 0x000458, "Member 'UWBP_Panel_Blacksmith_Consumables_C::SafeZone' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_Blacksmith_Consumables_C, UpgradeOverlay) == 0x000460, "Member 'UWBP_Panel_Blacksmith_Consumables_C::UpgradeOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_Blacksmith_Consumables_C, WBP_CommonActionBarContainer) == 0x000468, "Member 'UWBP_Panel_Blacksmith_Consumables_C::WBP_CommonActionBarContainer' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_Blacksmith_Consumables_C, WBP_HeadingText) == 0x000470, "Member 'UWBP_Panel_Blacksmith_Consumables_C::WBP_HeadingText' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_Blacksmith_Consumables_C, WBP_LuminaConsumablePanel) == 0x000478, "Member 'UWBP_Panel_Blacksmith_Consumables_C::WBP_LuminaConsumablePanel' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_Blacksmith_Consumables_C, WBP_TintUpgradePanel) == 0x000480, "Member 'UWBP_Panel_Blacksmith_Consumables_C::WBP_TintUpgradePanel' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_Blacksmith_Consumables_C, CurrentCharacterData) == 0x000488, "Member 'UWBP_Panel_Blacksmith_Consumables_C::CurrentCharacterData' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_Blacksmith_Consumables_C, OnClosed) == 0x000490, "Member 'UWBP_Panel_Blacksmith_Consumables_C::OnClosed' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_Blacksmith_Consumables_C, SD_OnWindowClosed) == 0x0004A0, "Member 'UWBP_Panel_Blacksmith_Consumables_C::SD_OnWindowClosed' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_Blacksmith_Consumables_C, IsBackAllowed) == 0x0004B0, "Member 'UWBP_Panel_Blacksmith_Consumables_C::IsBackAllowed' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_Blacksmith_Consumables_C, IsSavePoint) == 0x0004B1, "Member 'UWBP_Panel_Blacksmith_Consumables_C::IsSavePoint' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_Blacksmith_Consumables_C, Tutorials) == 0x0004B8, "Member 'UWBP_Panel_Blacksmith_Consumables_C::Tutorials' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_Blacksmith_Consumables_C, CurrentTutorialIndex) == 0x0004C8, "Member 'UWBP_Panel_Blacksmith_Consumables_C::CurrentTutorialIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_Blacksmith_Consumables_C, Area_Highlight_Widget) == 0x0004D0, "Member 'UWBP_Panel_Blacksmith_Consumables_C::Area_Highlight_Widget' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_Blacksmith_Consumables_C, IsMaelle) == 0x0004D8, "Member 'UWBP_Panel_Blacksmith_Consumables_C::IsMaelle' has a wrong offset!");

}

