#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PortraitUniqueMechanic_Stances

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "E_StanceType_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PortraitUniqueMechanic_Stances.WBP_PortraitUniqueMechanic_Stances_C
// 0x0028 (0x0308 - 0x02E0)
class UWBP_PortraitUniqueMechanic_Stances_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Stance_Stanceless;                            // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 StanceIcon;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             StanceText;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_StanceMechanicComponent_C*          StanceMechaCompo;                                  // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_PortraitUniqueMechanic_Stances(int32 EntryPoint);
	void SetStanceUI();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PortraitUniqueMechanic_Stances_C">();
	}
	static class UWBP_PortraitUniqueMechanic_Stances_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PortraitUniqueMechanic_Stances_C>();
	}
};
static_assert(alignof(UWBP_PortraitUniqueMechanic_Stances_C) == 0x000008, "Wrong alignment on UWBP_PortraitUniqueMechanic_Stances_C");
static_assert(sizeof(UWBP_PortraitUniqueMechanic_Stances_C) == 0x000308, "Wrong size on UWBP_PortraitUniqueMechanic_Stances_C");
static_assert(offsetof(UWBP_PortraitUniqueMechanic_Stances_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_PortraitUniqueMechanic_Stances_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PortraitUniqueMechanic_Stances_C, Anim_Stance_Stanceless) == 0x0002E8, "Member 'UWBP_PortraitUniqueMechanic_Stances_C::Anim_Stance_Stanceless' has a wrong offset!");
static_assert(offsetof(UWBP_PortraitUniqueMechanic_Stances_C, StanceIcon) == 0x0002F0, "Member 'UWBP_PortraitUniqueMechanic_Stances_C::StanceIcon' has a wrong offset!");
static_assert(offsetof(UWBP_PortraitUniqueMechanic_Stances_C, StanceText) == 0x0002F8, "Member 'UWBP_PortraitUniqueMechanic_Stances_C::StanceText' has a wrong offset!");
static_assert(offsetof(UWBP_PortraitUniqueMechanic_Stances_C, StanceMechaCompo) == 0x000300, "Member 'UWBP_PortraitUniqueMechanic_Stances_C::StanceMechaCompo' has a wrong offset!");

}

