#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LevelEntrancePOI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LevelEntrancePOI.WBP_LevelEntrancePOI_C
// 0x0088 (0x0390 - 0x0308)
class UWBP_LevelEntrancePOI_C final : public UCommonUserWidget
{
public:
	class UWidgetAnimation*                       Anim_Hovered;                                      // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Objective;                                    // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_ShowName;                                     // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               IconOverlay;                                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           IconRetainerBox;                                   // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       LevelIcon;                                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       LevelTitleText;                                    // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       ObjectiveIcon;                                     // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               TitleTextContainer;                                // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              InWidgetLocation;                                  // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ZoomThreshold;                                     // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsOverThreshold;                                  // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsQuestObjective;                                 // 0x0369(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Hovered;                                        // 0x036A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36B[0x5];                                      // 0x036B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    SD_POIHovered;                                     // 0x0370(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    SD_POIUnhovered;                                   // 0x0380(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void Check_Is_Quest_Objective(const struct FGameplayTag& LevelIdentifier, bool* IsQuestObjective);
	void GetWidgetLocation(struct FVector2D* WidgetLocation);
	void IsQuestObjective(bool* bIsQuestObjective_0);
	void SetIsHovered(bool InIsHovered);
	void SetQuestObjective(const struct FS_MinimapLevelIdentifier& LevelIdentifier);
	void SetTitleTextVisibility(const struct FS_MinimapLevelIdentifier& LevelIdentifier);
	void SetupLevelPOI(const struct FS_MinimapLevelIdentifier& InLevelIdentifier, const struct FVector2D& WidgetLocation);
	void SetZoomScale(double InZoomScale);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LevelEntrancePOI_C">();
	}
	static class UWBP_LevelEntrancePOI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LevelEntrancePOI_C>();
	}
};
static_assert(alignof(UWBP_LevelEntrancePOI_C) == 0x000008, "Wrong alignment on UWBP_LevelEntrancePOI_C");
static_assert(sizeof(UWBP_LevelEntrancePOI_C) == 0x000390, "Wrong size on UWBP_LevelEntrancePOI_C");
static_assert(offsetof(UWBP_LevelEntrancePOI_C, Anim_Hovered) == 0x000308, "Member 'UWBP_LevelEntrancePOI_C::Anim_Hovered' has a wrong offset!");
static_assert(offsetof(UWBP_LevelEntrancePOI_C, Anim_Objective) == 0x000310, "Member 'UWBP_LevelEntrancePOI_C::Anim_Objective' has a wrong offset!");
static_assert(offsetof(UWBP_LevelEntrancePOI_C, Anim_ShowName) == 0x000318, "Member 'UWBP_LevelEntrancePOI_C::Anim_ShowName' has a wrong offset!");
static_assert(offsetof(UWBP_LevelEntrancePOI_C, IconOverlay) == 0x000320, "Member 'UWBP_LevelEntrancePOI_C::IconOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_LevelEntrancePOI_C, IconRetainerBox) == 0x000328, "Member 'UWBP_LevelEntrancePOI_C::IconRetainerBox' has a wrong offset!");
static_assert(offsetof(UWBP_LevelEntrancePOI_C, LevelIcon) == 0x000330, "Member 'UWBP_LevelEntrancePOI_C::LevelIcon' has a wrong offset!");
static_assert(offsetof(UWBP_LevelEntrancePOI_C, LevelTitleText) == 0x000338, "Member 'UWBP_LevelEntrancePOI_C::LevelTitleText' has a wrong offset!");
static_assert(offsetof(UWBP_LevelEntrancePOI_C, ObjectiveIcon) == 0x000340, "Member 'UWBP_LevelEntrancePOI_C::ObjectiveIcon' has a wrong offset!");
static_assert(offsetof(UWBP_LevelEntrancePOI_C, TitleTextContainer) == 0x000348, "Member 'UWBP_LevelEntrancePOI_C::TitleTextContainer' has a wrong offset!");
static_assert(offsetof(UWBP_LevelEntrancePOI_C, InWidgetLocation) == 0x000350, "Member 'UWBP_LevelEntrancePOI_C::InWidgetLocation' has a wrong offset!");
static_assert(offsetof(UWBP_LevelEntrancePOI_C, ZoomThreshold) == 0x000360, "Member 'UWBP_LevelEntrancePOI_C::ZoomThreshold' has a wrong offset!");
static_assert(offsetof(UWBP_LevelEntrancePOI_C, bIsOverThreshold) == 0x000368, "Member 'UWBP_LevelEntrancePOI_C::bIsOverThreshold' has a wrong offset!");
static_assert(offsetof(UWBP_LevelEntrancePOI_C, bIsQuestObjective) == 0x000369, "Member 'UWBP_LevelEntrancePOI_C::bIsQuestObjective' has a wrong offset!");
static_assert(offsetof(UWBP_LevelEntrancePOI_C, Is_Hovered) == 0x00036A, "Member 'UWBP_LevelEntrancePOI_C::Is_Hovered' has a wrong offset!");
static_assert(offsetof(UWBP_LevelEntrancePOI_C, SD_POIHovered) == 0x000370, "Member 'UWBP_LevelEntrancePOI_C::SD_POIHovered' has a wrong offset!");
static_assert(offsetof(UWBP_LevelEntrancePOI_C, SD_POIUnhovered) == 0x000380, "Member 'UWBP_LevelEntrancePOI_C::SD_POIUnhovered' has a wrong offset!");

}

