#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SortDropdownEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_SortDropdownEntry_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SortDropdownEntry.WBP_SortDropdownEntry_C
// 0x0040 (0x0348 - 0x0308)
class UWBP_SortDropdownEntry_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_BaseButton_C*                      BaseButton;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       EntryDisplayText;                                  // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FS_SortDropdownEntry                   SortDropdownEntry;                                 // 0x0320(0x0018)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const struct FS_SortDropdownEntry& SortDropdownEntry)> OnEntryClicked; // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_SortDropdownEntry_BaseButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature(class UCommonButtonBase* Button, bool Selected);
	void BndEvt__WBP_SortDropdownEntry_WBP_BaseButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WBP_SortDropdownEntry(int32 EntryPoint);
	void GetSortDropdownEntry(struct FS_SortDropdownEntry* SortDropdownEntry_0);
	void SetSortDropdownEntry(struct FS_SortDropdownEntry& SortDropdownEntry_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SortDropdownEntry_C">();
	}
	static class UWBP_SortDropdownEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SortDropdownEntry_C>();
	}
};
static_assert(alignof(UWBP_SortDropdownEntry_C) == 0x000008, "Wrong alignment on UWBP_SortDropdownEntry_C");
static_assert(sizeof(UWBP_SortDropdownEntry_C) == 0x000348, "Wrong size on UWBP_SortDropdownEntry_C");
static_assert(offsetof(UWBP_SortDropdownEntry_C, UberGraphFrame) == 0x000308, "Member 'UWBP_SortDropdownEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SortDropdownEntry_C, BaseButton) == 0x000310, "Member 'UWBP_SortDropdownEntry_C::BaseButton' has a wrong offset!");
static_assert(offsetof(UWBP_SortDropdownEntry_C, EntryDisplayText) == 0x000318, "Member 'UWBP_SortDropdownEntry_C::EntryDisplayText' has a wrong offset!");
static_assert(offsetof(UWBP_SortDropdownEntry_C, SortDropdownEntry) == 0x000320, "Member 'UWBP_SortDropdownEntry_C::SortDropdownEntry' has a wrong offset!");
static_assert(offsetof(UWBP_SortDropdownEntry_C, OnEntryClicked) == 0x000338, "Member 'UWBP_SortDropdownEntry_C::OnEntryClicked' has a wrong offset!");

}

