#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BattleStats_Box

#include "Basic.hpp"

#include "S_BattleSummaryStats_structs.hpp"


namespace SDK::Params
{

// Function WBP_BattleStats_Box.WBP_BattleStats_Box_C.LoadBattleSummaryStats
// 0x0088 (0x0088 - 0x0000)
struct WBP_BattleStats_Box_C_LoadBattleSummaryStats final
{
public:
	struct FS_BattleSummaryStats                  BattleSummaryStats;                                // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0028(0x0010)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0038(0x0010)()
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0048(0x0010)()
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_1;          // 0x0058(0x0010)()
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_2;          // 0x0068(0x0010)()
	class FText                                   CallFunc_AsTimespan_Timespan_ReturnValue;          // 0x0078(0x0010)()
};
static_assert(alignof(WBP_BattleStats_Box_C_LoadBattleSummaryStats) == 0x000008, "Wrong alignment on WBP_BattleStats_Box_C_LoadBattleSummaryStats");
static_assert(sizeof(WBP_BattleStats_Box_C_LoadBattleSummaryStats) == 0x000088, "Wrong size on WBP_BattleStats_Box_C_LoadBattleSummaryStats");
static_assert(offsetof(WBP_BattleStats_Box_C_LoadBattleSummaryStats, BattleSummaryStats) == 0x000000, "Member 'WBP_BattleStats_Box_C_LoadBattleSummaryStats::BattleSummaryStats' has a wrong offset!");
static_assert(offsetof(WBP_BattleStats_Box_C_LoadBattleSummaryStats, CallFunc_Conv_IntToText_ReturnValue) == 0x000028, "Member 'WBP_BattleStats_Box_C_LoadBattleSummaryStats::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleStats_Box_C_LoadBattleSummaryStats, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000038, "Member 'WBP_BattleStats_Box_C_LoadBattleSummaryStats::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleStats_Box_C_LoadBattleSummaryStats, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000048, "Member 'WBP_BattleStats_Box_C_LoadBattleSummaryStats::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleStats_Box_C_LoadBattleSummaryStats, CallFunc_Conv_DoubleToText_ReturnValue_1) == 0x000058, "Member 'WBP_BattleStats_Box_C_LoadBattleSummaryStats::CallFunc_Conv_DoubleToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleStats_Box_C_LoadBattleSummaryStats, CallFunc_Conv_DoubleToText_ReturnValue_2) == 0x000068, "Member 'WBP_BattleStats_Box_C_LoadBattleSummaryStats::CallFunc_Conv_DoubleToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_BattleStats_Box_C_LoadBattleSummaryStats, CallFunc_AsTimespan_Timespan_ReturnValue) == 0x000078, "Member 'WBP_BattleStats_Box_C_LoadBattleSummaryStats::CallFunc_AsTimespan_Timespan_ReturnValue' has a wrong offset!");

}

