#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SkillComboPrompt

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_SkillComboPrompt.WBP_SkillComboPrompt_C.ExecuteUbergraph_WBP_SkillComboPrompt
// 0x0420 (0x0420 - 0x0000)
struct WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsSuccess;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetPercent_0_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue_1;                    // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_2;           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Remap_Progress_Full_Duration_ReturnValue; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Remap_Progress_Full_Duration_ReturnValue_1; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_2;                       // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_preTime;                        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_startTime;                      // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_endTime;                        // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   K2Node_CustomEvent_sequencePlayerTimeSource;       // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00F8(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_3;           // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_4;           // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue_2;                    // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_2;                        // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_2;                        // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_5;           // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue_3;                    // 0x0178(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_3;                        // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_3;                        // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_6;           // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderTransformAngle_ReturnValue;      // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetTimeSeconds_ReturnValue;               // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C8[0x8];                                      // 0x01C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromMaterial_ReturnValue;        // 0x01D0(0x00D0)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x02A0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x02E8(0x0010)(ReferenceParm)
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0300(0x0010)()
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetPercent_0_ReturnValue_1;               // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0330(0x0048)(HasGetValueTypeHash)
	double                                        CallFunc_GetCurrentSequenceTime_ReturnValue;       // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0388(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x03D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x03E0(0x0010)()
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F4[0x4];                                      // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_MaterialValue_InnerOffset_ImplicitCast; // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderTransformAngle_Angle_ImplicitCast; // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt) == 0x000010, "Wrong alignment on WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt");
static_assert(sizeof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt) == 0x000420, "Wrong size on WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, EntryPoint) == 0x000000, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, K2Node_CustomEvent_IsSuccess) == 0x000004, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::K2Node_CustomEvent_IsSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_GetPercent_0_ReturnValue) == 0x000008, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_GetPercent_0_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_FClamp_ReturnValue) == 0x000010, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000018, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_GetSize_ReturnValue) == 0x000020, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_GetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000030, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_BreakVector2D_X) == 0x000038, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_BreakVector2D_Y) == 0x000040, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_GetSize_ReturnValue_1) == 0x000048, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_GetSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_BreakVector2D_X_1) == 0x000058, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_BreakVector2D_Y_1) == 0x000060, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_Lerp_ReturnValue) == 0x000068, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_SlotAsCanvasSlot_ReturnValue_2) == 0x000070, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_SlotAsCanvasSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_MakeVector2D_ReturnValue) == 0x000078, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x000088, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_Remap_Progress_Full_Duration_ReturnValue) == 0x000098, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_Remap_Progress_Full_Duration_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000A0, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_Lerp_ReturnValue_1) == 0x0000A8, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_MakeVector2D_ReturnValue_1) == 0x0000B0, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_Remap_Progress_Full_Duration_ReturnValue_1) == 0x0000C0, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_Remap_Progress_Full_Duration_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_Lerp_ReturnValue_2) == 0x0000C8, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_PlayAnimation_ReturnValue) == 0x0000D0, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, K2Node_CustomEvent_preTime) == 0x0000D8, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::K2Node_CustomEvent_preTime' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, K2Node_CustomEvent_startTime) == 0x0000E0, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::K2Node_CustomEvent_startTime' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, K2Node_CustomEvent_endTime) == 0x0000E8, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::K2Node_CustomEvent_endTime' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, K2Node_CustomEvent_sequencePlayerTimeSource) == 0x0000F0, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::K2Node_CustomEvent_sequencePlayerTimeSource' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, K2Node_Event_MyGeometry) == 0x0000F8, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, K2Node_Event_InDeltaTime) == 0x000130, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_SlotAsCanvasSlot_ReturnValue_3) == 0x000138, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_SlotAsCanvasSlot_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_SlotAsCanvasSlot_ReturnValue_4) == 0x000140, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_SlotAsCanvasSlot_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_GetSize_ReturnValue_2) == 0x000148, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_GetSize_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_BreakVector2D_X_2) == 0x000158, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_BreakVector2D_Y_2) == 0x000160, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_SlotAsCanvasSlot_ReturnValue_5) == 0x000168, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_SlotAsCanvasSlot_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000170, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_GetSize_ReturnValue_3) == 0x000178, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_GetSize_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_BreakVector2D_X_3) == 0x000188, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_BreakVector2D_X_3' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_BreakVector2D_Y_3) == 0x000190, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_BreakVector2D_Y_3' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000198, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_MakeVector2D_ReturnValue_2) == 0x0001A0, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_SlotAsCanvasSlot_ReturnValue_6) == 0x0001B0, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_SlotAsCanvasSlot_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_GetRenderTransformAngle_ReturnValue) == 0x0001B8, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_GetRenderTransformAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_GetTimeSeconds_ReturnValue) == 0x0001C0, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_MakeBrushFromMaterial_ReturnValue) == 0x0001D0, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_MakeBrushFromMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, K2Node_MakeStruct_FormatArgumentData) == 0x0002A0, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, K2Node_MakeArray_Array) == 0x0002E8, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_K2_GetScalarParameterValue_ReturnValue) == 0x0002F8, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_K2_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_Format_ReturnValue) == 0x000300, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000310, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000318, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_GetPercent_0_ReturnValue_1) == 0x000320, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_GetPercent_0_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000328, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, K2Node_MakeStruct_FormatArgumentData_1) == 0x000330, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_GetCurrentSequenceTime_ReturnValue) == 0x000378, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_GetCurrentSequenceTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_IsValid_ReturnValue) == 0x000380, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, K2Node_MakeStruct_FormatArgumentData_2) == 0x000388, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, K2Node_MakeArray_Array_1) == 0x0003D0, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_Format_ReturnValue_1) == 0x0003E0, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x0003F0, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0003F8, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000400, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, K2Node_VariableSet_MaterialValue_InnerOffset_ImplicitCast) == 0x000408, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::K2Node_VariableSet_MaterialValue_InnerOffset_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt, CallFunc_SetRenderTransformAngle_Angle_ImplicitCast) == 0x000410, "Member 'WBP_SkillComboPrompt_C_ExecuteUbergraph_WBP_SkillComboPrompt::CallFunc_SetRenderTransformAngle_Angle_ImplicitCast' has a wrong offset!");

// Function WBP_SkillComboPrompt.WBP_SkillComboPrompt_C.Get Skill Combo Progress Full
// 0x0038 (0x0038 - 0x0000)
struct WBP_SkillComboPrompt_C_Get_Skill_Combo_Progress_Full final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetCurrentSequenceTime_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SkillComboPrompt_C_Get_Skill_Combo_Progress_Full) == 0x000008, "Wrong alignment on WBP_SkillComboPrompt_C_Get_Skill_Combo_Progress_Full");
static_assert(sizeof(WBP_SkillComboPrompt_C_Get_Skill_Combo_Progress_Full) == 0x000038, "Wrong size on WBP_SkillComboPrompt_C_Get_Skill_Combo_Progress_Full");
static_assert(offsetof(WBP_SkillComboPrompt_C_Get_Skill_Combo_Progress_Full, ReturnValue) == 0x000000, "Member 'WBP_SkillComboPrompt_C_Get_Skill_Combo_Progress_Full::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_Get_Skill_Combo_Progress_Full, CallFunc_GetCurrentSequenceTime_ReturnValue) == 0x000008, "Member 'WBP_SkillComboPrompt_C_Get_Skill_Combo_Progress_Full::CallFunc_GetCurrentSequenceTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_Get_Skill_Combo_Progress_Full, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_SkillComboPrompt_C_Get_Skill_Combo_Progress_Full::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_Get_Skill_Combo_Progress_Full, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_SkillComboPrompt_C_Get_Skill_Combo_Progress_Full::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_Get_Skill_Combo_Progress_Full, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000020, "Member 'WBP_SkillComboPrompt_C_Get_Skill_Combo_Progress_Full::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_Get_Skill_Combo_Progress_Full, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x000028, "Member 'WBP_SkillComboPrompt_C_Get_Skill_Combo_Progress_Full::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_Get_Skill_Combo_Progress_Full, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000030, "Member 'WBP_SkillComboPrompt_C_Get_Skill_Combo_Progress_Full::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");

// Function WBP_SkillComboPrompt.WBP_SkillComboPrompt_C.Get_Image_Target_Brush_0
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_SkillComboPrompt_C_Get_Image_Target_Brush_0 final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x00D0)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(WBP_SkillComboPrompt_C_Get_Image_Target_Brush_0) == 0x000010, "Wrong alignment on WBP_SkillComboPrompt_C_Get_Image_Target_Brush_0");
static_assert(sizeof(WBP_SkillComboPrompt_C_Get_Image_Target_Brush_0) == 0x0000D0, "Wrong size on WBP_SkillComboPrompt_C_Get_Image_Target_Brush_0");
static_assert(offsetof(WBP_SkillComboPrompt_C_Get_Image_Target_Brush_0, ReturnValue) == 0x000000, "Member 'WBP_SkillComboPrompt_C_Get_Image_Target_Brush_0::ReturnValue' has a wrong offset!");

// Function WBP_SkillComboPrompt.WBP_SkillComboPrompt_C.GetCurrentSequenceTime
// 0x0050 (0x0050 - 0x0000)
struct WBP_SkillComboPrompt_C_GetCurrentSequenceTime final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQualifiedFrameTime                    CallFunc_GetStartTime_ReturnValue;                 // 0x0008(0x0010)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_QualifiedFrameTimeToSeconds_ReturnValue; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQualifiedFrameTime                    CallFunc_GetCurrentTime_ReturnValue;               // 0x0020(0x0010)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_QualifiedFrameTimeToSeconds_ReturnValue_1; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SkillComboPrompt_C_GetCurrentSequenceTime) == 0x000008, "Wrong alignment on WBP_SkillComboPrompt_C_GetCurrentSequenceTime");
static_assert(sizeof(WBP_SkillComboPrompt_C_GetCurrentSequenceTime) == 0x000050, "Wrong size on WBP_SkillComboPrompt_C_GetCurrentSequenceTime");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetCurrentSequenceTime, ReturnValue) == 0x000000, "Member 'WBP_SkillComboPrompt_C_GetCurrentSequenceTime::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetCurrentSequenceTime, CallFunc_GetStartTime_ReturnValue) == 0x000008, "Member 'WBP_SkillComboPrompt_C_GetCurrentSequenceTime::CallFunc_GetStartTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetCurrentSequenceTime, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_SkillComboPrompt_C_GetCurrentSequenceTime::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetCurrentSequenceTime, CallFunc_Conv_QualifiedFrameTimeToSeconds_ReturnValue) == 0x00001C, "Member 'WBP_SkillComboPrompt_C_GetCurrentSequenceTime::CallFunc_Conv_QualifiedFrameTimeToSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetCurrentSequenceTime, CallFunc_GetCurrentTime_ReturnValue) == 0x000020, "Member 'WBP_SkillComboPrompt_C_GetCurrentSequenceTime::CallFunc_GetCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetCurrentSequenceTime, CallFunc_Conv_QualifiedFrameTimeToSeconds_ReturnValue_1) == 0x000030, "Member 'WBP_SkillComboPrompt_C_GetCurrentSequenceTime::CallFunc_Conv_QualifiedFrameTimeToSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetCurrentSequenceTime, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000038, "Member 'WBP_SkillComboPrompt_C_GetCurrentSequenceTime::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetCurrentSequenceTime, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000040, "Member 'WBP_SkillComboPrompt_C_GetCurrentSequenceTime::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetCurrentSequenceTime, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000048, "Member 'WBP_SkillComboPrompt_C_GetCurrentSequenceTime::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_SkillComboPrompt.WBP_SkillComboPrompt_C.GetDebugText
// 0x04A8 (0x04A8 - 0x0000)
struct WBP_SkillComboPrompt_C_GetDebugText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0010)()
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue;              // 0x0028(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue_1;            // 0x0080(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0090(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A0(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00E8(0x0010)()
	TArray<class UWidgetAnimation*>               K2Node_MakeArray_Array;                            // 0x00F8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0110(0x0048)(HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_2;                              // 0x0158(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0170(0x0010)()
	class FText                                   Temp_text_Variable_3;                              // 0x0180(0x0010)()
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0198(0x0048)(HasGetValueTypeHash)
	class UWidgetAnimation*                       CallFunc_Array_Get_Item;                           // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x01F0(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0238(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0288(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x0298(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x02E0(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x02F0(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_7;            // 0x0300(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0348(0x0010)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x035C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x035D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35E[0x2];                                      // 0x035E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0360(0x0010)()
	class FText                                   K2Node_Select_Default_1;                           // 0x0370(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_8;            // 0x0380(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_9;            // 0x03C8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0410(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0420(0x0010)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_10;           // 0x0438(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0480(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_494[0x4];                                      // 0x0494(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0498(0x0010)()
};
static_assert(alignof(WBP_SkillComboPrompt_C_GetDebugText) == 0x000008, "Wrong alignment on WBP_SkillComboPrompt_C_GetDebugText");
static_assert(sizeof(WBP_SkillComboPrompt_C_GetDebugText) == 0x0004A8, "Wrong size on WBP_SkillComboPrompt_C_GetDebugText");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, ReturnValue) == 0x000000, "Member 'WBP_SkillComboPrompt_C_GetDebugText::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, Temp_bool_Variable) == 0x000010, "Member 'WBP_SkillComboPrompt_C_GetDebugText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, Temp_text_Variable) == 0x000018, "Member 'WBP_SkillComboPrompt_C_GetDebugText::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, CallFunc_Conv_BoolToText_ReturnValue) == 0x000028, "Member 'WBP_SkillComboPrompt_C_GetDebugText::CallFunc_Conv_BoolToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'WBP_SkillComboPrompt_C_GetDebugText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, CallFunc_Conv_BoolToText_ReturnValue_1) == 0x000080, "Member 'WBP_SkillComboPrompt_C_GetDebugText::CallFunc_Conv_BoolToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, Temp_text_Variable_1) == 0x000090, "Member 'WBP_SkillComboPrompt_C_GetDebugText::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000A0, "Member 'WBP_SkillComboPrompt_C_GetDebugText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, CallFunc_MakeLiteralText_ReturnValue) == 0x0000E8, "Member 'WBP_SkillComboPrompt_C_GetDebugText::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, K2Node_MakeArray_Array) == 0x0000F8, "Member 'WBP_SkillComboPrompt_C_GetDebugText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, CallFunc_Array_Length_ReturnValue) == 0x000108, "Member 'WBP_SkillComboPrompt_C_GetDebugText::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, CallFunc_GetRenderOpacity_ReturnValue) == 0x00010C, "Member 'WBP_SkillComboPrompt_C_GetDebugText::CallFunc_GetRenderOpacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, K2Node_MakeStruct_FormatArgumentData_2) == 0x000110, "Member 'WBP_SkillComboPrompt_C_GetDebugText::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, Temp_text_Variable_2) == 0x000158, "Member 'WBP_SkillComboPrompt_C_GetDebugText::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, CallFunc_IsValid_ReturnValue) == 0x000168, "Member 'WBP_SkillComboPrompt_C_GetDebugText::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000170, "Member 'WBP_SkillComboPrompt_C_GetDebugText::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, Temp_text_Variable_3) == 0x000180, "Member 'WBP_SkillComboPrompt_C_GetDebugText::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, Temp_int_Array_Index_Variable) == 0x000190, "Member 'WBP_SkillComboPrompt_C_GetDebugText::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, K2Node_MakeStruct_FormatArgumentData_3) == 0x000198, "Member 'WBP_SkillComboPrompt_C_GetDebugText::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, CallFunc_Array_Get_Item) == 0x0001E0, "Member 'WBP_SkillComboPrompt_C_GetDebugText::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, CallFunc_GetEndTime_ReturnValue) == 0x0001E8, "Member 'WBP_SkillComboPrompt_C_GetDebugText::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x0001EC, "Member 'WBP_SkillComboPrompt_C_GetDebugText::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, K2Node_MakeStruct_FormatArgumentData_4) == 0x0001F0, "Member 'WBP_SkillComboPrompt_C_GetDebugText::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, K2Node_MakeStruct_FormatArgumentData_5) == 0x000238, "Member 'WBP_SkillComboPrompt_C_GetDebugText::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000280, "Member 'WBP_SkillComboPrompt_C_GetDebugText::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, CallFunc_GetObjectName_ReturnValue) == 0x000288, "Member 'WBP_SkillComboPrompt_C_GetDebugText::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, K2Node_MakeStruct_FormatArgumentData_6) == 0x000298, "Member 'WBP_SkillComboPrompt_C_GetDebugText::K2Node_MakeStruct_FormatArgumentData_6' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, CallFunc_Conv_StringToText_ReturnValue) == 0x0002E0, "Member 'WBP_SkillComboPrompt_C_GetDebugText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, K2Node_MakeArray_Array_1) == 0x0002F0, "Member 'WBP_SkillComboPrompt_C_GetDebugText::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, K2Node_MakeStruct_FormatArgumentData_7) == 0x000300, "Member 'WBP_SkillComboPrompt_C_GetDebugText::K2Node_MakeStruct_FormatArgumentData_7' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, CallFunc_Format_ReturnValue) == 0x000348, "Member 'WBP_SkillComboPrompt_C_GetDebugText::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, Temp_int_Loop_Counter_Variable) == 0x000358, "Member 'WBP_SkillComboPrompt_C_GetDebugText::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, Temp_bool_Variable_1) == 0x00035C, "Member 'WBP_SkillComboPrompt_C_GetDebugText::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00035D, "Member 'WBP_SkillComboPrompt_C_GetDebugText::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, K2Node_Select_Default) == 0x000360, "Member 'WBP_SkillComboPrompt_C_GetDebugText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, K2Node_Select_Default_1) == 0x000370, "Member 'WBP_SkillComboPrompt_C_GetDebugText::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, K2Node_MakeStruct_FormatArgumentData_8) == 0x000380, "Member 'WBP_SkillComboPrompt_C_GetDebugText::K2Node_MakeStruct_FormatArgumentData_8' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, K2Node_MakeStruct_FormatArgumentData_9) == 0x0003C8, "Member 'WBP_SkillComboPrompt_C_GetDebugText::K2Node_MakeStruct_FormatArgumentData_9' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, K2Node_MakeArray_Array_2) == 0x000410, "Member 'WBP_SkillComboPrompt_C_GetDebugText::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, CallFunc_Format_ReturnValue_1) == 0x000420, "Member 'WBP_SkillComboPrompt_C_GetDebugText::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, CallFunc_Less_IntInt_ReturnValue) == 0x000430, "Member 'WBP_SkillComboPrompt_C_GetDebugText::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, K2Node_MakeStruct_FormatArgumentData_10) == 0x000438, "Member 'WBP_SkillComboPrompt_C_GetDebugText::K2Node_MakeStruct_FormatArgumentData_10' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, K2Node_MakeArray_Array_3) == 0x000480, "Member 'WBP_SkillComboPrompt_C_GetDebugText::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, CallFunc_Add_IntInt_ReturnValue) == 0x000490, "Member 'WBP_SkillComboPrompt_C_GetDebugText::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetDebugText, CallFunc_Format_ReturnValue_2) == 0x000498, "Member 'WBP_SkillComboPrompt_C_GetDebugText::CallFunc_Format_ReturnValue_2' has a wrong offset!");

// Function WBP_SkillComboPrompt.WBP_SkillComboPrompt_C.GetFillColorAndOpacity_0
// 0x0030 (0x0030 - 0x0000)
struct WBP_SkillComboPrompt_C_GetFillColorAndOpacity_0 final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetSkillComboProgressInWindow_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetLinearColorValue_ReturnValue;          // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLinearColorValue_InTime_ImplicitCast;  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SkillComboPrompt_C_GetFillColorAndOpacity_0) == 0x000008, "Wrong alignment on WBP_SkillComboPrompt_C_GetFillColorAndOpacity_0");
static_assert(sizeof(WBP_SkillComboPrompt_C_GetFillColorAndOpacity_0) == 0x000030, "Wrong size on WBP_SkillComboPrompt_C_GetFillColorAndOpacity_0");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetFillColorAndOpacity_0, ReturnValue) == 0x000000, "Member 'WBP_SkillComboPrompt_C_GetFillColorAndOpacity_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetFillColorAndOpacity_0, CallFunc_GetSkillComboProgressInWindow_ReturnValue) == 0x000010, "Member 'WBP_SkillComboPrompt_C_GetFillColorAndOpacity_0::CallFunc_GetSkillComboProgressInWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetFillColorAndOpacity_0, CallFunc_GetLinearColorValue_ReturnValue) == 0x000018, "Member 'WBP_SkillComboPrompt_C_GetFillColorAndOpacity_0::CallFunc_GetLinearColorValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillComboPrompt_C_GetFillColorAndOpacity_0, CallFunc_GetLinearColorValue_InTime_ImplicitCast) == 0x000028, "Member 'WBP_SkillComboPrompt_C_GetFillColorAndOpacity_0::CallFunc_GetLinearColorValue_InTime_ImplicitCast' has a wrong offset!");

// Function WBP_SkillComboPrompt.WBP_SkillComboPrompt_C.GetPercent_0
// 0x0078 (0x0078 - 0x0000)
struct WBP_SkillComboPrompt_C_GetPercent_0 final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Get_Skill_Combo_Progress_Full_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0010(0x0048)(HasGetValueTypeHash)
