#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_OptionsList_Abstract

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Settings_OptionsList_Abstract.WBP_Settings_OptionsList_Abstract_C.BindOnOptionEntryFocused
// 0x0010 (0x0010 - 0x0000)
struct WBP_Settings_OptionsList_Abstract_C_BindOnOptionEntryFocused final
{
public:
	TDelegate<void(class UWBP_Settings_OptionEntry_C* Widget)> Event;                                // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_OptionsList_Abstract_C_BindOnOptionEntryFocused) == 0x000004, "Wrong alignment on WBP_Settings_OptionsList_Abstract_C_BindOnOptionEntryFocused");
static_assert(sizeof(WBP_Settings_OptionsList_Abstract_C_BindOnOptionEntryFocused) == 0x000010, "Wrong size on WBP_Settings_OptionsList_Abstract_C_BindOnOptionEntryFocused");
static_assert(offsetof(WBP_Settings_OptionsList_Abstract_C_BindOnOptionEntryFocused, Event) == 0x000000, "Member 'WBP_Settings_OptionsList_Abstract_C_BindOnOptionEntryFocused::Event' has a wrong offset!");

// Function WBP_Settings_OptionsList_Abstract.WBP_Settings_OptionsList_Abstract_C.UnbindOnOptionEntryFocused
// 0x0010 (0x0010 - 0x0000)
struct WBP_Settings_OptionsList_Abstract_C_UnbindOnOptionEntryFocused final
{
public:
	TDelegate<void(class UWBP_Settings_OptionEntry_C* Widget)> Event;                                // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_OptionsList_Abstract_C_UnbindOnOptionEntryFocused) == 0x000004, "Wrong alignment on WBP_Settings_OptionsList_Abstract_C_UnbindOnOptionEntryFocused");
static_assert(sizeof(WBP_Settings_OptionsList_Abstract_C_UnbindOnOptionEntryFocused) == 0x000010, "Wrong size on WBP_Settings_OptionsList_Abstract_C_UnbindOnOptionEntryFocused");
static_assert(offsetof(WBP_Settings_OptionsList_Abstract_C_UnbindOnOptionEntryFocused, Event) == 0x000000, "Member 'WBP_Settings_OptionsList_Abstract_C_UnbindOnOptionEntryFocused::Event' has a wrong offset!");

// Function WBP_Settings_OptionsList_Abstract.WBP_Settings_OptionsList_Abstract_C.ExecuteUbergraph_WBP_Settings_OptionsList_Abstract
// 0x0004 (0x0004 - 0x0000)
struct WBP_Settings_OptionsList_Abstract_C_ExecuteUbergraph_WBP_Settings_OptionsList_Abstract final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_OptionsList_Abstract_C_ExecuteUbergraph_WBP_Settings_OptionsList_Abstract) == 0x000004, "Wrong alignment on WBP_Settings_OptionsList_Abstract_C_ExecuteUbergraph_WBP_Settings_OptionsList_Abstract");
static_assert(sizeof(WBP_Settings_OptionsList_Abstract_C_ExecuteUbergraph_WBP_Settings_OptionsList_Abstract) == 0x000004, "Wrong size on WBP_Settings_OptionsList_Abstract_C_ExecuteUbergraph_WBP_Settings_OptionsList_Abstract");
static_assert(offsetof(WBP_Settings_OptionsList_Abstract_C_ExecuteUbergraph_WBP_Settings_OptionsList_Abstract, EntryPoint) == 0x000000, "Member 'WBP_Settings_OptionsList_Abstract_C_ExecuteUbergraph_WBP_Settings_OptionsList_Abstract::EntryPoint' has a wrong offset!");

}

