#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Button_TopMenu_Horizontal

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Button_TopMenu_Horizontal.WBP_Button_TopMenu_Horizontal_C.ExecuteUbergraph_WBP_Button_TopMenu_Horizontal
// 0x0010 (0x0010 - 0x0000)
struct WBP_Button_TopMenu_Horizontal_C_ExecuteUbergraph_WBP_Button_TopMenu_Horizontal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Button_TopMenu_Horizontal_C_ExecuteUbergraph_WBP_Button_TopMenu_Horizontal) == 0x000008, "Wrong alignment on WBP_Button_TopMenu_Horizontal_C_ExecuteUbergraph_WBP_Button_TopMenu_Horizontal");
static_assert(sizeof(WBP_Button_TopMenu_Horizontal_C_ExecuteUbergraph_WBP_Button_TopMenu_Horizontal) == 0x000010, "Wrong size on WBP_Button_TopMenu_Horizontal_C_ExecuteUbergraph_WBP_Button_TopMenu_Horizontal");
static_assert(offsetof(WBP_Button_TopMenu_Horizontal_C_ExecuteUbergraph_WBP_Button_TopMenu_Horizontal, EntryPoint) == 0x000000, "Member 'WBP_Button_TopMenu_Horizontal_C_ExecuteUbergraph_WBP_Button_TopMenu_Horizontal::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Button_TopMenu_Horizontal_C_ExecuteUbergraph_WBP_Button_TopMenu_Horizontal, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'WBP_Button_TopMenu_Horizontal_C_ExecuteUbergraph_WBP_Button_TopMenu_Horizontal::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Button_TopMenu_Horizontal_C_ExecuteUbergraph_WBP_Button_TopMenu_Horizontal, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'WBP_Button_TopMenu_Horizontal_C_ExecuteUbergraph_WBP_Button_TopMenu_Horizontal::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");

// Function WBP_Button_TopMenu_Horizontal.WBP_Button_TopMenu_Horizontal_C.SetTabName
// 0x0010 (0x0010 - 0x0000)
struct WBP_Button_TopMenu_Horizontal_C_SetTabName final
{
public:
	class FText                                   InTabName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Button_TopMenu_Horizontal_C_SetTabName) == 0x000008, "Wrong alignment on WBP_Button_TopMenu_Horizontal_C_SetTabName");
static_assert(sizeof(WBP_Button_TopMenu_Horizontal_C_SetTabName) == 0x000010, "Wrong size on WBP_Button_TopMenu_Horizontal_C_SetTabName");
static_assert(offsetof(WBP_Button_TopMenu_Horizontal_C_SetTabName, InTabName) == 0x000000, "Member 'WBP_Button_TopMenu_Horizontal_C_SetTabName::InTabName' has a wrong offset!");

}

