#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GM_LuminaPoints

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_GM_LuminaPoints.WBP_GM_LuminaPoints_C.SetValues
// 0x0028 (0x0028 - 0x0000)
struct WBP_GM_LuminaPoints_C_SetValues final
{
public:
	int32                                         InUsedPoints;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InMaxPoints;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0018(0x0010)()
};
static_assert(alignof(WBP_GM_LuminaPoints_C_SetValues) == 0x000008, "Wrong alignment on WBP_GM_LuminaPoints_C_SetValues");
static_assert(sizeof(WBP_GM_LuminaPoints_C_SetValues) == 0x000028, "Wrong size on WBP_GM_LuminaPoints_C_SetValues");
static_assert(offsetof(WBP_GM_LuminaPoints_C_SetValues, InUsedPoints) == 0x000000, "Member 'WBP_GM_LuminaPoints_C_SetValues::InUsedPoints' has a wrong offset!");
static_assert(offsetof(WBP_GM_LuminaPoints_C_SetValues, InMaxPoints) == 0x000004, "Member 'WBP_GM_LuminaPoints_C_SetValues::InMaxPoints' has a wrong offset!");
static_assert(offsetof(WBP_GM_LuminaPoints_C_SetValues, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_GM_LuminaPoints_C_SetValues::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_LuminaPoints_C_SetValues, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000018, "Member 'WBP_GM_LuminaPoints_C_SetValues::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");

}

