#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UniqueMechanic_Perfection

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "E_Perfection_Ranks_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UniqueMechanic_Perfection.WBP_UniqueMechanic_Perfection_C
// 0x0060 (0x0340 - 0x02E0)
class UWBP_UniqueMechanic_Perfection_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_SRank;                                        // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_DistortFade;                                  // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_TurnStart;                                    // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   FX_PerfectionLetter;                               // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background_Color;                            // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Perfection_Letter_Gauge_C*         PerfectionLetter;                                  // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox;                                       // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Name_UniqueMechanics_C*            WBP_Name_UniqueMechanics;                          // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsAppearing;                                       // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_PerfectionMechanicComponent_C*      Perfection_Component;                              // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               FX_MIDLetter;                                      // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Appear();
	void Construct();
	void Disappear();
	void ExecuteUbergraph_WBP_UniqueMechanic_Perfection(int32 EntryPoint);
	void FX_FeedbackOnRankChanged();
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void SetPerfectionComponent(class UBP_PerfectionMechanicComponent_C* PerfectionComponent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UniqueMechanic_Perfection_C">();
	}
	static class UWBP_UniqueMechanic_Perfection_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UniqueMechanic_Perfection_C>();
	}
};
static_assert(alignof(UWBP_UniqueMechanic_Perfection_C) == 0x000008, "Wrong alignment on UWBP_UniqueMechanic_Perfection_C");
static_assert(sizeof(UWBP_UniqueMechanic_Perfection_C) == 0x000340, "Wrong size on UWBP_UniqueMechanic_Perfection_C");
static_assert(offsetof(UWBP_UniqueMechanic_Perfection_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_UniqueMechanic_Perfection_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Perfection_C, Anim_SRank) == 0x0002E8, "Member 'UWBP_UniqueMechanic_Perfection_C::Anim_SRank' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Perfection_C, Anim_DistortFade) == 0x0002F0, "Member 'UWBP_UniqueMechanic_Perfection_C::Anim_DistortFade' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Perfection_C, Anim_TurnStart) == 0x0002F8, "Member 'UWBP_UniqueMechanic_Perfection_C::Anim_TurnStart' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Perfection_C, FX_PerfectionLetter) == 0x000300, "Member 'UWBP_UniqueMechanic_Perfection_C::FX_PerfectionLetter' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Perfection_C, Image_Background_Color) == 0x000308, "Member 'UWBP_UniqueMechanic_Perfection_C::Image_Background_Color' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Perfection_C, PerfectionLetter) == 0x000310, "Member 'UWBP_UniqueMechanic_Perfection_C::PerfectionLetter' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Perfection_C, RetainerBox) == 0x000318, "Member 'UWBP_UniqueMechanic_Perfection_C::RetainerBox' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Perfection_C, WBP_Name_UniqueMechanics) == 0x000320, "Member 'UWBP_UniqueMechanic_Perfection_C::WBP_Name_UniqueMechanics' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Perfection_C, IsAppearing) == 0x000328, "Member 'UWBP_UniqueMechanic_Perfection_C::IsAppearing' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Perfection_C, Perfection_Component) == 0x000330, "Member 'UWBP_UniqueMechanic_Perfection_C::Perfection_Component' has a wrong offset!");
static_assert(offsetof(UWBP_UniqueMechanic_Perfection_C, FX_MIDLetter) == 0x000338, "Member 'UWBP_UniqueMechanic_Perfection_C::FX_MIDLetter' has a wrong offset!");

}

