#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TurnOrder_Background_ActiveCharacter

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ECharacterTeamSelector_structs.hpp"


namespace SDK::Params
{

// Function WBP_TurnOrder_Background_ActiveCharacter.WBP_TurnOrder_Background_ActiveCharacter_C.ExecuteUbergraph_WBP_TurnOrder_Background_ActiveCharacter
// 0x0030 (0x0030 - 0x0000)
struct WBP_TurnOrder_Background_ActiveCharacter_C_ExecuteUbergraph_WBP_TurnOrder_Background_ActiveCharacter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECharacterTeamSelector                        K2Node_CustomEvent_CurrentTeam;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_wildcard_Variable;                            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TurnOrder_Background_ActiveCharacter_C_ExecuteUbergraph_WBP_TurnOrder_Background_ActiveCharacter) == 0x000008, "Wrong alignment on WBP_TurnOrder_Background_ActiveCharacter_C_ExecuteUbergraph_WBP_TurnOrder_Background_ActiveCharacter");
static_assert(sizeof(WBP_TurnOrder_Background_ActiveCharacter_C_ExecuteUbergraph_WBP_TurnOrder_Background_ActiveCharacter) == 0x000030, "Wrong size on WBP_TurnOrder_Background_ActiveCharacter_C_ExecuteUbergraph_WBP_TurnOrder_Background_ActiveCharacter");
static_assert(offsetof(WBP_TurnOrder_Background_ActiveCharacter_C_ExecuteUbergraph_WBP_TurnOrder_Background_ActiveCharacter, EntryPoint) == 0x000000, "Member 'WBP_TurnOrder_Background_ActiveCharacter_C_ExecuteUbergraph_WBP_TurnOrder_Background_ActiveCharacter::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TurnOrder_Background_ActiveCharacter_C_ExecuteUbergraph_WBP_TurnOrder_Background_ActiveCharacter, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_TurnOrder_Background_ActiveCharacter_C_ExecuteUbergraph_WBP_TurnOrder_Background_ActiveCharacter::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TurnOrder_Background_ActiveCharacter_C_ExecuteUbergraph_WBP_TurnOrder_Background_ActiveCharacter, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WBP_TurnOrder_Background_ActiveCharacter_C_ExecuteUbergraph_WBP_TurnOrder_Background_ActiveCharacter::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TurnOrder_Background_ActiveCharacter_C_ExecuteUbergraph_WBP_TurnOrder_Background_ActiveCharacter, K2Node_CustomEvent_CurrentTeam) == 0x000018, "Member 'WBP_TurnOrder_Background_ActiveCharacter_C_ExecuteUbergraph_WBP_TurnOrder_Background_ActiveCharacter::K2Node_CustomEvent_CurrentTeam' has a wrong offset!");
static_assert(offsetof(WBP_TurnOrder_Background_ActiveCharacter_C_ExecuteUbergraph_WBP_TurnOrder_Background_ActiveCharacter, CallFunc_PlayAnimation_ReturnValue_2) == 0x000020, "Member 'WBP_TurnOrder_Background_ActiveCharacter_C_ExecuteUbergraph_WBP_TurnOrder_Background_ActiveCharacter::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TurnOrder_Background_ActiveCharacter_C_ExecuteUbergraph_WBP_TurnOrder_Background_ActiveCharacter, Temp_wildcard_Variable) == 0x000028, "Member 'WBP_TurnOrder_Background_ActiveCharacter_C_ExecuteUbergraph_WBP_TurnOrder_Background_ActiveCharacter::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TurnOrder_Background_ActiveCharacter_C_ExecuteUbergraph_WBP_TurnOrder_Background_ActiveCharacter, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000029, "Member 'WBP_TurnOrder_Background_ActiveCharacter_C_ExecuteUbergraph_WBP_TurnOrder_Background_ActiveCharacter::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TurnOrder_Background_ActiveCharacter_C_ExecuteUbergraph_WBP_TurnOrder_Background_ActiveCharacter, K2Node_SwitchEnum_CmpSuccess) == 0x00002A, "Member 'WBP_TurnOrder_Background_ActiveCharacter_C_ExecuteUbergraph_WBP_TurnOrder_Background_ActiveCharacter::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_TurnOrder_Background_ActiveCharacter.WBP_TurnOrder_Background_ActiveCharacter_C.SetBackgroundText
// 0x0010 (0x0010 - 0x0000)
struct WBP_TurnOrder_Background_ActiveCharacter_C_SetBackgroundText final
{
public:
	class FText                                   InName;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_TurnOrder_Background_ActiveCharacter_C_SetBackgroundText) == 0x000008, "Wrong alignment on WBP_TurnOrder_Background_ActiveCharacter_C_SetBackgroundText");
static_assert(sizeof(WBP_TurnOrder_Background_ActiveCharacter_C_SetBackgroundText) == 0x000010, "Wrong size on WBP_TurnOrder_Background_ActiveCharacter_C_SetBackgroundText");
static_assert(offsetof(WBP_TurnOrder_Background_ActiveCharacter_C_SetBackgroundText, InName) == 0x000000, "Member 'WBP_TurnOrder_Background_ActiveCharacter_C_SetBackgroundText::InName' has a wrong offset!");

// Function WBP_TurnOrder_Background_ActiveCharacter.WBP_TurnOrder_Background_ActiveCharacter_C.SetCurrentTeam
// 0x0001 (0x0001 - 0x0000)
struct WBP_TurnOrder_Background_ActiveCharacter_C_SetCurrentTeam final
{
public:
	ECharacterTeamSelector                        CurrentTeam_0;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TurnOrder_Background_ActiveCharacter_C_SetCurrentTeam) == 0x000001, "Wrong alignment on WBP_TurnOrder_Background_ActiveCharacter_C_SetCurrentTeam");
static_assert(sizeof(WBP_TurnOrder_Background_ActiveCharacter_C_SetCurrentTeam) == 0x000001, "Wrong size on WBP_TurnOrder_Background_ActiveCharacter_C_SetCurrentTeam");
static_assert(offsetof(WBP_TurnOrder_Background_ActiveCharacter_C_SetCurrentTeam, CurrentTeam_0) == 0x000000, "Member 'WBP_TurnOrder_Background_ActiveCharacter_C_SetCurrentTeam::CurrentTeam_0' has a wrong offset!");

// Function WBP_TurnOrder_Background_ActiveCharacter.WBP_TurnOrder_Background_ActiveCharacter_C.SetTeamColor
// 0x0034 (0x0034 - 0x0000)
struct WBP_TurnOrder_Background_ActiveCharacter_C_SetTeamColor final
{
public:
	struct FLinearColor                           TeamColor_0;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetColorVariationForText_ReturnValue;     // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0020(0x0014)()
};
static_assert(alignof(WBP_TurnOrder_Background_ActiveCharacter_C_SetTeamColor) == 0x000004, "Wrong alignment on WBP_TurnOrder_Background_ActiveCharacter_C_SetTeamColor");
static_assert(sizeof(WBP_TurnOrder_Background_ActiveCharacter_C_SetTeamColor) == 0x000034, "Wrong size on WBP_TurnOrder_Background_ActiveCharacter_C_SetTeamColor");
static_assert(offsetof(WBP_TurnOrder_Background_ActiveCharacter_C_SetTeamColor, TeamColor_0) == 0x000000, "Member 'WBP_TurnOrder_Background_ActiveCharacter_C_SetTeamColor::TeamColor_0' has a wrong offset!");
static_assert(offsetof(WBP_TurnOrder_Background_ActiveCharacter_C_SetTeamColor, CallFunc_GetColorVariationForText_ReturnValue) == 0x000010, "Member 'WBP_TurnOrder_Background_ActiveCharacter_C_SetTeamColor::CallFunc_GetColorVariationForText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TurnOrder_Background_ActiveCharacter_C_SetTeamColor, K2Node_MakeStruct_SlateColor) == 0x000020, "Member 'WBP_TurnOrder_Background_ActiveCharacter_C_SetTeamColor::K2Node_MakeStruct_SlateColor' has a wrong offset!");

}

