#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_Battle_TargetingControls

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUD_Battle_TargetingControls.WBP_HUD_Battle_TargetingControls_C
// 0x0048 (0x0478 - 0x0430)
class UWBP_HUD_Battle_TargetingControls_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Appear;                                       // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Root;                                // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GM_PromptGeneric_C*                WBP_GM_PromptGeneric_Back;                         // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GM_PromptGeneric_C*                WBP_GM_PromptGeneric_Confirm;                      // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnCancelClicked;                                   // 0x0458(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnConfirmClicked;                                  // 0x0468(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void AppearInternal();
	void BndEvt__WBP_HUD_Battle_TargetingControls_WBP_GM_PromptGeneric_Back_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_HUD_CancelButton_WBP_GM_PromptGeneric_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void DisappearInternal();
	void ExecuteUbergraph_WBP_HUD_Battle_TargetingControls(int32 EntryPoint);
	void GetTiedObject(class UObject** Object);
	void OnUIAction();
	void OnUINavigationFocus(const class UBP_UINavigationFocusEvent_C* FocusEventBP);
	void OnUINavigationFocusLost();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUD_Battle_TargetingControls_C">();
	}
	static class UWBP_HUD_Battle_TargetingControls_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_Battle_TargetingControls_C>();
	}
};
static_assert(alignof(UWBP_HUD_Battle_TargetingControls_C) == 0x000008, "Wrong alignment on UWBP_HUD_Battle_TargetingControls_C");
static_assert(sizeof(UWBP_HUD_Battle_TargetingControls_C) == 0x000478, "Wrong size on UWBP_HUD_Battle_TargetingControls_C");
static_assert(offsetof(UWBP_HUD_Battle_TargetingControls_C, UberGraphFrame) == 0x000430, "Member 'UWBP_HUD_Battle_TargetingControls_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Battle_TargetingControls_C, Anim_Appear) == 0x000438, "Member 'UWBP_HUD_Battle_TargetingControls_C::Anim_Appear' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Battle_TargetingControls_C, HorizontalBox_Root) == 0x000440, "Member 'UWBP_HUD_Battle_TargetingControls_C::HorizontalBox_Root' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Battle_TargetingControls_C, WBP_GM_PromptGeneric_Back) == 0x000448, "Member 'UWBP_HUD_Battle_TargetingControls_C::WBP_GM_PromptGeneric_Back' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Battle_TargetingControls_C, WBP_GM_PromptGeneric_Confirm) == 0x000450, "Member 'UWBP_HUD_Battle_TargetingControls_C::WBP_GM_PromptGeneric_Confirm' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Battle_TargetingControls_C, OnCancelClicked) == 0x000458, "Member 'UWBP_HUD_Battle_TargetingControls_C::OnCancelClicked' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Battle_TargetingControls_C, OnConfirmClicked) == 0x000468, "Member 'UWBP_HUD_Battle_TargetingControls_C::OnConfirmClicked' has a wrong offset!");

}

