#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HealthBar

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_HealthBar.WBP_HealthBar_C.LoadCharacterData
// 0x0018 (0x0018 - 0x0000)
struct WBP_HealthBar_C_LoadCharacterData final
{
public:
	class UBP_CharacterData_C*                    InCharacterData;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetMaxHP_MaxHP;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HealthBar_C_LoadCharacterData) == 0x000008, "Wrong alignment on WBP_HealthBar_C_LoadCharacterData");
static_assert(sizeof(WBP_HealthBar_C_LoadCharacterData) == 0x000018, "Wrong size on WBP_HealthBar_C_LoadCharacterData");
static_assert(offsetof(WBP_HealthBar_C_LoadCharacterData, InCharacterData) == 0x000000, "Member 'WBP_HealthBar_C_LoadCharacterData::InCharacterData' has a wrong offset!");
static_assert(offsetof(WBP_HealthBar_C_LoadCharacterData, CallFunc_GetMaxHP_MaxHP) == 0x000008, "Member 'WBP_HealthBar_C_LoadCharacterData::CallFunc_GetMaxHP_MaxHP' has a wrong offset!");
static_assert(offsetof(WBP_HealthBar_C_LoadCharacterData, CallFunc_FTrunc_ReturnValue) == 0x000010, "Member 'WBP_HealthBar_C_LoadCharacterData::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HealthBar_C_LoadCharacterData, CallFunc_FTrunc_ReturnValue_1) == 0x000014, "Member 'WBP_HealthBar_C_LoadCharacterData::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");

// Function WBP_HealthBar.WBP_HealthBar_C.SetValue
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_HealthBar_C_SetValue final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxValue;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0010)()
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0048)(HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0078(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0088(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E0(0x0010)()
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HealthBar_C_SetValue) == 0x000008, "Wrong alignment on WBP_HealthBar_C_SetValue");
static_assert(sizeof(WBP_HealthBar_C_SetValue) == 0x0000F8, "Wrong size on WBP_HealthBar_C_SetValue");
static_assert(offsetof(WBP_HealthBar_C_SetValue, Value) == 0x000000, "Member 'WBP_HealthBar_C_SetValue::Value' has a wrong offset!");
static_assert(offsetof(WBP_HealthBar_C_SetValue, MaxValue) == 0x000004, "Member 'WBP_HealthBar_C_SetValue::MaxValue' has a wrong offset!");
static_assert(offsetof(WBP_HealthBar_C_SetValue, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'WBP_HealthBar_C_SetValue::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HealthBar_C_SetValue, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'WBP_HealthBar_C_SetValue::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HealthBar_C_SetValue, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000020, "Member 'WBP_HealthBar_C_SetValue::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HealthBar_C_SetValue, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'WBP_HealthBar_C_SetValue::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_HealthBar_C_SetValue, CallFunc_SafeDivide_ReturnValue) == 0x000070, "Member 'WBP_HealthBar_C_SetValue::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HealthBar_C_SetValue, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000078, "Member 'WBP_HealthBar_C_SetValue::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HealthBar_C_SetValue, K2Node_MakeStruct_FormatArgumentData_1) == 0x000088, "Member 'WBP_HealthBar_C_SetValue::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_HealthBar_C_SetValue, K2Node_MakeArray_Array) == 0x0000D0, "Member 'WBP_HealthBar_C_SetValue::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_HealthBar_C_SetValue, CallFunc_Format_ReturnValue) == 0x0000E0, "Member 'WBP_HealthBar_C_SetValue::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HealthBar_C_SetValue, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x0000F0, "Member 'WBP_HealthBar_C_SetValue::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

// Function WBP_HealthBar.WBP_HealthBar_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_HealthBar_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HealthBar_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_HealthBar_C_PreConstruct");
static_assert(sizeof(WBP_HealthBar_C_PreConstruct) == 0x000001, "Wrong size on WBP_HealthBar_C_PreConstruct");
static_assert(offsetof(WBP_HealthBar_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_HealthBar_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_HealthBar.WBP_HealthBar_C.ExecuteUbergraph_WBP_HealthBar
// 0x0018 (0x0018 - 0x0000)
struct WBP_HealthBar_C_ExecuteUbergraph_WBP_HealthBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       K2Node_DynamicCast_AsVertical_Box_Slot;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HealthBar_C_ExecuteUbergraph_WBP_HealthBar) == 0x000008, "Wrong alignment on WBP_HealthBar_C_ExecuteUbergraph_WBP_HealthBar");
static_assert(sizeof(WBP_HealthBar_C_ExecuteUbergraph_WBP_HealthBar) == 0x000018, "Wrong size on WBP_HealthBar_C_ExecuteUbergraph_WBP_HealthBar");
static_assert(offsetof(WBP_HealthBar_C_ExecuteUbergraph_WBP_HealthBar, EntryPoint) == 0x000000, "Member 'WBP_HealthBar_C_ExecuteUbergraph_WBP_HealthBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HealthBar_C_ExecuteUbergraph_WBP_HealthBar, K2Node_DynamicCast_AsVertical_Box_Slot) == 0x000008, "Member 'WBP_HealthBar_C_ExecuteUbergraph_WBP_HealthBar::K2Node_DynamicCast_AsVertical_Box_Slot' has a wrong offset!");
static_assert(offsetof(WBP_HealthBar_C_ExecuteUbergraph_WBP_HealthBar, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_HealthBar_C_ExecuteUbergraph_WBP_HealthBar::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HealthBar_C_ExecuteUbergraph_WBP_HealthBar, K2Node_Event_IsDesignTime) == 0x000011, "Member 'WBP_HealthBar_C_ExecuteUbergraph_WBP_HealthBar::K2Node_Event_IsDesignTime' has a wrong offset!");

}

