#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MM_BackupSaveEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MM_BackupSaveEntry.WBP_MM_BackupSaveEntry_C
// 0x0050 (0x0358 - 0x0308)
class UWBP_MM_BackupSaveEntry_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       DateText;                                          // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PlaytimeText;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BaseButton_C*                      WBP_BaseButton;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UWBP_MM_BackupSaveEntry_C* BackUpSaveEntry)> OnBackupSaveFocused; // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UWBP_MM_BackupSaveEntry_C* BackUpSaveEntry)> OnBackupSaveClicked; // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FString                                 BackUpSave;                                        // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_MM_BackupSaveEntry_WBP_BaseButton_K2Node_ComponentBoundEvent_0_OnButtonBaseFocused__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_MM_BackupSaveEntry_WBP_BaseButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WBP_MM_BackupSaveEntry(int32 EntryPoint);
	void GetBackUpSave(class FString* BackUpSave_0);
	void LoadBackupSaveData(const class FString& SaveString, class UBP_SaveGameData_C* SaveData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MM_BackupSaveEntry_C">();
	}
	static class UWBP_MM_BackupSaveEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MM_BackupSaveEntry_C>();
	}
};
static_assert(alignof(UWBP_MM_BackupSaveEntry_C) == 0x000008, "Wrong alignment on UWBP_MM_BackupSaveEntry_C");
static_assert(sizeof(UWBP_MM_BackupSaveEntry_C) == 0x000358, "Wrong size on UWBP_MM_BackupSaveEntry_C");
static_assert(offsetof(UWBP_MM_BackupSaveEntry_C, UberGraphFrame) == 0x000308, "Member 'UWBP_MM_BackupSaveEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MM_BackupSaveEntry_C, DateText) == 0x000310, "Member 'UWBP_MM_BackupSaveEntry_C::DateText' has a wrong offset!");
static_assert(offsetof(UWBP_MM_BackupSaveEntry_C, PlaytimeText) == 0x000318, "Member 'UWBP_MM_BackupSaveEntry_C::PlaytimeText' has a wrong offset!");
static_assert(offsetof(UWBP_MM_BackupSaveEntry_C, WBP_BaseButton) == 0x000320, "Member 'UWBP_MM_BackupSaveEntry_C::WBP_BaseButton' has a wrong offset!");
static_assert(offsetof(UWBP_MM_BackupSaveEntry_C, OnBackupSaveFocused) == 0x000328, "Member 'UWBP_MM_BackupSaveEntry_C::OnBackupSaveFocused' has a wrong offset!");
static_assert(offsetof(UWBP_MM_BackupSaveEntry_C, OnBackupSaveClicked) == 0x000338, "Member 'UWBP_MM_BackupSaveEntry_C::OnBackupSaveClicked' has a wrong offset!");
static_assert(offsetof(UWBP_MM_BackupSaveEntry_C, BackUpSave) == 0x000348, "Member 'UWBP_MM_BackupSaveEntry_C::BackUpSave' has a wrong offset!");

}

