#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Panel_Blacksmith_Consumables

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_Panel_Blacksmith_Consumables.WBP_Panel_Blacksmith_Consumables_C.BP_OnHandleBackAction
// 0x0001 (0x0001 - 0x0000)
struct WBP_Panel_Blacksmith_Consumables_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Panel_Blacksmith_Consumables_C_BP_OnHandleBackAction) == 0x000001, "Wrong alignment on WBP_Panel_Blacksmith_Consumables_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_Panel_Blacksmith_Consumables_C_BP_OnHandleBackAction) == 0x000001, "Wrong size on WBP_Panel_Blacksmith_Consumables_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_Panel_Blacksmith_Consumables_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");

// Function WBP_Panel_Blacksmith_Consumables.WBP_Panel_Blacksmith_Consumables_C.EndCuratorExpeditionMenuTutorials
// 0x0008 (0x0008 - 0x0000)
struct WBP_Panel_Blacksmith_Consumables_C_EndCuratorExpeditionMenuTutorials final
{
public:
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Panel_Blacksmith_Consumables_C_EndCuratorExpeditionMenuTutorials) == 0x000008, "Wrong alignment on WBP_Panel_Blacksmith_Consumables_C_EndCuratorExpeditionMenuTutorials");
static_assert(sizeof(WBP_Panel_Blacksmith_Consumables_C_EndCuratorExpeditionMenuTutorials) == 0x000008, "Wrong size on WBP_Panel_Blacksmith_Consumables_C_EndCuratorExpeditionMenuTutorials");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_EndCuratorExpeditionMenuTutorials, CallFunc_GetCustomGI_ReturnValue) == 0x000000, "Member 'WBP_Panel_Blacksmith_Consumables_C_EndCuratorExpeditionMenuTutorials::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");

// Function WBP_Panel_Blacksmith_Consumables.WBP_Panel_Blacksmith_Consumables_C.ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables
// 0x01B8 (0x01B8 - 0x0000)
struct WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Temp_object_Variable;                              // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_1;  // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1; // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_2;  // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_2; // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x00C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_3;  // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_3; // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Controller_World_C*            K2Node_DynamicCast_AsBP_J_RPG_Controller_World;    // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0104(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0118(0x0008)(NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Controller_World_C*            K2Node_DynamicCast_AsBP_J_RPG_Controller_World_1;  // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13B[0x1];                                      // 0x013B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default;                             // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Tuto_BlurIndicator_C*              CallFunc_HighlightTutorialWidget_AreaHighlightWidget; // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    CallFunc_GetAllEntries_ReturnValue;                // 0x0158(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_LuminaConsumableEntry_C*           K2Node_DynamicCast_AsWBP_Lumina_Consumable_Entry;  // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_182[0x6];                                      // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_1;         // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D_1;                 // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables) == 0x000008, "Wrong alignment on WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables");
static_assert(sizeof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables) == 0x0001B8, "Wrong size on WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, EntryPoint) == 0x000000, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000038, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, Temp_int_Variable) == 0x000040, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, Temp_object_Variable) == 0x000048, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, K2Node_CreateDelegate_OutputDelegate_3) == 0x000050, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, Temp_int_Variable_1) == 0x000060, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, Temp_int_Loop_Counter_Variable) == 0x000064, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, K2Node_CreateDelegate_OutputDelegate_4) == 0x000068, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, CallFunc_Add_IntInt_ReturnValue) == 0x000078, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, Temp_int_Array_Index_Variable) == 0x00007C, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000080, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000088, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, CallFunc_CreatePlayAnimationProxyObject_Result_1) == 0x000098, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::CallFunc_CreatePlayAnimationProxyObject_Result_1' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1) == 0x0000A0, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, CallFunc_IsValid_ReturnValue_1) == 0x0000A8, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, CallFunc_CreatePlayAnimationProxyObject_Result_2) == 0x0000B0, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::CallFunc_CreatePlayAnimationProxyObject_Result_2' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_2) == 0x0000B8, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000C0, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, CallFunc_IsValid_ReturnValue_2) == 0x0000D0, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, CallFunc_CreatePlayAnimationProxyObject_Result_3) == 0x0000D8, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::CallFunc_CreatePlayAnimationProxyObject_Result_3' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, CallFunc_CreatePlayAnimationProxyObject_ReturnValue_3) == 0x0000E0, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::CallFunc_CreatePlayAnimationProxyObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, CallFunc_IsValid_ReturnValue_3) == 0x0000E8, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, CallFunc_GetPlayerController_ReturnValue) == 0x0000F0, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, K2Node_DynamicCast_AsBP_J_RPG_Controller_World) == 0x0000F8, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::K2Node_DynamicCast_AsBP_J_RPG_Controller_World' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, K2Node_CreateDelegate_OutputDelegate_6) == 0x000104, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000118, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, CallFunc_GetPlayerController_ReturnValue_1) == 0x000120, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, K2Node_DynamicCast_AsBP_J_RPG_Controller_World_1) == 0x000128, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::K2Node_DynamicCast_AsBP_J_RPG_Controller_World_1' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, K2Node_DynamicCast_bSuccess_1) == 0x000130, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, CallFunc_Array_Length_ReturnValue) == 0x000134, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000138, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, CallFunc_Not_PreBool_ReturnValue) == 0x000139, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, CallFunc_IsValid_ReturnValue_4) == 0x00013A, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, CallFunc_Add_IntInt_ReturnValue_1) == 0x00013C, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, K2Node_Select_Default) == 0x000140, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, CallFunc_HighlightTutorialWidget_AreaHighlightWidget) == 0x000148, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::CallFunc_HighlightTutorialWidget_AreaHighlightWidget' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, CallFunc_IsValid_ReturnValue_5) == 0x000150, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, CallFunc_GetAllEntries_ReturnValue) == 0x000158, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::CallFunc_GetAllEntries_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, CallFunc_Array_Get_Item) == 0x000168, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, CallFunc_Array_Length_ReturnValue_1) == 0x000170, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, K2Node_DynamicCast_AsWBP_Lumina_Consumable_Entry) == 0x000178, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::K2Node_DynamicCast_AsWBP_Lumina_Consumable_Entry' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, K2Node_DynamicCast_bSuccess_2) == 0x000180, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, CallFunc_Less_IntInt_ReturnValue) == 0x000181, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000188, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, K2Node_DynamicCast_AsTexture_2D) == 0x000190, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, K2Node_DynamicCast_bSuccess_3) == 0x000198, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, CallFunc_LoadAsset_Blocking_ReturnValue_1) == 0x0001A0, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::CallFunc_LoadAsset_Blocking_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, K2Node_DynamicCast_AsTexture_2D_1) == 0x0001A8, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::K2Node_DynamicCast_AsTexture_2D_1' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables, K2Node_DynamicCast_bSuccess_4) == 0x0001B0, "Member 'WBP_Panel_Blacksmith_Consumables_C_ExecuteUbergraph_WBP_Panel_Blacksmith_Consumables::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");

// Function WBP_Panel_Blacksmith_Consumables.WBP_Panel_Blacksmith_Consumables_C.StartCuratorExpeditionMenuTutorials
// 0x0003 (0x0003 - 0x0000)
struct WBP_Panel_Blacksmith_Consumables_C_StartCuratorExpeditionMenuTutorials final
{
public:
	bool                                          CallFunc_AreTutorialsEnabled_ReturnValue;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPersistentFlag_Result;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Panel_Blacksmith_Consumables_C_StartCuratorExpeditionMenuTutorials) == 0x000001, "Wrong alignment on WBP_Panel_Blacksmith_Consumables_C_StartCuratorExpeditionMenuTutorials");
static_assert(sizeof(WBP_Panel_Blacksmith_Consumables_C_StartCuratorExpeditionMenuTutorials) == 0x000003, "Wrong size on WBP_Panel_Blacksmith_Consumables_C_StartCuratorExpeditionMenuTutorials");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_StartCuratorExpeditionMenuTutorials, CallFunc_AreTutorialsEnabled_ReturnValue) == 0x000000, "Member 'WBP_Panel_Blacksmith_Consumables_C_StartCuratorExpeditionMenuTutorials::CallFunc_AreTutorialsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_StartCuratorExpeditionMenuTutorials, CallFunc_HasPersistentFlag_Result) == 0x000001, "Member 'WBP_Panel_Blacksmith_Consumables_C_StartCuratorExpeditionMenuTutorials::CallFunc_HasPersistentFlag_Result' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_StartCuratorExpeditionMenuTutorials, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'WBP_Panel_Blacksmith_Consumables_C_StartCuratorExpeditionMenuTutorials::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_Panel_Blacksmith_Consumables.WBP_Panel_Blacksmith_Consumables_C.BP_GetDesiredFocusTarget
// 0x0038 (0x0038 - 0x0000)
struct WBP_Panel_Blacksmith_Consumables_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    CallFunc_GetAllEntries_ReturnValue;                // 0x0008(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_LuminaConsumableEntry_C*           K2Node_DynamicCast_AsWBP_Lumina_Consumable_Entry;  // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Panel_Blacksmith_Consumables_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_Panel_Blacksmith_Consumables_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_Panel_Blacksmith_Consumables_C_BP_GetDesiredFocusTarget) == 0x000038, "Wrong size on WBP_Panel_Blacksmith_Consumables_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_Panel_Blacksmith_Consumables_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Blacksmith_Consumables_C_BP_GetDesiredFocusTarget, CallFunc_GetAllEntries_ReturnValue) == 0x000008, "Member 'WBP_Panel_Blacksmith_Consumables_C_BP_GetDesiredFocusTarget::CallFunc_GetAllEntries_ReturnValue' has a wrong offset!");
