#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SF_RichTextBlock

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function WBP_SF_RichTextBlock.WBP_SF_RichTextBlock_C.ExecuteUbergraph_WBP_SF_RichTextBlock
// 0x0128 (0x0128 - 0x0000)
struct WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       K2Node_DynamicCast_AsCanvas_Panel_Slot;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     K2Node_DynamicCast_AsHorizontal_Box_Slot;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       K2Node_DynamicCast_AsVertical_Box_Slot;            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0038(0x0010)()
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       K2Node_DynamicCast_AsVertical_Box_Slot_1;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       K2Node_DynamicCast_AsCanvas_Panel_Slot_1;          // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetZOrder_ReturnValue;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                CallFunc_GetOffsets_ReturnValue;                   // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchorData                            CallFunc_GetLayout_ReturnValue;                    // 0x00A0(0x0040)(NoDestructor)
	bool                                          CallFunc_GetAutoSize_ReturnValue;                  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnchors                               CallFunc_GetAnchors_ReturnValue;                   // 0x00E8(0x0020)(NoDestructor)
	struct FVector2D                              CallFunc_GetAlignment_ReturnValue;                 // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     K2Node_DynamicCast_AsHorizontal_Box_Slot_1;        // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock) == 0x000008, "Wrong alignment on WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock");
static_assert(sizeof(WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock) == 0x000128, "Wrong size on WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock");
static_assert(offsetof(WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock, EntryPoint) == 0x000000, "Member 'WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock, K2Node_DynamicCast_AsCanvas_Panel_Slot) == 0x000008, "Member 'WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock::K2Node_DynamicCast_AsCanvas_Panel_Slot' has a wrong offset!");
static_assert(offsetof(WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock, K2Node_DynamicCast_AsHorizontal_Box_Slot) == 0x000018, "Member 'WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock::K2Node_DynamicCast_AsHorizontal_Box_Slot' has a wrong offset!");
static_assert(offsetof(WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock, K2Node_DynamicCast_bSuccess_1) == 0x000020, "Member 'WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock, K2Node_DynamicCast_AsVertical_Box_Slot) == 0x000028, "Member 'WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock::K2Node_DynamicCast_AsVertical_Box_Slot' has a wrong offset!");
static_assert(offsetof(WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock, K2Node_DynamicCast_bSuccess_2) == 0x000030, "Member 'WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock, CallFunc_GetText_ReturnValue) == 0x000038, "Member 'WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock, CallFunc_GetVisibility_ReturnValue) == 0x000048, "Member 'WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock, K2Node_DynamicCast_AsVertical_Box_Slot_1) == 0x000050, "Member 'WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock::K2Node_DynamicCast_AsVertical_Box_Slot_1' has a wrong offset!");
static_assert(offsetof(WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock, K2Node_DynamicCast_bSuccess_3) == 0x000058, "Member 'WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock, K2Node_DynamicCast_AsCanvas_Panel_Slot_1) == 0x000060, "Member 'WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock::K2Node_DynamicCast_AsCanvas_Panel_Slot_1' has a wrong offset!");
static_assert(offsetof(WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock, K2Node_DynamicCast_bSuccess_4) == 0x000068, "Member 'WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock, CallFunc_GetZOrder_ReturnValue) == 0x00006C, "Member 'WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock::CallFunc_GetZOrder_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock, CallFunc_GetSize_ReturnValue) == 0x000070, "Member 'WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock::CallFunc_GetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock, CallFunc_GetOffsets_ReturnValue) == 0x000080, "Member 'WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock::CallFunc_GetOffsets_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock, CallFunc_GetPosition_ReturnValue) == 0x000090, "Member 'WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock, CallFunc_GetLayout_ReturnValue) == 0x0000A0, "Member 'WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock::CallFunc_GetLayout_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock, CallFunc_GetAutoSize_ReturnValue) == 0x0000E0, "Member 'WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock::CallFunc_GetAutoSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock, CallFunc_GetAnchors_ReturnValue) == 0x0000E8, "Member 'WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock::CallFunc_GetAnchors_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock, CallFunc_GetAlignment_ReturnValue) == 0x000108, "Member 'WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock::CallFunc_GetAlignment_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock, K2Node_DynamicCast_AsHorizontal_Box_Slot_1) == 0x000118, "Member 'WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock::K2Node_DynamicCast_AsHorizontal_Box_Slot_1' has a wrong offset!");
static_assert(offsetof(WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock, K2Node_DynamicCast_bSuccess_5) == 0x000120, "Member 'WBP_SF_RichTextBlock_C_ExecuteUbergraph_WBP_SF_RichTextBlock::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");

}

