#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WorldMapPromptContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_WorldMapPromptContainer.WBP_WorldMapPromptContainer_C
// 0x0038 (0x0318 - 0x02E0)
class UWBP_WorldMapPromptContainer_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_TextualInputActionBinding_C*       WBP_TextualInputActionBinding_Camp;                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TextualInputActionBinding_C*       WBP_TextualInputActionBinding_FlyDown;             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TextualInputActionBinding_C*       WBP_TextualInputActionBinding_FlyUp;               // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TextualInputActionBinding_C*       WBP_TextualInputActionBinding_MiniMap;             // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TextualInputActionBinding_C*       WBP_TextualInputActionBinding_Mount;               // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TextualInputActionBinding_C*       WBP_TextualInputActionBinding_TakeOffLand;         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_WorldMapPromptContainer(int32 EntryPoint);
	void OnAnyWorldMapCapacityUnlocked();
	void OnDismountRequested();
	void OnMountRequested();
	void SetCampPossible(bool CanCamp);
	void SetIsFlying(bool IsFlying);
	void SetLandPossible(bool CanLand);
	void SetMountPossible(bool CanMount);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_WorldMapPromptContainer_C">();
	}
	static class UWBP_WorldMapPromptContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_WorldMapPromptContainer_C>();
	}
};
static_assert(alignof(UWBP_WorldMapPromptContainer_C) == 0x000008, "Wrong alignment on UWBP_WorldMapPromptContainer_C");
static_assert(sizeof(UWBP_WorldMapPromptContainer_C) == 0x000318, "Wrong size on UWBP_WorldMapPromptContainer_C");
static_assert(offsetof(UWBP_WorldMapPromptContainer_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_WorldMapPromptContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_WorldMapPromptContainer_C, WBP_TextualInputActionBinding_Camp) == 0x0002E8, "Member 'UWBP_WorldMapPromptContainer_C::WBP_TextualInputActionBinding_Camp' has a wrong offset!");
static_assert(offsetof(UWBP_WorldMapPromptContainer_C, WBP_TextualInputActionBinding_FlyDown) == 0x0002F0, "Member 'UWBP_WorldMapPromptContainer_C::WBP_TextualInputActionBinding_FlyDown' has a wrong offset!");
static_assert(offsetof(UWBP_WorldMapPromptContainer_C, WBP_TextualInputActionBinding_FlyUp) == 0x0002F8, "Member 'UWBP_WorldMapPromptContainer_C::WBP_TextualInputActionBinding_FlyUp' has a wrong offset!");
static_assert(offsetof(UWBP_WorldMapPromptContainer_C, WBP_TextualInputActionBinding_MiniMap) == 0x000300, "Member 'UWBP_WorldMapPromptContainer_C::WBP_TextualInputActionBinding_MiniMap' has a wrong offset!");
static_assert(offsetof(UWBP_WorldMapPromptContainer_C, WBP_TextualInputActionBinding_Mount) == 0x000308, "Member 'UWBP_WorldMapPromptContainer_C::WBP_TextualInputActionBinding_Mount' has a wrong offset!");
static_assert(offsetof(UWBP_WorldMapPromptContainer_C, WBP_TextualInputActionBinding_TakeOffLand) == 0x000310, "Member 'UWBP_WorldMapPromptContainer_C::WBP_TextualInputActionBinding_TakeOffLand' has a wrong offset!");

}

