#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Category_Customization

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SandFall_structs.hpp"
#include "E_CustomizationItemType_structs.hpp"
#include "CommonUI_classes.hpp"
#include "CommonInput_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Category_Customization.WBP_Category_Customization_C
// 0x0078 (0x04A8 - 0x0430)
class UWBP_Category_Customization_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_HeadingText_C*                     CategoryText;                                      // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDynamicEntryBox*                       CustomizationEntryBox;                             // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox;                                         // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ItemCategoryName;                                  // 0x0450(0x0010)(Edit, BlueprintVisible)
	E_CustomizationItemType                       ItemType;                                          // 0x0460(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_461[0x7];                                      // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CharacterData_C*                    CharacterData;                                     // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_GameMenuScene_C*                    GameMenuScene;                                     // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FSoundEventDataTableRowHandle          SD_OnOutfitEquipped;                               // 0x0478(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FSoundEventDataTableRowHandle          SD_OnHaircutEquipped;                              // 0x0488(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	TMulticastInlineDelegate<void(bool IsWaiting)> OnWaitForPSOCaching;                              // 0x0498(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BP_OnActivated();
	void CheckSelectedState();
	struct FS_CharacterCustomizationItemData ComputeCharacterCustomizationItemDataToApply(const struct FS_jRPG_Item_StaticData& Item);
	void Construct();
	void CREATEDELEGATE_PROXYFUNCTION_0(const struct FS_jRPG_Item_StaticData& Item);
	void ExecuteUbergraph_WBP_Category_Customization(int32 EntryPoint);
	void GetEquippedItem(struct FS_jRPG_Item_StaticData* Item);
	void LoadCustomizationItems(class UBP_CharacterData_C* CharacterData_0, E_CustomizationItemType ItemType_0);
	void OnCachingDone_36ECF51143440342322FE398BB0138A5();
	void OnCachingTakingMoreTime_36ECF51143440342322FE398BB0138A5();
	void OnCustomizationItemClicked(const struct FS_jRPG_Item_StaticData& ItemStaticData);
	void OnInputMethodChanged(ECommonInputType bNewInputType);
	void PreConstruct(bool IsDesignTime);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Category_Customization_C">();
	}
	static class UWBP_Category_Customization_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Category_Customization_C>();
	}
};
static_assert(alignof(UWBP_Category_Customization_C) == 0x000008, "Wrong alignment on UWBP_Category_Customization_C");
static_assert(sizeof(UWBP_Category_Customization_C) == 0x0004A8, "Wrong size on UWBP_Category_Customization_C");
static_assert(offsetof(UWBP_Category_Customization_C, UberGraphFrame) == 0x000430, "Member 'UWBP_Category_Customization_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Category_Customization_C, CategoryText) == 0x000438, "Member 'UWBP_Category_Customization_C::CategoryText' has a wrong offset!");
static_assert(offsetof(UWBP_Category_Customization_C, CustomizationEntryBox) == 0x000440, "Member 'UWBP_Category_Customization_C::CustomizationEntryBox' has a wrong offset!");
static_assert(offsetof(UWBP_Category_Customization_C, ScrollBox) == 0x000448, "Member 'UWBP_Category_Customization_C::ScrollBox' has a wrong offset!");
static_assert(offsetof(UWBP_Category_Customization_C, ItemCategoryName) == 0x000450, "Member 'UWBP_Category_Customization_C::ItemCategoryName' has a wrong offset!");
static_assert(offsetof(UWBP_Category_Customization_C, ItemType) == 0x000460, "Member 'UWBP_Category_Customization_C::ItemType' has a wrong offset!");
static_assert(offsetof(UWBP_Category_Customization_C, CharacterData) == 0x000468, "Member 'UWBP_Category_Customization_C::CharacterData' has a wrong offset!");
static_assert(offsetof(UWBP_Category_Customization_C, GameMenuScene) == 0x000470, "Member 'UWBP_Category_Customization_C::GameMenuScene' has a wrong offset!");
static_assert(offsetof(UWBP_Category_Customization_C, SD_OnOutfitEquipped) == 0x000478, "Member 'UWBP_Category_Customization_C::SD_OnOutfitEquipped' has a wrong offset!");
static_assert(offsetof(UWBP_Category_Customization_C, SD_OnHaircutEquipped) == 0x000488, "Member 'UWBP_Category_Customization_C::SD_OnHaircutEquipped' has a wrong offset!");
static_assert(offsetof(UWBP_Category_Customization_C, OnWaitForPSOCaching) == 0x000498, "Member 'UWBP_Category_Customization_C::OnWaitForPSOCaching' has a wrong offset!");

}

