#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharacterSelectorEntry

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_CharacterSelectorEntry.WBP_CharacterSelectorEntry_C.BPI_ShouldShowNotification
// 0x0001 (0x0001 - 0x0000)
struct WBP_CharacterSelectorEntry_C_BPI_ShouldShowNotification final
{
public:
	bool                                          bShouldShow;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectorEntry_C_BPI_ShouldShowNotification) == 0x000001, "Wrong alignment on WBP_CharacterSelectorEntry_C_BPI_ShouldShowNotification");
static_assert(sizeof(WBP_CharacterSelectorEntry_C_BPI_ShouldShowNotification) == 0x000001, "Wrong size on WBP_CharacterSelectorEntry_C_BPI_ShouldShowNotification");
static_assert(offsetof(WBP_CharacterSelectorEntry_C_BPI_ShouldShowNotification, bShouldShow) == 0x000000, "Member 'WBP_CharacterSelectorEntry_C_BPI_ShouldShowNotification::bShouldShow' has a wrong offset!");

// Function WBP_CharacterSelectorEntry.WBP_CharacterSelectorEntry_C.GetTiedObject
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterSelectorEntry_C_GetTiedObject final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectorEntry_C_GetTiedObject) == 0x000008, "Wrong alignment on WBP_CharacterSelectorEntry_C_GetTiedObject");
static_assert(sizeof(WBP_CharacterSelectorEntry_C_GetTiedObject) == 0x000008, "Wrong size on WBP_CharacterSelectorEntry_C_GetTiedObject");
static_assert(offsetof(WBP_CharacterSelectorEntry_C_GetTiedObject, Object) == 0x000000, "Member 'WBP_CharacterSelectorEntry_C_GetTiedObject::Object' has a wrong offset!");

// Function WBP_CharacterSelectorEntry.WBP_CharacterSelectorEntry_C.LoadCharacter
// 0x0048 (0x0048 - 0x0000)
struct WBP_CharacterSelectorEntry_C_LoadCharacter final
{
public:
	class UBP_CharacterData_C*                    CharacterData_0;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetCharacterPortrait_CharacterIcon;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_UINotifiedObject_C> CallFunc_LoadNotificationData_NotifiedObject_CastInput; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   K2Node_DynamicCast_AsBP_J_RPG_GI_Custom;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCharacterInParty_ReturnValue;           // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectorEntry_C_LoadCharacter) == 0x000008, "Wrong alignment on WBP_CharacterSelectorEntry_C_LoadCharacter");
static_assert(sizeof(WBP_CharacterSelectorEntry_C_LoadCharacter) == 0x000048, "Wrong size on WBP_CharacterSelectorEntry_C_LoadCharacter");
static_assert(offsetof(WBP_CharacterSelectorEntry_C_LoadCharacter, CharacterData_0) == 0x000000, "Member 'WBP_CharacterSelectorEntry_C_LoadCharacter::CharacterData_0' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorEntry_C_LoadCharacter, Temp_bool_Variable) == 0x000008, "Member 'WBP_CharacterSelectorEntry_C_LoadCharacter::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorEntry_C_LoadCharacter, CallFunc_GetCharacterPortrait_CharacterIcon) == 0x000010, "Member 'WBP_CharacterSelectorEntry_C_LoadCharacter::CallFunc_GetCharacterPortrait_CharacterIcon' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorEntry_C_LoadCharacter, Temp_byte_Variable) == 0x000018, "Member 'WBP_CharacterSelectorEntry_C_LoadCharacter::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorEntry_C_LoadCharacter, Temp_byte_Variable_1) == 0x000019, "Member 'WBP_CharacterSelectorEntry_C_LoadCharacter::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorEntry_C_LoadCharacter, CallFunc_LoadNotificationData_NotifiedObject_CastInput) == 0x000020, "Member 'WBP_CharacterSelectorEntry_C_LoadCharacter::CallFunc_LoadNotificationData_NotifiedObject_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorEntry_C_LoadCharacter, CallFunc_GetGameInstance_ReturnValue) == 0x000030, "Member 'WBP_CharacterSelectorEntry_C_LoadCharacter::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorEntry_C_LoadCharacter, K2Node_DynamicCast_AsBP_J_RPG_GI_Custom) == 0x000038, "Member 'WBP_CharacterSelectorEntry_C_LoadCharacter::K2Node_DynamicCast_AsBP_J_RPG_GI_Custom' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorEntry_C_LoadCharacter, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_CharacterSelectorEntry_C_LoadCharacter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorEntry_C_LoadCharacter, CallFunc_IsCharacterInParty_ReturnValue) == 0x000041, "Member 'WBP_CharacterSelectorEntry_C_LoadCharacter::CallFunc_IsCharacterInParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorEntry_C_LoadCharacter, K2Node_Select_Default) == 0x000042, "Member 'WBP_CharacterSelectorEntry_C_LoadCharacter::K2Node_Select_Default' has a wrong offset!");

// Function WBP_CharacterSelectorEntry.WBP_CharacterSelectorEntry_C.BPI_OnMarkNotificationAsRead
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterSelectorEntry_C_BPI_OnMarkNotificationAsRead final
{
public:
	class UUserWidget*                            MarkCaller;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectorEntry_C_BPI_OnMarkNotificationAsRead) == 0x000008, "Wrong alignment on WBP_CharacterSelectorEntry_C_BPI_OnMarkNotificationAsRead");
static_assert(sizeof(WBP_CharacterSelectorEntry_C_BPI_OnMarkNotificationAsRead) == 0x000008, "Wrong size on WBP_CharacterSelectorEntry_C_BPI_OnMarkNotificationAsRead");
static_assert(offsetof(WBP_CharacterSelectorEntry_C_BPI_OnMarkNotificationAsRead, MarkCaller) == 0x000000, "Member 'WBP_CharacterSelectorEntry_C_BPI_OnMarkNotificationAsRead::MarkCaller' has a wrong offset!");

// Function WBP_CharacterSelectorEntry.WBP_CharacterSelectorEntry_C.OnUINavigationFocus
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterSelectorEntry_C_OnUINavigationFocus final
{
public:
	const class UBP_UINavigationFocusEvent_C*     FocusEventBP;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectorEntry_C_OnUINavigationFocus) == 0x000008, "Wrong alignment on WBP_CharacterSelectorEntry_C_OnUINavigationFocus");
static_assert(sizeof(WBP_CharacterSelectorEntry_C_OnUINavigationFocus) == 0x000008, "Wrong size on WBP_CharacterSelectorEntry_C_OnUINavigationFocus");
static_assert(offsetof(WBP_CharacterSelectorEntry_C_OnUINavigationFocus, FocusEventBP) == 0x000000, "Member 'WBP_CharacterSelectorEntry_C_OnUINavigationFocus::FocusEventBP' has a wrong offset!");

// Function WBP_CharacterSelectorEntry.WBP_CharacterSelectorEntry_C.SetNotificationEnabled
// 0x0001 (0x0001 - 0x0000)
struct WBP_CharacterSelectorEntry_C_SetNotificationEnabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectorEntry_C_SetNotificationEnabled) == 0x000001, "Wrong alignment on WBP_CharacterSelectorEntry_C_SetNotificationEnabled");
static_assert(sizeof(WBP_CharacterSelectorEntry_C_SetNotificationEnabled) == 0x000001, "Wrong size on WBP_CharacterSelectorEntry_C_SetNotificationEnabled");
static_assert(offsetof(WBP_CharacterSelectorEntry_C_SetNotificationEnabled, Enabled) == 0x000000, "Member 'WBP_CharacterSelectorEntry_C_SetNotificationEnabled::Enabled' has a wrong offset!");

// Function WBP_CharacterSelectorEntry.WBP_CharacterSelectorEntry_C.BndEvt__WBP_CharacterSelectorEntry_WBP_CharacterSelectorButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterSelectorEntry_C_BndEvt__WBP_CharacterSelectorEntry_WBP_CharacterSelectorButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectorEntry_C_BndEvt__WBP_CharacterSelectorEntry_WBP_CharacterSelectorButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterSelectorEntry_C_BndEvt__WBP_CharacterSelectorEntry_WBP_CharacterSelectorButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_CharacterSelectorEntry_C_BndEvt__WBP_CharacterSelectorEntry_WBP_CharacterSelectorButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_CharacterSelectorEntry_C_BndEvt__WBP_CharacterSelectorEntry_WBP_CharacterSelectorButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_CharacterSelectorEntry_C_BndEvt__WBP_CharacterSelectorEntry_WBP_CharacterSelectorButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_CharacterSelectorEntry_C_BndEvt__WBP_CharacterSelectorEntry_WBP_CharacterSelectorButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_CharacterSelectorEntry.WBP_CharacterSelectorEntry_C.ExecuteUbergraph_WBP_CharacterSelectorEntry
// 0x0028 (0x0028 - 0x0000)
struct WBP_CharacterSelectorEntry_C_ExecuteUbergraph_WBP_CharacterSelectorEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_Event_MarkCaller;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UBP_UINavigationFocusEvent_C*     K2Node_Event_FocusEventBP;                         // 0x0010(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enabled;                        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectorEntry_C_ExecuteUbergraph_WBP_CharacterSelectorEntry) == 0x000008, "Wrong alignment on WBP_CharacterSelectorEntry_C_ExecuteUbergraph_WBP_CharacterSelectorEntry");
static_assert(sizeof(WBP_CharacterSelectorEntry_C_ExecuteUbergraph_WBP_CharacterSelectorEntry) == 0x000028, "Wrong size on WBP_CharacterSelectorEntry_C_ExecuteUbergraph_WBP_CharacterSelectorEntry");
static_assert(offsetof(WBP_CharacterSelectorEntry_C_ExecuteUbergraph_WBP_CharacterSelectorEntry, EntryPoint) == 0x000000, "Member 'WBP_CharacterSelectorEntry_C_ExecuteUbergraph_WBP_CharacterSelectorEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorEntry_C_ExecuteUbergraph_WBP_CharacterSelectorEntry, K2Node_Event_MarkCaller) == 0x000008, "Member 'WBP_CharacterSelectorEntry_C_ExecuteUbergraph_WBP_CharacterSelectorEntry::K2Node_Event_MarkCaller' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorEntry_C_ExecuteUbergraph_WBP_CharacterSelectorEntry, K2Node_Event_FocusEventBP) == 0x000010, "Member 'WBP_CharacterSelectorEntry_C_ExecuteUbergraph_WBP_CharacterSelectorEntry::K2Node_Event_FocusEventBP' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorEntry_C_ExecuteUbergraph_WBP_CharacterSelectorEntry, K2Node_CustomEvent_Enabled) == 0x000018, "Member 'WBP_CharacterSelectorEntry_C_ExecuteUbergraph_WBP_CharacterSelectorEntry::K2Node_CustomEvent_Enabled' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectorEntry_C_ExecuteUbergraph_WBP_CharacterSelectorEntry, K2Node_ComponentBoundEvent_Button) == 0x000020, "Member 'WBP_CharacterSelectorEntry_C_ExecuteUbergraph_WBP_CharacterSelectorEntry::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

}

