#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BreakBar

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function WBP_BreakBar.WBP_BreakBar_C.AnimateFillProgress
// 0x0008 (0x0008 - 0x0000)
struct WBP_BreakBar_C_AnimateFillProgress final
{
public:
	double                                        TargetProgress;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BreakBar_C_AnimateFillProgress) == 0x000008, "Wrong alignment on WBP_BreakBar_C_AnimateFillProgress");
static_assert(sizeof(WBP_BreakBar_C_AnimateFillProgress) == 0x000008, "Wrong size on WBP_BreakBar_C_AnimateFillProgress");
static_assert(offsetof(WBP_BreakBar_C_AnimateFillProgress, TargetProgress) == 0x000000, "Member 'WBP_BreakBar_C_AnimateFillProgress::TargetProgress' has a wrong offset!");

// Function WBP_BreakBar.WBP_BreakBar_C.ExecuteUbergraph_WBP_BreakBar
// 0x0078 (0x0078 - 0x0000)
struct WBP_BreakBar_C_ExecuteUbergraph_WBP_BreakBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_FillProgress;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x0030(0x0020)(NoDestructor)
	double                                        K2Node_CustomEvent_TargetProgress;                 // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       K2Node_DynamicCast_AsCanvas_Panel_Slot;            // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BreakBar_C_ExecuteUbergraph_WBP_BreakBar) == 0x000008, "Wrong alignment on WBP_BreakBar_C_ExecuteUbergraph_WBP_BreakBar");
static_assert(sizeof(WBP_BreakBar_C_ExecuteUbergraph_WBP_BreakBar) == 0x000078, "Wrong size on WBP_BreakBar_C_ExecuteUbergraph_WBP_BreakBar");
static_assert(offsetof(WBP_BreakBar_C_ExecuteUbergraph_WBP_BreakBar, EntryPoint) == 0x000000, "Member 'WBP_BreakBar_C_ExecuteUbergraph_WBP_BreakBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_BreakBar_C_ExecuteUbergraph_WBP_BreakBar, K2Node_MakeStruct_Margin) == 0x000004, "Member 'WBP_BreakBar_C_ExecuteUbergraph_WBP_BreakBar::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_BreakBar_C_ExecuteUbergraph_WBP_BreakBar, K2Node_CustomEvent_FillProgress) == 0x000018, "Member 'WBP_BreakBar_C_ExecuteUbergraph_WBP_BreakBar::K2Node_CustomEvent_FillProgress' has a wrong offset!");
static_assert(offsetof(WBP_BreakBar_C_ExecuteUbergraph_WBP_BreakBar, CallFunc_MakeVector2D_ReturnValue) == 0x000020, "Member 'WBP_BreakBar_C_ExecuteUbergraph_WBP_BreakBar::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BreakBar_C_ExecuteUbergraph_WBP_BreakBar, K2Node_MakeStruct_Anchors) == 0x000030, "Member 'WBP_BreakBar_C_ExecuteUbergraph_WBP_BreakBar::K2Node_MakeStruct_Anchors' has a wrong offset!");
static_assert(offsetof(WBP_BreakBar_C_ExecuteUbergraph_WBP_BreakBar, K2Node_CustomEvent_TargetProgress) == 0x000050, "Member 'WBP_BreakBar_C_ExecuteUbergraph_WBP_BreakBar::K2Node_CustomEvent_TargetProgress' has a wrong offset!");
static_assert(offsetof(WBP_BreakBar_C_ExecuteUbergraph_WBP_BreakBar, K2Node_Event_IsDesignTime) == 0x000058, "Member 'WBP_BreakBar_C_ExecuteUbergraph_WBP_BreakBar::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_BreakBar_C_ExecuteUbergraph_WBP_BreakBar, CallFunc_PlayAnimation_ReturnValue) == 0x000060, "Member 'WBP_BreakBar_C_ExecuteUbergraph_WBP_BreakBar::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BreakBar_C_ExecuteUbergraph_WBP_BreakBar, K2Node_DynamicCast_AsCanvas_Panel_Slot) == 0x000068, "Member 'WBP_BreakBar_C_ExecuteUbergraph_WBP_BreakBar::K2Node_DynamicCast_AsCanvas_Panel_Slot' has a wrong offset!");
static_assert(offsetof(WBP_BreakBar_C_ExecuteUbergraph_WBP_BreakBar, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'WBP_BreakBar_C_ExecuteUbergraph_WBP_BreakBar::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_BreakBar_C_ExecuteUbergraph_WBP_BreakBar, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000074, "Member 'WBP_BreakBar_C_ExecuteUbergraph_WBP_BreakBar::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

// Function WBP_BreakBar.WBP_BreakBar_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_BreakBar_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BreakBar_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_BreakBar_C_PreConstruct");
static_assert(sizeof(WBP_BreakBar_C_PreConstruct) == 0x000001, "Wrong size on WBP_BreakBar_C_PreConstruct");
static_assert(offsetof(WBP_BreakBar_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_BreakBar_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_BreakBar.WBP_BreakBar_C.SetAnimationProgress
// 0x0030 (0x0030 - 0x0000)
struct WBP_BreakBar_C_SetAnimationProgress final
{
public:
	double                                        TargetFillProgress_0;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BreakBar_C_SetAnimationProgress) == 0x000008, "Wrong alignment on WBP_BreakBar_C_SetAnimationProgress");
static_assert(sizeof(WBP_BreakBar_C_SetAnimationProgress) == 0x000030, "Wrong size on WBP_BreakBar_C_SetAnimationProgress");
static_assert(offsetof(WBP_BreakBar_C_SetAnimationProgress, TargetFillProgress_0) == 0x000000, "Member 'WBP_BreakBar_C_SetAnimationProgress::TargetFillProgress_0' has a wrong offset!");
static_assert(offsetof(WBP_BreakBar_C_SetAnimationProgress, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'WBP_BreakBar_C_SetAnimationProgress::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BreakBar_C_SetAnimationProgress, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000010, "Member 'WBP_BreakBar_C_SetAnimationProgress::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BreakBar_C_SetAnimationProgress, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'WBP_BreakBar_C_SetAnimationProgress::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function WBP_BreakBar.WBP_BreakBar_C.SetFillProgress
// 0x0008 (0x0008 - 0x0000)
struct WBP_BreakBar_C_SetFillProgress final
{
public:
	double                                        FillProgress_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BreakBar_C_SetFillProgress) == 0x000008, "Wrong alignment on WBP_BreakBar_C_SetFillProgress");
static_assert(sizeof(WBP_BreakBar_C_SetFillProgress) == 0x000008, "Wrong size on WBP_BreakBar_C_SetFillProgress");
static_assert(offsetof(WBP_BreakBar_C_SetFillProgress, FillProgress_0) == 0x000000, "Member 'WBP_BreakBar_C_SetFillProgress::FillProgress_0' has a wrong offset!");

}

