#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BattleInput_PlayerTurn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BattleInput_PlayerTurn.WBP_BattleInput_PlayerTurn_C
// 0x0038 (0x0468 - 0x0430)
class UWBP_BattleInput_PlayerTurn_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Appear;                                       // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_BattleInputContainer_C*            WBP_BattleInputContainer;                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GM_PromptGeneric_C*                WBP_GM_PromptGeneric_Back;                         // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GM_PromptGeneric_C*                WBP_GM_PromptGeneric_Flee;                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GM_PromptGeneric_C*                WBP_GM_PromptGeneric_SkipTurn;                     // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsBackBound;                                       // 0x0460(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BindBackButton(const TDelegate<void(class UCommonButtonBase* Button)>& ClickedEvent);
	void BndEvt__WBP_BattleInput_PlayerTurn_WBP_GM_PromptGeneric_Flee_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_BattleInput_PlayerTurn_WBP_GM_PromptGeneric_SkipTurn_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void Construct();
	void ExecuteUbergraph_WBP_BattleInput_PlayerTurn(int32 EntryPoint);
	void OnSkipImpossibleChanged(bool IsSkipImpossible);
	void UnbindBackButton(const TDelegate<void(class UCommonButtonBase* Button)>& ClickedEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BattleInput_PlayerTurn_C">();
	}
	static class UWBP_BattleInput_PlayerTurn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BattleInput_PlayerTurn_C>();
	}
};
static_assert(alignof(UWBP_BattleInput_PlayerTurn_C) == 0x000008, "Wrong alignment on UWBP_BattleInput_PlayerTurn_C");
static_assert(sizeof(UWBP_BattleInput_PlayerTurn_C) == 0x000468, "Wrong size on UWBP_BattleInput_PlayerTurn_C");
static_assert(offsetof(UWBP_BattleInput_PlayerTurn_C, UberGraphFrame) == 0x000430, "Member 'UWBP_BattleInput_PlayerTurn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_BattleInput_PlayerTurn_C, Anim_Appear) == 0x000438, "Member 'UWBP_BattleInput_PlayerTurn_C::Anim_Appear' has a wrong offset!");
static_assert(offsetof(UWBP_BattleInput_PlayerTurn_C, WBP_BattleInputContainer) == 0x000440, "Member 'UWBP_BattleInput_PlayerTurn_C::WBP_BattleInputContainer' has a wrong offset!");
static_assert(offsetof(UWBP_BattleInput_PlayerTurn_C, WBP_GM_PromptGeneric_Back) == 0x000448, "Member 'UWBP_BattleInput_PlayerTurn_C::WBP_GM_PromptGeneric_Back' has a wrong offset!");
static_assert(offsetof(UWBP_BattleInput_PlayerTurn_C, WBP_GM_PromptGeneric_Flee) == 0x000450, "Member 'UWBP_BattleInput_PlayerTurn_C::WBP_GM_PromptGeneric_Flee' has a wrong offset!");
static_assert(offsetof(UWBP_BattleInput_PlayerTurn_C, WBP_GM_PromptGeneric_SkipTurn) == 0x000458, "Member 'UWBP_BattleInput_PlayerTurn_C::WBP_GM_PromptGeneric_SkipTurn' has a wrong offset!");
static_assert(offsetof(UWBP_BattleInput_PlayerTurn_C, IsBackBound) == 0x000460, "Member 'UWBP_BattleInput_PlayerTurn_C::IsBackBound' has a wrong offset!");

}

