#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ItemDetailsCard

#include "Basic.hpp"

#include "S_jRPG_Item_StaticData_structs.hpp"


namespace SDK::Params
{

// Function WBP_ItemDetailsCard.WBP_ItemDetailsCard_C.LoadItem
// 0x0140 (0x0140 - 0x0000)
struct WBP_ItemDetailsCard_C_LoadItem final
{
public:
	struct FS_jRPG_Item_StaticData                ItemData;                                          // 0x0000(0x0130)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	class UBP_DataAsset_Item_Journal_C*           K2Node_DynamicCast_AsBP_Data_Asset_Item_Journal;   // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemDetailsCard_C_LoadItem) == 0x000008, "Wrong alignment on WBP_ItemDetailsCard_C_LoadItem");
static_assert(sizeof(WBP_ItemDetailsCard_C_LoadItem) == 0x000140, "Wrong size on WBP_ItemDetailsCard_C_LoadItem");
static_assert(offsetof(WBP_ItemDetailsCard_C_LoadItem, ItemData) == 0x000000, "Member 'WBP_ItemDetailsCard_C_LoadItem::ItemData' has a wrong offset!");
static_assert(offsetof(WBP_ItemDetailsCard_C_LoadItem, K2Node_DynamicCast_AsBP_Data_Asset_Item_Journal) == 0x000130, "Member 'WBP_ItemDetailsCard_C_LoadItem::K2Node_DynamicCast_AsBP_Data_Asset_Item_Journal' has a wrong offset!");
static_assert(offsetof(WBP_ItemDetailsCard_C_LoadItem, K2Node_DynamicCast_bSuccess) == 0x000138, "Member 'WBP_ItemDetailsCard_C_LoadItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_ItemDetailsCard.WBP_ItemDetailsCard_C.LoadItemInstance
// 0x0138 (0x0138 - 0x0000)
struct WBP_ItemDetailsCard_C_LoadItemInstance final
{
public:
	class UBP_ItemInstance_Base_C*                ItemInstance;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_jRPG_Item_StaticData                CallFunc_GetItemStaticData_ItemStaticData;         // 0x0008(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemDetailsCard_C_LoadItemInstance) == 0x000008, "Wrong alignment on WBP_ItemDetailsCard_C_LoadItemInstance");
static_assert(sizeof(WBP_ItemDetailsCard_C_LoadItemInstance) == 0x000138, "Wrong size on WBP_ItemDetailsCard_C_LoadItemInstance");
static_assert(offsetof(WBP_ItemDetailsCard_C_LoadItemInstance, ItemInstance) == 0x000000, "Member 'WBP_ItemDetailsCard_C_LoadItemInstance::ItemInstance' has a wrong offset!");
static_assert(offsetof(WBP_ItemDetailsCard_C_LoadItemInstance, CallFunc_GetItemStaticData_ItemStaticData) == 0x000008, "Member 'WBP_ItemDetailsCard_C_LoadItemInstance::CallFunc_GetItemStaticData_ItemStaticData' has a wrong offset!");

}

