#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DialogNotifBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "E_DialoguesPortraitsType_structs.hpp"
#include "E_DialoguesPortraitsCharacters_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DialogNotifBox.WBP_DialogNotifBox_C
// 0x00C0 (0x03A0 - 0x02E0)
class UWBP_DialogNotifBox_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Appear;                                       // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Arrow_1;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ArtDeco;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ArtDeco_1;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_1;                                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LineTop_1;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_LinesContainer;                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DialogNotifLine_C*                 WBP_DialogNotifLine;                               // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GM_Secondary_BottomTop_C*          WBP_GM_Secondary_BottomTop;                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DialogNotifLine_C*                 CurrentDialogLine;                                 // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             DialogueDataBase;                                  // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   DialogToPlay;                                      // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_DA_IWD_data_C*                      InWorldDialogue;                                   // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         DialogLineIndex;                                   // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_DialoguesPortraitsCharacters                CharacterWhoTalk;                                  // 0x0354(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_DialoguesPortraitsType                      CharacterEmotion;                                  // 0x0355(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_356[0x2];                                      // 0x0356(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             CurrentDialogueSoundBase;                          // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CurrentAudioComponent;                             // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldInterrupt;                                   // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPaused;                                          // 0x0369(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36A[0x6];                                      // 0x036A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CurrentLineTimer;                                  // 0x0370(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           DialogueLineFinishedTimer;                         // 0x0378(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnDialogFinished;                                  // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnDialogueInterrupted;                             // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Construct();
	void DEBUG_SanitizeForTextToSpeech(const class FString& SourceString, class FString* SanitizedSpokenText, class FString* SanitizedForWordCount);
	void ExecuteUbergraph_WBP_DialogNotifBox(int32 EntryPoint);
	void GetCurrentLine(struct FS_DialogueLine* Output);
	class UBP_DA_IWD_data_C* GetInWorldDialogueInPlay();
	void InterruptDialog();
	void OnAllDialogueLinesFinished(bool PlayDisappearAnimation);
	void OnCurrentLineTimerCompleted();
	void OnDialogLineFinished();
	void OnDialogueLineFinishedTimerEnd();
	void OnDisappearAnimationFinished();
	void PlayDialogueLineAudio(class USoundBase* Sound);
	void PlayNextLine();
	void SetDialogPaused(bool Paused);
	void SetGameplayPaused(bool Paused);
	void UpdatePortrait(class UTexture** Portrait);
	void UpdateWidgets();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DialogNotifBox_C">();
	}
	static class UWBP_DialogNotifBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DialogNotifBox_C>();
	}
};
static_assert(alignof(UWBP_DialogNotifBox_C) == 0x000008, "Wrong alignment on UWBP_DialogNotifBox_C");
static_assert(sizeof(UWBP_DialogNotifBox_C) == 0x0003A0, "Wrong size on UWBP_DialogNotifBox_C");
static_assert(offsetof(UWBP_DialogNotifBox_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_DialogNotifBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DialogNotifBox_C, Anim_Appear) == 0x0002E8, "Member 'UWBP_DialogNotifBox_C::Anim_Appear' has a wrong offset!");
static_assert(offsetof(UWBP_DialogNotifBox_C, Arrow_1) == 0x0002F0, "Member 'UWBP_DialogNotifBox_C::Arrow_1' has a wrong offset!");
static_assert(offsetof(UWBP_DialogNotifBox_C, ArtDeco) == 0x0002F8, "Member 'UWBP_DialogNotifBox_C::ArtDeco' has a wrong offset!");
static_assert(offsetof(UWBP_DialogNotifBox_C, ArtDeco_1) == 0x000300, "Member 'UWBP_DialogNotifBox_C::ArtDeco_1' has a wrong offset!");
static_assert(offsetof(UWBP_DialogNotifBox_C, BG_1) == 0x000308, "Member 'UWBP_DialogNotifBox_C::BG_1' has a wrong offset!");
static_assert(offsetof(UWBP_DialogNotifBox_C, LineTop_1) == 0x000310, "Member 'UWBP_DialogNotifBox_C::LineTop_1' has a wrong offset!");
static_assert(offsetof(UWBP_DialogNotifBox_C, VerticalBox_LinesContainer) == 0x000318, "Member 'UWBP_DialogNotifBox_C::VerticalBox_LinesContainer' has a wrong offset!");
static_assert(offsetof(UWBP_DialogNotifBox_C, WBP_DialogNotifLine) == 0x000320, "Member 'UWBP_DialogNotifBox_C::WBP_DialogNotifLine' has a wrong offset!");
static_assert(offsetof(UWBP_DialogNotifBox_C, WBP_GM_Secondary_BottomTop) == 0x000328, "Member 'UWBP_DialogNotifBox_C::WBP_GM_Secondary_BottomTop' has a wrong offset!");
static_assert(offsetof(UWBP_DialogNotifBox_C, CurrentDialogLine) == 0x000330, "Member 'UWBP_DialogNotifBox_C::CurrentDialogLine' has a wrong offset!");
static_assert(offsetof(UWBP_DialogNotifBox_C, DialogueDataBase) == 0x000338, "Member 'UWBP_DialogNotifBox_C::DialogueDataBase' has a wrong offset!");
static_assert(offsetof(UWBP_DialogNotifBox_C, DialogToPlay) == 0x000340, "Member 'UWBP_DialogNotifBox_C::DialogToPlay' has a wrong offset!");
static_assert(offsetof(UWBP_DialogNotifBox_C, InWorldDialogue) == 0x000348, "Member 'UWBP_DialogNotifBox_C::InWorldDialogue' has a wrong offset!");
static_assert(offsetof(UWBP_DialogNotifBox_C, DialogLineIndex) == 0x000350, "Member 'UWBP_DialogNotifBox_C::DialogLineIndex' has a wrong offset!");
static_assert(offsetof(UWBP_DialogNotifBox_C, CharacterWhoTalk) == 0x000354, "Member 'UWBP_DialogNotifBox_C::CharacterWhoTalk' has a wrong offset!");
static_assert(offsetof(UWBP_DialogNotifBox_C, CharacterEmotion) == 0x000355, "Member 'UWBP_DialogNotifBox_C::CharacterEmotion' has a wrong offset!");
static_assert(offsetof(UWBP_DialogNotifBox_C, CurrentDialogueSoundBase) == 0x000358, "Member 'UWBP_DialogNotifBox_C::CurrentDialogueSoundBase' has a wrong offset!");
static_assert(offsetof(UWBP_DialogNotifBox_C, CurrentAudioComponent) == 0x000360, "Member 'UWBP_DialogNotifBox_C::CurrentAudioComponent' has a wrong offset!");
static_assert(offsetof(UWBP_DialogNotifBox_C, ShouldInterrupt) == 0x000368, "Member 'UWBP_DialogNotifBox_C::ShouldInterrupt' has a wrong offset!");
static_assert(offsetof(UWBP_DialogNotifBox_C, IsPaused) == 0x000369, "Member 'UWBP_DialogNotifBox_C::IsPaused' has a wrong offset!");
static_assert(offsetof(UWBP_DialogNotifBox_C, CurrentLineTimer) == 0x000370, "Member 'UWBP_DialogNotifBox_C::CurrentLineTimer' has a wrong offset!");
static_assert(offsetof(UWBP_DialogNotifBox_C, DialogueLineFinishedTimer) == 0x000378, "Member 'UWBP_DialogNotifBox_C::DialogueLineFinishedTimer' has a wrong offset!");
static_assert(offsetof(UWBP_DialogNotifBox_C, OnDialogFinished) == 0x000380, "Member 'UWBP_DialogNotifBox_C::OnDialogFinished' has a wrong offset!");
static_assert(offsetof(UWBP_DialogNotifBox_C, OnDialogueInterrupted) == 0x000390, "Member 'UWBP_DialogNotifBox_C::OnDialogueInterrupted' has a wrong offset!");

}

