#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PromptContainer

#include "Basic.hpp"

#include "FPromptParams_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FPromptActorAttachmentInfo_structs.hpp"
#include "FPromptID_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_PromptContainer.WBP_PromptContainer_C.AddDistantPromptToWorldPosition
// 0x0060 (0x0060 - 0x0000)
struct WBP_PromptContainer_C_AddDistantPromptToWorldPosition final
{
public:
	struct FVector                                WorldPosition;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_ExplorationPromptHint_C*           ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FFPromptID                             PromptID;                                          // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_ExplorationPromptHint_C*           CallFunc_CreateExplorationPromptHint_Widget;       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFPromptID                             K2Node_MakeStruct_FPromptID;                       // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_NewGuid_ReturnValue;                      // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PromptContainer_C_AddDistantPromptToWorldPosition) == 0x000008, "Wrong alignment on WBP_PromptContainer_C_AddDistantPromptToWorldPosition");
static_assert(sizeof(WBP_PromptContainer_C_AddDistantPromptToWorldPosition) == 0x000060, "Wrong size on WBP_PromptContainer_C_AddDistantPromptToWorldPosition");
static_assert(offsetof(WBP_PromptContainer_C_AddDistantPromptToWorldPosition, WorldPosition) == 0x000000, "Member 'WBP_PromptContainer_C_AddDistantPromptToWorldPosition::WorldPosition' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_AddDistantPromptToWorldPosition, ReturnValue) == 0x000018, "Member 'WBP_PromptContainer_C_AddDistantPromptToWorldPosition::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_AddDistantPromptToWorldPosition, PromptID) == 0x000020, "Member 'WBP_PromptContainer_C_AddDistantPromptToWorldPosition::PromptID' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_AddDistantPromptToWorldPosition, CallFunc_CreateExplorationPromptHint_Widget) == 0x000030, "Member 'WBP_PromptContainer_C_AddDistantPromptToWorldPosition::CallFunc_CreateExplorationPromptHint_Widget' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_AddDistantPromptToWorldPosition, K2Node_MakeStruct_FPromptID) == 0x000038, "Member 'WBP_PromptContainer_C_AddDistantPromptToWorldPosition::K2Node_MakeStruct_FPromptID' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_AddDistantPromptToWorldPosition, CallFunc_NewGuid_ReturnValue) == 0x000048, "Member 'WBP_PromptContainer_C_AddDistantPromptToWorldPosition::CallFunc_NewGuid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_AddDistantPromptToWorldPosition, CallFunc_AddChildToCanvas_ReturnValue) == 0x000058, "Member 'WBP_PromptContainer_C_AddDistantPromptToWorldPosition::CallFunc_AddChildToCanvas_ReturnValue' has a wrong offset!");

// Function WBP_PromptContainer.WBP_PromptContainer_C.AddPromptToActor
// 0x0080 (0x0080 - 0x0000)
struct WBP_PromptContainer_C_AddPromptToActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Offset;                                            // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFPromptParams                         PromptParams;                                      // 0x0020(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	struct FFPromptID                             PromptID;                                          // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_ExplorationPrompt_C*               CallFunc_CreatePromptWidget_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FFPromptID                             CallFunc_CreatePromptWidget_PromptID;              // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFPromptActorAttachmentInfo            K2Node_MakeStruct_FPromptActorAttachmentInfo;      // 0x0060(0x0020)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PromptContainer_C_AddPromptToActor) == 0x000008, "Wrong alignment on WBP_PromptContainer_C_AddPromptToActor");
static_assert(sizeof(WBP_PromptContainer_C_AddPromptToActor) == 0x000080, "Wrong size on WBP_PromptContainer_C_AddPromptToActor");
static_assert(offsetof(WBP_PromptContainer_C_AddPromptToActor, Actor) == 0x000000, "Member 'WBP_PromptContainer_C_AddPromptToActor::Actor' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_AddPromptToActor, Offset) == 0x000008, "Member 'WBP_PromptContainer_C_AddPromptToActor::Offset' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_AddPromptToActor, PromptParams) == 0x000020, "Member 'WBP_PromptContainer_C_AddPromptToActor::PromptParams' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_AddPromptToActor, PromptID) == 0x000038, "Member 'WBP_PromptContainer_C_AddPromptToActor::PromptID' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_AddPromptToActor, CallFunc_CreatePromptWidget_ReturnValue) == 0x000048, "Member 'WBP_PromptContainer_C_AddPromptToActor::CallFunc_CreatePromptWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_AddPromptToActor, CallFunc_CreatePromptWidget_PromptID) == 0x000050, "Member 'WBP_PromptContainer_C_AddPromptToActor::CallFunc_CreatePromptWidget_PromptID' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_AddPromptToActor, K2Node_MakeStruct_FPromptActorAttachmentInfo) == 0x000060, "Member 'WBP_PromptContainer_C_AddPromptToActor::K2Node_MakeStruct_FPromptActorAttachmentInfo' has a wrong offset!");

// Function WBP_PromptContainer.WBP_PromptContainer_C.AddPromptToWorldPosition
// 0x0070 (0x0070 - 0x0000)
struct WBP_PromptContainer_C_AddPromptToWorldPosition final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFPromptParams                         PromptParams;                                      // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FFPromptID                             PromptID;                                          // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_InteractionSystem_C*                CallFunc_GetInteractionSystem_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_ExplorationPrompt_C*               CallFunc_CreatePromptWidget_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FFPromptID                             CallFunc_CreatePromptWidget_PromptID;              // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PromptContainer_C_AddPromptToWorldPosition) == 0x000008, "Wrong alignment on WBP_PromptContainer_C_AddPromptToWorldPosition");
static_assert(sizeof(WBP_PromptContainer_C_AddPromptToWorldPosition) == 0x000070, "Wrong size on WBP_PromptContainer_C_AddPromptToWorldPosition");
static_assert(offsetof(WBP_PromptContainer_C_AddPromptToWorldPosition, Location) == 0x000000, "Member 'WBP_PromptContainer_C_AddPromptToWorldPosition::Location' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_AddPromptToWorldPosition, PromptParams) == 0x000018, "Member 'WBP_PromptContainer_C_AddPromptToWorldPosition::PromptParams' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_AddPromptToWorldPosition, PromptID) == 0x000030, "Member 'WBP_PromptContainer_C_AddPromptToWorldPosition::PromptID' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_AddPromptToWorldPosition, CallFunc_GetInteractionSystem_ReturnValue) == 0x000040, "Member 'WBP_PromptContainer_C_AddPromptToWorldPosition::CallFunc_GetInteractionSystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_AddPromptToWorldPosition, CallFunc_CreatePromptWidget_ReturnValue) == 0x000048, "Member 'WBP_PromptContainer_C_AddPromptToWorldPosition::CallFunc_CreatePromptWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_AddPromptToWorldPosition, CallFunc_CreatePromptWidget_PromptID) == 0x000050, "Member 'WBP_PromptContainer_C_AddPromptToWorldPosition::CallFunc_CreatePromptWidget_PromptID' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_AddPromptToWorldPosition, K2Node_CreateDelegate_OutputDelegate) == 0x000060, "Member 'WBP_PromptContainer_C_AddPromptToWorldPosition::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_PromptContainer.WBP_PromptContainer_C.ClampToParentWidget
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_PromptContainer_C_ClampToParentWidget final
{
public:
	struct FVector2D                              ScreenPosition;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                ParentWidget;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	double                                        Margin;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelWidget*                           CallFunc_GetParent_ReturnValue;                    // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetPaintSpaceGeometry_ReturnValue;        // 0x0048(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue;                 // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DFloat_ReturnValue;       // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PromptContainer_C_ClampToParentWidget) == 0x000008, "Wrong alignment on WBP_PromptContainer_C_ClampToParentWidget");
static_assert(sizeof(WBP_PromptContainer_C_ClampToParentWidget) == 0x0000D0, "Wrong size on WBP_PromptContainer_C_ClampToParentWidget");
static_assert(offsetof(WBP_PromptContainer_C_ClampToParentWidget, ScreenPosition) == 0x000000, "Member 'WBP_PromptContainer_C_ClampToParentWidget::ScreenPosition' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_ClampToParentWidget, ParentWidget) == 0x000010, "Member 'WBP_PromptContainer_C_ClampToParentWidget::ParentWidget' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_ClampToParentWidget, Margin) == 0x000018, "Member 'WBP_PromptContainer_C_ClampToParentWidget::Margin' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_ClampToParentWidget, ReturnValue) == 0x000020, "Member 'WBP_PromptContainer_C_ClampToParentWidget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_ClampToParentWidget, CallFunc_BreakVector2D_X) == 0x000030, "Member 'WBP_PromptContainer_C_ClampToParentWidget::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_ClampToParentWidget, CallFunc_BreakVector2D_Y) == 0x000038, "Member 'WBP_PromptContainer_C_ClampToParentWidget::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_ClampToParentWidget, CallFunc_GetParent_ReturnValue) == 0x000040, "Member 'WBP_PromptContainer_C_ClampToParentWidget::CallFunc_GetParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_ClampToParentWidget, CallFunc_GetPaintSpaceGeometry_ReturnValue) == 0x000048, "Member 'WBP_PromptContainer_C_ClampToParentWidget::CallFunc_GetPaintSpaceGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_ClampToParentWidget, CallFunc_GetLocalSize_ReturnValue) == 0x000080, "Member 'WBP_PromptContainer_C_ClampToParentWidget::CallFunc_GetLocalSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_ClampToParentWidget, CallFunc_Subtract_Vector2DFloat_ReturnValue) == 0x000090, "Member 'WBP_PromptContainer_C_ClampToParentWidget::CallFunc_Subtract_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_ClampToParentWidget, CallFunc_BreakVector2D_X_1) == 0x0000A0, "Member 'WBP_PromptContainer_C_ClampToParentWidget::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_ClampToParentWidget, CallFunc_BreakVector2D_Y_1) == 0x0000A8, "Member 'WBP_PromptContainer_C_ClampToParentWidget::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_ClampToParentWidget, CallFunc_FClamp_ReturnValue) == 0x0000B0, "Member 'WBP_PromptContainer_C_ClampToParentWidget::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_ClampToParentWidget, CallFunc_FClamp_ReturnValue_1) == 0x0000B8, "Member 'WBP_PromptContainer_C_ClampToParentWidget::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_ClampToParentWidget, CallFunc_MakeVector2D_ReturnValue) == 0x0000C0, "Member 'WBP_PromptContainer_C_ClampToParentWidget::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function WBP_PromptContainer.WBP_PromptContainer_C.CreatePromptWidget
// 0x0070 (0x0070 - 0x0000)
struct WBP_PromptContainer_C_CreatePromptWidget final
{
public:
	struct FFPromptParams                         PromptParams;                                      // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	class UWBP_ExplorationPrompt_C*               ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FFPromptID                             PromptID;                                          // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  local_GUID_0;                                      // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFPromptID                             K2Node_MakeStruct_FPromptID;                       // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_NewGuid_ReturnValue;                      // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_ExplorationPrompt_C*               CallFunc_SpawnObject_ReturnValue;                  // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PromptContainer_C_CreatePromptWidget) == 0x000008, "Wrong alignment on WBP_PromptContainer_C_CreatePromptWidget");
static_assert(sizeof(WBP_PromptContainer_C_CreatePromptWidget) == 0x000070, "Wrong size on WBP_PromptContainer_C_CreatePromptWidget");
static_assert(offsetof(WBP_PromptContainer_C_CreatePromptWidget, PromptParams) == 0x000000, "Member 'WBP_PromptContainer_C_CreatePromptWidget::PromptParams' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_CreatePromptWidget, ReturnValue) == 0x000018, "Member 'WBP_PromptContainer_C_CreatePromptWidget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_CreatePromptWidget, PromptID) == 0x000020, "Member 'WBP_PromptContainer_C_CreatePromptWidget::PromptID' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_CreatePromptWidget, local_GUID_0) == 0x000030, "Member 'WBP_PromptContainer_C_CreatePromptWidget::local_GUID_0' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_CreatePromptWidget, K2Node_MakeStruct_FPromptID) == 0x000040, "Member 'WBP_PromptContainer_C_CreatePromptWidget::K2Node_MakeStruct_FPromptID' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_CreatePromptWidget, CallFunc_NewGuid_ReturnValue) == 0x000050, "Member 'WBP_PromptContainer_C_CreatePromptWidget::CallFunc_NewGuid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_CreatePromptWidget, CallFunc_SpawnObject_ReturnValue) == 0x000060, "Member 'WBP_PromptContainer_C_CreatePromptWidget::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_CreatePromptWidget, CallFunc_AddChildToCanvas_ReturnValue) == 0x000068, "Member 'WBP_PromptContainer_C_CreatePromptWidget::CallFunc_AddChildToCanvas_ReturnValue' has a wrong offset!");

// Function WBP_PromptContainer.WBP_PromptContainer_C.ExecuteUbergraph_WBP_PromptContainer
// 0x0048 (0x0048 - 0x0000)
struct WBP_PromptContainer_C_ExecuteUbergraph_WBP_PromptContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_ExplorationPromptHintPool_C*        CallFunc_SpawnObject_ReturnValue;                  // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PromptContainer_C_ExecuteUbergraph_WBP_PromptContainer) == 0x000008, "Wrong alignment on WBP_PromptContainer_C_ExecuteUbergraph_WBP_PromptContainer");
static_assert(sizeof(WBP_PromptContainer_C_ExecuteUbergraph_WBP_PromptContainer) == 0x000048, "Wrong size on WBP_PromptContainer_C_ExecuteUbergraph_WBP_PromptContainer");
static_assert(offsetof(WBP_PromptContainer_C_ExecuteUbergraph_WBP_PromptContainer, EntryPoint) == 0x000000, "Member 'WBP_PromptContainer_C_ExecuteUbergraph_WBP_PromptContainer::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_ExecuteUbergraph_WBP_PromptContainer, K2Node_Event_MyGeometry) == 0x000004, "Member 'WBP_PromptContainer_C_ExecuteUbergraph_WBP_PromptContainer::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_ExecuteUbergraph_WBP_PromptContainer, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'WBP_PromptContainer_C_ExecuteUbergraph_WBP_PromptContainer::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_ExecuteUbergraph_WBP_PromptContainer, CallFunc_SpawnObject_ReturnValue) == 0x000040, "Member 'WBP_PromptContainer_C_ExecuteUbergraph_WBP_PromptContainer::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

// Function WBP_PromptContainer.WBP_PromptContainer_C.HidePrompt
// 0x0038 (0x0038 - 0x0000)
struct WBP_PromptContainer_C_HidePrompt final
{
public:
	struct FFPromptID                             PromptID;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_ExplorationPrompt_C*               Temp_wildcard_Variable;                            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_ExplorationPrompt_C* PromptWidget)> K2Node_CreateDelegate_OutputDelegate; // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_ExplorationPrompt_C*               CallFunc_Map_Find_Value;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PromptContainer_C_HidePrompt) == 0x000008, "Wrong alignment on WBP_PromptContainer_C_HidePrompt");
static_assert(sizeof(WBP_PromptContainer_C_HidePrompt) == 0x000038, "Wrong size on WBP_PromptContainer_C_HidePrompt");
static_assert(offsetof(WBP_PromptContainer_C_HidePrompt, PromptID) == 0x000000, "Member 'WBP_PromptContainer_C_HidePrompt::PromptID' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_HidePrompt, Temp_wildcard_Variable) == 0x000010, "Member 'WBP_PromptContainer_C_HidePrompt::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_HidePrompt, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_PromptContainer_C_HidePrompt::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_HidePrompt, CallFunc_Map_Find_Value) == 0x000028, "Member 'WBP_PromptContainer_C_HidePrompt::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_HidePrompt, CallFunc_Map_Find_ReturnValue) == 0x000030, "Member 'WBP_PromptContainer_C_HidePrompt::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_HidePrompt, CallFunc_Map_Remove_ReturnValue) == 0x000031, "Member 'WBP_PromptContainer_C_HidePrompt::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");

// Function WBP_PromptContainer.WBP_PromptContainer_C.OnPromptDisappeared
// 0x0010 (0x0010 - 0x0000)
struct WBP_PromptContainer_C_OnPromptDisappeared final
{
public:
	class UWBP_ExplorationPrompt_C*               PromptWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue_1;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PromptContainer_C_OnPromptDisappeared) == 0x000008, "Wrong alignment on WBP_PromptContainer_C_OnPromptDisappeared");
static_assert(sizeof(WBP_PromptContainer_C_OnPromptDisappeared) == 0x000010, "Wrong size on WBP_PromptContainer_C_OnPromptDisappeared");
static_assert(offsetof(WBP_PromptContainer_C_OnPromptDisappeared, PromptWidget) == 0x000000, "Member 'WBP_PromptContainer_C_OnPromptDisappeared::PromptWidget' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_OnPromptDisappeared, CallFunc_Map_Remove_ReturnValue) == 0x000008, "Member 'WBP_PromptContainer_C_OnPromptDisappeared::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_OnPromptDisappeared, CallFunc_Map_Remove_ReturnValue_1) == 0x000009, "Member 'WBP_PromptContainer_C_OnPromptDisappeared::CallFunc_Map_Remove_ReturnValue_1' has a wrong offset!");

// Function WBP_PromptContainer.WBP_PromptContainer_C.RemoveDistantPrompt
// 0x0030 (0x0030 - 0x0000)
struct WBP_PromptContainer_C_RemoveDistantPrompt final
{
public:
	struct FFPromptID                             PromptID;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_ExplorationPromptHint_C*           Temp_wildcard_Variable;                            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ExplorationPromptHint_C*           CallFunc_Map_Find_Value;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PromptContainer_C_RemoveDistantPrompt) == 0x000008, "Wrong alignment on WBP_PromptContainer_C_RemoveDistantPrompt");
static_assert(sizeof(WBP_PromptContainer_C_RemoveDistantPrompt) == 0x000030, "Wrong size on WBP_PromptContainer_C_RemoveDistantPrompt");
static_assert(offsetof(WBP_PromptContainer_C_RemoveDistantPrompt, PromptID) == 0x000000, "Member 'WBP_PromptContainer_C_RemoveDistantPrompt::PromptID' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_RemoveDistantPrompt, Temp_wildcard_Variable) == 0x000010, "Member 'WBP_PromptContainer_C_RemoveDistantPrompt::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_RemoveDistantPrompt, CallFunc_Map_Remove_ReturnValue) == 0x000018, "Member 'WBP_PromptContainer_C_RemoveDistantPrompt::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_RemoveDistantPrompt, CallFunc_Map_Find_Value) == 0x000020, "Member 'WBP_PromptContainer_C_RemoveDistantPrompt::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_RemoveDistantPrompt, CallFunc_Map_Find_ReturnValue) == 0x000028, "Member 'WBP_PromptContainer_C_RemoveDistantPrompt::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function WBP_PromptContainer.WBP_PromptContainer_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_PromptContainer_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PromptContainer_C_Tick) == 0x000004, "Wrong alignment on WBP_PromptContainer_C_Tick");
static_assert(sizeof(WBP_PromptContainer_C_Tick) == 0x00003C, "Wrong size on WBP_PromptContainer_C_Tick");
static_assert(offsetof(WBP_PromptContainer_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_PromptContainer_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_PromptContainer_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_PromptContainer.WBP_PromptContainer_C.UpdateActorPrompts
// 0x0090 (0x0090 - 0x0000)
struct WBP_PromptContainer_C_UpdateActorPrompts final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_ExplorationPrompt_C*>       CallFunc_Map_Keys_Keys;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ExplorationPrompt_C*               CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFPromptActorAttachmentInfo            CallFunc_Map_Find_Value;                           // 0x0038(0x0020)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PromptContainer_C_UpdateActorPrompts) == 0x000008, "Wrong alignment on WBP_PromptContainer_C_UpdateActorPrompts");
static_assert(sizeof(WBP_PromptContainer_C_UpdateActorPrompts) == 0x000090, "Wrong size on WBP_PromptContainer_C_UpdateActorPrompts");
static_assert(offsetof(WBP_PromptContainer_C_UpdateActorPrompts, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_PromptContainer_C_UpdateActorPrompts::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_UpdateActorPrompts, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_PromptContainer_C_UpdateActorPrompts::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_UpdateActorPrompts, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_PromptContainer_C_UpdateActorPrompts::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_UpdateActorPrompts, CallFunc_Map_Keys_Keys) == 0x000010, "Member 'WBP_PromptContainer_C_UpdateActorPrompts::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_UpdateActorPrompts, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_PromptContainer_C_UpdateActorPrompts::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_UpdateActorPrompts, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_PromptContainer_C_UpdateActorPrompts::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_UpdateActorPrompts, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WBP_PromptContainer_C_UpdateActorPrompts::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_UpdateActorPrompts, CallFunc_Map_Find_Value) == 0x000038, "Member 'WBP_PromptContainer_C_UpdateActorPrompts::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_UpdateActorPrompts, CallFunc_Map_Find_ReturnValue) == 0x000058, "Member 'WBP_PromptContainer_C_UpdateActorPrompts::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_UpdateActorPrompts, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000060, "Member 'WBP_PromptContainer_C_UpdateActorPrompts::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_UpdateActorPrompts, CallFunc_Add_VectorVector_ReturnValue) == 0x000078, "Member 'WBP_PromptContainer_C_UpdateActorPrompts::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");

// Function WBP_PromptContainer.WBP_PromptContainer_C.UpdatePromptWidget
// 0x0110 (0x0110 - 0x0000)
struct WBP_PromptContainer_C_UpdatePromptWidget final
{
public:
	struct FFPromptParams                         PromptParams;                                      // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	struct FFPromptID                             PromptID;                                          // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInteraction3D;                                   // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_GuidToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0088(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0098(0x0048)(HasGetValueTypeHash)
	class UWBP_ExplorationPrompt_C*               CallFunc_Map_Find_Value;                           // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00F0(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PromptContainer_C_UpdatePromptWidget) == 0x000008, "Wrong alignment on WBP_PromptContainer_C_UpdatePromptWidget");
static_assert(sizeof(WBP_PromptContainer_C_UpdatePromptWidget) == 0x000110, "Wrong size on WBP_PromptContainer_C_UpdatePromptWidget");
static_assert(offsetof(WBP_PromptContainer_C_UpdatePromptWidget, PromptParams) == 0x000000, "Member 'WBP_PromptContainer_C_UpdatePromptWidget::PromptParams' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_UpdatePromptWidget, PromptID) == 0x000018, "Member 'WBP_PromptContainer_C_UpdatePromptWidget::PromptID' has a wrong offset!");
static_assert(offsetof(WBP_PromptContainer_C_UpdatePromptWidget, IsInteraction3D) == 0x000028, "Member 'WBP_PromptContainer_C_UpdatePromptWidget::IsInteraction3D' has a wrong offset!");
