#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GM_SkillsPanel

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_GM_SkillsPanel.WBP_GM_SkillsPanel_C.BackFromSkillSelectionState
// 0x0010 (0x0010 - 0x0000)
struct WBP_GM_SkillsPanel_C_BackFromSkillSelectionState final
{
public:
	bool                                          CallFunc_IsInGamepadOrKeyboardNavigationMode_ReturnValue; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_SkillsPanel_C_BackFromSkillSelectionState) == 0x000008, "Wrong alignment on WBP_GM_SkillsPanel_C_BackFromSkillSelectionState");
static_assert(sizeof(WBP_GM_SkillsPanel_C_BackFromSkillSelectionState) == 0x000010, "Wrong size on WBP_GM_SkillsPanel_C_BackFromSkillSelectionState");
static_assert(offsetof(WBP_GM_SkillsPanel_C_BackFromSkillSelectionState, CallFunc_IsInGamepadOrKeyboardNavigationMode_ReturnValue) == 0x000000, "Member 'WBP_GM_SkillsPanel_C_BackFromSkillSelectionState::CallFunc_IsInGamepadOrKeyboardNavigationMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_BackFromSkillSelectionState, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'WBP_GM_SkillsPanel_C_BackFromSkillSelectionState::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

// Function WBP_GM_SkillsPanel.WBP_GM_SkillsPanel_C.BndEvt__WBP_GM_SkillsPanel_AssignedSkills_K2Node_ComponentBoundEvent_10_OnSkillSlotFocused__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_GM_SkillsPanel_C_BndEvt__WBP_GM_SkillsPanel_AssignedSkills_K2Node_ComponentBoundEvent_10_OnSkillSlotFocused__DelegateSignature final
{
public:
	class UWBP_GM_SkillElementShort_C*            InFocusedSlot;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFocused;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_SkillsPanel_C_BndEvt__WBP_GM_SkillsPanel_AssignedSkills_K2Node_ComponentBoundEvent_10_OnSkillSlotFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GM_SkillsPanel_C_BndEvt__WBP_GM_SkillsPanel_AssignedSkills_K2Node_ComponentBoundEvent_10_OnSkillSlotFocused__DelegateSignature");
static_assert(sizeof(WBP_GM_SkillsPanel_C_BndEvt__WBP_GM_SkillsPanel_AssignedSkills_K2Node_ComponentBoundEvent_10_OnSkillSlotFocused__DelegateSignature) == 0x000010, "Wrong size on WBP_GM_SkillsPanel_C_BndEvt__WBP_GM_SkillsPanel_AssignedSkills_K2Node_ComponentBoundEvent_10_OnSkillSlotFocused__DelegateSignature");
static_assert(offsetof(WBP_GM_SkillsPanel_C_BndEvt__WBP_GM_SkillsPanel_AssignedSkills_K2Node_ComponentBoundEvent_10_OnSkillSlotFocused__DelegateSignature, InFocusedSlot) == 0x000000, "Member 'WBP_GM_SkillsPanel_C_BndEvt__WBP_GM_SkillsPanel_AssignedSkills_K2Node_ComponentBoundEvent_10_OnSkillSlotFocused__DelegateSignature::InFocusedSlot' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_BndEvt__WBP_GM_SkillsPanel_AssignedSkills_K2Node_ComponentBoundEvent_10_OnSkillSlotFocused__DelegateSignature, IsFocused) == 0x000008, "Member 'WBP_GM_SkillsPanel_C_BndEvt__WBP_GM_SkillsPanel_AssignedSkills_K2Node_ComponentBoundEvent_10_OnSkillSlotFocused__DelegateSignature::IsFocused' has a wrong offset!");

// Function WBP_GM_SkillsPanel.WBP_GM_SkillsPanel_C.BndEvt__WBP_GM_SkillsPanel_AssignedSkills_K2Node_ComponentBoundEvent_9_OnSkillSlotClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_SkillsPanel_C_BndEvt__WBP_GM_SkillsPanel_AssignedSkills_K2Node_ComponentBoundEvent_9_OnSkillSlotClicked__DelegateSignature final
{
public:
	class UWBP_GM_SkillElementShort_C*            InClickedSlot;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_SkillsPanel_C_BndEvt__WBP_GM_SkillsPanel_AssignedSkills_K2Node_ComponentBoundEvent_9_OnSkillSlotClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GM_SkillsPanel_C_BndEvt__WBP_GM_SkillsPanel_AssignedSkills_K2Node_ComponentBoundEvent_9_OnSkillSlotClicked__DelegateSignature");
static_assert(sizeof(WBP_GM_SkillsPanel_C_BndEvt__WBP_GM_SkillsPanel_AssignedSkills_K2Node_ComponentBoundEvent_9_OnSkillSlotClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_GM_SkillsPanel_C_BndEvt__WBP_GM_SkillsPanel_AssignedSkills_K2Node_ComponentBoundEvent_9_OnSkillSlotClicked__DelegateSignature");
static_assert(offsetof(WBP_GM_SkillsPanel_C_BndEvt__WBP_GM_SkillsPanel_AssignedSkills_K2Node_ComponentBoundEvent_9_OnSkillSlotClicked__DelegateSignature, InClickedSlot) == 0x000000, "Member 'WBP_GM_SkillsPanel_C_BndEvt__WBP_GM_SkillsPanel_AssignedSkills_K2Node_ComponentBoundEvent_9_OnSkillSlotClicked__DelegateSignature::InClickedSlot' has a wrong offset!");

// Function WBP_GM_SkillsPanel.WBP_GM_SkillsPanel_C.BndEvt__WBP_GM_SkillsPanel_SkillsList_K2Node_ComponentBoundEvent_11_OnSkillItemClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_SkillsPanel_C_BndEvt__WBP_GM_SkillsPanel_SkillsList_K2Node_ComponentBoundEvent_11_OnSkillItemClicked__DelegateSignature final
{
public:
	class UBP_DataAsset_Skill_C*                  SkillData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_SkillsPanel_C_BndEvt__WBP_GM_SkillsPanel_SkillsList_K2Node_ComponentBoundEvent_11_OnSkillItemClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GM_SkillsPanel_C_BndEvt__WBP_GM_SkillsPanel_SkillsList_K2Node_ComponentBoundEvent_11_OnSkillItemClicked__DelegateSignature");
static_assert(sizeof(WBP_GM_SkillsPanel_C_BndEvt__WBP_GM_SkillsPanel_SkillsList_K2Node_ComponentBoundEvent_11_OnSkillItemClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_GM_SkillsPanel_C_BndEvt__WBP_GM_SkillsPanel_SkillsList_K2Node_ComponentBoundEvent_11_OnSkillItemClicked__DelegateSignature");
static_assert(offsetof(WBP_GM_SkillsPanel_C_BndEvt__WBP_GM_SkillsPanel_SkillsList_K2Node_ComponentBoundEvent_11_OnSkillItemClicked__DelegateSignature, SkillData) == 0x000000, "Member 'WBP_GM_SkillsPanel_C_BndEvt__WBP_GM_SkillsPanel_SkillsList_K2Node_ComponentBoundEvent_11_OnSkillItemClicked__DelegateSignature::SkillData' has a wrong offset!");

// Function WBP_GM_SkillsPanel.WBP_GM_SkillsPanel_C.BndEvt__WBP_GM_SkillsPanel_SkillsList_K2Node_ComponentBoundEvent_12_OnSkillItemNavigated__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_SkillsPanel_C_BndEvt__WBP_GM_SkillsPanel_SkillsList_K2Node_ComponentBoundEvent_12_OnSkillItemNavigated__DelegateSignature final
{
public:
	class UBP_DataAsset_Skill_C*                  SkillData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_SkillsPanel_C_BndEvt__WBP_GM_SkillsPanel_SkillsList_K2Node_ComponentBoundEvent_12_OnSkillItemNavigated__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GM_SkillsPanel_C_BndEvt__WBP_GM_SkillsPanel_SkillsList_K2Node_ComponentBoundEvent_12_OnSkillItemNavigated__DelegateSignature");
static_assert(sizeof(WBP_GM_SkillsPanel_C_BndEvt__WBP_GM_SkillsPanel_SkillsList_K2Node_ComponentBoundEvent_12_OnSkillItemNavigated__DelegateSignature) == 0x000008, "Wrong size on WBP_GM_SkillsPanel_C_BndEvt__WBP_GM_SkillsPanel_SkillsList_K2Node_ComponentBoundEvent_12_OnSkillItemNavigated__DelegateSignature");
static_assert(offsetof(WBP_GM_SkillsPanel_C_BndEvt__WBP_GM_SkillsPanel_SkillsList_K2Node_ComponentBoundEvent_12_OnSkillItemNavigated__DelegateSignature, SkillData) == 0x000000, "Member 'WBP_GM_SkillsPanel_C_BndEvt__WBP_GM_SkillsPanel_SkillsList_K2Node_ComponentBoundEvent_12_OnSkillItemNavigated__DelegateSignature::SkillData' has a wrong offset!");

// Function WBP_GM_SkillsPanel.WBP_GM_SkillsPanel_C.BndEvt__WBP_GM_SkillsPanel_SkillTreeButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_SkillsPanel_C_BndEvt__WBP_GM_SkillsPanel_SkillTreeButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_SkillsPanel_C_BndEvt__WBP_GM_SkillsPanel_SkillTreeButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GM_SkillsPanel_C_BndEvt__WBP_GM_SkillsPanel_SkillTreeButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_GM_SkillsPanel_C_BndEvt__WBP_GM_SkillsPanel_SkillTreeButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_GM_SkillsPanel_C_BndEvt__WBP_GM_SkillsPanel_SkillTreeButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_GM_SkillsPanel_C_BndEvt__WBP_GM_SkillsPanel_SkillTreeButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_GM_SkillsPanel_C_BndEvt__WBP_GM_SkillsPanel_SkillTreeButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_GM_SkillsPanel.WBP_GM_SkillsPanel_C.BndEvt__WBP_Panel_Pictos_WBP_CommonBoundActionButton_Unequip_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_SkillsPanel_C_BndEvt__WBP_Panel_Pictos_WBP_CommonBoundActionButton_Unequip_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_SkillsPanel_C_BndEvt__WBP_Panel_Pictos_WBP_CommonBoundActionButton_Unequip_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GM_SkillsPanel_C_BndEvt__WBP_Panel_Pictos_WBP_CommonBoundActionButton_Unequip_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_GM_SkillsPanel_C_BndEvt__WBP_Panel_Pictos_WBP_CommonBoundActionButton_Unequip_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_GM_SkillsPanel_C_BndEvt__WBP_Panel_Pictos_WBP_CommonBoundActionButton_Unequip_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_GM_SkillsPanel_C_BndEvt__WBP_Panel_Pictos_WBP_CommonBoundActionButton_Unequip_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_GM_SkillsPanel_C_BndEvt__WBP_Panel_Pictos_WBP_CommonBoundActionButton_Unequip_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_GM_SkillsPanel.WBP_GM_SkillsPanel_C.BPI_GetCharacterNotificationState
// 0x0010 (0x0010 - 0x0000)
struct WBP_GM_SkillsPanel_C_BPI_GetCharacterNotificationState final
{
public:
	class UBP_CharacterData_C*                    CharacterData;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          HasNotification;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_SkillsPanel_C_BPI_GetCharacterNotificationState) == 0x000008, "Wrong alignment on WBP_GM_SkillsPanel_C_BPI_GetCharacterNotificationState");
static_assert(sizeof(WBP_GM_SkillsPanel_C_BPI_GetCharacterNotificationState) == 0x000010, "Wrong size on WBP_GM_SkillsPanel_C_BPI_GetCharacterNotificationState");
static_assert(offsetof(WBP_GM_SkillsPanel_C_BPI_GetCharacterNotificationState, CharacterData) == 0x000000, "Member 'WBP_GM_SkillsPanel_C_BPI_GetCharacterNotificationState::CharacterData' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_BPI_GetCharacterNotificationState, HasNotification) == 0x000008, "Member 'WBP_GM_SkillsPanel_C_BPI_GetCharacterNotificationState::HasNotification' has a wrong offset!");

// Function WBP_GM_SkillsPanel.WBP_GM_SkillsPanel_C.BPI_LoadCharacter
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_SkillsPanel_C_BPI_LoadCharacter final
{
public:
	class UBP_CharacterData_C*                    CharacterData;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_SkillsPanel_C_BPI_LoadCharacter) == 0x000008, "Wrong alignment on WBP_GM_SkillsPanel_C_BPI_LoadCharacter");
static_assert(sizeof(WBP_GM_SkillsPanel_C_BPI_LoadCharacter) == 0x000008, "Wrong size on WBP_GM_SkillsPanel_C_BPI_LoadCharacter");
static_assert(offsetof(WBP_GM_SkillsPanel_C_BPI_LoadCharacter, CharacterData) == 0x000000, "Member 'WBP_GM_SkillsPanel_C_BPI_LoadCharacter::CharacterData' has a wrong offset!");

// Function WBP_GM_SkillsPanel.WBP_GM_SkillsPanel_C.CanUnassignSkills
// 0x0048 (0x0048 - 0x0000)
struct WBP_GM_SkillsPanel_C_CanUnassignSkills final
{
public:
	bool                                          bCanUnassignSkills;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumberOfValidSkills;                               // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_DataAsset_Skill_C*>          CallFunc_GetEquippedSkills_EquippedSkills;         // 0x0020(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DataAsset_Skill_C*                  CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_SkillsPanel_C_CanUnassignSkills) == 0x000008, "Wrong alignment on WBP_GM_SkillsPanel_C_CanUnassignSkills");
static_assert(sizeof(WBP_GM_SkillsPanel_C_CanUnassignSkills) == 0x000048, "Wrong size on WBP_GM_SkillsPanel_C_CanUnassignSkills");
static_assert(offsetof(WBP_GM_SkillsPanel_C_CanUnassignSkills, bCanUnassignSkills) == 0x000000, "Member 'WBP_GM_SkillsPanel_C_CanUnassignSkills::bCanUnassignSkills' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_CanUnassignSkills, NumberOfValidSkills) == 0x000004, "Member 'WBP_GM_SkillsPanel_C_CanUnassignSkills::NumberOfValidSkills' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_CanUnassignSkills, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_GM_SkillsPanel_C_CanUnassignSkills::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_CanUnassignSkills, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_GM_SkillsPanel_C_CanUnassignSkills::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_CanUnassignSkills, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_GM_SkillsPanel_C_CanUnassignSkills::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_CanUnassignSkills, Temp_int_Variable) == 0x000014, "Member 'WBP_GM_SkillsPanel_C_CanUnassignSkills::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_CanUnassignSkills, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000018, "Member 'WBP_GM_SkillsPanel_C_CanUnassignSkills::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_CanUnassignSkills, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'WBP_GM_SkillsPanel_C_CanUnassignSkills::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_CanUnassignSkills, CallFunc_GetEquippedSkills_EquippedSkills) == 0x000020, "Member 'WBP_GM_SkillsPanel_C_CanUnassignSkills::CallFunc_GetEquippedSkills_EquippedSkills' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_CanUnassignSkills, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WBP_GM_SkillsPanel_C_CanUnassignSkills::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_CanUnassignSkills, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_GM_SkillsPanel_C_CanUnassignSkills::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_CanUnassignSkills, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'WBP_GM_SkillsPanel_C_CanUnassignSkills::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_CanUnassignSkills, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'WBP_GM_SkillsPanel_C_CanUnassignSkills::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_GM_SkillsPanel.WBP_GM_SkillsPanel_C.CheckUnassignForbidden
// 0x0018 (0x0018 - 0x0000)
struct WBP_GM_SkillsPanel_C_CheckUnassignForbidden final
{
public:
	bool                                          CallFunc_CanUnassignSkills_bCanUnassignSkills;     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CommonBoundActionButton_C*         CallFunc_FindActionButtonFromButton_CommonButtonBase; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_SkillsPanel_C_CheckUnassignForbidden) == 0x000008, "Wrong alignment on WBP_GM_SkillsPanel_C_CheckUnassignForbidden");
static_assert(sizeof(WBP_GM_SkillsPanel_C_CheckUnassignForbidden) == 0x000018, "Wrong size on WBP_GM_SkillsPanel_C_CheckUnassignForbidden");
static_assert(offsetof(WBP_GM_SkillsPanel_C_CheckUnassignForbidden, CallFunc_CanUnassignSkills_bCanUnassignSkills) == 0x000000, "Member 'WBP_GM_SkillsPanel_C_CheckUnassignForbidden::CallFunc_CanUnassignSkills_bCanUnassignSkills' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_CheckUnassignForbidden, CallFunc_GetIsEnabled_ReturnValue) == 0x000001, "Member 'WBP_GM_SkillsPanel_C_CheckUnassignForbidden::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_CheckUnassignForbidden, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'WBP_GM_SkillsPanel_C_CheckUnassignForbidden::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_CheckUnassignForbidden, CallFunc_FindActionButtonFromButton_CommonButtonBase) == 0x000008, "Member 'WBP_GM_SkillsPanel_C_CheckUnassignForbidden::CallFunc_FindActionButtonFromButton_CommonButtonBase' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_CheckUnassignForbidden, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_GM_SkillsPanel_C_CheckUnassignForbidden::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_GM_SkillsPanel.WBP_GM_SkillsPanel_C.DoCustom NavigationSkillList
// 0x0018 (0x0018 - 0x0000)
struct WBP_GM_SkillsPanel_C_DoCustom_NavigationSkillList final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_SkillsPanel_C_DoCustom_NavigationSkillList) == 0x000008, "Wrong alignment on WBP_GM_SkillsPanel_C_DoCustom_NavigationSkillList");
static_assert(sizeof(WBP_GM_SkillsPanel_C_DoCustom_NavigationSkillList) == 0x000018, "Wrong size on WBP_GM_SkillsPanel_C_DoCustom_NavigationSkillList");
static_assert(offsetof(WBP_GM_SkillsPanel_C_DoCustom_NavigationSkillList, Navigation_0) == 0x000000, "Member 'WBP_GM_SkillsPanel_C_DoCustom_NavigationSkillList::Navigation_0' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_DoCustom_NavigationSkillList, ReturnValue) == 0x000008, "Member 'WBP_GM_SkillsPanel_C_DoCustom_NavigationSkillList::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_DoCustom_NavigationSkillList, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_GM_SkillsPanel_C_DoCustom_NavigationSkillList::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_GM_SkillsPanel.WBP_GM_SkillsPanel_C.DoCustomNavigationSkillSlots
// 0x0068 (0x0068 - 0x0000)
struct WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    CallFunc_GetDisplayedEntryWidgets_ReturnValue;     // 0x0038(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots) == 0x000008, "Wrong alignment on WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots");
static_assert(sizeof(WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots) == 0x000068, "Wrong size on WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots");
static_assert(offsetof(WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots, Navigation_0) == 0x000000, "Member 'WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots::Navigation_0' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots, ReturnValue) == 0x000008, "Member 'WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots, Temp_object_Variable) == 0x000018, "Member 'WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots, Temp_bool_Variable) == 0x000020, "Member 'WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000021, "Member 'WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots, K2Node_Select_Default) == 0x000028, "Member 'WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000030, "Member 'WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x000031, "Member 'WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots, CallFunc_IsActivated_ReturnValue) == 0x000032, "Member 'WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots::CallFunc_IsActivated_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots, CallFunc_GetDisplayedEntryWidgets_ReturnValue) == 0x000038, "Member 'WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots::CallFunc_GetDisplayedEntryWidgets_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots, CallFunc_Divide_IntInt_ReturnValue) == 0x00004C, "Member 'WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000050, "Member 'WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots, CallFunc_SelectInt_ReturnValue) == 0x000058, "Member 'WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots, CallFunc_SelectInt_ReturnValue_1) == 0x00005C, "Member 'WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots, CallFunc_Subtract_IntInt_ReturnValue) == 0x000060, "Member 'WBP_GM_SkillsPanel_C_DoCustomNavigationSkillSlots::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_GM_SkillsPanel.WBP_GM_SkillsPanel_C.DoCustomNavigationSkillTreeButton
// 0x0010 (0x0010 - 0x0000)
struct WBP_GM_SkillsPanel_C_DoCustomNavigationSkillTreeButton final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_SkillsPanel_C_DoCustomNavigationSkillTreeButton) == 0x000008, "Wrong alignment on WBP_GM_SkillsPanel_C_DoCustomNavigationSkillTreeButton");
static_assert(sizeof(WBP_GM_SkillsPanel_C_DoCustomNavigationSkillTreeButton) == 0x000010, "Wrong size on WBP_GM_SkillsPanel_C_DoCustomNavigationSkillTreeButton");
static_assert(offsetof(WBP_GM_SkillsPanel_C_DoCustomNavigationSkillTreeButton, Navigation_0) == 0x000000, "Member 'WBP_GM_SkillsPanel_C_DoCustomNavigationSkillTreeButton::Navigation_0' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_DoCustomNavigationSkillTreeButton, ReturnValue) == 0x000008, "Member 'WBP_GM_SkillsPanel_C_DoCustomNavigationSkillTreeButton::ReturnValue' has a wrong offset!");

// Function WBP_GM_SkillsPanel.WBP_GM_SkillsPanel_C.ExecuteUbergraph_WBP_GM_SkillsPanel
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CharacterData_C*                    K2Node_Event_CharacterData;                        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GM_SkillElementShort_C*            K2Node_ComponentBoundEvent_InClickedSlot;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_GM_SkillElementShort_C*            K2Node_ComponentBoundEvent_InFocusedSlot;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_IsFocused;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSlotIndex_SlotIndex;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_DataAsset_Skill_C*                  K2Node_ComponentBoundEvent_SkillData_1;            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DataAsset_Skill_C*                  K2Node_ComponentBoundEvent_SkillData;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0068(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UWBP_CommonActionBarContainer_C*        CallFunc_GetGameMenuActionBarFromPanel_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_CommonBoundActionButton_C*         CallFunc_FindActionButtonFromButton_CommonButtonBase; // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CommonActionBarContainer_C*        K2Node_CustomEvent_ActionBarContainerWidget;       // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_CommonActionBarContainer_C* ActionBarContainerWidget)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0090(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_CommonActionBarContainer_C* ActionBarContainerWidget)> K2Node_CreateDelegate_OutputDelegate_2; // 0x00A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel) == 0x000008, "Wrong alignment on WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel");
static_assert(sizeof(WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel) == 0x0000B0, "Wrong size on WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel");
static_assert(offsetof(WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel, EntryPoint) == 0x000000, "Member 'WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel, K2Node_Event_CharacterData) == 0x000008, "Member 'WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel::K2Node_Event_CharacterData' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel, K2Node_ComponentBoundEvent_Button_1) == 0x000010, "Member 'WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel, CallFunc_GetIsEnabled_ReturnValue) == 0x000018, "Member 'WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel, K2Node_ComponentBoundEvent_InClickedSlot) == 0x000020, "Member 'WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel::K2Node_ComponentBoundEvent_InClickedSlot' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel, K2Node_ComponentBoundEvent_InFocusedSlot) == 0x000028, "Member 'WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel::K2Node_ComponentBoundEvent_InFocusedSlot' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel, K2Node_ComponentBoundEvent_IsFocused) == 0x000030, "Member 'WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel::K2Node_ComponentBoundEvent_IsFocused' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel, CallFunc_GetSlotIndex_SlotIndex) == 0x000034, "Member 'WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel::CallFunc_GetSlotIndex_SlotIndex' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel, K2Node_ComponentBoundEvent_SkillData_1) == 0x000038, "Member 'WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel::K2Node_ComponentBoundEvent_SkillData_1' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel, K2Node_ComponentBoundEvent_SkillData) == 0x000040, "Member 'WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel::K2Node_ComponentBoundEvent_SkillData' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel, K2Node_ComponentBoundEvent_Button) == 0x000048, "Member 'WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel, K2Node_CreateDelegate_OutputDelegate) == 0x000054, "Member 'WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000068, "Member 'WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel, CallFunc_GetGameMenuActionBarFromPanel_ReturnValue) == 0x000070, "Member 'WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel::CallFunc_GetGameMenuActionBarFromPanel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel, CallFunc_FindActionButtonFromButton_CommonButtonBase) == 0x000078, "Member 'WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel::CallFunc_FindActionButtonFromButton_CommonButtonBase' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel, CallFunc_IsValid_ReturnValue_1) == 0x000080, "Member 'WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel, K2Node_CustomEvent_ActionBarContainerWidget) == 0x000088, "Member 'WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel::K2Node_CustomEvent_ActionBarContainerWidget' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel, K2Node_CreateDelegate_OutputDelegate_1) == 0x000090, "Member 'WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000A0, "Member 'WBP_GM_SkillsPanel_C_ExecuteUbergraph_WBP_GM_SkillsPanel::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function WBP_GM_SkillsPanel.WBP_GM_SkillsPanel_C.GetLastFocusedSkillSlot
// 0x0004 (0x0004 - 0x0000)
struct WBP_GM_SkillsPanel_C_GetLastFocusedSkillSlot final
{
public:
	int32                                         LastFocusedSkillSlot_0;                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_SkillsPanel_C_GetLastFocusedSkillSlot) == 0x000004, "Wrong alignment on WBP_GM_SkillsPanel_C_GetLastFocusedSkillSlot");
static_assert(sizeof(WBP_GM_SkillsPanel_C_GetLastFocusedSkillSlot) == 0x000004, "Wrong size on WBP_GM_SkillsPanel_C_GetLastFocusedSkillSlot");
static_assert(offsetof(WBP_GM_SkillsPanel_C_GetLastFocusedSkillSlot, LastFocusedSkillSlot_0) == 0x000000, "Member 'WBP_GM_SkillsPanel_C_GetLastFocusedSkillSlot::LastFocusedSkillSlot_0' has a wrong offset!");

// Function WBP_GM_SkillsPanel.WBP_GM_SkillsPanel_C.GoToSkillSelectionState
// 0x0020 (0x0020 - 0x0000)
struct WBP_GM_SkillsPanel_C_GoToSkillSelectionState final
{
public:
	class UWBP_GM_SkillElementShort_C*            InSelectedSlot;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_DataAsset_Skill_C*                  CallFunc_GetSkillData_SkillData;                   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_SkillsPanel_C_GoToSkillSelectionState) == 0x000008, "Wrong alignment on WBP_GM_SkillsPanel_C_GoToSkillSelectionState");
static_assert(sizeof(WBP_GM_SkillsPanel_C_GoToSkillSelectionState) == 0x000020, "Wrong size on WBP_GM_SkillsPanel_C_GoToSkillSelectionState");
static_assert(offsetof(WBP_GM_SkillsPanel_C_GoToSkillSelectionState, InSelectedSlot) == 0x000000, "Member 'WBP_GM_SkillsPanel_C_GoToSkillSelectionState::InSelectedSlot' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_GoToSkillSelectionState, CallFunc_GetSkillData_SkillData) == 0x000008, "Member 'WBP_GM_SkillsPanel_C_GoToSkillSelectionState::CallFunc_GetSkillData_SkillData' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_GoToSkillSelectionState, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'WBP_GM_SkillsPanel_C_GoToSkillSelectionState::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_GoToSkillSelectionState, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_GM_SkillsPanel_C_GoToSkillSelectionState::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_GM_SkillsPanel.WBP_GM_SkillsPanel_C.GoToSlotSelectionState
// 0x0018 (0x0018 - 0x0000)
struct WBP_GM_SkillsPanel_C_GoToSlotSelectionState final
{
public:
	class UBP_DataAsset_Skill_C*                  InSkillData;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInGamepadOrKeyboardNavigationMode_ReturnValue; // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_SkillsPanel_C_GoToSlotSelectionState) == 0x000008, "Wrong alignment on WBP_GM_SkillsPanel_C_GoToSlotSelectionState");
static_assert(sizeof(WBP_GM_SkillsPanel_C_GoToSlotSelectionState) == 0x000018, "Wrong size on WBP_GM_SkillsPanel_C_GoToSlotSelectionState");
static_assert(offsetof(WBP_GM_SkillsPanel_C_GoToSlotSelectionState, InSkillData) == 0x000000, "Member 'WBP_GM_SkillsPanel_C_GoToSlotSelectionState::InSkillData' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_GoToSlotSelectionState, CallFunc_IsInGamepadOrKeyboardNavigationMode_ReturnValue) == 0x000008, "Member 'WBP_GM_SkillsPanel_C_GoToSlotSelectionState::CallFunc_IsInGamepadOrKeyboardNavigationMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_GoToSlotSelectionState, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000010, "Member 'WBP_GM_SkillsPanel_C_GoToSlotSelectionState::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");

// Function WBP_GM_SkillsPanel.WBP_GM_SkillsPanel_C.InitializeSlotsData
// 0x0020 (0x0020 - 0x0000)
struct WBP_GM_SkillsPanel_C_InitializeSlotsData final
{
public:
	class UBP_DataAsset_Skill_C*                  CallFunc_GetSkillData_SkillData;                   // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_DataAsset_Skill_C*>          CallFunc_GetEquippedSkills_EquippedSkills;         // 0x0008(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_SkillsPanel_C_InitializeSlotsData) == 0x000008, "Wrong alignment on WBP_GM_SkillsPanel_C_InitializeSlotsData");
static_assert(sizeof(WBP_GM_SkillsPanel_C_InitializeSlotsData) == 0x000020, "Wrong size on WBP_GM_SkillsPanel_C_InitializeSlotsData");
static_assert(offsetof(WBP_GM_SkillsPanel_C_InitializeSlotsData, CallFunc_GetSkillData_SkillData) == 0x000000, "Member 'WBP_GM_SkillsPanel_C_InitializeSlotsData::CallFunc_GetSkillData_SkillData' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_InitializeSlotsData, CallFunc_GetEquippedSkills_EquippedSkills) == 0x000008, "Member 'WBP_GM_SkillsPanel_C_InitializeSlotsData::CallFunc_GetEquippedSkills_EquippedSkills' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_InitializeSlotsData, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_GM_SkillsPanel_C_InitializeSlotsData::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_GM_SkillsPanel.WBP_GM_SkillsPanel_C.IsInSelectionState
// 0x0004 (0x0004 - 0x0000)
struct WBP_GM_SkillsPanel_C_IsInSelectionState final
{
public:
	bool                                          IsInSelectionState_0;                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_SkillsPanel_C_IsInSelectionState) == 0x000001, "Wrong alignment on WBP_GM_SkillsPanel_C_IsInSelectionState");
static_assert(sizeof(WBP_GM_SkillsPanel_C_IsInSelectionState) == 0x000004, "Wrong size on WBP_GM_SkillsPanel_C_IsInSelectionState");
static_assert(offsetof(WBP_GM_SkillsPanel_C_IsInSelectionState, IsInSelectionState_0) == 0x000000, "Member 'WBP_GM_SkillsPanel_C_IsInSelectionState::IsInSelectionState_0' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_IsInSelectionState, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'WBP_GM_SkillsPanel_C_IsInSelectionState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_IsInSelectionState, CallFunc_IsValid_ReturnValue_1) == 0x000002, "Member 'WBP_GM_SkillsPanel_C_IsInSelectionState::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_IsInSelectionState, CallFunc_BooleanOR_ReturnValue) == 0x000003, "Member 'WBP_GM_SkillsPanel_C_IsInSelectionState::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_GM_SkillsPanel.WBP_GM_SkillsPanel_C.LoadCharacter
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_SkillsPanel_C_LoadCharacter final
{
public:
	class UBP_CharacterData_C*                    CharacterData;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_SkillsPanel_C_LoadCharacter) == 0x000008, "Wrong alignment on WBP_GM_SkillsPanel_C_LoadCharacter");
static_assert(sizeof(WBP_GM_SkillsPanel_C_LoadCharacter) == 0x000008, "Wrong size on WBP_GM_SkillsPanel_C_LoadCharacter");
static_assert(offsetof(WBP_GM_SkillsPanel_C_LoadCharacter, CharacterData) == 0x000000, "Member 'WBP_GM_SkillsPanel_C_LoadCharacter::CharacterData' has a wrong offset!");

// Function WBP_GM_SkillsPanel.WBP_GM_SkillsPanel_C.OnActionBarContentUpdated
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_SkillsPanel_C_OnActionBarContentUpdated final
{
public:
	class UWBP_CommonActionBarContainer_C*        ActionBarContainerWidget;                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_SkillsPanel_C_OnActionBarContentUpdated) == 0x000008, "Wrong alignment on WBP_GM_SkillsPanel_C_OnActionBarContentUpdated");
static_assert(sizeof(WBP_GM_SkillsPanel_C_OnActionBarContentUpdated) == 0x000008, "Wrong size on WBP_GM_SkillsPanel_C_OnActionBarContentUpdated");
static_assert(offsetof(WBP_GM_SkillsPanel_C_OnActionBarContentUpdated, ActionBarContainerWidget) == 0x000000, "Member 'WBP_GM_SkillsPanel_C_OnActionBarContentUpdated::ActionBarContainerWidget' has a wrong offset!");

// Function WBP_GM_SkillsPanel.WBP_GM_SkillsPanel_C.OnSkillItemClicked
// 0x0010 (0x0010 - 0x0000)
struct WBP_GM_SkillsPanel_C_OnSkillItemClicked final
{
public:
	class UBP_DataAsset_Skill_C*                  InSkillData;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotIndex_SlotIndex;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_SkillsPanel_C_OnSkillItemClicked) == 0x000008, "Wrong alignment on WBP_GM_SkillsPanel_C_OnSkillItemClicked");
static_assert(sizeof(WBP_GM_SkillsPanel_C_OnSkillItemClicked) == 0x000010, "Wrong size on WBP_GM_SkillsPanel_C_OnSkillItemClicked");
static_assert(offsetof(WBP_GM_SkillsPanel_C_OnSkillItemClicked, InSkillData) == 0x000000, "Member 'WBP_GM_SkillsPanel_C_OnSkillItemClicked::InSkillData' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_OnSkillItemClicked, CallFunc_GetSlotIndex_SlotIndex) == 0x000008, "Member 'WBP_GM_SkillsPanel_C_OnSkillItemClicked::CallFunc_GetSlotIndex_SlotIndex' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_OnSkillItemClicked, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'WBP_GM_SkillsPanel_C_OnSkillItemClicked::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_GM_SkillsPanel.WBP_GM_SkillsPanel_C.OnSlotClicked
// 0x0010 (0x0010 - 0x0000)
struct WBP_GM_SkillsPanel_C_OnSlotClicked final
{
public:
	class UWBP_GM_SkillElementShort_C*            InClickedSlot;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSlotIndex_SlotIndex;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_SkillsPanel_C_OnSlotClicked) == 0x000008, "Wrong alignment on WBP_GM_SkillsPanel_C_OnSlotClicked");
static_assert(sizeof(WBP_GM_SkillsPanel_C_OnSlotClicked) == 0x000010, "Wrong size on WBP_GM_SkillsPanel_C_OnSlotClicked");
static_assert(offsetof(WBP_GM_SkillsPanel_C_OnSlotClicked, InClickedSlot) == 0x000000, "Member 'WBP_GM_SkillsPanel_C_OnSlotClicked::InClickedSlot' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_OnSlotClicked, CallFunc_GetSlotIndex_SlotIndex) == 0x000008, "Member 'WBP_GM_SkillsPanel_C_OnSlotClicked::CallFunc_GetSlotIndex_SlotIndex' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillsPanel_C_OnSlotClicked, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'WBP_GM_SkillsPanel_C_OnSlotClicked::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_GM_SkillsPanel.WBP_GM_SkillsPanel_C.PreSelectSlot
// 0x0048 (0x0048 - 0x0000)
struct WBP_GM_SkillsPanel_C_PreSelectSlot final
{
public:
	int32                                         InSlotIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
