#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DecoratorWidget_Keyword

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "E_RichTextDecorator_Keyword_IconPosition_structs.hpp"
#include "UMG_structs.hpp"
#include "S_RichTextDecorator_KeywordStyle_structs.hpp"


namespace SDK::Params
{

// Function WBP_DecoratorWidget_Keyword.WBP_DecoratorWidget_Keyword_C.ExecuteUbergraph_WBP_DecoratorWidget_Keyword
// 0x0004 (0x0004 - 0x0000)
struct WBP_DecoratorWidget_Keyword_C_ExecuteUbergraph_WBP_DecoratorWidget_Keyword final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DecoratorWidget_Keyword_C_ExecuteUbergraph_WBP_DecoratorWidget_Keyword) == 0x000004, "Wrong alignment on WBP_DecoratorWidget_Keyword_C_ExecuteUbergraph_WBP_DecoratorWidget_Keyword");
static_assert(sizeof(WBP_DecoratorWidget_Keyword_C_ExecuteUbergraph_WBP_DecoratorWidget_Keyword) == 0x000004, "Wrong size on WBP_DecoratorWidget_Keyword_C_ExecuteUbergraph_WBP_DecoratorWidget_Keyword");
static_assert(offsetof(WBP_DecoratorWidget_Keyword_C_ExecuteUbergraph_WBP_DecoratorWidget_Keyword, EntryPoint) == 0x000000, "Member 'WBP_DecoratorWidget_Keyword_C_ExecuteUbergraph_WBP_DecoratorWidget_Keyword::EntryPoint' has a wrong offset!");

// Function WBP_DecoratorWidget_Keyword.WBP_DecoratorWidget_Keyword_C.SetupIconStyle
// 0x01E0 (0x01E0 - 0x0000)
struct WBP_DecoratorWidget_Keyword_C_SetupIconStyle final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_RichTextDecorator_Keyword_IconPosition      Temp_byte_Variable_2;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxCharacterHeightFromStyle_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_RichTextDecorator_Keyword_IconPosition      Temp_byte_Variable_5;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0010(0x00D0)()
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00E4(0x0014)()
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x0100(0x00D0)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DecoratorWidget_Keyword_C_SetupIconStyle) == 0x000010, "Wrong alignment on WBP_DecoratorWidget_Keyword_C_SetupIconStyle");
static_assert(sizeof(WBP_DecoratorWidget_Keyword_C_SetupIconStyle) == 0x0001E0, "Wrong size on WBP_DecoratorWidget_Keyword_C_SetupIconStyle");
static_assert(offsetof(WBP_DecoratorWidget_Keyword_C_SetupIconStyle, Temp_byte_Variable) == 0x000000, "Member 'WBP_DecoratorWidget_Keyword_C_SetupIconStyle::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DecoratorWidget_Keyword_C_SetupIconStyle, Temp_byte_Variable_1) == 0x000001, "Member 'WBP_DecoratorWidget_Keyword_C_SetupIconStyle::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_DecoratorWidget_Keyword_C_SetupIconStyle, Temp_byte_Variable_2) == 0x000002, "Member 'WBP_DecoratorWidget_Keyword_C_SetupIconStyle::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_DecoratorWidget_Keyword_C_SetupIconStyle, Temp_byte_Variable_3) == 0x000003, "Member 'WBP_DecoratorWidget_Keyword_C_SetupIconStyle::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_DecoratorWidget_Keyword_C_SetupIconStyle, CallFunc_GetMaxCharacterHeightFromStyle_ReturnValue) == 0x000004, "Member 'WBP_DecoratorWidget_Keyword_C_SetupIconStyle::CallFunc_GetMaxCharacterHeightFromStyle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DecoratorWidget_Keyword_C_SetupIconStyle, Temp_byte_Variable_4) == 0x000008, "Member 'WBP_DecoratorWidget_Keyword_C_SetupIconStyle::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_DecoratorWidget_Keyword_C_SetupIconStyle, Temp_byte_Variable_5) == 0x000009, "Member 'WBP_DecoratorWidget_Keyword_C_SetupIconStyle::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_DecoratorWidget_Keyword_C_SetupIconStyle, K2Node_Select_Default) == 0x00000A, "Member 'WBP_DecoratorWidget_Keyword_C_SetupIconStyle::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_DecoratorWidget_Keyword_C_SetupIconStyle, K2Node_MakeStruct_SlateBrush) == 0x000010, "Member 'WBP_DecoratorWidget_Keyword_C_SetupIconStyle::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(WBP_DecoratorWidget_Keyword_C_SetupIconStyle, K2Node_Select_Default_1) == 0x0000E0, "Member 'WBP_DecoratorWidget_Keyword_C_SetupIconStyle::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_DecoratorWidget_Keyword_C_SetupIconStyle, K2Node_MakeStruct_SlateColor) == 0x0000E4, "Member 'WBP_DecoratorWidget_Keyword_C_SetupIconStyle::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_DecoratorWidget_Keyword_C_SetupIconStyle, K2Node_MakeStruct_SlateBrush_1) == 0x000100, "Member 'WBP_DecoratorWidget_Keyword_C_SetupIconStyle::K2Node_MakeStruct_SlateBrush_1' has a wrong offset!");
static_assert(offsetof(WBP_DecoratorWidget_Keyword_C_SetupIconStyle, CallFunc_IsValid_ReturnValue) == 0x0001D0, "Member 'WBP_DecoratorWidget_Keyword_C_SetupIconStyle::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_DecoratorWidget_Keyword.WBP_DecoratorWidget_Keyword_C.SetupTextStyle
// 0x03C0 (0x03C0 - 0x0000)
struct WBP_DecoratorWidget_Keyword_C_SetupTextStyle final
{
public:
	struct FSlateFontInfo                         local_Font;                                        // 0x0000(0x0060)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FTextBlockStyle                        CallFunc_GetParentStyle_ReturnValue;               // 0x0060(0x0340)(ConstParm)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x03A0(0x0014)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x03B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DecoratorWidget_Keyword_C_SetupTextStyle) == 0x000010, "Wrong alignment on WBP_DecoratorWidget_Keyword_C_SetupTextStyle");
static_assert(sizeof(WBP_DecoratorWidget_Keyword_C_SetupTextStyle) == 0x0003C0, "Wrong size on WBP_DecoratorWidget_Keyword_C_SetupTextStyle");
static_assert(offsetof(WBP_DecoratorWidget_Keyword_C_SetupTextStyle, local_Font) == 0x000000, "Member 'WBP_DecoratorWidget_Keyword_C_SetupTextStyle::local_Font' has a wrong offset!");
static_assert(offsetof(WBP_DecoratorWidget_Keyword_C_SetupTextStyle, CallFunc_GetParentStyle_ReturnValue) == 0x000060, "Member 'WBP_DecoratorWidget_Keyword_C_SetupTextStyle::CallFunc_GetParentStyle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DecoratorWidget_Keyword_C_SetupTextStyle, K2Node_MakeStruct_SlateColor) == 0x0003A0, "Member 'WBP_DecoratorWidget_Keyword_C_SetupTextStyle::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_DecoratorWidget_Keyword_C_SetupTextStyle, CallFunc_IsValid_ReturnValue) == 0x0003B4, "Member 'WBP_DecoratorWidget_Keyword_C_SetupTextStyle::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_DecoratorWidget_Keyword.WBP_DecoratorWidget_Keyword_C.SetupWidget
// 0x0078 (0x0078 - 0x0000)
struct WBP_DecoratorWidget_Keyword_C_SetupWidget final
{
public:
	class FString                                 CallFunc_GetIDString_ReturnValue;                  // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetContentText_ReturnValue;               // 0x0010(0x0010)()
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_RichTextDecorator_KeywordStyle      CallFunc_GetDataTableRowFromName_OutRow;           // 0x0028(0x0048)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DecoratorWidget_Keyword_C_SetupWidget) == 0x000008, "Wrong alignment on WBP_DecoratorWidget_Keyword_C_SetupWidget");
static_assert(sizeof(WBP_DecoratorWidget_Keyword_C_SetupWidget) == 0x000078, "Wrong size on WBP_DecoratorWidget_Keyword_C_SetupWidget");
static_assert(offsetof(WBP_DecoratorWidget_Keyword_C_SetupWidget, CallFunc_GetIDString_ReturnValue) == 0x000000, "Member 'WBP_DecoratorWidget_Keyword_C_SetupWidget::CallFunc_GetIDString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DecoratorWidget_Keyword_C_SetupWidget, CallFunc_GetContentText_ReturnValue) == 0x000010, "Member 'WBP_DecoratorWidget_Keyword_C_SetupWidget::CallFunc_GetContentText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DecoratorWidget_Keyword_C_SetupWidget, CallFunc_Conv_StringToName_ReturnValue) == 0x000020, "Member 'WBP_DecoratorWidget_Keyword_C_SetupWidget::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DecoratorWidget_Keyword_C_SetupWidget, CallFunc_GetDataTableRowFromName_OutRow) == 0x000028, "Member 'WBP_DecoratorWidget_Keyword_C_SetupWidget::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_DecoratorWidget_Keyword_C_SetupWidget, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000070, "Member 'WBP_DecoratorWidget_Keyword_C_SetupWidget::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

}

