#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BattleEffectsBox

#include "Basic.hpp"

#include "E_BuffAndStatusEffectTypes_structs.hpp"
#include "E_StatusEffects_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_BattleEffectsBox.WBP_BattleEffectsBox_C.AddLinkedCharacter
// 0x0028 (0x0028 - 0x0000)
struct WBP_BattleEffectsBox_C_AddLinkedCharacter final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        CharacterBattleStats_0;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UBP_BattleBuffInstance_C* BuffInstance)> K2Node_CreateDelegate_OutputDelegate; // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UBP_BattleBuffInstance_C* BuffInstance)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleEffectsBox_C_AddLinkedCharacter) == 0x000008, "Wrong alignment on WBP_BattleEffectsBox_C_AddLinkedCharacter");
static_assert(sizeof(WBP_BattleEffectsBox_C_AddLinkedCharacter) == 0x000028, "Wrong size on WBP_BattleEffectsBox_C_AddLinkedCharacter");
static_assert(offsetof(WBP_BattleEffectsBox_C_AddLinkedCharacter, CharacterBattleStats_0) == 0x000000, "Member 'WBP_BattleEffectsBox_C_AddLinkedCharacter::CharacterBattleStats_0' has a wrong offset!");
static_assert(offsetof(WBP_BattleEffectsBox_C_AddLinkedCharacter, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_BattleEffectsBox_C_AddLinkedCharacter::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_BattleEffectsBox_C_AddLinkedCharacter, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'WBP_BattleEffectsBox_C_AddLinkedCharacter::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function WBP_BattleEffectsBox.WBP_BattleEffectsBox_C.ShouldBuffBeAdded
// 0x0008 (0x0008 - 0x0000)
struct WBP_BattleEffectsBox_C_ShouldBuffBeAdded final
{
public:
	E_BuffAndStatusEffectTypes                    BuffType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldBeAdded;                                    // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BuffAndStatusEffectTypes                    Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleEffectsBox_C_ShouldBuffBeAdded) == 0x000001, "Wrong alignment on WBP_BattleEffectsBox_C_ShouldBuffBeAdded");
static_assert(sizeof(WBP_BattleEffectsBox_C_ShouldBuffBeAdded) == 0x000008, "Wrong size on WBP_BattleEffectsBox_C_ShouldBuffBeAdded");
static_assert(offsetof(WBP_BattleEffectsBox_C_ShouldBuffBeAdded, BuffType) == 0x000000, "Member 'WBP_BattleEffectsBox_C_ShouldBuffBeAdded::BuffType' has a wrong offset!");
static_assert(offsetof(WBP_BattleEffectsBox_C_ShouldBuffBeAdded, bShouldBeAdded) == 0x000001, "Member 'WBP_BattleEffectsBox_C_ShouldBuffBeAdded::bShouldBeAdded' has a wrong offset!");
static_assert(offsetof(WBP_BattleEffectsBox_C_ShouldBuffBeAdded, Temp_byte_Variable) == 0x000002, "Member 'WBP_BattleEffectsBox_C_ShouldBuffBeAdded::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BattleEffectsBox_C_ShouldBuffBeAdded, Temp_bool_Variable) == 0x000003, "Member 'WBP_BattleEffectsBox_C_ShouldBuffBeAdded::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BattleEffectsBox_C_ShouldBuffBeAdded, Temp_bool_Variable_1) == 0x000004, "Member 'WBP_BattleEffectsBox_C_ShouldBuffBeAdded::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleEffectsBox_C_ShouldBuffBeAdded, Temp_bool_Variable_2) == 0x000005, "Member 'WBP_BattleEffectsBox_C_ShouldBuffBeAdded::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_BattleEffectsBox_C_ShouldBuffBeAdded, CallFunc_Not_PreBool_ReturnValue) == 0x000006, "Member 'WBP_BattleEffectsBox_C_ShouldBuffBeAdded::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleEffectsBox_C_ShouldBuffBeAdded, K2Node_Select_Default) == 0x000007, "Member 'WBP_BattleEffectsBox_C_ShouldBuffBeAdded::K2Node_Select_Default' has a wrong offset!");

// Function WBP_BattleEffectsBox.WBP_BattleEffectsBox_C.OnBuffRemoved
// 0x0020 (0x0020 - 0x0000)
struct WBP_BattleEffectsBox_C_OnBuffRemoved final
{
public:
	class UBP_BattleBuffInstance_C*               BuffInstance;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_jRPG_BuffSlot_C*                   CallFunc_Map_Find_Value;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleEffectsBox_C_OnBuffRemoved) == 0x000008, "Wrong alignment on WBP_BattleEffectsBox_C_OnBuffRemoved");
static_assert(sizeof(WBP_BattleEffectsBox_C_OnBuffRemoved) == 0x000020, "Wrong size on WBP_BattleEffectsBox_C_OnBuffRemoved");
static_assert(offsetof(WBP_BattleEffectsBox_C_OnBuffRemoved, BuffInstance) == 0x000000, "Member 'WBP_BattleEffectsBox_C_OnBuffRemoved::BuffInstance' has a wrong offset!");
static_assert(offsetof(WBP_BattleEffectsBox_C_OnBuffRemoved, CallFunc_Map_Remove_ReturnValue) == 0x000008, "Member 'WBP_BattleEffectsBox_C_OnBuffRemoved::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleEffectsBox_C_OnBuffRemoved, CallFunc_Map_Find_Value) == 0x000010, "Member 'WBP_BattleEffectsBox_C_OnBuffRemoved::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_BattleEffectsBox_C_OnBuffRemoved, CallFunc_Map_Find_ReturnValue) == 0x000018, "Member 'WBP_BattleEffectsBox_C_OnBuffRemoved::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function WBP_BattleEffectsBox.WBP_BattleEffectsBox_C.OnBuffAdded
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_BattleEffectsBox_C_OnBuffAdded final
{
public:
	class UBP_BattleBuffInstance_C*               BuffInstance;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_jRPG_BuffSlot_C*                   CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldBuffBeAdded_bShouldBeAdded;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0070(0x0010)()
	double                                        Temp_real_Variable;                                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_2;                              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default_1;                           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Contains_ReturnValue;                 // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleEffectsBox_C_OnBuffAdded) == 0x000008, "Wrong alignment on WBP_BattleEffectsBox_C_OnBuffAdded");
static_assert(sizeof(WBP_BattleEffectsBox_C_OnBuffAdded) == 0x0000E8, "Wrong size on WBP_BattleEffectsBox_C_OnBuffAdded");
static_assert(offsetof(WBP_BattleEffectsBox_C_OnBuffAdded, BuffInstance) == 0x000000, "Member 'WBP_BattleEffectsBox_C_OnBuffAdded::BuffInstance' has a wrong offset!");
static_assert(offsetof(WBP_BattleEffectsBox_C_OnBuffAdded, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_BattleEffectsBox_C_OnBuffAdded::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleEffectsBox_C_OnBuffAdded, CallFunc_ShouldBuffBeAdded_bShouldBeAdded) == 0x000010, "Member 'WBP_BattleEffectsBox_C_OnBuffAdded::CallFunc_ShouldBuffBeAdded_bShouldBeAdded' has a wrong offset!");
static_assert(offsetof(WBP_BattleEffectsBox_C_OnBuffAdded, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'WBP_BattleEffectsBox_C_OnBuffAdded::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_BattleEffectsBox_C_OnBuffAdded, K2Node_MakeArray_Array) == 0x000060, "Member 'WBP_BattleEffectsBox_C_OnBuffAdded::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_BattleEffectsBox_C_OnBuffAdded, CallFunc_Format_ReturnValue) == 0x000070, "Member 'WBP_BattleEffectsBox_C_OnBuffAdded::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleEffectsBox_C_OnBuffAdded, Temp_real_Variable) == 0x000080, "Member 'WBP_BattleEffectsBox_C_OnBuffAdded::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BattleEffectsBox_C_OnBuffAdded, CallFunc_AddChild_ReturnValue) == 0x000088, "Member 'WBP_BattleEffectsBox_C_OnBuffAdded::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleEffectsBox_C_OnBuffAdded, Temp_real_Variable_1) == 0x000090, "Member 'WBP_BattleEffectsBox_C_OnBuffAdded::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleEffectsBox_C_OnBuffAdded, Temp_bool_Variable) == 0x000098, "Member 'WBP_BattleEffectsBox_C_OnBuffAdded::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BattleEffectsBox_C_OnBuffAdded, Temp_real_Variable_2) == 0x0000A0, "Member 'WBP_BattleEffectsBox_C_OnBuffAdded::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_BattleEffectsBox_C_OnBuffAdded, K2Node_Select_Default) == 0x0000A8, "Member 'WBP_BattleEffectsBox_C_OnBuffAdded::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_BattleEffectsBox_C_OnBuffAdded, Temp_real_Variable_3) == 0x0000B0, "Member 'WBP_BattleEffectsBox_C_OnBuffAdded::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_BattleEffectsBox_C_OnBuffAdded, Temp_bool_Variable_1) == 0x0000B8, "Member 'WBP_BattleEffectsBox_C_OnBuffAdded::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleEffectsBox_C_OnBuffAdded, K2Node_Select_Default_1) == 0x0000C0, "Member 'WBP_BattleEffectsBox_C_OnBuffAdded::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleEffectsBox_C_OnBuffAdded, CallFunc_Map_Contains_ReturnValue) == 0x0000C8, "Member 'WBP_BattleEffectsBox_C_OnBuffAdded::CallFunc_Map_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleEffectsBox_C_OnBuffAdded, CallFunc_MakeVector2D_ReturnValue) == 0x0000D0, "Member 'WBP_BattleEffectsBox_C_OnBuffAdded::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleEffectsBox_C_OnBuffAdded, CallFunc_Not_PreBool_ReturnValue) == 0x0000E0, "Member 'WBP_BattleEffectsBox_C_OnBuffAdded::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_BattleEffectsBox.WBP_BattleEffectsBox_C.SetCharacterBattleStats
// 0x0028 (0x0028 - 0x0000)
struct WBP_BattleEffectsBox_C_SetCharacterBattleStats final
{
public:
	class UAC_jRPG_CharacterBattleStats_C*        InCharacterBattleStats;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UBP_BattleBuffInstance_C* BuffInstance)> K2Node_CreateDelegate_OutputDelegate; // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UBP_BattleBuffInstance_C* BuffInstance)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleEffectsBox_C_SetCharacterBattleStats) == 0x000008, "Wrong alignment on WBP_BattleEffectsBox_C_SetCharacterBattleStats");
static_assert(sizeof(WBP_BattleEffectsBox_C_SetCharacterBattleStats) == 0x000028, "Wrong size on WBP_BattleEffectsBox_C_SetCharacterBattleStats");
static_assert(offsetof(WBP_BattleEffectsBox_C_SetCharacterBattleStats, InCharacterBattleStats) == 0x000000, "Member 'WBP_BattleEffectsBox_C_SetCharacterBattleStats::InCharacterBattleStats' has a wrong offset!");
static_assert(offsetof(WBP_BattleEffectsBox_C_SetCharacterBattleStats, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_BattleEffectsBox_C_SetCharacterBattleStats::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_BattleEffectsBox_C_SetCharacterBattleStats, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'WBP_BattleEffectsBox_C_SetCharacterBattleStats::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function WBP_BattleEffectsBox.WBP_BattleEffectsBox_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_BattleEffectsBox_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleEffectsBox_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_BattleEffectsBox_C_PreConstruct");
static_assert(sizeof(WBP_BattleEffectsBox_C_PreConstruct) == 0x000001, "Wrong size on WBP_BattleEffectsBox_C_PreConstruct");
static_assert(offsetof(WBP_BattleEffectsBox_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_BattleEffectsBox_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_BattleEffectsBox.WBP_BattleEffectsBox_C.ExecuteUbergraph_WBP_BattleEffectsBox
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_BattleEffectsBox_C_ExecuteUbergraph_WBP_BattleEffectsBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_2;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x1];                                       // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_StatusEffects                               CallFunc_Array_Get_Item;                           // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetStatusEffectBuffClass_BP_Class;        // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_BattleBuffInstance_C*               CallFunc_SpawnObject_ReturnValue;                  // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_1;                           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_VariableSet_WrapSize_ImplicitCast;          // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleEffectsBox_C_ExecuteUbergraph_WBP_BattleEffectsBox) == 0x000008, "Wrong alignment on WBP_BattleEffectsBox_C_ExecuteUbergraph_WBP_BattleEffectsBox");
static_assert(sizeof(WBP_BattleEffectsBox_C_ExecuteUbergraph_WBP_BattleEffectsBox) == 0x0000C8, "Wrong size on WBP_BattleEffectsBox_C_ExecuteUbergraph_WBP_BattleEffectsBox");
static_assert(offsetof(WBP_BattleEffectsBox_C_ExecuteUbergraph_WBP_BattleEffectsBox, EntryPoint) == 0x000000, "Member 'WBP_BattleEffectsBox_C_ExecuteUbergraph_WBP_BattleEffectsBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_BattleEffectsBox_C_ExecuteUbergraph_WBP_BattleEffectsBox, Temp_bool_Variable) == 0x000004, "Member 'WBP_BattleEffectsBox_C_ExecuteUbergraph_WBP_BattleEffectsBox::Temp_bool_Variable' has a wrong offset!");
