#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlatformPauseModal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PlatformPauseModal.WBP_PlatformPauseModal_C
// 0x0020 (0x0450 - 0x0430)
class UWBP_PlatformPauseModal_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonLazyImage*                       Background;                                        // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                InputGuard;                                        // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ModalSizeBox;                                      // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	void BP_OnDeactivated();
	void ExecuteUbergraph_WBP_PlatformPauseModal(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PlatformPauseModal_C">();
	}
	static class UWBP_PlatformPauseModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PlatformPauseModal_C>();
	}
};
static_assert(alignof(UWBP_PlatformPauseModal_C) == 0x000008, "Wrong alignment on UWBP_PlatformPauseModal_C");
static_assert(sizeof(UWBP_PlatformPauseModal_C) == 0x000450, "Wrong size on UWBP_PlatformPauseModal_C");
static_assert(offsetof(UWBP_PlatformPauseModal_C, UberGraphFrame) == 0x000430, "Member 'UWBP_PlatformPauseModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PlatformPauseModal_C, Background) == 0x000438, "Member 'UWBP_PlatformPauseModal_C::Background' has a wrong offset!");
static_assert(offsetof(UWBP_PlatformPauseModal_C, InputGuard) == 0x000440, "Member 'UWBP_PlatformPauseModal_C::InputGuard' has a wrong offset!");
static_assert(offsetof(UWBP_PlatformPauseModal_C, ModalSizeBox) == 0x000448, "Member 'UWBP_PlatformPauseModal_C::ModalSizeBox' has a wrong offset!");

}

