#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BreakBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BreakBar.WBP_BreakBar_C
// 0x0050 (0x0330 - 0x02E0)
class UWBP_BreakBar_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Increase;                                     // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               CursorBox;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Glow;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_BreakBar;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Cursor_BreakBar_C*                 WBP_Cursor_BreakBar;                               // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        FillProgress;                                      // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AnimationProgress;                                 // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	double                                        InitialFillProgress;                               // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TargetFillProgress;                                // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimateFillProgress(double TargetProgress);
	void Construct();
	void ExecuteUbergraph_WBP_BreakBar(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void RefreshProgress();
	void SetAnimationProgress(double TargetFillProgress_0);
	void SetFillProgress(double FillProgress_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BreakBar_C">();
	}
	static class UWBP_BreakBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BreakBar_C>();
	}
};
static_assert(alignof(UWBP_BreakBar_C) == 0x000008, "Wrong alignment on UWBP_BreakBar_C");
static_assert(sizeof(UWBP_BreakBar_C) == 0x000330, "Wrong size on UWBP_BreakBar_C");
static_assert(offsetof(UWBP_BreakBar_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_BreakBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_BreakBar_C, Anim_Increase) == 0x0002E8, "Member 'UWBP_BreakBar_C::Anim_Increase' has a wrong offset!");
static_assert(offsetof(UWBP_BreakBar_C, CursorBox) == 0x0002F0, "Member 'UWBP_BreakBar_C::CursorBox' has a wrong offset!");
static_assert(offsetof(UWBP_BreakBar_C, Image_Glow) == 0x0002F8, "Member 'UWBP_BreakBar_C::Image_Glow' has a wrong offset!");
static_assert(offsetof(UWBP_BreakBar_C, ProgressBar_BreakBar) == 0x000300, "Member 'UWBP_BreakBar_C::ProgressBar_BreakBar' has a wrong offset!");
static_assert(offsetof(UWBP_BreakBar_C, WBP_Cursor_BreakBar) == 0x000308, "Member 'UWBP_BreakBar_C::WBP_Cursor_BreakBar' has a wrong offset!");
static_assert(offsetof(UWBP_BreakBar_C, FillProgress) == 0x000310, "Member 'UWBP_BreakBar_C::FillProgress' has a wrong offset!");
static_assert(offsetof(UWBP_BreakBar_C, AnimationProgress) == 0x000318, "Member 'UWBP_BreakBar_C::AnimationProgress' has a wrong offset!");
static_assert(offsetof(UWBP_BreakBar_C, InitialFillProgress) == 0x000320, "Member 'UWBP_BreakBar_C::InitialFillProgress' has a wrong offset!");
static_assert(offsetof(UWBP_BreakBar_C, TargetFillProgress) == 0x000328, "Member 'UWBP_BreakBar_C::TargetFillProgress' has a wrong offset!");

}

