#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FullScreenNotification_RelationshipUp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SandFall_structs.hpp"
#include "WBP_FullScreenNotification_Generic_classes.hpp"
#include "E_CharacterList_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_FullScreenNotification_RelationshipUp.WBP_FullScreenNotification_RelationshipUp_C
// 0x0078 (0x0518 - 0x04A0)
class UWBP_FullScreenNotification_RelationshipUp_C final : public UWBP_FullScreenNotification_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_FullScreenNotification_RelationshipUp_C; // 0x04A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_ShowTextOverride;                             // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_ShowPromptOverride;                           // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_WrappingText_C*                    CharacterName;                                     // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GM_PromptGeneric_C*                ConfirmPromptOverride;                             // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   FX_Petals;                                         // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   FX_SmokeExplosion;                                 // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WrappingText_C*                    NotificationHeaderOverride;                        // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RelationshipNumber_C*              RelationshipNumber;                                // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSoundEventDataTableRowHandle          RelationUpSound;                                   // 0x04E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FSoundEventDataTableRowHandle          SD_RDUp;                                           // 0x04F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FSoundEventDataTableRowHandle          SD_RDMax;                                          // 0x0508(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void BndEvt__WBP_FullScreenNotification_Generic_ConfirmPrompt_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void Construct();
	void ExecuteUbergraph_WBP_FullScreenNotification_RelationshipUp(int32 EntryPoint);
	void GetCharacterDisplayName(E_CharacterList Character, class FText* CharacterDisplayName);
	void InitializeWidgetFromCharacter(E_CharacterList Character);
	void LoadNotification(class UBP_DataAsset_FullscreenNotification_C* NotificationData);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void PreConstruct(bool IsDesignTime);
	void ShowConfirmPrompt();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_FullScreenNotification_RelationshipUp_C">();
	}
	static class UWBP_FullScreenNotification_RelationshipUp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_FullScreenNotification_RelationshipUp_C>();
	}
};
static_assert(alignof(UWBP_FullScreenNotification_RelationshipUp_C) == 0x000008, "Wrong alignment on UWBP_FullScreenNotification_RelationshipUp_C");
static_assert(sizeof(UWBP_FullScreenNotification_RelationshipUp_C) == 0x000518, "Wrong size on UWBP_FullScreenNotification_RelationshipUp_C");
static_assert(offsetof(UWBP_FullScreenNotification_RelationshipUp_C, UberGraphFrame_WBP_FullScreenNotification_RelationshipUp_C) == 0x0004A0, "Member 'UWBP_FullScreenNotification_RelationshipUp_C::UberGraphFrame_WBP_FullScreenNotification_RelationshipUp_C' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenNotification_RelationshipUp_C, Anim_ShowTextOverride) == 0x0004A8, "Member 'UWBP_FullScreenNotification_RelationshipUp_C::Anim_ShowTextOverride' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenNotification_RelationshipUp_C, Anim_ShowPromptOverride) == 0x0004B0, "Member 'UWBP_FullScreenNotification_RelationshipUp_C::Anim_ShowPromptOverride' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenNotification_RelationshipUp_C, CharacterName) == 0x0004B8, "Member 'UWBP_FullScreenNotification_RelationshipUp_C::CharacterName' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenNotification_RelationshipUp_C, ConfirmPromptOverride) == 0x0004C0, "Member 'UWBP_FullScreenNotification_RelationshipUp_C::ConfirmPromptOverride' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenNotification_RelationshipUp_C, FX_Petals) == 0x0004C8, "Member 'UWBP_FullScreenNotification_RelationshipUp_C::FX_Petals' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenNotification_RelationshipUp_C, FX_SmokeExplosion) == 0x0004D0, "Member 'UWBP_FullScreenNotification_RelationshipUp_C::FX_SmokeExplosion' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenNotification_RelationshipUp_C, NotificationHeaderOverride) == 0x0004D8, "Member 'UWBP_FullScreenNotification_RelationshipUp_C::NotificationHeaderOverride' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenNotification_RelationshipUp_C, RelationshipNumber) == 0x0004E0, "Member 'UWBP_FullScreenNotification_RelationshipUp_C::RelationshipNumber' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenNotification_RelationshipUp_C, RelationUpSound) == 0x0004E8, "Member 'UWBP_FullScreenNotification_RelationshipUp_C::RelationUpSound' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenNotification_RelationshipUp_C, SD_RDUp) == 0x0004F8, "Member 'UWBP_FullScreenNotification_RelationshipUp_C::SD_RDUp' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenNotification_RelationshipUp_C, SD_RDMax) == 0x000508, "Member 'UWBP_FullScreenNotification_RelationshipUp_C::SD_RDMax' has a wrong offset!");

}

