#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharacterShieldCounter

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_CharacterShieldCounter.WBP_CharacterShieldCounter_C.ExecuteUbergraph_WBP_CharacterShieldCounter
// 0x0038 (0x0038 - 0x0000)
struct WBP_CharacterShieldCounter_C_ExecuteUbergraph_WBP_CharacterShieldCounter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterShieldCounter_C_ExecuteUbergraph_WBP_CharacterShieldCounter) == 0x000008, "Wrong alignment on WBP_CharacterShieldCounter_C_ExecuteUbergraph_WBP_CharacterShieldCounter");
static_assert(sizeof(WBP_CharacterShieldCounter_C_ExecuteUbergraph_WBP_CharacterShieldCounter) == 0x000038, "Wrong size on WBP_CharacterShieldCounter_C_ExecuteUbergraph_WBP_CharacterShieldCounter");
static_assert(offsetof(WBP_CharacterShieldCounter_C_ExecuteUbergraph_WBP_CharacterShieldCounter, EntryPoint) == 0x000000, "Member 'WBP_CharacterShieldCounter_C_ExecuteUbergraph_WBP_CharacterShieldCounter::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CharacterShieldCounter_C_ExecuteUbergraph_WBP_CharacterShieldCounter, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_CharacterShieldCounter_C_ExecuteUbergraph_WBP_CharacterShieldCounter::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CharacterShieldCounter_C_ExecuteUbergraph_WBP_CharacterShieldCounter, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'WBP_CharacterShieldCounter_C_ExecuteUbergraph_WBP_CharacterShieldCounter::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterShieldCounter_C_ExecuteUbergraph_WBP_CharacterShieldCounter, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000020, "Member 'WBP_CharacterShieldCounter_C_ExecuteUbergraph_WBP_CharacterShieldCounter::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_CharacterShieldCounter_C_ExecuteUbergraph_WBP_CharacterShieldCounter, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000028, "Member 'WBP_CharacterShieldCounter_C_ExecuteUbergraph_WBP_CharacterShieldCounter::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterShieldCounter_C_ExecuteUbergraph_WBP_CharacterShieldCounter, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_CharacterShieldCounter_C_ExecuteUbergraph_WBP_CharacterShieldCounter::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_CharacterShieldCounter.WBP_CharacterShieldCounter_C.SetShieldCounter
// 0x0030 (0x0030 - 0x0000)
struct WBP_CharacterShieldCounter_C_SetShieldCounter final
{
public:
	int32                                         InShieldCount;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_1;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterShieldCounter_C_SetShieldCounter) == 0x000008, "Wrong alignment on WBP_CharacterShieldCounter_C_SetShieldCounter");
static_assert(sizeof(WBP_CharacterShieldCounter_C_SetShieldCounter) == 0x000030, "Wrong size on WBP_CharacterShieldCounter_C_SetShieldCounter");
static_assert(offsetof(WBP_CharacterShieldCounter_C_SetShieldCounter, InShieldCount) == 0x000000, "Member 'WBP_CharacterShieldCounter_C_SetShieldCounter::InShieldCount' has a wrong offset!");
static_assert(offsetof(WBP_CharacterShieldCounter_C_SetShieldCounter, Temp_byte_Variable) == 0x000004, "Member 'WBP_CharacterShieldCounter_C_SetShieldCounter::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterShieldCounter_C_SetShieldCounter, CallFunc_Greater_IntInt_ReturnValue) == 0x000005, "Member 'WBP_CharacterShieldCounter_C_SetShieldCounter::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterShieldCounter_C_SetShieldCounter, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_CharacterShieldCounter_C_SetShieldCounter::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterShieldCounter_C_SetShieldCounter, Temp_byte_Variable_1) == 0x000018, "Member 'WBP_CharacterShieldCounter_C_SetShieldCounter::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterShieldCounter_C_SetShieldCounter, Temp_bool_Variable) == 0x000019, "Member 'WBP_CharacterShieldCounter_C_SetShieldCounter::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterShieldCounter_C_SetShieldCounter, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00001A, "Member 'WBP_CharacterShieldCounter_C_SetShieldCounter::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterShieldCounter_C_SetShieldCounter, K2Node_Select_Default) == 0x00001B, "Member 'WBP_CharacterShieldCounter_C_SetShieldCounter::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CharacterShieldCounter_C_SetShieldCounter, Temp_bool_Variable_1) == 0x00001C, "Member 'WBP_CharacterShieldCounter_C_SetShieldCounter::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterShieldCounter_C_SetShieldCounter, K2Node_Select_Default_1) == 0x000020, "Member 'WBP_CharacterShieldCounter_C_SetShieldCounter::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterShieldCounter_C_SetShieldCounter, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'WBP_CharacterShieldCounter_C_SetShieldCounter::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

