#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DialogNotifBox

#include "Basic.hpp"

#include "S_DialogueLine_structs.hpp"
#include "Engine_structs.hpp"
#include "FInWorldDialogue_CharacterProfile_structs.hpp"
#include "E_DialoguesPortraitsType_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_DialogNotifBox.WBP_DialogNotifBox_C.DEBUG_SanitizeForTextToSpeech
// 0x0090 (0x0090 - 0x0000)
struct WBP_DialogNotifBox_C_DEBUG_SanitizeForTextToSpeech final
{
public:
	class FString                                 SourceString;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 SanitizedSpokenText;                               // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 SanitizedForWordCount;                             // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue_1;                    // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue_2;                    // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue_3;                    // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue_4;                    // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue_5;                    // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogNotifBox_C_DEBUG_SanitizeForTextToSpeech) == 0x000008, "Wrong alignment on WBP_DialogNotifBox_C_DEBUG_SanitizeForTextToSpeech");
static_assert(sizeof(WBP_DialogNotifBox_C_DEBUG_SanitizeForTextToSpeech) == 0x000090, "Wrong size on WBP_DialogNotifBox_C_DEBUG_SanitizeForTextToSpeech");
static_assert(offsetof(WBP_DialogNotifBox_C_DEBUG_SanitizeForTextToSpeech, SourceString) == 0x000000, "Member 'WBP_DialogNotifBox_C_DEBUG_SanitizeForTextToSpeech::SourceString' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_DEBUG_SanitizeForTextToSpeech, SanitizedSpokenText) == 0x000010, "Member 'WBP_DialogNotifBox_C_DEBUG_SanitizeForTextToSpeech::SanitizedSpokenText' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_DEBUG_SanitizeForTextToSpeech, SanitizedForWordCount) == 0x000020, "Member 'WBP_DialogNotifBox_C_DEBUG_SanitizeForTextToSpeech::SanitizedForWordCount' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_DEBUG_SanitizeForTextToSpeech, CallFunc_Replace_ReturnValue) == 0x000030, "Member 'WBP_DialogNotifBox_C_DEBUG_SanitizeForTextToSpeech::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_DEBUG_SanitizeForTextToSpeech, CallFunc_Replace_ReturnValue_1) == 0x000040, "Member 'WBP_DialogNotifBox_C_DEBUG_SanitizeForTextToSpeech::CallFunc_Replace_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_DEBUG_SanitizeForTextToSpeech, CallFunc_Replace_ReturnValue_2) == 0x000050, "Member 'WBP_DialogNotifBox_C_DEBUG_SanitizeForTextToSpeech::CallFunc_Replace_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_DEBUG_SanitizeForTextToSpeech, CallFunc_Replace_ReturnValue_3) == 0x000060, "Member 'WBP_DialogNotifBox_C_DEBUG_SanitizeForTextToSpeech::CallFunc_Replace_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_DEBUG_SanitizeForTextToSpeech, CallFunc_Replace_ReturnValue_4) == 0x000070, "Member 'WBP_DialogNotifBox_C_DEBUG_SanitizeForTextToSpeech::CallFunc_Replace_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_DEBUG_SanitizeForTextToSpeech, CallFunc_Replace_ReturnValue_5) == 0x000080, "Member 'WBP_DialogNotifBox_C_DEBUG_SanitizeForTextToSpeech::CallFunc_Replace_ReturnValue_5' has a wrong offset!");

// Function WBP_DialogNotifBox.WBP_DialogNotifBox_C.ExecuteUbergraph_WBP_DialogNotifBox
// 0x0188 (0x0188 - 0x0000)
struct WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Paused;                               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_DialogueLine                        CallFunc_GetCurrentLine_Output;                    // 0x0008(0x0058)(HasGetValueTypeHash)
	struct FS_DialogueLine                        CallFunc_GetCurrentLine_Output_1;                  // 0x0060(0x0058)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_World_C*             K2Node_DynamicCast_AsBP_J_RPG_Character_World;     // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_DialogNotifLine_C*                 CallFunc_SpawnObject_ReturnValue;                  // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextToSpeechEngineSubsystem*           CallFunc_GetTextToSpeechEngineSubsystem_ReturnValue; // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_DialogueLine                        CallFunc_GetCurrentLine_Output_2;                  // 0x00F0(0x0058)(HasGetValueTypeHash)
	bool                                          CallFunc_IsSpeakingOnChannel_ReturnValue;          // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Copy_ReturnValue;                           // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox) == 0x000008, "Wrong alignment on WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox");
static_assert(sizeof(WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox) == 0x000188, "Wrong size on WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox");
static_assert(offsetof(WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox, EntryPoint) == 0x000000, "Member 'WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox, K2Node_Event_Paused) == 0x000004, "Member 'WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox::K2Node_Event_Paused' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox, CallFunc_GetCurrentLine_Output) == 0x000008, "Member 'WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox::CallFunc_GetCurrentLine_Output' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox, CallFunc_GetCurrentLine_Output_1) == 0x000060, "Member 'WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox::CallFunc_GetCurrentLine_Output_1' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox, CallFunc_GetPlayerCharacter_ReturnValue) == 0x0000C0, "Member 'WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox, K2Node_DynamicCast_AsBP_J_RPG_Character_World) == 0x0000C8, "Member 'WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox::K2Node_DynamicCast_AsBP_J_RPG_Character_World' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox, CallFunc_SpawnObject_ReturnValue) == 0x0000D8, "Member 'WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox, CallFunc_MakeLiteralName_ReturnValue) == 0x0000E0, "Member 'WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox, CallFunc_GetTextToSpeechEngineSubsystem_ReturnValue) == 0x0000E8, "Member 'WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox::CallFunc_GetTextToSpeechEngineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox, CallFunc_GetCurrentLine_Output_2) == 0x0000F0, "Member 'WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox::CallFunc_GetCurrentLine_Output_2' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox, CallFunc_IsSpeakingOnChannel_ReturnValue) == 0x000148, "Member 'WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox::CallFunc_IsSpeakingOnChannel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox, CallFunc_Conv_TextToString_ReturnValue) == 0x000150, "Member 'WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox, CallFunc_Replace_ReturnValue) == 0x000160, "Member 'WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox, K2Node_Copy_ReturnValue) == 0x000170, "Member 'WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox::K2Node_Copy_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox, CallFunc_Not_PreBool_ReturnValue) == 0x000180, "Member 'WBP_DialogNotifBox_C_ExecuteUbergraph_WBP_DialogNotifBox::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_DialogNotifBox.WBP_DialogNotifBox_C.GetCurrentLine
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_DialogNotifBox_C_GetCurrentLine final
{
public:
	struct FS_DialogueLine                        Output;                                            // 0x0000(0x0058)(Parm, OutParm, HasGetValueTypeHash)
	struct FS_DialogueLine                        CallFunc_Array_Get_Item;                           // 0x0058(0x0058)(HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogNotifBox_C_GetCurrentLine) == 0x000008, "Wrong alignment on WBP_DialogNotifBox_C_GetCurrentLine");
static_assert(sizeof(WBP_DialogNotifBox_C_GetCurrentLine) == 0x0000B0, "Wrong size on WBP_DialogNotifBox_C_GetCurrentLine");
static_assert(offsetof(WBP_DialogNotifBox_C_GetCurrentLine, Output) == 0x000000, "Member 'WBP_DialogNotifBox_C_GetCurrentLine::Output' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_GetCurrentLine, CallFunc_Array_Get_Item) == 0x000058, "Member 'WBP_DialogNotifBox_C_GetCurrentLine::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WBP_DialogNotifBox.WBP_DialogNotifBox_C.GetInWorldDialogueInPlay
// 0x0008 (0x0008 - 0x0000)
struct WBP_DialogNotifBox_C_GetInWorldDialogueInPlay final
{
public:
	class UBP_DA_IWD_data_C*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogNotifBox_C_GetInWorldDialogueInPlay) == 0x000008, "Wrong alignment on WBP_DialogNotifBox_C_GetInWorldDialogueInPlay");
static_assert(sizeof(WBP_DialogNotifBox_C_GetInWorldDialogueInPlay) == 0x000008, "Wrong size on WBP_DialogNotifBox_C_GetInWorldDialogueInPlay");
static_assert(offsetof(WBP_DialogNotifBox_C_GetInWorldDialogueInPlay, ReturnValue) == 0x000000, "Member 'WBP_DialogNotifBox_C_GetInWorldDialogueInPlay::ReturnValue' has a wrong offset!");

// Function WBP_DialogNotifBox.WBP_DialogNotifBox_C.InterruptDialog
// 0x0001 (0x0001 - 0x0000)
struct WBP_DialogNotifBox_C_InterruptDialog final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogNotifBox_C_InterruptDialog) == 0x000001, "Wrong alignment on WBP_DialogNotifBox_C_InterruptDialog");
static_assert(sizeof(WBP_DialogNotifBox_C_InterruptDialog) == 0x000001, "Wrong size on WBP_DialogNotifBox_C_InterruptDialog");
static_assert(offsetof(WBP_DialogNotifBox_C_InterruptDialog, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_DialogNotifBox_C_InterruptDialog::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_DialogNotifBox.WBP_DialogNotifBox_C.OnAllDialogueLinesFinished
// 0x0020 (0x0020 - 0x0000)
struct WBP_DialogNotifBox_C_OnAllDialogueLinesFinished final
{
public:
	bool                                          PlayDisappearAnimation;                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogNotifBox_C_OnAllDialogueLinesFinished) == 0x000008, "Wrong alignment on WBP_DialogNotifBox_C_OnAllDialogueLinesFinished");
static_assert(sizeof(WBP_DialogNotifBox_C_OnAllDialogueLinesFinished) == 0x000020, "Wrong size on WBP_DialogNotifBox_C_OnAllDialogueLinesFinished");
static_assert(offsetof(WBP_DialogNotifBox_C_OnAllDialogueLinesFinished, PlayDisappearAnimation) == 0x000000, "Member 'WBP_DialogNotifBox_C_OnAllDialogueLinesFinished::PlayDisappearAnimation' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_OnAllDialogueLinesFinished, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_DialogNotifBox_C_OnAllDialogueLinesFinished::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_OnAllDialogueLinesFinished, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000018, "Member 'WBP_DialogNotifBox_C_OnAllDialogueLinesFinished::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

// Function WBP_DialogNotifBox.WBP_DialogNotifBox_C.OnDialogLineFinished
// 0x0018 (0x0018 - 0x0000)
struct WBP_DialogNotifBox_C_OnDialogLineFinished final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogNotifBox_C_OnDialogLineFinished) == 0x000008, "Wrong alignment on WBP_DialogNotifBox_C_OnDialogLineFinished");
static_assert(sizeof(WBP_DialogNotifBox_C_OnDialogLineFinished) == 0x000018, "Wrong size on WBP_DialogNotifBox_C_OnDialogLineFinished");
static_assert(offsetof(WBP_DialogNotifBox_C_OnDialogLineFinished, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_DialogNotifBox_C_OnDialogLineFinished::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_OnDialogLineFinished, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000010, "Member 'WBP_DialogNotifBox_C_OnDialogLineFinished::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function WBP_DialogNotifBox.WBP_DialogNotifBox_C.OnDialogueLineFinishedTimerEnd
// 0x0028 (0x0028 - 0x0000)
struct WBP_DialogNotifBox_C_OnDialogueLineFinishedTimerEnd final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_World_C*             K2Node_DynamicCast_AsBP_J_RPG_Character_World;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogNotifBox_C_OnDialogueLineFinishedTimerEnd) == 0x000008, "Wrong alignment on WBP_DialogNotifBox_C_OnDialogueLineFinishedTimerEnd");
static_assert(sizeof(WBP_DialogNotifBox_C_OnDialogueLineFinishedTimerEnd) == 0x000028, "Wrong size on WBP_DialogNotifBox_C_OnDialogueLineFinishedTimerEnd");
static_assert(offsetof(WBP_DialogNotifBox_C_OnDialogueLineFinishedTimerEnd, Temp_int_Variable) == 0x000000, "Member 'WBP_DialogNotifBox_C_OnDialogueLineFinishedTimerEnd::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_OnDialogueLineFinishedTimerEnd, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WBP_DialogNotifBox_C_OnDialogueLineFinishedTimerEnd::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_OnDialogueLineFinishedTimerEnd, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000008, "Member 'WBP_DialogNotifBox_C_OnDialogueLineFinishedTimerEnd::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_OnDialogueLineFinishedTimerEnd, K2Node_DynamicCast_AsBP_J_RPG_Character_World) == 0x000010, "Member 'WBP_DialogNotifBox_C_OnDialogueLineFinishedTimerEnd::K2Node_DynamicCast_AsBP_J_RPG_Character_World' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_OnDialogueLineFinishedTimerEnd, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_DialogNotifBox_C_OnDialogueLineFinishedTimerEnd::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_OnDialogueLineFinishedTimerEnd, CallFunc_Array_LastIndex_ReturnValue) == 0x00001C, "Member 'WBP_DialogNotifBox_C_OnDialogueLineFinishedTimerEnd::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_OnDialogueLineFinishedTimerEnd, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000020, "Member 'WBP_DialogNotifBox_C_OnDialogueLineFinishedTimerEnd::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_DialogNotifBox.WBP_DialogNotifBox_C.OnDisappearAnimationFinished
// 0x0010 (0x0010 - 0x0000)
struct WBP_DialogNotifBox_C_OnDisappearAnimationFinished final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogNotifBox_C_OnDisappearAnimationFinished) == 0x000004, "Wrong alignment on WBP_DialogNotifBox_C_OnDisappearAnimationFinished");
static_assert(sizeof(WBP_DialogNotifBox_C_OnDisappearAnimationFinished) == 0x000010, "Wrong size on WBP_DialogNotifBox_C_OnDisappearAnimationFinished");
static_assert(offsetof(WBP_DialogNotifBox_C_OnDisappearAnimationFinished, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_DialogNotifBox_C_OnDisappearAnimationFinished::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_DialogNotifBox.WBP_DialogNotifBox_C.PlayDialogueLineAudio
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_DialogNotifBox_C_PlayDialogueLineAudio final
{
public:
	class USoundBase*                             Sound;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_DialogueLine                        CallFunc_GetCurrentLine_Output;                    // 0x0008(0x0058)(HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0064(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0098(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Option_1_ImplicitCast;               // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogNotifBox_C_PlayDialogueLineAudio) == 0x000008, "Wrong alignment on WBP_DialogNotifBox_C_PlayDialogueLineAudio");
static_assert(sizeof(WBP_DialogNotifBox_C_PlayDialogueLineAudio) == 0x0000B0, "Wrong size on WBP_DialogNotifBox_C_PlayDialogueLineAudio");
static_assert(offsetof(WBP_DialogNotifBox_C_PlayDialogueLineAudio, Sound) == 0x000000, "Member 'WBP_DialogNotifBox_C_PlayDialogueLineAudio::Sound' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_PlayDialogueLineAudio, CallFunc_GetCurrentLine_Output) == 0x000008, "Member 'WBP_DialogNotifBox_C_PlayDialogueLineAudio::CallFunc_GetCurrentLine_Output' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_PlayDialogueLineAudio, Temp_bool_Variable) == 0x000060, "Member 'WBP_DialogNotifBox_C_PlayDialogueLineAudio::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_PlayDialogueLineAudio, K2Node_CreateDelegate_OutputDelegate) == 0x000064, "Member 'WBP_DialogNotifBox_C_PlayDialogueLineAudio::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_PlayDialogueLineAudio, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000078, "Member 'WBP_DialogNotifBox_C_PlayDialogueLineAudio::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_PlayDialogueLineAudio, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000080, "Member 'WBP_DialogNotifBox_C_PlayDialogueLineAudio::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_PlayDialogueLineAudio, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000088, "Member 'WBP_DialogNotifBox_C_PlayDialogueLineAudio::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_PlayDialogueLineAudio, K2Node_Select_Default) == 0x000090, "Member 'WBP_DialogNotifBox_C_PlayDialogueLineAudio::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_PlayDialogueLineAudio, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000098, "Member 'WBP_DialogNotifBox_C_PlayDialogueLineAudio::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_PlayDialogueLineAudio, K2Node_Select_Option_1_ImplicitCast) == 0x0000A0, "Member 'WBP_DialogNotifBox_C_PlayDialogueLineAudio::K2Node_Select_Option_1_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_PlayDialogueLineAudio, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x0000A8, "Member 'WBP_DialogNotifBox_C_PlayDialogueLineAudio::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function WBP_DialogNotifBox.WBP_DialogNotifBox_C.SetDialogPaused
// 0x0004 (0x0004 - 0x0000)
struct WBP_DialogNotifBox_C_SetDialogPaused final
{
public:
	bool                                          Paused;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogNotifBox_C_SetDialogPaused) == 0x000001, "Wrong alignment on WBP_DialogNotifBox_C_SetDialogPaused");
static_assert(sizeof(WBP_DialogNotifBox_C_SetDialogPaused) == 0x000004, "Wrong size on WBP_DialogNotifBox_C_SetDialogPaused");
static_assert(offsetof(WBP_DialogNotifBox_C_SetDialogPaused, Paused) == 0x000000, "Member 'WBP_DialogNotifBox_C_SetDialogPaused::Paused' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_SetDialogPaused, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'WBP_DialogNotifBox_C_SetDialogPaused::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_SetDialogPaused, CallFunc_IsValid_ReturnValue_1) == 0x000002, "Member 'WBP_DialogNotifBox_C_SetDialogPaused::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_SetDialogPaused, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000003, "Member 'WBP_DialogNotifBox_C_SetDialogPaused::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function WBP_DialogNotifBox.WBP_DialogNotifBox_C.SetGameplayPaused
// 0x0001 (0x0001 - 0x0000)
struct WBP_DialogNotifBox_C_SetGameplayPaused final
{
public:
	bool                                          Paused;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogNotifBox_C_SetGameplayPaused) == 0x000001, "Wrong alignment on WBP_DialogNotifBox_C_SetGameplayPaused");
static_assert(sizeof(WBP_DialogNotifBox_C_SetGameplayPaused) == 0x000001, "Wrong size on WBP_DialogNotifBox_C_SetGameplayPaused");
static_assert(offsetof(WBP_DialogNotifBox_C_SetGameplayPaused, Paused) == 0x000000, "Member 'WBP_DialogNotifBox_C_SetGameplayPaused::Paused' has a wrong offset!");

// Function WBP_DialogNotifBox.WBP_DialogNotifBox_C.UpdatePortrait
// 0x0240 (0x0240 - 0x0000)
struct WBP_DialogNotifBox_C_UpdatePortrait final
{
public:
	class UTexture*                               Portrait;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_DialoguesPortraitsType                      Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0040(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0098(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F0(0x0010)()
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_2; // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_3; // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0128(0x0010)()
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0138(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0148(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0190(0x0048)(HasGetValueTypeHash)
	struct FFInWorldDialogue_CharacterProfile     CallFunc_GetDataTableRowFromName_OutRow;           // 0x01D8(0x0030)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0210(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0220(0x0010)()
	class UTexture*                               K2Node_Select_Default;                             // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogNotifBox_C_UpdatePortrait) == 0x000008, "Wrong alignment on WBP_DialogNotifBox_C_UpdatePortrait");
static_assert(sizeof(WBP_DialogNotifBox_C_UpdatePortrait) == 0x000240, "Wrong size on WBP_DialogNotifBox_C_UpdatePortrait");
static_assert(offsetof(WBP_DialogNotifBox_C_UpdatePortrait, Portrait) == 0x000000, "Member 'WBP_DialogNotifBox_C_UpdatePortrait::Portrait' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_UpdatePortrait, Temp_byte_Variable) == 0x000008, "Member 'WBP_DialogNotifBox_C_UpdatePortrait::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_UpdatePortrait, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000010, "Member 'WBP_DialogNotifBox_C_UpdatePortrait::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_UpdatePortrait, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1) == 0x000020, "Member 'WBP_DialogNotifBox_C_UpdatePortrait::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_UpdatePortrait, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'WBP_DialogNotifBox_C_UpdatePortrait::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_UpdatePortrait, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000040, "Member 'WBP_DialogNotifBox_C_UpdatePortrait::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_UpdatePortrait, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'WBP_DialogNotifBox_C_UpdatePortrait::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_UpdatePortrait, K2Node_MakeStruct_FormatArgumentData_1) == 0x000098, "Member 'WBP_DialogNotifBox_C_UpdatePortrait::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_UpdatePortrait, K2Node_MakeArray_Array) == 0x0000E0, "Member 'WBP_DialogNotifBox_C_UpdatePortrait::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_UpdatePortrait, CallFunc_Format_ReturnValue) == 0x0000F0, "Member 'WBP_DialogNotifBox_C_UpdatePortrait::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_UpdatePortrait, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_2) == 0x000100, "Member 'WBP_DialogNotifBox_C_UpdatePortrait::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_UpdatePortrait, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_3) == 0x000110, "Member 'WBP_DialogNotifBox_C_UpdatePortrait::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_UpdatePortrait, CallFunc_Conv_StringToName_ReturnValue) == 0x000120, "Member 'WBP_DialogNotifBox_C_UpdatePortrait::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_UpdatePortrait, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000128, "Member 'WBP_DialogNotifBox_C_UpdatePortrait::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_UpdatePortrait, CallFunc_Conv_NameToText_ReturnValue) == 0x000138, "Member 'WBP_DialogNotifBox_C_UpdatePortrait::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_UpdatePortrait, K2Node_MakeStruct_FormatArgumentData_2) == 0x000148, "Member 'WBP_DialogNotifBox_C_UpdatePortrait::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_UpdatePortrait, K2Node_MakeStruct_FormatArgumentData_3) == 0x000190, "Member 'WBP_DialogNotifBox_C_UpdatePortrait::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_UpdatePortrait, CallFunc_GetDataTableRowFromName_OutRow) == 0x0001D8, "Member 'WBP_DialogNotifBox_C_UpdatePortrait::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_UpdatePortrait, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000208, "Member 'WBP_DialogNotifBox_C_UpdatePortrait::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_UpdatePortrait, K2Node_MakeArray_Array_1) == 0x000210, "Member 'WBP_DialogNotifBox_C_UpdatePortrait::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_UpdatePortrait, CallFunc_Format_ReturnValue_1) == 0x000220, "Member 'WBP_DialogNotifBox_C_UpdatePortrait::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_UpdatePortrait, K2Node_Select_Default) == 0x000230, "Member 'WBP_DialogNotifBox_C_UpdatePortrait::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_UpdatePortrait, CallFunc_IsValid_ReturnValue) == 0x000238, "Member 'WBP_DialogNotifBox_C_UpdatePortrait::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_DialogNotifBox.WBP_DialogNotifBox_C.UpdateWidgets
// 0x0150 (0x0150 - 0x0000)
struct WBP_DialogNotifBox_C_UpdateWidgets final
{
public:
	struct FS_DialogueLine                        CallFunc_GetCurrentLine_Output;                    // 0x0000(0x0058)(HasGetValueTypeHash)
	class UTexture*                               CallFunc_UpdatePortrait_Portrait;                  // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0070(0x00D0)()
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DialogNotifBox_C_UpdateWidgets) == 0x000010, "Wrong alignment on WBP_DialogNotifBox_C_UpdateWidgets");
static_assert(sizeof(WBP_DialogNotifBox_C_UpdateWidgets) == 0x000150, "Wrong size on WBP_DialogNotifBox_C_UpdateWidgets");
static_assert(offsetof(WBP_DialogNotifBox_C_UpdateWidgets, CallFunc_GetCurrentLine_Output) == 0x000000, "Member 'WBP_DialogNotifBox_C_UpdateWidgets::CallFunc_GetCurrentLine_Output' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_UpdateWidgets, CallFunc_UpdatePortrait_Portrait) == 0x000058, "Member 'WBP_DialogNotifBox_C_UpdateWidgets::CallFunc_UpdatePortrait_Portrait' has a wrong offset!");
static_assert(offsetof(WBP_DialogNotifBox_C_UpdateWidgets, CallFunc_PlayAnimation_ReturnValue) == 0x000060, "Member 'WBP_DialogNotifBox_C_UpdateWidgets::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
