#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BattleWheelButton_Gradient_Var1

#include "Basic.hpp"

#include "WBP_BattleWheelButton_Background_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BattleWheelButton_Gradient_Var1.WBP_BattleWheelButton_Gradient_Var1_C
// 0x0020 (0x03A8 - 0x0388)
class UWBP_BattleWheelButton_Gradient_Var1_C final : public UWBP_BattleWheelButton_Background_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_BattleWheelButton_Gradient_Var1_C; // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_79;                                          // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_183;                                   // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_ProgressBar;                           // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_BattleWheelButton_Gradient_Var1(int32 EntryPoint);
	void SetGradientProgress();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BattleWheelButton_Gradient_Var1_C">();
	}
	static class UWBP_BattleWheelButton_Gradient_Var1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BattleWheelButton_Gradient_Var1_C>();
	}
};
static_assert(alignof(UWBP_BattleWheelButton_Gradient_Var1_C) == 0x000008, "Wrong alignment on UWBP_BattleWheelButton_Gradient_Var1_C");
static_assert(sizeof(UWBP_BattleWheelButton_Gradient_Var1_C) == 0x0003A8, "Wrong size on UWBP_BattleWheelButton_Gradient_Var1_C");
static_assert(offsetof(UWBP_BattleWheelButton_Gradient_Var1_C, UberGraphFrame_WBP_BattleWheelButton_Gradient_Var1_C) == 0x000388, "Member 'UWBP_BattleWheelButton_Gradient_Var1_C::UberGraphFrame_WBP_BattleWheelButton_Gradient_Var1_C' has a wrong offset!");
static_assert(offsetof(UWBP_BattleWheelButton_Gradient_Var1_C, Image_79) == 0x000390, "Member 'UWBP_BattleWheelButton_Gradient_Var1_C::Image_79' has a wrong offset!");
static_assert(offsetof(UWBP_BattleWheelButton_Gradient_Var1_C, ProgressBar_183) == 0x000398, "Member 'UWBP_BattleWheelButton_Gradient_Var1_C::ProgressBar_183' has a wrong offset!");
static_assert(offsetof(UWBP_BattleWheelButton_Gradient_Var1_C, RetainerBox_ProgressBar) == 0x0003A0, "Member 'UWBP_BattleWheelButton_Gradient_Var1_C::RetainerBox_ProgressBar' has a wrong offset!");

}

