#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_InputOptions

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Settings_InputOptions.WBP_Settings_InputOptions_C.AreSettingsDirty
// 0x0002 (0x0002 - 0x0000)
struct WBP_Settings_InputOptions_C_AreSettingsDirty final
{
public:
	bool                                          IsDirty;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreMappingsDirty_IsDirty;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_InputOptions_C_AreSettingsDirty) == 0x000001, "Wrong alignment on WBP_Settings_InputOptions_C_AreSettingsDirty");
static_assert(sizeof(WBP_Settings_InputOptions_C_AreSettingsDirty) == 0x000002, "Wrong size on WBP_Settings_InputOptions_C_AreSettingsDirty");
static_assert(offsetof(WBP_Settings_InputOptions_C_AreSettingsDirty, IsDirty) == 0x000000, "Member 'WBP_Settings_InputOptions_C_AreSettingsDirty::IsDirty' has a wrong offset!");
static_assert(offsetof(WBP_Settings_InputOptions_C_AreSettingsDirty, CallFunc_AreMappingsDirty_IsDirty) == 0x000001, "Member 'WBP_Settings_InputOptions_C_AreSettingsDirty::CallFunc_AreMappingsDirty_IsDirty' has a wrong offset!");

// Function WBP_Settings_InputOptions.WBP_Settings_InputOptions_C.AreSettingValidBeforeApply
// 0x0004 (0x0004 - 0x0000)
struct WBP_Settings_InputOptions_C_AreSettingValidBeforeApply final
{
public:
	bool                                          IsValid;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreSettingValidBeforeApply_IsValid;       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreMappingsValid_IsValid;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_InputOptions_C_AreSettingValidBeforeApply) == 0x000001, "Wrong alignment on WBP_Settings_InputOptions_C_AreSettingValidBeforeApply");
static_assert(sizeof(WBP_Settings_InputOptions_C_AreSettingValidBeforeApply) == 0x000004, "Wrong size on WBP_Settings_InputOptions_C_AreSettingValidBeforeApply");
static_assert(offsetof(WBP_Settings_InputOptions_C_AreSettingValidBeforeApply, IsValid) == 0x000000, "Member 'WBP_Settings_InputOptions_C_AreSettingValidBeforeApply::IsValid' has a wrong offset!");
static_assert(offsetof(WBP_Settings_InputOptions_C_AreSettingValidBeforeApply, CallFunc_AreSettingValidBeforeApply_IsValid) == 0x000001, "Member 'WBP_Settings_InputOptions_C_AreSettingValidBeforeApply::CallFunc_AreSettingValidBeforeApply_IsValid' has a wrong offset!");
static_assert(offsetof(WBP_Settings_InputOptions_C_AreSettingValidBeforeApply, CallFunc_AreMappingsValid_IsValid) == 0x000002, "Member 'WBP_Settings_InputOptions_C_AreSettingValidBeforeApply::CallFunc_AreMappingsValid_IsValid' has a wrong offset!");
static_assert(offsetof(WBP_Settings_InputOptions_C_AreSettingValidBeforeApply, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'WBP_Settings_InputOptions_C_AreSettingValidBeforeApply::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_Settings_InputOptions.WBP_Settings_InputOptions_C.ExecuteUbergraph_WBP_Settings_InputOptions
// 0x0030 (0x0030 - 0x0000)
struct WBP_Settings_InputOptions_C_ExecuteUbergraph_WBP_Settings_InputOptions final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ModalPopup_C*                      CallFunc_CreateModalWindow_OutputPin;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlatformsSubsystem*                    CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_InputOptions_C_ExecuteUbergraph_WBP_Settings_InputOptions) == 0x000008, "Wrong alignment on WBP_Settings_InputOptions_C_ExecuteUbergraph_WBP_Settings_InputOptions");
static_assert(sizeof(WBP_Settings_InputOptions_C_ExecuteUbergraph_WBP_Settings_InputOptions) == 0x000030, "Wrong size on WBP_Settings_InputOptions_C_ExecuteUbergraph_WBP_Settings_InputOptions");
static_assert(offsetof(WBP_Settings_InputOptions_C_ExecuteUbergraph_WBP_Settings_InputOptions, EntryPoint) == 0x000000, "Member 'WBP_Settings_InputOptions_C_ExecuteUbergraph_WBP_Settings_InputOptions::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Settings_InputOptions_C_ExecuteUbergraph_WBP_Settings_InputOptions, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_Settings_InputOptions_C_ExecuteUbergraph_WBP_Settings_InputOptions::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Settings_InputOptions_C_ExecuteUbergraph_WBP_Settings_InputOptions, CallFunc_CreateModalWindow_OutputPin) == 0x000018, "Member 'WBP_Settings_InputOptions_C_ExecuteUbergraph_WBP_Settings_InputOptions::CallFunc_CreateModalWindow_OutputPin' has a wrong offset!");
static_assert(offsetof(WBP_Settings_InputOptions_C_ExecuteUbergraph_WBP_Settings_InputOptions, K2Node_Event_IsDesignTime) == 0x000020, "Member 'WBP_Settings_InputOptions_C_ExecuteUbergraph_WBP_Settings_InputOptions::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Settings_InputOptions_C_ExecuteUbergraph_WBP_Settings_InputOptions, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000028, "Member 'WBP_Settings_InputOptions_C_ExecuteUbergraph_WBP_Settings_InputOptions::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

// Function WBP_Settings_InputOptions.WBP_Settings_InputOptions_C.OnMappingEntryFocused
// 0x0008 (0x0008 - 0x0000)
struct WBP_Settings_InputOptions_C_OnMappingEntryFocused final
{
public:
	class UWBP_Settings_MappingOptionEntry_C*     MappingEntry;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_InputOptions_C_OnMappingEntryFocused) == 0x000008, "Wrong alignment on WBP_Settings_InputOptions_C_OnMappingEntryFocused");
static_assert(sizeof(WBP_Settings_InputOptions_C_OnMappingEntryFocused) == 0x000008, "Wrong size on WBP_Settings_InputOptions_C_OnMappingEntryFocused");
static_assert(offsetof(WBP_Settings_InputOptions_C_OnMappingEntryFocused, MappingEntry) == 0x000000, "Member 'WBP_Settings_InputOptions_C_OnMappingEntryFocused::MappingEntry' has a wrong offset!");

// Function WBP_Settings_InputOptions.WBP_Settings_InputOptions_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_InputOptions_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_InputOptions_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Settings_InputOptions_C_PreConstruct");
static_assert(sizeof(WBP_Settings_InputOptions_C_PreConstruct) == 0x000001, "Wrong size on WBP_Settings_InputOptions_C_PreConstruct");
static_assert(offsetof(WBP_Settings_InputOptions_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Settings_InputOptions_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Settings_InputOptions.WBP_Settings_InputOptions_C.RefreshWidgetsWithUserSettings
// 0x0010 (0x0010 - 0x0000)
struct WBP_Settings_InputOptions_C_RefreshWidgetsWithUserSettings final
{
public:
	TDelegate<void(class UWBP_Settings_MappingOptionEntry_C* MappingEntry)> K2Node_CreateDelegate_OutputDelegate; // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_InputOptions_C_RefreshWidgetsWithUserSettings) == 0x000004, "Wrong alignment on WBP_Settings_InputOptions_C_RefreshWidgetsWithUserSettings");
static_assert(sizeof(WBP_Settings_InputOptions_C_RefreshWidgetsWithUserSettings) == 0x000010, "Wrong size on WBP_Settings_InputOptions_C_RefreshWidgetsWithUserSettings");
static_assert(offsetof(WBP_Settings_InputOptions_C_RefreshWidgetsWithUserSettings, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_Settings_InputOptions_C_RefreshWidgetsWithUserSettings::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_Settings_InputOptions.WBP_Settings_InputOptions_C.SetupEnhancedInputUserSettings
// 0x0078 (0x0078 - 0x0000)
struct WBP_Settings_InputOptions_C_SetupEnhancedInputUserSettings final
{
public:
	class UEnhancedInputLocalPlayerSubsystem*     CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSet<class UInputMappingContext*>             K2Node_MakeSet_Set;                                // 0x0008(0x0050)(ConstParm)
	TScriptInterface<class IEnhancedInputSubsystemInterface> CallFunc_GetUserSettings_self_CastInput; // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEnhancedInputUserSettings*             CallFunc_GetUserSettings_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RegisterInputMappingContexts_ReturnValue; // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_InputOptions_C_SetupEnhancedInputUserSettings) == 0x000008, "Wrong alignment on WBP_Settings_InputOptions_C_SetupEnhancedInputUserSettings");
static_assert(sizeof(WBP_Settings_InputOptions_C_SetupEnhancedInputUserSettings) == 0x000078, "Wrong size on WBP_Settings_InputOptions_C_SetupEnhancedInputUserSettings");
static_assert(offsetof(WBP_Settings_InputOptions_C_SetupEnhancedInputUserSettings, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000000, "Member 'WBP_Settings_InputOptions_C_SetupEnhancedInputUserSettings::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_InputOptions_C_SetupEnhancedInputUserSettings, K2Node_MakeSet_Set) == 0x000008, "Member 'WBP_Settings_InputOptions_C_SetupEnhancedInputUserSettings::K2Node_MakeSet_Set' has a wrong offset!");
static_assert(offsetof(WBP_Settings_InputOptions_C_SetupEnhancedInputUserSettings, CallFunc_GetUserSettings_self_CastInput) == 0x000058, "Member 'WBP_Settings_InputOptions_C_SetupEnhancedInputUserSettings::CallFunc_GetUserSettings_self_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_Settings_InputOptions_C_SetupEnhancedInputUserSettings, CallFunc_GetUserSettings_ReturnValue) == 0x000068, "Member 'WBP_Settings_InputOptions_C_SetupEnhancedInputUserSettings::CallFunc_GetUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_InputOptions_C_SetupEnhancedInputUserSettings, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'WBP_Settings_InputOptions_C_SetupEnhancedInputUserSettings::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_InputOptions_C_SetupEnhancedInputUserSettings, CallFunc_RegisterInputMappingContexts_ReturnValue) == 0x000071, "Member 'WBP_Settings_InputOptions_C_SetupEnhancedInputUserSettings::CallFunc_RegisterInputMappingContexts_ReturnValue' has a wrong offset!");

// Function WBP_Settings_InputOptions.WBP_Settings_InputOptions_C.BP_GetDesiredFocusTarget
// 0x0010 (0x0010 - 0x0000)
struct WBP_Settings_InputOptions_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_InputOptions_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_Settings_InputOptions_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_Settings_InputOptions_C_BP_GetDesiredFocusTarget) == 0x000010, "Wrong size on WBP_Settings_InputOptions_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_Settings_InputOptions_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_Settings_InputOptions_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_InputOptions_C_BP_GetDesiredFocusTarget, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000008, "Member 'WBP_Settings_InputOptions_C_BP_GetDesiredFocusTarget::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");

}

