#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Panel_Pictos

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "FEquipmentSlot_structs.hpp"
#include "UMG_structs.hpp"
#include "S_jRPG_Item_StaticData_structs.hpp"
#include "Engine_structs.hpp"
#include "S_jRPG_Item_DynamicData_structs.hpp"
#include "SlateCore_structs.hpp"
#include "E_ModalStandardButton_structs.hpp"
#include "EModalUIResponse_structs.hpp"
#include "FCharacterAssignedEquipment_structs.hpp"


namespace SDK::Params
{

// Function WBP_Panel_Pictos.WBP_Panel_Pictos_C.BackFromPictoSelectionState
// 0x0010 (0x0010 - 0x0000)
struct WBP_Panel_Pictos_C_BackFromPictoSelectionState final
{
public:
	bool                                          CallFunc_IsInGamepadOrKeyboardNavigationMode_ReturnValue; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Panel_Pictos_C_BackFromPictoSelectionState) == 0x000008, "Wrong alignment on WBP_Panel_Pictos_C_BackFromPictoSelectionState");
static_assert(sizeof(WBP_Panel_Pictos_C_BackFromPictoSelectionState) == 0x000010, "Wrong size on WBP_Panel_Pictos_C_BackFromPictoSelectionState");
static_assert(offsetof(WBP_Panel_Pictos_C_BackFromPictoSelectionState, CallFunc_IsInGamepadOrKeyboardNavigationMode_ReturnValue) == 0x000000, "Member 'WBP_Panel_Pictos_C_BackFromPictoSelectionState::CallFunc_IsInGamepadOrKeyboardNavigationMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_BackFromPictoSelectionState, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'WBP_Panel_Pictos_C_BackFromPictoSelectionState::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

// Function WBP_Panel_Pictos.WBP_Panel_Pictos_C.BndEvt__WBP_Panel_Pictos_LuminaAccessPrompt_K2Node_ComponentBoundEvent_13_OnPressed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_LuminaAccessPrompt_K2Node_ComponentBoundEvent_13_OnPressed__DelegateSignature final
{
public:
	class UWBP_GM_PromptGeneric_C*                PromptWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_LuminaAccessPrompt_K2Node_ComponentBoundEvent_13_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_LuminaAccessPrompt_K2Node_ComponentBoundEvent_13_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_LuminaAccessPrompt_K2Node_ComponentBoundEvent_13_OnPressed__DelegateSignature) == 0x000008, "Wrong size on WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_LuminaAccessPrompt_K2Node_ComponentBoundEvent_13_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_LuminaAccessPrompt_K2Node_ComponentBoundEvent_13_OnPressed__DelegateSignature, PromptWidget) == 0x000000, "Member 'WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_LuminaAccessPrompt_K2Node_ComponentBoundEvent_13_OnPressed__DelegateSignature::PromptWidget' has a wrong offset!");

// Function WBP_Panel_Pictos.WBP_Panel_Pictos_C.BndEvt__WBP_Panel_Pictos_PictosList_K2Node_ComponentBoundEvent_0_OnPictoItemClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_PictosList_K2Node_ComponentBoundEvent_0_OnPictoItemClicked__DelegateSignature final
{
public:
	class UBP_PictoViewItem_C*                    PictoViewItem;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_PictosList_K2Node_ComponentBoundEvent_0_OnPictoItemClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_PictosList_K2Node_ComponentBoundEvent_0_OnPictoItemClicked__DelegateSignature");
static_assert(sizeof(WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_PictosList_K2Node_ComponentBoundEvent_0_OnPictoItemClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_PictosList_K2Node_ComponentBoundEvent_0_OnPictoItemClicked__DelegateSignature");
static_assert(offsetof(WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_PictosList_K2Node_ComponentBoundEvent_0_OnPictoItemClicked__DelegateSignature, PictoViewItem) == 0x000000, "Member 'WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_PictosList_K2Node_ComponentBoundEvent_0_OnPictoItemClicked__DelegateSignature::PictoViewItem' has a wrong offset!");

// Function WBP_Panel_Pictos.WBP_Panel_Pictos_C.BndEvt__WBP_Panel_Pictos_PictosList_K2Node_ComponentBoundEvent_7_OnPictoItemNavigated__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_PictosList_K2Node_ComponentBoundEvent_7_OnPictoItemNavigated__DelegateSignature final
{
public:
	class UBP_PictoViewItem_C*                    InPictoItem;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_PictosList_K2Node_ComponentBoundEvent_7_OnPictoItemNavigated__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_PictosList_K2Node_ComponentBoundEvent_7_OnPictoItemNavigated__DelegateSignature");
static_assert(sizeof(WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_PictosList_K2Node_ComponentBoundEvent_7_OnPictoItemNavigated__DelegateSignature) == 0x000008, "Wrong size on WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_PictosList_K2Node_ComponentBoundEvent_7_OnPictoItemNavigated__DelegateSignature");
static_assert(offsetof(WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_PictosList_K2Node_ComponentBoundEvent_7_OnPictoItemNavigated__DelegateSignature, InPictoItem) == 0x000000, "Member 'WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_PictosList_K2Node_ComponentBoundEvent_7_OnPictoItemNavigated__DelegateSignature::InPictoItem' has a wrong offset!");

// Function WBP_Panel_Pictos.WBP_Panel_Pictos_C.BndEvt__WBP_Panel_Pictos_WBP_CommonBoundActionButton_ToggleFavorite_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_CommonBoundActionButton_ToggleFavorite_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_CommonBoundActionButton_ToggleFavorite_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_CommonBoundActionButton_ToggleFavorite_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_CommonBoundActionButton_ToggleFavorite_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_CommonBoundActionButton_ToggleFavorite_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_CommonBoundActionButton_ToggleFavorite_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_CommonBoundActionButton_ToggleFavorite_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Panel_Pictos.WBP_Panel_Pictos_C.BndEvt__WBP_Panel_Pictos_WBP_CommonBoundActionButton_Unequip_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_CommonBoundActionButton_Unequip_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_CommonBoundActionButton_Unequip_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_CommonBoundActionButton_Unequip_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_CommonBoundActionButton_Unequip_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_CommonBoundActionButton_Unequip_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_CommonBoundActionButton_Unequip_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_CommonBoundActionButton_Unequip_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Panel_Pictos.WBP_Panel_Pictos_C.BndEvt__WBP_Panel_Pictos_WBP_GM_COV_LuminaPanel_K2Node_ComponentBoundEvent_12_OnLuminaEntryFocused__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_GM_COV_LuminaPanel_K2Node_ComponentBoundEvent_12_OnLuminaEntryFocused__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_GM_COV_LuminaPanel_K2Node_ComponentBoundEvent_12_OnLuminaEntryFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_GM_COV_LuminaPanel_K2Node_ComponentBoundEvent_12_OnLuminaEntryFocused__DelegateSignature");
static_assert(sizeof(WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_GM_COV_LuminaPanel_K2Node_ComponentBoundEvent_12_OnLuminaEntryFocused__DelegateSignature) == 0x000008, "Wrong size on WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_GM_COV_LuminaPanel_K2Node_ComponentBoundEvent_12_OnLuminaEntryFocused__DelegateSignature");
static_assert(offsetof(WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_GM_COV_LuminaPanel_K2Node_ComponentBoundEvent_12_OnLuminaEntryFocused__DelegateSignature, Button) == 0x000000, "Member 'WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_GM_COV_LuminaPanel_K2Node_ComponentBoundEvent_12_OnLuminaEntryFocused__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Panel_Pictos.WBP_Panel_Pictos_C.BndEvt__WBP_Panel_Pictos_WBP_GM_COV_LuminaPanel_K2Node_ComponentBoundEvent_14_OnLuminaEntryClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_GM_COV_LuminaPanel_K2Node_ComponentBoundEvent_14_OnLuminaEntryClicked__DelegateSignature final
{
public:
	class FName                                   InPassiveEffectID;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_GM_COV_LuminaPanel_K2Node_ComponentBoundEvent_14_OnLuminaEntryClicked__DelegateSignature) == 0x000004, "Wrong alignment on WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_GM_COV_LuminaPanel_K2Node_ComponentBoundEvent_14_OnLuminaEntryClicked__DelegateSignature");
static_assert(sizeof(WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_GM_COV_LuminaPanel_K2Node_ComponentBoundEvent_14_OnLuminaEntryClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_GM_COV_LuminaPanel_K2Node_ComponentBoundEvent_14_OnLuminaEntryClicked__DelegateSignature");
static_assert(offsetof(WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_GM_COV_LuminaPanel_K2Node_ComponentBoundEvent_14_OnLuminaEntryClicked__DelegateSignature, InPassiveEffectID) == 0x000000, "Member 'WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_GM_COV_LuminaPanel_K2Node_ComponentBoundEvent_14_OnLuminaEntryClicked__DelegateSignature::InPassiveEffectID' has a wrong offset!");

// Function WBP_Panel_Pictos.WBP_Panel_Pictos_C.BndEvt__WBP_Panel_Pictos_WBP_PictoSlot0_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_PictoSlot0_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_PictoSlot0_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_PictoSlot0_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_PictoSlot0_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_PictoSlot0_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_PictoSlot0_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_PictoSlot0_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Panel_Pictos.WBP_Panel_Pictos_C.BndEvt__WBP_Panel_Pictos_WBP_PictoSlot1_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_PictoSlot1_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_PictoSlot1_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_PictoSlot1_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_PictoSlot1_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_PictoSlot1_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_PictoSlot1_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_PictoSlot1_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Panel_Pictos.WBP_Panel_Pictos_C.BndEvt__WBP_Panel_Pictos_WBP_PictoSlot2_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_PictoSlot2_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_PictoSlot2_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_PictoSlot2_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_PictoSlot2_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_PictoSlot2_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_PictoSlot2_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Panel_Pictos_C_BndEvt__WBP_Panel_Pictos_WBP_PictoSlot2_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Panel_Pictos.WBP_Panel_Pictos_C.BPI_GetCharacterNotificationState
// 0x0010 (0x0010 - 0x0000)
struct WBP_Panel_Pictos_C_BPI_GetCharacterNotificationState final
{
public:
	class UBP_CharacterData_C*                    CharacterData;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          HasNotification;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Panel_Pictos_C_BPI_GetCharacterNotificationState) == 0x000008, "Wrong alignment on WBP_Panel_Pictos_C_BPI_GetCharacterNotificationState");
static_assert(sizeof(WBP_Panel_Pictos_C_BPI_GetCharacterNotificationState) == 0x000010, "Wrong size on WBP_Panel_Pictos_C_BPI_GetCharacterNotificationState");
static_assert(offsetof(WBP_Panel_Pictos_C_BPI_GetCharacterNotificationState, CharacterData) == 0x000000, "Member 'WBP_Panel_Pictos_C_BPI_GetCharacterNotificationState::CharacterData' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_BPI_GetCharacterNotificationState, HasNotification) == 0x000008, "Member 'WBP_Panel_Pictos_C_BPI_GetCharacterNotificationState::HasNotification' has a wrong offset!");

// Function WBP_Panel_Pictos.WBP_Panel_Pictos_C.BPI_LoadCharacter
// 0x0008 (0x0008 - 0x0000)
struct WBP_Panel_Pictos_C_BPI_LoadCharacter final
{
public:
	class UBP_CharacterData_C*                    CharacterData;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Panel_Pictos_C_BPI_LoadCharacter) == 0x000008, "Wrong alignment on WBP_Panel_Pictos_C_BPI_LoadCharacter");
static_assert(sizeof(WBP_Panel_Pictos_C_BPI_LoadCharacter) == 0x000008, "Wrong size on WBP_Panel_Pictos_C_BPI_LoadCharacter");
static_assert(offsetof(WBP_Panel_Pictos_C_BPI_LoadCharacter, CharacterData) == 0x000000, "Member 'WBP_Panel_Pictos_C_BPI_LoadCharacter::CharacterData' has a wrong offset!");

// Function WBP_Panel_Pictos.WBP_Panel_Pictos_C.BPI_OnMarkNotificationAsRead
// 0x0008 (0x0008 - 0x0000)
struct WBP_Panel_Pictos_C_BPI_OnMarkNotificationAsRead final
{
public:
	class UUserWidget*                            MarkCaller;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Panel_Pictos_C_BPI_OnMarkNotificationAsRead) == 0x000008, "Wrong alignment on WBP_Panel_Pictos_C_BPI_OnMarkNotificationAsRead");
static_assert(sizeof(WBP_Panel_Pictos_C_BPI_OnMarkNotificationAsRead) == 0x000008, "Wrong size on WBP_Panel_Pictos_C_BPI_OnMarkNotificationAsRead");
static_assert(offsetof(WBP_Panel_Pictos_C_BPI_OnMarkNotificationAsRead, MarkCaller) == 0x000000, "Member 'WBP_Panel_Pictos_C_BPI_OnMarkNotificationAsRead::MarkCaller' has a wrong offset!");

// Function WBP_Panel_Pictos.WBP_Panel_Pictos_C.BPI_ShouldShowNotification
// 0x0018 (0x0018 - 0x0000)
struct WBP_Panel_Pictos_C_BPI_ShouldShowNotification final
{
public:
	bool                                          bShouldShow;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsThereAnyObjectNotifiedInPool_IsFound;   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Panel_Pictos_C_BPI_ShouldShowNotification) == 0x000008, "Wrong alignment on WBP_Panel_Pictos_C_BPI_ShouldShowNotification");
static_assert(sizeof(WBP_Panel_Pictos_C_BPI_ShouldShowNotification) == 0x000018, "Wrong size on WBP_Panel_Pictos_C_BPI_ShouldShowNotification");
static_assert(offsetof(WBP_Panel_Pictos_C_BPI_ShouldShowNotification, bShouldShow) == 0x000000, "Member 'WBP_Panel_Pictos_C_BPI_ShouldShowNotification::bShouldShow' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_BPI_ShouldShowNotification, CallFunc_GetCustomGI_ReturnValue) == 0x000008, "Member 'WBP_Panel_Pictos_C_BPI_ShouldShowNotification::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_BPI_ShouldShowNotification, CallFunc_IsThereAnyObjectNotifiedInPool_IsFound) == 0x000010, "Member 'WBP_Panel_Pictos_C_BPI_ShouldShowNotification::CallFunc_IsThereAnyObjectNotifiedInPool_IsFound' has a wrong offset!");

// Function WBP_Panel_Pictos.WBP_Panel_Pictos_C.CreateModalWindowForEquippedItem
// 0x0288 (0x0288 - 0x0000)
struct WBP_Panel_Pictos_C_CreateModalWindowForEquippedItem final
{
public:
	struct FS_jRPG_Item_StaticData                Item;                                              // 0x0000(0x0130)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UBP_CharacterData_C*                    OtherCharacter;                                    // 0x0130(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          HasItemInSlot;                                     // 0x0138(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ModalPopup_C*                      ModalWindow;                                       // 0x0140(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	E_ModalStandardButton                         Temp_byte_Variable;                                // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetCharacterDisplayName_CharacterDisplayName; // 0x0150(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0160(0x0048)(HasGetValueTypeHash)
	E_ModalStandardButton                         Temp_byte_Variable_1;                              // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01B0(0x0048)(HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetCharacterDisplayName_CharacterDisplayName_1; // 0x0200(0x0010)()
	E_ModalStandardButton                         K2Node_Select_Default;                             // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0218(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0260(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0270(0x0010)()
	class UWBP_ModalPopup_C*                      CallFunc_CreateModalWindow_OutputPin;              // 0x0280(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Panel_Pictos_C_CreateModalWindowForEquippedItem) == 0x000008, "Wrong alignment on WBP_Panel_Pictos_C_CreateModalWindowForEquippedItem");
static_assert(sizeof(WBP_Panel_Pictos_C_CreateModalWindowForEquippedItem) == 0x000288, "Wrong size on WBP_Panel_Pictos_C_CreateModalWindowForEquippedItem");
static_assert(offsetof(WBP_Panel_Pictos_C_CreateModalWindowForEquippedItem, Item) == 0x000000, "Member 'WBP_Panel_Pictos_C_CreateModalWindowForEquippedItem::Item' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_CreateModalWindowForEquippedItem, OtherCharacter) == 0x000130, "Member 'WBP_Panel_Pictos_C_CreateModalWindowForEquippedItem::OtherCharacter' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_CreateModalWindowForEquippedItem, HasItemInSlot) == 0x000138, "Member 'WBP_Panel_Pictos_C_CreateModalWindowForEquippedItem::HasItemInSlot' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_CreateModalWindowForEquippedItem, ModalWindow) == 0x000140, "Member 'WBP_Panel_Pictos_C_CreateModalWindowForEquippedItem::ModalWindow' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_CreateModalWindowForEquippedItem, Temp_byte_Variable) == 0x000148, "Member 'WBP_Panel_Pictos_C_CreateModalWindowForEquippedItem::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_CreateModalWindowForEquippedItem, CallFunc_GetCharacterDisplayName_CharacterDisplayName) == 0x000150, "Member 'WBP_Panel_Pictos_C_CreateModalWindowForEquippedItem::CallFunc_GetCharacterDisplayName_CharacterDisplayName' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_CreateModalWindowForEquippedItem, K2Node_MakeStruct_FormatArgumentData) == 0x000160, "Member 'WBP_Panel_Pictos_C_CreateModalWindowForEquippedItem::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_CreateModalWindowForEquippedItem, Temp_byte_Variable_1) == 0x0001A8, "Member 'WBP_Panel_Pictos_C_CreateModalWindowForEquippedItem::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_CreateModalWindowForEquippedItem, K2Node_MakeStruct_FormatArgumentData_1) == 0x0001B0, "Member 'WBP_Panel_Pictos_C_CreateModalWindowForEquippedItem::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_CreateModalWindowForEquippedItem, Temp_bool_Variable) == 0x0001F8, "Member 'WBP_Panel_Pictos_C_CreateModalWindowForEquippedItem::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_CreateModalWindowForEquippedItem, CallFunc_GetCharacterDisplayName_CharacterDisplayName_1) == 0x000200, "Member 'WBP_Panel_Pictos_C_CreateModalWindowForEquippedItem::CallFunc_GetCharacterDisplayName_CharacterDisplayName_1' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_CreateModalWindowForEquippedItem, K2Node_Select_Default) == 0x000210, "Member 'WBP_Panel_Pictos_C_CreateModalWindowForEquippedItem::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_CreateModalWindowForEquippedItem, K2Node_MakeStruct_FormatArgumentData_2) == 0x000218, "Member 'WBP_Panel_Pictos_C_CreateModalWindowForEquippedItem::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_CreateModalWindowForEquippedItem, K2Node_MakeArray_Array) == 0x000260, "Member 'WBP_Panel_Pictos_C_CreateModalWindowForEquippedItem::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_CreateModalWindowForEquippedItem, CallFunc_Format_ReturnValue) == 0x000270, "Member 'WBP_Panel_Pictos_C_CreateModalWindowForEquippedItem::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_CreateModalWindowForEquippedItem, CallFunc_CreateModalWindow_OutputPin) == 0x000280, "Member 'WBP_Panel_Pictos_C_CreateModalWindowForEquippedItem::CallFunc_CreateModalWindow_OutputPin' has a wrong offset!");

// Function WBP_Panel_Pictos.WBP_Panel_Pictos_C.CreateModalWindowForExcludedCharacter
// 0x0270 (0x0270 - 0x0000)
struct WBP_Panel_Pictos_C_CreateModalWindowForExcludedCharacter final
{
public:
	struct FS_jRPG_Item_StaticData                Item;                                              // 0x0000(0x0130)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UBP_CharacterData_C*                    OtherCharacter;                                    // 0x0130(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_ModalPopup_C*                      ModalWindow;                                       // 0x0138(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCharacterDisplayName_CharacterDisplayName; // 0x0140(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0150(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0198(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x01E0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0228(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0238(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0248(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0258(0x0010)()
	class UWBP_ModalPopup_C*                      CallFunc_CreateModalWindow_OutputPin;              // 0x0268(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Panel_Pictos_C_CreateModalWindowForExcludedCharacter) == 0x000008, "Wrong alignment on WBP_Panel_Pictos_C_CreateModalWindowForExcludedCharacter");
static_assert(sizeof(WBP_Panel_Pictos_C_CreateModalWindowForExcludedCharacter) == 0x000270, "Wrong size on WBP_Panel_Pictos_C_CreateModalWindowForExcludedCharacter");
static_assert(offsetof(WBP_Panel_Pictos_C_CreateModalWindowForExcludedCharacter, Item) == 0x000000, "Member 'WBP_Panel_Pictos_C_CreateModalWindowForExcludedCharacter::Item' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_CreateModalWindowForExcludedCharacter, OtherCharacter) == 0x000130, "Member 'WBP_Panel_Pictos_C_CreateModalWindowForExcludedCharacter::OtherCharacter' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_CreateModalWindowForExcludedCharacter, ModalWindow) == 0x000138, "Member 'WBP_Panel_Pictos_C_CreateModalWindowForExcludedCharacter::ModalWindow' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_CreateModalWindowForExcludedCharacter, CallFunc_GetCharacterDisplayName_CharacterDisplayName) == 0x000140, "Member 'WBP_Panel_Pictos_C_CreateModalWindowForExcludedCharacter::CallFunc_GetCharacterDisplayName_CharacterDisplayName' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_CreateModalWindowForExcludedCharacter, K2Node_MakeStruct_FormatArgumentData) == 0x000150, "Member 'WBP_Panel_Pictos_C_CreateModalWindowForExcludedCharacter::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_CreateModalWindowForExcludedCharacter, K2Node_MakeStruct_FormatArgumentData_1) == 0x000198, "Member 'WBP_Panel_Pictos_C_CreateModalWindowForExcludedCharacter::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_CreateModalWindowForExcludedCharacter, K2Node_MakeStruct_FormatArgumentData_2) == 0x0001E0, "Member 'WBP_Panel_Pictos_C_CreateModalWindowForExcludedCharacter::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_CreateModalWindowForExcludedCharacter, K2Node_MakeArray_Array) == 0x000228, "Member 'WBP_Panel_Pictos_C_CreateModalWindowForExcludedCharacter::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_CreateModalWindowForExcludedCharacter, K2Node_MakeArray_Array_1) == 0x000238, "Member 'WBP_Panel_Pictos_C_CreateModalWindowForExcludedCharacter::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_CreateModalWindowForExcludedCharacter, CallFunc_Format_ReturnValue) == 0x000248, "Member 'WBP_Panel_Pictos_C_CreateModalWindowForExcludedCharacter::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_CreateModalWindowForExcludedCharacter, CallFunc_Format_ReturnValue_1) == 0x000258, "Member 'WBP_Panel_Pictos_C_CreateModalWindowForExcludedCharacter::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_CreateModalWindowForExcludedCharacter, CallFunc_CreateModalWindow_OutputPin) == 0x000268, "Member 'WBP_Panel_Pictos_C_CreateModalWindowForExcludedCharacter::CallFunc_CreateModalWindow_OutputPin' has a wrong offset!");

// Function WBP_Panel_Pictos.WBP_Panel_Pictos_C.DoCustom NavigationPictoList
// 0x0018 (0x0018 - 0x0000)
struct WBP_Panel_Pictos_C_DoCustom_NavigationPictoList final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Panel_Pictos_C_DoCustom_NavigationPictoList) == 0x000008, "Wrong alignment on WBP_Panel_Pictos_C_DoCustom_NavigationPictoList");
static_assert(sizeof(WBP_Panel_Pictos_C_DoCustom_NavigationPictoList) == 0x000018, "Wrong size on WBP_Panel_Pictos_C_DoCustom_NavigationPictoList");
static_assert(offsetof(WBP_Panel_Pictos_C_DoCustom_NavigationPictoList, Navigation_0) == 0x000000, "Member 'WBP_Panel_Pictos_C_DoCustom_NavigationPictoList::Navigation_0' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_DoCustom_NavigationPictoList, ReturnValue) == 0x000008, "Member 'WBP_Panel_Pictos_C_DoCustom_NavigationPictoList::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_DoCustom_NavigationPictoList, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_Panel_Pictos_C_DoCustom_NavigationPictoList::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_Panel_Pictos.WBP_Panel_Pictos_C.DoCustomNavigationLumina
// 0x0018 (0x0018 - 0x0000)
struct WBP_Panel_Pictos_C_DoCustomNavigationLumina final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Panel_Pictos_C_DoCustomNavigationLumina) == 0x000008, "Wrong alignment on WBP_Panel_Pictos_C_DoCustomNavigationLumina");
static_assert(sizeof(WBP_Panel_Pictos_C_DoCustomNavigationLumina) == 0x000018, "Wrong size on WBP_Panel_Pictos_C_DoCustomNavigationLumina");
static_assert(offsetof(WBP_Panel_Pictos_C_DoCustomNavigationLumina, Navigation_0) == 0x000000, "Member 'WBP_Panel_Pictos_C_DoCustomNavigationLumina::Navigation_0' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_DoCustomNavigationLumina, ReturnValue) == 0x000008, "Member 'WBP_Panel_Pictos_C_DoCustomNavigationLumina::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_DoCustomNavigationLumina, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'WBP_Panel_Pictos_C_DoCustomNavigationLumina::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_Panel_Pictos.WBP_Panel_Pictos_C.DoCustomNavigationPictoSlots
// 0x0040 (0x0040 - 0x0000)
struct WBP_Panel_Pictos_C_DoCustomNavigationPictoSlots final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumItems_ReturnValue;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    CallFunc_GetDisplayedEntryWidgets_ReturnValue;     // 0x0010(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Panel_Pictos_C_DoCustomNavigationPictoSlots) == 0x000008, "Wrong alignment on WBP_Panel_Pictos_C_DoCustomNavigationPictoSlots");
static_assert(sizeof(WBP_Panel_Pictos_C_DoCustomNavigationPictoSlots) == 0x000040, "Wrong size on WBP_Panel_Pictos_C_DoCustomNavigationPictoSlots");
static_assert(offsetof(WBP_Panel_Pictos_C_DoCustomNavigationPictoSlots, Navigation_0) == 0x000000, "Member 'WBP_Panel_Pictos_C_DoCustomNavigationPictoSlots::Navigation_0' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_DoCustomNavigationPictoSlots, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'WBP_Panel_Pictos_C_DoCustomNavigationPictoSlots::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_DoCustomNavigationPictoSlots, CallFunc_GetNumItems_ReturnValue) == 0x000004, "Member 'WBP_Panel_Pictos_C_DoCustomNavigationPictoSlots::CallFunc_GetNumItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_DoCustomNavigationPictoSlots, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Panel_Pictos_C_DoCustomNavigationPictoSlots::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_DoCustomNavigationPictoSlots, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000009, "Member 'WBP_Panel_Pictos_C_DoCustomNavigationPictoSlots::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_DoCustomNavigationPictoSlots, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x00000A, "Member 'WBP_Panel_Pictos_C_DoCustomNavigationPictoSlots::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_DoCustomNavigationPictoSlots, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x00000B, "Member 'WBP_Panel_Pictos_C_DoCustomNavigationPictoSlots::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_DoCustomNavigationPictoSlots, CallFunc_IsActivated_ReturnValue) == 0x00000C, "Member 'WBP_Panel_Pictos_C_DoCustomNavigationPictoSlots::CallFunc_IsActivated_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_DoCustomNavigationPictoSlots, CallFunc_GetDisplayedEntryWidgets_ReturnValue) == 0x000010, "Member 'WBP_Panel_Pictos_C_DoCustomNavigationPictoSlots::CallFunc_GetDisplayedEntryWidgets_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_DoCustomNavigationPictoSlots, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_Panel_Pictos_C_DoCustomNavigationPictoSlots::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_DoCustomNavigationPictoSlots, CallFunc_Divide_IntInt_ReturnValue) == 0x000024, "Member 'WBP_Panel_Pictos_C_DoCustomNavigationPictoSlots::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_DoCustomNavigationPictoSlots, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000028, "Member 'WBP_Panel_Pictos_C_DoCustomNavigationPictoSlots::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_DoCustomNavigationPictoSlots, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_Panel_Pictos_C_DoCustomNavigationPictoSlots::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_DoCustomNavigationPictoSlots, CallFunc_SelectInt_ReturnValue) == 0x000030, "Member 'WBP_Panel_Pictos_C_DoCustomNavigationPictoSlots::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_DoCustomNavigationPictoSlots, CallFunc_SelectInt_ReturnValue_1) == 0x000034, "Member 'WBP_Panel_Pictos_C_DoCustomNavigationPictoSlots::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Panel_Pictos_C_DoCustomNavigationPictoSlots, CallFunc_Subtract_IntInt_ReturnValue) == 0x000038, "Member 'WBP_Panel_Pictos_C_DoCustomNavigationPictoSlots::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Panel_Pictos.WBP_Panel_Pictos_C.EndPictosMenuTutorials
// 0x0008 (0x0008 - 0x0000)
struct WBP_Panel_Pictos_C_EndPictosMenuTutorials final
{
public:
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Panel_Pictos_C_EndPictosMenuTutorials) == 0x000008, "Wrong alignment on WBP_Panel_Pictos_C_EndPictosMenuTutorials");
static_assert(sizeof(WBP_Panel_Pictos_C_EndPictosMenuTutorials) == 0x000008, "Wrong size on WBP_Panel_Pictos_C_EndPictosMenuTutorials");
static_assert(offsetof(WBP_Panel_Pictos_C_EndPictosMenuTutorials, CallFunc_GetCustomGI_ReturnValue) == 0x000000, "Member 'WBP_Panel_Pictos_C_EndPictosMenuTutorials::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");

// Function WBP_Panel_Pictos.WBP_Panel_Pictos_C.ExecuteUbergraph_WBP_Panel_Pictos
// 0x08C0 (0x08C0 - 0x0000)
struct WBP_Panel_Pictos_C_ExecuteUbergraph_WBP_Panel_Pictos final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInGamepadOrKeyboardNavigationMode_ReturnValue; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_Event_MarkCaller;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_PictoViewItem_C*                    K2Node_CustomEvent_InPictoViewItem;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InTargetSlotIndex;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFEquipmentSlot                        K2Node_MakeStruct_FEquipmentSlot;                  // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ItemInstance_Gear_Pictos_C*         CallFunc_GetGearPictosInstance_AsBP_Item_Instance_Gear_Pictos; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_InventoryManager_C*            CallFunc_GetInventoryManager_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetItemDefinitionID_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFCharacterAssignedEquipment>   CallFunc_GetCharactersWithItemEquipped_AssignedEquipment; // 0x0058(0x0010)(ReferenceParm)
	EModalUIResponse                              K2Node_CustomEvent_InUserResponse;                 // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B[0x1];                                       // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue; // 0x0080(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_jRPG_Item_StaticData                CallFunc_GetItemStaticData_ItemStaticData;         // 0x0098(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_IsSlotUsed_ReturnValue;                   // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSlotUsed_ReturnValue_1;                 // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CA[0x6];                                      // 0x01CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ItemInstance_Gear_C*                CallFunc_GetItemInstanceInSlot_ItemInstance;       // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSlotUsed_ReturnValue_2;                 // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSlotUsed_ReturnValue_3;                 // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DA[0x6];                                      // 0x01DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ItemInstance_Gear_C*                CallFunc_GetItemInstanceInSlot_ItemInstance_1;     // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_jRPG_Item_StaticData                CallFunc_GetItemStaticData_ItemStaticData_1;       // 0x01E8(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_jRPG_Item_StaticData                CallFunc_GetItemStaticData_ItemStaticData_2;       // 0x0320(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_451[0x3];                                      // 0x0451(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0454(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x045C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45D[0x3];                                      // 0x045D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CharacterData_C*                    K2Node_Event_CharacterData;                        // 0x0460(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_5;               // 0x0468(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_471[0x7];                                      // 0x0471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_PictoViewItem_C*                    K2Node_ComponentBoundEvent_PictoViewItem;          // 0x0478(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_4;               // 0x0480(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_3;               // 0x0488(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0490(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_PictoViewItem_C*                    K2Node_ComponentBoundEvent_InPictoItem;            // 0x0498(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x04A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x04A8(0x0010)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x04BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x04BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x04BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BF[0x1];                                      // 0x04BF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C4[0x4];                                      // 0x04C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x04C8(0x0010)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x04DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DD[0x3];                                      // 0x04DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ModalPopup_C*                      CallFunc_CreateModalWindowForEquippedItem_ModalWindow; // 0x04E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
