#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_OptionTooltip

#include "Basic.hpp"

#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Settings_OptionTooltip.WBP_Settings_OptionTooltip_C
// 0x0020 (0x0328 - 0x0308)
class UWBP_Settings_OptionTooltip_C final : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                       OptionDescription;                                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WrappingText_C*                    OptionName;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       TooltipBackground;                                 // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetOptionNameAndDesc(const class FText& InOptionName, const class FText& InOptionDesc);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Settings_OptionTooltip_C">();
	}
	static class UWBP_Settings_OptionTooltip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Settings_OptionTooltip_C>();
	}
};
static_assert(alignof(UWBP_Settings_OptionTooltip_C) == 0x000008, "Wrong alignment on UWBP_Settings_OptionTooltip_C");
static_assert(sizeof(UWBP_Settings_OptionTooltip_C) == 0x000328, "Wrong size on UWBP_Settings_OptionTooltip_C");
static_assert(offsetof(UWBP_Settings_OptionTooltip_C, OptionDescription) == 0x000308, "Member 'UWBP_Settings_OptionTooltip_C::OptionDescription' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_OptionTooltip_C, OptionName) == 0x000310, "Member 'UWBP_Settings_OptionTooltip_C::OptionName' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_OptionTooltip_C, SizeBox) == 0x000318, "Member 'UWBP_Settings_OptionTooltip_C::SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_OptionTooltip_C, TooltipBackground) == 0x000320, "Member 'UWBP_Settings_OptionTooltip_C::TooltipBackground' has a wrong offset!");

}

