#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Tuto_BlurIndicator

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Tuto_BlurIndicator.WBP_Tuto_BlurIndicator_C
// 0x0058 (0x0338 - 0x02E0)
class UWBP_Tuto_BlurIndicator_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Appear;                                       // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 MaskImage;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_0;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMediaPlayer*                           MediaPlayer;                                       // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMediaSource*                           Media_Source;                                      // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        PlayDelay;                                         // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMediaTexture*                          Video;                                             // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                TargetWidget;                                      // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector2D                              AdditionalHalfSize;                                // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Tuto_BlurIndicator(int32 EntryPoint);
	void ExitTuto();
	void ForceUpdate();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Tuto_BlurIndicator_C">();
	}
	static class UWBP_Tuto_BlurIndicator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Tuto_BlurIndicator_C>();
	}
};
static_assert(alignof(UWBP_Tuto_BlurIndicator_C) == 0x000008, "Wrong alignment on UWBP_Tuto_BlurIndicator_C");
static_assert(sizeof(UWBP_Tuto_BlurIndicator_C) == 0x000338, "Wrong size on UWBP_Tuto_BlurIndicator_C");
static_assert(offsetof(UWBP_Tuto_BlurIndicator_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_Tuto_BlurIndicator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Tuto_BlurIndicator_C, Anim_Appear) == 0x0002E8, "Member 'UWBP_Tuto_BlurIndicator_C::Anim_Appear' has a wrong offset!");
static_assert(offsetof(UWBP_Tuto_BlurIndicator_C, MaskImage) == 0x0002F0, "Member 'UWBP_Tuto_BlurIndicator_C::MaskImage' has a wrong offset!");
static_assert(offsetof(UWBP_Tuto_BlurIndicator_C, RetainerBox_0) == 0x0002F8, "Member 'UWBP_Tuto_BlurIndicator_C::RetainerBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_Tuto_BlurIndicator_C, MediaPlayer) == 0x000300, "Member 'UWBP_Tuto_BlurIndicator_C::MediaPlayer' has a wrong offset!");
static_assert(offsetof(UWBP_Tuto_BlurIndicator_C, Media_Source) == 0x000308, "Member 'UWBP_Tuto_BlurIndicator_C::Media_Source' has a wrong offset!");
static_assert(offsetof(UWBP_Tuto_BlurIndicator_C, PlayDelay) == 0x000310, "Member 'UWBP_Tuto_BlurIndicator_C::PlayDelay' has a wrong offset!");
static_assert(offsetof(UWBP_Tuto_BlurIndicator_C, Video) == 0x000318, "Member 'UWBP_Tuto_BlurIndicator_C::Video' has a wrong offset!");
static_assert(offsetof(UWBP_Tuto_BlurIndicator_C, TargetWidget) == 0x000320, "Member 'UWBP_Tuto_BlurIndicator_C::TargetWidget' has a wrong offset!");
static_assert(offsetof(UWBP_Tuto_BlurIndicator_C, AdditionalHalfSize) == 0x000328, "Member 'UWBP_Tuto_BlurIndicator_C::AdditionalHalfSize' has a wrong offset!");

}

