#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CinematicControls

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CinematicControls.WBP_CinematicControls_C
// 0x0058 (0x0488 - 0x0430)
class UWBP_CinematicControls_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Pause_Appear;                                 // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_All;                                   // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GM_PromptGeneric_C*                WBP_GM_PromptGeneric_Pause;                        // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GM_PromptGeneric_C*                WBP_GM_PromptGeneric_Skip;                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnButtonPausePressed;                              // 0x0458(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnButtonSkipPressed;                               // 0x0468(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnUnpauseAnimationFinished;                        // 0x0478(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_CinematicControls_WBP_GM_PromptGeneric_Pause_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature(class UWBP_GM_PromptGeneric_C* PromptWidget);
	void BndEvt__WBP_CinematicControls_WBP_GM_PromptGeneric_Skip_K2Node_ComponentBoundEvent_3_OnPressed__DelegateSignature(class UWBP_GM_PromptGeneric_C* PromptWidget);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void ExecuteUbergraph_WBP_CinematicControls(int32 EntryPoint);
	void OnCinematicPaused();
	void OnCinematicUnpaused();
	void OnUnpauseAppearFinished();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CinematicControls_C">();
	}
	static class UWBP_CinematicControls_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CinematicControls_C>();
	}
};
static_assert(alignof(UWBP_CinematicControls_C) == 0x000008, "Wrong alignment on UWBP_CinematicControls_C");
static_assert(sizeof(UWBP_CinematicControls_C) == 0x000488, "Wrong size on UWBP_CinematicControls_C");
static_assert(offsetof(UWBP_CinematicControls_C, UberGraphFrame) == 0x000430, "Member 'UWBP_CinematicControls_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CinematicControls_C, Anim_Pause_Appear) == 0x000438, "Member 'UWBP_CinematicControls_C::Anim_Pause_Appear' has a wrong offset!");
static_assert(offsetof(UWBP_CinematicControls_C, CanvasPanel_All) == 0x000440, "Member 'UWBP_CinematicControls_C::CanvasPanel_All' has a wrong offset!");
static_assert(offsetof(UWBP_CinematicControls_C, WBP_GM_PromptGeneric_Pause) == 0x000448, "Member 'UWBP_CinematicControls_C::WBP_GM_PromptGeneric_Pause' has a wrong offset!");
static_assert(offsetof(UWBP_CinematicControls_C, WBP_GM_PromptGeneric_Skip) == 0x000450, "Member 'UWBP_CinematicControls_C::WBP_GM_PromptGeneric_Skip' has a wrong offset!");
static_assert(offsetof(UWBP_CinematicControls_C, OnButtonPausePressed) == 0x000458, "Member 'UWBP_CinematicControls_C::OnButtonPausePressed' has a wrong offset!");
static_assert(offsetof(UWBP_CinematicControls_C, OnButtonSkipPressed) == 0x000468, "Member 'UWBP_CinematicControls_C::OnButtonSkipPressed' has a wrong offset!");
static_assert(offsetof(UWBP_CinematicControls_C, OnUnpauseAnimationFinished) == 0x000478, "Member 'UWBP_CinematicControls_C::OnUnpauseAnimationFinished' has a wrong offset!");

}

