#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OverviewHealCartridge

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_OverviewHealCartridge.WBP_OverviewHealCartridge_C.BndEvt__WBP_OverviewHealCartridge_HealPrompt_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_OverviewHealCartridge_C_BndEvt__WBP_OverviewHealCartridge_HealPrompt_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OverviewHealCartridge_C_BndEvt__WBP_OverviewHealCartridge_HealPrompt_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_OverviewHealCartridge_C_BndEvt__WBP_OverviewHealCartridge_HealPrompt_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_OverviewHealCartridge_C_BndEvt__WBP_OverviewHealCartridge_HealPrompt_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_OverviewHealCartridge_C_BndEvt__WBP_OverviewHealCartridge_HealPrompt_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_OverviewHealCartridge_C_BndEvt__WBP_OverviewHealCartridge_HealPrompt_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_OverviewHealCartridge_C_BndEvt__WBP_OverviewHealCartridge_HealPrompt_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_OverviewHealCartridge.WBP_OverviewHealCartridge_C.ExecuteUbergraph_WBP_OverviewHealCartridge
// 0x0040 (0x0040 - 0x0000)
struct WBP_OverviewHealCartridge_C_ExecuteUbergraph_WBP_OverviewHealCartridge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_InventoryManager_C*            CallFunc_GetInventoryManager_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPartyHealConsumable_Row_Name;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Controller_World_C*            K2Node_DynamicCast_AsBP_J_RPG_Controller_World;    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FindItemCountFromInventory_Quantity;      // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OverviewHealCartridge_C_ExecuteUbergraph_WBP_OverviewHealCartridge) == 0x000008, "Wrong alignment on WBP_OverviewHealCartridge_C_ExecuteUbergraph_WBP_OverviewHealCartridge");
static_assert(sizeof(WBP_OverviewHealCartridge_C_ExecuteUbergraph_WBP_OverviewHealCartridge) == 0x000040, "Wrong size on WBP_OverviewHealCartridge_C_ExecuteUbergraph_WBP_OverviewHealCartridge");
static_assert(offsetof(WBP_OverviewHealCartridge_C_ExecuteUbergraph_WBP_OverviewHealCartridge, EntryPoint) == 0x000000, "Member 'WBP_OverviewHealCartridge_C_ExecuteUbergraph_WBP_OverviewHealCartridge::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_OverviewHealCartridge_C_ExecuteUbergraph_WBP_OverviewHealCartridge, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'WBP_OverviewHealCartridge_C_ExecuteUbergraph_WBP_OverviewHealCartridge::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_OverviewHealCartridge_C_ExecuteUbergraph_WBP_OverviewHealCartridge, CallFunc_GetInventoryManager_ReturnValue) == 0x000010, "Member 'WBP_OverviewHealCartridge_C_ExecuteUbergraph_WBP_OverviewHealCartridge::CallFunc_GetInventoryManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OverviewHealCartridge_C_ExecuteUbergraph_WBP_OverviewHealCartridge, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'WBP_OverviewHealCartridge_C_ExecuteUbergraph_WBP_OverviewHealCartridge::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OverviewHealCartridge_C_ExecuteUbergraph_WBP_OverviewHealCartridge, CallFunc_GetPartyHealConsumable_Row_Name) == 0x000020, "Member 'WBP_OverviewHealCartridge_C_ExecuteUbergraph_WBP_OverviewHealCartridge::CallFunc_GetPartyHealConsumable_Row_Name' has a wrong offset!");
static_assert(offsetof(WBP_OverviewHealCartridge_C_ExecuteUbergraph_WBP_OverviewHealCartridge, K2Node_DynamicCast_AsBP_J_RPG_Controller_World) == 0x000028, "Member 'WBP_OverviewHealCartridge_C_ExecuteUbergraph_WBP_OverviewHealCartridge::K2Node_DynamicCast_AsBP_J_RPG_Controller_World' has a wrong offset!");
static_assert(offsetof(WBP_OverviewHealCartridge_C_ExecuteUbergraph_WBP_OverviewHealCartridge, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_OverviewHealCartridge_C_ExecuteUbergraph_WBP_OverviewHealCartridge::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_OverviewHealCartridge_C_ExecuteUbergraph_WBP_OverviewHealCartridge, CallFunc_FindItemCountFromInventory_Quantity) == 0x000034, "Member 'WBP_OverviewHealCartridge_C_ExecuteUbergraph_WBP_OverviewHealCartridge::CallFunc_FindItemCountFromInventory_Quantity' has a wrong offset!");
static_assert(offsetof(WBP_OverviewHealCartridge_C_ExecuteUbergraph_WBP_OverviewHealCartridge, CallFunc_Greater_IntInt_ReturnValue) == 0x000038, "Member 'WBP_OverviewHealCartridge_C_ExecuteUbergraph_WBP_OverviewHealCartridge::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OverviewHealCartridge_C_ExecuteUbergraph_WBP_OverviewHealCartridge, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'WBP_OverviewHealCartridge_C_ExecuteUbergraph_WBP_OverviewHealCartridge::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_OverviewHealCartridge.WBP_OverviewHealCartridge_C.SetPromptActive
// 0x0020 (0x0020 - 0x0000)
struct WBP_OverviewHealCartridge_C_SetPromptActive final
{
public:
	float                                         Temp_wildcard_Variable;                            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_InventoryManager_C*            CallFunc_GetInventoryManager_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPartyHealConsumable_Row_Name;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindItemCountFromInventory_Quantity;      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCharacterToHeal_ReturnValue;           // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OverviewHealCartridge_C_SetPromptActive) == 0x000008, "Wrong alignment on WBP_OverviewHealCartridge_C_SetPromptActive");
static_assert(sizeof(WBP_OverviewHealCartridge_C_SetPromptActive) == 0x000020, "Wrong size on WBP_OverviewHealCartridge_C_SetPromptActive");
static_assert(offsetof(WBP_OverviewHealCartridge_C_SetPromptActive, Temp_wildcard_Variable) == 0x000000, "Member 'WBP_OverviewHealCartridge_C_SetPromptActive::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(WBP_OverviewHealCartridge_C_SetPromptActive, CallFunc_GetInventoryManager_ReturnValue) == 0x000008, "Member 'WBP_OverviewHealCartridge_C_SetPromptActive::CallFunc_GetInventoryManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OverviewHealCartridge_C_SetPromptActive, CallFunc_GetPartyHealConsumable_Row_Name) == 0x000010, "Member 'WBP_OverviewHealCartridge_C_SetPromptActive::CallFunc_GetPartyHealConsumable_Row_Name' has a wrong offset!");
static_assert(offsetof(WBP_OverviewHealCartridge_C_SetPromptActive, CallFunc_FindItemCountFromInventory_Quantity) == 0x000018, "Member 'WBP_OverviewHealCartridge_C_SetPromptActive::CallFunc_FindItemCountFromInventory_Quantity' has a wrong offset!");
static_assert(offsetof(WBP_OverviewHealCartridge_C_SetPromptActive, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_OverviewHealCartridge_C_SetPromptActive::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OverviewHealCartridge_C_SetPromptActive, CallFunc_HasCharacterToHeal_ReturnValue) == 0x00001D, "Member 'WBP_OverviewHealCartridge_C_SetPromptActive::CallFunc_HasCharacterToHeal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OverviewHealCartridge_C_SetPromptActive, CallFunc_BooleanAND_ReturnValue) == 0x00001E, "Member 'WBP_OverviewHealCartridge_C_SetPromptActive::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

