#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_ArrowTargetSelection

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUD_ArrowTargetSelection.WBP_HUD_ArrowTargetSelection_C
// 0x0058 (0x0338 - 0x02E0)
class UWBP_HUD_ArrowTargetSelection_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Loop;                                         // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Skip_Anim_Left;                               // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Skip_Anim_Right;                              // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Arrow_In_L;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow_In_R;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow_Out_L;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow_Out_L_Shadow;                                // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow_Out_R;                                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow_Out_R_Shadow;                                // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       CurrentAnimation;                                  // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Appear();
	void Disappear();
	void ExecuteUbergraph_WBP_HUD_ArrowTargetSelection(int32 EntryPoint);
	void OnTransitionAnimationFinished();
	void SetArrowState(bool LeftEnabled, bool RightEnabled, bool HighlightLeft, bool HighlightRight);
	void SetLeftArrowVisible(bool Visible);
	void SetRightArrowVisible(bool Visible);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUD_ArrowTargetSelection_C">();
	}
	static class UWBP_HUD_ArrowTargetSelection_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_ArrowTargetSelection_C>();
	}
};
static_assert(alignof(UWBP_HUD_ArrowTargetSelection_C) == 0x000008, "Wrong alignment on UWBP_HUD_ArrowTargetSelection_C");
static_assert(sizeof(UWBP_HUD_ArrowTargetSelection_C) == 0x000338, "Wrong size on UWBP_HUD_ArrowTargetSelection_C");
static_assert(offsetof(UWBP_HUD_ArrowTargetSelection_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_HUD_ArrowTargetSelection_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_ArrowTargetSelection_C, Anim_Loop) == 0x0002E8, "Member 'UWBP_HUD_ArrowTargetSelection_C::Anim_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_ArrowTargetSelection_C, Anim_Skip_Anim_Left) == 0x0002F0, "Member 'UWBP_HUD_ArrowTargetSelection_C::Anim_Skip_Anim_Left' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_ArrowTargetSelection_C, Anim_Skip_Anim_Right) == 0x0002F8, "Member 'UWBP_HUD_ArrowTargetSelection_C::Anim_Skip_Anim_Right' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_ArrowTargetSelection_C, Arrow_In_L) == 0x000300, "Member 'UWBP_HUD_ArrowTargetSelection_C::Arrow_In_L' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_ArrowTargetSelection_C, Arrow_In_R) == 0x000308, "Member 'UWBP_HUD_ArrowTargetSelection_C::Arrow_In_R' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_ArrowTargetSelection_C, Arrow_Out_L) == 0x000310, "Member 'UWBP_HUD_ArrowTargetSelection_C::Arrow_Out_L' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_ArrowTargetSelection_C, Arrow_Out_L_Shadow) == 0x000318, "Member 'UWBP_HUD_ArrowTargetSelection_C::Arrow_Out_L_Shadow' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_ArrowTargetSelection_C, Arrow_Out_R) == 0x000320, "Member 'UWBP_HUD_ArrowTargetSelection_C::Arrow_Out_R' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_ArrowTargetSelection_C, Arrow_Out_R_Shadow) == 0x000328, "Member 'UWBP_HUD_ArrowTargetSelection_C::Arrow_Out_R_Shadow' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_ArrowTargetSelection_C, CurrentAnimation) == 0x000330, "Member 'UWBP_HUD_ArrowTargetSelection_C::CurrentAnimation' has a wrong offset!");

}

