#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Tooltip_BattleScreen

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Tooltip_BattleScreen.WBP_Tooltip_BattleScreen_C.ExecuteUbergraph_WBP_Tooltip_BattleScreen
// 0x0040 (0x0040 - 0x0000)
struct WBP_Tooltip_BattleScreen_C_ExecuteUbergraph_WBP_Tooltip_BattleScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_TooltipName;                    // 0x0008(0x0010)(ConstParm)
	class FText                                   K2Node_CustomEvent_TooltipDesc;                    // 0x0018(0x0010)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDisappearAnimPlaying_ReturnValue;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTooltipVisible_IsVisible;               // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Tooltip_BattleScreen_C_ExecuteUbergraph_WBP_Tooltip_BattleScreen) == 0x000008, "Wrong alignment on WBP_Tooltip_BattleScreen_C_ExecuteUbergraph_WBP_Tooltip_BattleScreen");
static_assert(sizeof(WBP_Tooltip_BattleScreen_C_ExecuteUbergraph_WBP_Tooltip_BattleScreen) == 0x000040, "Wrong size on WBP_Tooltip_BattleScreen_C_ExecuteUbergraph_WBP_Tooltip_BattleScreen");
static_assert(offsetof(WBP_Tooltip_BattleScreen_C_ExecuteUbergraph_WBP_Tooltip_BattleScreen, EntryPoint) == 0x000000, "Member 'WBP_Tooltip_BattleScreen_C_ExecuteUbergraph_WBP_Tooltip_BattleScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_BattleScreen_C_ExecuteUbergraph_WBP_Tooltip_BattleScreen, K2Node_CustomEvent_TooltipName) == 0x000008, "Member 'WBP_Tooltip_BattleScreen_C_ExecuteUbergraph_WBP_Tooltip_BattleScreen::K2Node_CustomEvent_TooltipName' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_BattleScreen_C_ExecuteUbergraph_WBP_Tooltip_BattleScreen, K2Node_CustomEvent_TooltipDesc) == 0x000018, "Member 'WBP_Tooltip_BattleScreen_C_ExecuteUbergraph_WBP_Tooltip_BattleScreen::K2Node_CustomEvent_TooltipDesc' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_BattleScreen_C_ExecuteUbergraph_WBP_Tooltip_BattleScreen, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'WBP_Tooltip_BattleScreen_C_ExecuteUbergraph_WBP_Tooltip_BattleScreen::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_BattleScreen_C_ExecuteUbergraph_WBP_Tooltip_BattleScreen, CallFunc_PlayAnimation_ReturnValue_1) == 0x000030, "Member 'WBP_Tooltip_BattleScreen_C_ExecuteUbergraph_WBP_Tooltip_BattleScreen::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_BattleScreen_C_ExecuteUbergraph_WBP_Tooltip_BattleScreen, CallFunc_IsDisappearAnimPlaying_ReturnValue) == 0x000038, "Member 'WBP_Tooltip_BattleScreen_C_ExecuteUbergraph_WBP_Tooltip_BattleScreen::CallFunc_IsDisappearAnimPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_BattleScreen_C_ExecuteUbergraph_WBP_Tooltip_BattleScreen, CallFunc_IsTooltipVisible_IsVisible) == 0x000039, "Member 'WBP_Tooltip_BattleScreen_C_ExecuteUbergraph_WBP_Tooltip_BattleScreen::CallFunc_IsTooltipVisible_IsVisible' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_BattleScreen_C_ExecuteUbergraph_WBP_Tooltip_BattleScreen, CallFunc_Not_PreBool_ReturnValue) == 0x00003A, "Member 'WBP_Tooltip_BattleScreen_C_ExecuteUbergraph_WBP_Tooltip_BattleScreen::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_BattleScreen_C_ExecuteUbergraph_WBP_Tooltip_BattleScreen, CallFunc_BooleanAND_ReturnValue) == 0x00003B, "Member 'WBP_Tooltip_BattleScreen_C_ExecuteUbergraph_WBP_Tooltip_BattleScreen::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_Tooltip_BattleScreen.WBP_Tooltip_BattleScreen_C.IsDisappearAnimPlaying
// 0x0005 (0x0005 - 0x0000)
struct WBP_Tooltip_BattleScreen_C_IsDisappearAnimPlaying final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlayingForward_ReturnValue;    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Tooltip_BattleScreen_C_IsDisappearAnimPlaying) == 0x000001, "Wrong alignment on WBP_Tooltip_BattleScreen_C_IsDisappearAnimPlaying");
static_assert(sizeof(WBP_Tooltip_BattleScreen_C_IsDisappearAnimPlaying) == 0x000005, "Wrong size on WBP_Tooltip_BattleScreen_C_IsDisappearAnimPlaying");
static_assert(offsetof(WBP_Tooltip_BattleScreen_C_IsDisappearAnimPlaying, ReturnValue) == 0x000000, "Member 'WBP_Tooltip_BattleScreen_C_IsDisappearAnimPlaying::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_BattleScreen_C_IsDisappearAnimPlaying, CallFunc_IsAnimationPlayingForward_ReturnValue) == 0x000001, "Member 'WBP_Tooltip_BattleScreen_C_IsDisappearAnimPlaying::CallFunc_IsAnimationPlayingForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_BattleScreen_C_IsDisappearAnimPlaying, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000002, "Member 'WBP_Tooltip_BattleScreen_C_IsDisappearAnimPlaying::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_BattleScreen_C_IsDisappearAnimPlaying, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'WBP_Tooltip_BattleScreen_C_IsDisappearAnimPlaying::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_BattleScreen_C_IsDisappearAnimPlaying, CallFunc_BooleanAND_ReturnValue) == 0x000004, "Member 'WBP_Tooltip_BattleScreen_C_IsDisappearAnimPlaying::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_Tooltip_BattleScreen.WBP_Tooltip_BattleScreen_C.IsTooltipVisible
// 0x0002 (0x0002 - 0x0000)
struct WBP_Tooltip_BattleScreen_C_IsTooltipVisible final
{
public:
	bool                                          IsVisible_0;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Tooltip_BattleScreen_C_IsTooltipVisible) == 0x000001, "Wrong alignment on WBP_Tooltip_BattleScreen_C_IsTooltipVisible");
static_assert(sizeof(WBP_Tooltip_BattleScreen_C_IsTooltipVisible) == 0x000002, "Wrong size on WBP_Tooltip_BattleScreen_C_IsTooltipVisible");
static_assert(offsetof(WBP_Tooltip_BattleScreen_C_IsTooltipVisible, IsVisible_0) == 0x000000, "Member 'WBP_Tooltip_BattleScreen_C_IsTooltipVisible::IsVisible_0' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_BattleScreen_C_IsTooltipVisible, CallFunc_IsVisible_ReturnValue) == 0x000001, "Member 'WBP_Tooltip_BattleScreen_C_IsTooltipVisible::CallFunc_IsVisible_ReturnValue' has a wrong offset!");

// Function WBP_Tooltip_BattleScreen.WBP_Tooltip_BattleScreen_C.ShowTooltip
// 0x0020 (0x0020 - 0x0000)
struct WBP_Tooltip_BattleScreen_C_ShowTooltip final
{
public:
	class FText                                   TooltipName_0;                                     // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   TooltipDesc;                                       // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Tooltip_BattleScreen_C_ShowTooltip) == 0x000008, "Wrong alignment on WBP_Tooltip_BattleScreen_C_ShowTooltip");
static_assert(sizeof(WBP_Tooltip_BattleScreen_C_ShowTooltip) == 0x000020, "Wrong size on WBP_Tooltip_BattleScreen_C_ShowTooltip");
static_assert(offsetof(WBP_Tooltip_BattleScreen_C_ShowTooltip, TooltipName_0) == 0x000000, "Member 'WBP_Tooltip_BattleScreen_C_ShowTooltip::TooltipName_0' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_BattleScreen_C_ShowTooltip, TooltipDesc) == 0x000010, "Member 'WBP_Tooltip_BattleScreen_C_ShowTooltip::TooltipDesc' has a wrong offset!");

}

