#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DecoratorWidget_Keyword

#include "Basic.hpp"

#include "SandFall_classes.hpp"
#include "Engine_structs.hpp"
#include "S_RichTextDecorator_KeywordStyle_structs.hpp"
#include "E_RichTextDecorator_Keyword_IconPosition_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DecoratorWidget_Keyword.WBP_DecoratorWidget_Keyword_C
// 0x0090 (0x06D0 - 0x0640)
class alignas(0x10) UWBP_DecoratorWidget_Keyword_C final : public URichTextBlockCustomWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0640(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HorizontalBox_LeftIcon;                            // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_RightIcon;                           // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LeftIcon;                                    // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_RightIcon;                                   // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_Content;                             // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_LeftIcon;                                  // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_RightIcon;                                 // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDataTable*                             KeywordStyles;                                     // 0x0680(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FS_RichTextDecorator_KeywordStyle      AppliedStyle;                                      // 0x0688(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_DecoratorWidget_Keyword(int32 EntryPoint);
	void NotifyUpdateNeeded();
	void SetupIconStyle();
	void SetupTextStyle();
	void SetupWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DecoratorWidget_Keyword_C">();
	}
	static class UWBP_DecoratorWidget_Keyword_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DecoratorWidget_Keyword_C>();
	}
};
static_assert(alignof(UWBP_DecoratorWidget_Keyword_C) == 0x000010, "Wrong alignment on UWBP_DecoratorWidget_Keyword_C");
static_assert(sizeof(UWBP_DecoratorWidget_Keyword_C) == 0x0006D0, "Wrong size on UWBP_DecoratorWidget_Keyword_C");
static_assert(offsetof(UWBP_DecoratorWidget_Keyword_C, UberGraphFrame) == 0x000640, "Member 'UWBP_DecoratorWidget_Keyword_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DecoratorWidget_Keyword_C, HorizontalBox_LeftIcon) == 0x000648, "Member 'UWBP_DecoratorWidget_Keyword_C::HorizontalBox_LeftIcon' has a wrong offset!");
static_assert(offsetof(UWBP_DecoratorWidget_Keyword_C, HorizontalBox_RightIcon) == 0x000650, "Member 'UWBP_DecoratorWidget_Keyword_C::HorizontalBox_RightIcon' has a wrong offset!");
static_assert(offsetof(UWBP_DecoratorWidget_Keyword_C, Image_LeftIcon) == 0x000658, "Member 'UWBP_DecoratorWidget_Keyword_C::Image_LeftIcon' has a wrong offset!");
static_assert(offsetof(UWBP_DecoratorWidget_Keyword_C, Image_RightIcon) == 0x000660, "Member 'UWBP_DecoratorWidget_Keyword_C::Image_RightIcon' has a wrong offset!");
static_assert(offsetof(UWBP_DecoratorWidget_Keyword_C, RichTextBlock_Content) == 0x000668, "Member 'UWBP_DecoratorWidget_Keyword_C::RichTextBlock_Content' has a wrong offset!");
static_assert(offsetof(UWBP_DecoratorWidget_Keyword_C, SizeBox_LeftIcon) == 0x000670, "Member 'UWBP_DecoratorWidget_Keyword_C::SizeBox_LeftIcon' has a wrong offset!");
static_assert(offsetof(UWBP_DecoratorWidget_Keyword_C, SizeBox_RightIcon) == 0x000678, "Member 'UWBP_DecoratorWidget_Keyword_C::SizeBox_RightIcon' has a wrong offset!");
static_assert(offsetof(UWBP_DecoratorWidget_Keyword_C, KeywordStyles) == 0x000680, "Member 'UWBP_DecoratorWidget_Keyword_C::KeywordStyles' has a wrong offset!");
static_assert(offsetof(UWBP_DecoratorWidget_Keyword_C, AppliedStyle) == 0x000688, "Member 'UWBP_DecoratorWidget_Keyword_C::AppliedStyle' has a wrong offset!");

}

