#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GM_SkillsList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"
#include "E_jRPG_StatType_structs.hpp"
#include "BlueprintSorting_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GM_SkillsList.WBP_GM_SkillsList_C
// 0x0068 (0x0498 - 0x0430)
class UWBP_GM_SkillsList_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Deactivated;                                  // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGridPanel*                             GridPanel;                                         // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTileView*                        SkillsTileView;                                    // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SkillTooltip_C*                    SkillTooltip;                                      // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SortDropdown_C*                    SortDropdown;                                      // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UBP_DataAsset_Skill_C* SkillData)> OnSkillItemClicked;       // 0x0460(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UBP_DataAsset_Skill_C* SkillData)> OnSkillItemNavigated;     // 0x0470(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UBP_DataAsset_Skill_C* SkillDataLhs, class UBP_DataAsset_Skill_C* SkillDataRhs, class UOrderingResult* OrderingResult)> Dummy_SortSkillData; // 0x0480(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UBP_CharacterData_C*                    CurrentCharacter;                                  // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_GM_SkillsList_SkillsTileView_K2Node_ComponentBoundEvent_3_OnListEntryInitializedDynamic__DelegateSignature(class UObject* Item, class UUserWidget* Widget);
	void BndEvt__WBP_PictosList_PictosTileView_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature(class UUserWidget* Widget);
	void BndEvt__WBP_PictosList_SortDropdown_K2Node_ComponentBoundEvent_0_OnActiveDropdownEntryChanged__DelegateSignature();
	void BndEvt__WBP_PictosList_SortDropdown_K2Node_ComponentBoundEvent_4_OnSortDirectionChanged__DelegateSignature();
	void BP_OnActivated();
	void BP_OnDeactivated();
	void ExecuteUbergraph_WBP_GM_SkillsList(int32 EntryPoint);
	void LoadSkillsForCharacter(class UBP_CharacterData_C* CharacterData);
	void OnSkillElementClicked(class UBP_DataAsset_Skill_C* SkillData);
	void OnSkillElementShortFocused(class UBP_DataAsset_Skill_C* SkillData, const struct FVector2D& AbsolutePos);
	void ShowSkillTooltip(class UBP_DataAsset_Skill_C* InSkillData, const struct FVector2D& AbsolutePos, bool IsCartridge);
	void SkillSortLambda(class UBP_DataAsset_Skill_C* SkillLhs, class UBP_DataAsset_Skill_C* SkillRhs, class UOrderingResult* OrderingResult);
	void SortSkills();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GM_SkillsList_C">();
	}
	static class UWBP_GM_SkillsList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GM_SkillsList_C>();
	}
};
static_assert(alignof(UWBP_GM_SkillsList_C) == 0x000008, "Wrong alignment on UWBP_GM_SkillsList_C");
static_assert(sizeof(UWBP_GM_SkillsList_C) == 0x000498, "Wrong size on UWBP_GM_SkillsList_C");
static_assert(offsetof(UWBP_GM_SkillsList_C, UberGraphFrame) == 0x000430, "Member 'UWBP_GM_SkillsList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GM_SkillsList_C, Anim_Deactivated) == 0x000438, "Member 'UWBP_GM_SkillsList_C::Anim_Deactivated' has a wrong offset!");
static_assert(offsetof(UWBP_GM_SkillsList_C, GridPanel) == 0x000440, "Member 'UWBP_GM_SkillsList_C::GridPanel' has a wrong offset!");
static_assert(offsetof(UWBP_GM_SkillsList_C, SkillsTileView) == 0x000448, "Member 'UWBP_GM_SkillsList_C::SkillsTileView' has a wrong offset!");
static_assert(offsetof(UWBP_GM_SkillsList_C, SkillTooltip) == 0x000450, "Member 'UWBP_GM_SkillsList_C::SkillTooltip' has a wrong offset!");
static_assert(offsetof(UWBP_GM_SkillsList_C, SortDropdown) == 0x000458, "Member 'UWBP_GM_SkillsList_C::SortDropdown' has a wrong offset!");
static_assert(offsetof(UWBP_GM_SkillsList_C, OnSkillItemClicked) == 0x000460, "Member 'UWBP_GM_SkillsList_C::OnSkillItemClicked' has a wrong offset!");
static_assert(offsetof(UWBP_GM_SkillsList_C, OnSkillItemNavigated) == 0x000470, "Member 'UWBP_GM_SkillsList_C::OnSkillItemNavigated' has a wrong offset!");
static_assert(offsetof(UWBP_GM_SkillsList_C, Dummy_SortSkillData) == 0x000480, "Member 'UWBP_GM_SkillsList_C::Dummy_SortSkillData' has a wrong offset!");
static_assert(offsetof(UWBP_GM_SkillsList_C, CurrentCharacter) == 0x000490, "Member 'UWBP_GM_SkillsList_C::CurrentCharacter' has a wrong offset!");

}

