#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Panel_PictosElement

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "EWeaponQuality_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Panel_PictosElement.WBP_Panel_PictosElement_C
// 0x0068 (0x0370 - 0x0308)
class UWBP_Panel_PictosElement_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_BaseButton_C*                      BaseButton;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CharacterMarker_C*                 CharacterMarker;                                   // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FavoriteBullet_C*                  FavoriteBullet;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NotificationBullet_C*              NotificationBullet;                                // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PictoIcon_C*                       PictoIcon;                                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PictoLevel_C*                      PictoLevel;                                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WrappingText_C*                    PictoName;                                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UBP_PictoViewItem_C* PictoViewItem)> OnElementClicked;       // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UBP_PictoViewItem_C*                    PictoViewItem;                                     // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UBP_PictoViewItem_C* PictoViewItem, const struct FVector2D& AbsolutePos)> OnElementNavigated; // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_Panel_PictosElement_BaseButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Panel_PictosElement_BaseButton_K2Node_ComponentBoundEvent_1_OnButtonBaseFocusedHold__DelegateSignature();
	void BndEvt__WBP_Panel_PictosElement_BaseButton_K2Node_ComponentBoundEvent_3_CommonSelectedStateChangedBase__DelegateSignature(class UCommonButtonBase* Button, bool Selected);
	void BndEvt__WBP_Panel_PictosElement_FavoriteBullet_K2Node_ComponentBoundEvent_2_OnSetToFavorite__DelegateSignature();
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void ExecuteUbergraph_WBP_Panel_PictosElement(int32 EntryPoint);
	void LoadTextColor(class UBP_ItemInstance_Gear_C* PictoInstance, class UBP_PictoViewItem_C* PictoViewItem_0);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void OnNextTick();
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void Set_Button_as_Empty();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Panel_PictosElement_C">();
	}
	static class UWBP_Panel_PictosElement_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Panel_PictosElement_C>();
	}
};
static_assert(alignof(UWBP_Panel_PictosElement_C) == 0x000008, "Wrong alignment on UWBP_Panel_PictosElement_C");
static_assert(sizeof(UWBP_Panel_PictosElement_C) == 0x000370, "Wrong size on UWBP_Panel_PictosElement_C");
static_assert(offsetof(UWBP_Panel_PictosElement_C, UberGraphFrame) == 0x000308, "Member 'UWBP_Panel_PictosElement_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_PictosElement_C, BaseButton) == 0x000310, "Member 'UWBP_Panel_PictosElement_C::BaseButton' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_PictosElement_C, CharacterMarker) == 0x000318, "Member 'UWBP_Panel_PictosElement_C::CharacterMarker' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_PictosElement_C, FavoriteBullet) == 0x000320, "Member 'UWBP_Panel_PictosElement_C::FavoriteBullet' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_PictosElement_C, NotificationBullet) == 0x000328, "Member 'UWBP_Panel_PictosElement_C::NotificationBullet' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_PictosElement_C, PictoIcon) == 0x000330, "Member 'UWBP_Panel_PictosElement_C::PictoIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_PictosElement_C, PictoLevel) == 0x000338, "Member 'UWBP_Panel_PictosElement_C::PictoLevel' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_PictosElement_C, PictoName) == 0x000340, "Member 'UWBP_Panel_PictosElement_C::PictoName' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_PictosElement_C, OnElementClicked) == 0x000348, "Member 'UWBP_Panel_PictosElement_C::OnElementClicked' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_PictosElement_C, PictoViewItem) == 0x000358, "Member 'UWBP_Panel_PictosElement_C::PictoViewItem' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_PictosElement_C, OnElementNavigated) == 0x000360, "Member 'UWBP_Panel_PictosElement_C::OnElementNavigated' has a wrong offset!");

}

