#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GM_LuminaHeader

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_GM_LuminaHeader.WBP_GM_LuminaHeader_C.ExecuteUbergraph_WBP_GM_LuminaHeader
// 0x0010 (0x0010 - 0x0000)
struct WBP_GM_LuminaHeader_C_ExecuteUbergraph_WBP_GM_LuminaHeader final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_LuminaHeader_C_ExecuteUbergraph_WBP_GM_LuminaHeader) == 0x000008, "Wrong alignment on WBP_GM_LuminaHeader_C_ExecuteUbergraph_WBP_GM_LuminaHeader");
static_assert(sizeof(WBP_GM_LuminaHeader_C_ExecuteUbergraph_WBP_GM_LuminaHeader) == 0x000010, "Wrong size on WBP_GM_LuminaHeader_C_ExecuteUbergraph_WBP_GM_LuminaHeader");
static_assert(offsetof(WBP_GM_LuminaHeader_C_ExecuteUbergraph_WBP_GM_LuminaHeader, EntryPoint) == 0x000000, "Member 'WBP_GM_LuminaHeader_C_ExecuteUbergraph_WBP_GM_LuminaHeader::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GM_LuminaHeader_C_ExecuteUbergraph_WBP_GM_LuminaHeader, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_GM_LuminaHeader_C_ExecuteUbergraph_WBP_GM_LuminaHeader::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_GM_LuminaHeader.WBP_GM_LuminaHeader_C.SetValues
// 0x0020 (0x0020 - 0x0000)
struct WBP_GM_LuminaHeader_C_SetValues final
{
public:
	int32                                         InUsedPoints;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InMaxPoints;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0010)()
};
static_assert(alignof(WBP_GM_LuminaHeader_C_SetValues) == 0x000008, "Wrong alignment on WBP_GM_LuminaHeader_C_SetValues");
static_assert(sizeof(WBP_GM_LuminaHeader_C_SetValues) == 0x000020, "Wrong size on WBP_GM_LuminaHeader_C_SetValues");
static_assert(offsetof(WBP_GM_LuminaHeader_C_SetValues, InUsedPoints) == 0x000000, "Member 'WBP_GM_LuminaHeader_C_SetValues::InUsedPoints' has a wrong offset!");
static_assert(offsetof(WBP_GM_LuminaHeader_C_SetValues, InMaxPoints) == 0x000004, "Member 'WBP_GM_LuminaHeader_C_SetValues::InMaxPoints' has a wrong offset!");
static_assert(offsetof(WBP_GM_LuminaHeader_C_SetValues, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'WBP_GM_LuminaHeader_C_SetValues::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_LuminaHeader_C_SetValues, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'WBP_GM_LuminaHeader_C_SetValues::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

}

