#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ExplorationPrompt

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EInputAction_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ExplorationPrompt.WBP_ExplorationPrompt_C
// 0x00B0 (0x04E0 - 0x0430)
class UWBP_ExplorationPrompt_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Triggered_Retriggerable;                      // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_AppearPoint;                                  // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_HalfWay;                                      // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Transition;                                   // 0x0450(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_AppearPrompt;                                 // 0x0458(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Triggered;                                    // 0x0460(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_HalfCircleLeft;                              // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_HalfCircleRight;                             // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_paint;                                       // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_TriangleLeft;                                // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_TriangleRight;                               // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Prompt_Text;                                       // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ButtonBinding_C*                   WBP_ButtonBinding;                                 // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ActionText;                                        // 0x04A0(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	EInputAction                                  Game_Action;                                       // 0x04B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFarAway;                                         // 0x04B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B2[0x6];                                      // 0x04B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UWBP_ExplorationPrompt_C* PromptWidget)> OnDisappeared;      // 0x04B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnInteracted;                                      // 0x04C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          Is2DPrompt;                                        // 0x04D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Appear();
	void BndEvt__WBP_ExplorationPrompt_WBP_ButtonBinding_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature(class UWBP_ButtonBinding_C* PromptWidget);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void Construct();
	void DestroyPromptAfterAppearAnimation();
	void Disappear();
	void Event_AppearPoint();
	void Event_HalfwayTo();
	void Event_TransitionToInput();
	void ExecuteUbergraph_WBP_ExplorationPrompt(int32 EntryPoint);
	void OnInteractionTrigger_Retriggerable();
	void OnInteractionTriggered();
	void PreConstruct(bool IsDesignTime);
	void SetPromptParams(const struct FFPromptParams& PromptParams);
	void UpdateContent();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ExplorationPrompt_C">();
	}
	static class UWBP_ExplorationPrompt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ExplorationPrompt_C>();
	}
};
static_assert(alignof(UWBP_ExplorationPrompt_C) == 0x000008, "Wrong alignment on UWBP_ExplorationPrompt_C");
static_assert(sizeof(UWBP_ExplorationPrompt_C) == 0x0004E0, "Wrong size on UWBP_ExplorationPrompt_C");
static_assert(offsetof(UWBP_ExplorationPrompt_C, UberGraphFrame) == 0x000430, "Member 'UWBP_ExplorationPrompt_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ExplorationPrompt_C, Anim_Triggered_Retriggerable) == 0x000438, "Member 'UWBP_ExplorationPrompt_C::Anim_Triggered_Retriggerable' has a wrong offset!");
static_assert(offsetof(UWBP_ExplorationPrompt_C, Anim_AppearPoint) == 0x000440, "Member 'UWBP_ExplorationPrompt_C::Anim_AppearPoint' has a wrong offset!");
static_assert(offsetof(UWBP_ExplorationPrompt_C, Anim_HalfWay) == 0x000448, "Member 'UWBP_ExplorationPrompt_C::Anim_HalfWay' has a wrong offset!");
static_assert(offsetof(UWBP_ExplorationPrompt_C, Anim_Transition) == 0x000450, "Member 'UWBP_ExplorationPrompt_C::Anim_Transition' has a wrong offset!");
static_assert(offsetof(UWBP_ExplorationPrompt_C, Anim_AppearPrompt) == 0x000458, "Member 'UWBP_ExplorationPrompt_C::Anim_AppearPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_ExplorationPrompt_C, Anim_Triggered) == 0x000460, "Member 'UWBP_ExplorationPrompt_C::Anim_Triggered' has a wrong offset!");
static_assert(offsetof(UWBP_ExplorationPrompt_C, Image_HalfCircleLeft) == 0x000468, "Member 'UWBP_ExplorationPrompt_C::Image_HalfCircleLeft' has a wrong offset!");
static_assert(offsetof(UWBP_ExplorationPrompt_C, Image_HalfCircleRight) == 0x000470, "Member 'UWBP_ExplorationPrompt_C::Image_HalfCircleRight' has a wrong offset!");
static_assert(offsetof(UWBP_ExplorationPrompt_C, Image_paint) == 0x000478, "Member 'UWBP_ExplorationPrompt_C::Image_paint' has a wrong offset!");
static_assert(offsetof(UWBP_ExplorationPrompt_C, Image_TriangleLeft) == 0x000480, "Member 'UWBP_ExplorationPrompt_C::Image_TriangleLeft' has a wrong offset!");
static_assert(offsetof(UWBP_ExplorationPrompt_C, Image_TriangleRight) == 0x000488, "Member 'UWBP_ExplorationPrompt_C::Image_TriangleRight' has a wrong offset!");
static_assert(offsetof(UWBP_ExplorationPrompt_C, Prompt_Text) == 0x000490, "Member 'UWBP_ExplorationPrompt_C::Prompt_Text' has a wrong offset!");
static_assert(offsetof(UWBP_ExplorationPrompt_C, WBP_ButtonBinding) == 0x000498, "Member 'UWBP_ExplorationPrompt_C::WBP_ButtonBinding' has a wrong offset!");
static_assert(offsetof(UWBP_ExplorationPrompt_C, ActionText) == 0x0004A0, "Member 'UWBP_ExplorationPrompt_C::ActionText' has a wrong offset!");
static_assert(offsetof(UWBP_ExplorationPrompt_C, Game_Action) == 0x0004B0, "Member 'UWBP_ExplorationPrompt_C::Game_Action' has a wrong offset!");
static_assert(offsetof(UWBP_ExplorationPrompt_C, IsFarAway) == 0x0004B1, "Member 'UWBP_ExplorationPrompt_C::IsFarAway' has a wrong offset!");
static_assert(offsetof(UWBP_ExplorationPrompt_C, OnDisappeared) == 0x0004B8, "Member 'UWBP_ExplorationPrompt_C::OnDisappeared' has a wrong offset!");
static_assert(offsetof(UWBP_ExplorationPrompt_C, OnInteracted) == 0x0004C8, "Member 'UWBP_ExplorationPrompt_C::OnInteracted' has a wrong offset!");
static_assert(offsetof(UWBP_ExplorationPrompt_C, Is2DPrompt) == 0x0004D8, "Member 'UWBP_ExplorationPrompt_C::Is2DPrompt' has a wrong offset!");

}

