#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GradientChargeGauge

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_GradientChargeGauge.WBP_GradientChargeGauge_C.ExecuteUbergraph_WBP_GradientChargeGauge
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetChargeColor_ReturnValue;               // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ABP_jRPG_Character_Battle_Base_C* Character)> K2Node_CreateDelegate_OutputDelegate; // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetChargeColor_ReturnValue_1;             // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraUIComponent*                    CallFunc_GetNiagaraComponent_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_PreviousProgress;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PreviousCharges;                // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue_1;           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0060(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetCurrentProgress_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAvailableCharges_ReturnValue;          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(double PreviousProgress, int32 PreviousCharges)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0074(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue_2;           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Character_Battle_Base_C*       K2Node_CustomEvent_Character;                      // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerTeamCharacter_IsPlayerTeam;       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraUIComponent*                    CallFunc_GetNiagaraComponent_ReturnValue_1;        // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge) == 0x000008, "Wrong alignment on WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge");
static_assert(sizeof(WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge) == 0x0000B0, "Wrong size on WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge");
static_assert(offsetof(WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge, EntryPoint) == 0x000000, "Member 'WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge, CallFunc_GetChargeColor_ReturnValue) == 0x000004, "Member 'WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge::CallFunc_GetChargeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge, CallFunc_GetChargeColor_ReturnValue_1) == 0x000024, "Member 'WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge::CallFunc_GetChargeColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge, CallFunc_GetNiagaraComponent_ReturnValue) == 0x000038, "Member 'WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge::CallFunc_GetNiagaraComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge, CallFunc_GetBattleManager_ReturnValue) == 0x000040, "Member 'WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge, K2Node_CustomEvent_PreviousProgress) == 0x000048, "Member 'WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge::K2Node_CustomEvent_PreviousProgress' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge, K2Node_CustomEvent_PreviousCharges) == 0x000050, "Member 'WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge::K2Node_CustomEvent_PreviousCharges' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge, K2Node_Event_IsDesignTime) == 0x000054, "Member 'WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge, CallFunc_GetBattleManager_ReturnValue_1) == 0x000058, "Member 'WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge::CallFunc_GetBattleManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge, K2Node_Event_Animation) == 0x000060, "Member 'WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge, CallFunc_GetCurrentProgress_ReturnValue) == 0x000068, "Member 'WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge::CallFunc_GetCurrentProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge, CallFunc_GetAvailableCharges_ReturnValue) == 0x000070, "Member 'WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge::CallFunc_GetAvailableCharges_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge, K2Node_CreateDelegate_OutputDelegate_1) == 0x000074, "Member 'WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000084, "Member 'WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge, CallFunc_GetBattleManager_ReturnValue_2) == 0x000088, "Member 'WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge::CallFunc_GetBattleManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge, K2Node_CustomEvent_Character) == 0x000090, "Member 'WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge, CallFunc_IsPlayerTeamCharacter_IsPlayerTeam) == 0x000098, "Member 'WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge::CallFunc_IsPlayerTeamCharacter_IsPlayerTeam' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge, CallFunc_Greater_IntInt_ReturnValue) == 0x000099, "Member 'WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge, CallFunc_GetNiagaraComponent_ReturnValue_1) == 0x0000A0, "Member 'WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge::CallFunc_GetNiagaraComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge, CallFunc_BooleanAND_ReturnValue) == 0x0000A8, "Member 'WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x0000AC, "Member 'WBP_GradientChargeGauge_C_ExecuteUbergraph_WBP_GradientChargeGauge::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");

// Function WBP_GradientChargeGauge.WBP_GradientChargeGauge_C.FeedbackOnTurnStart
// 0x0008 (0x0008 - 0x0000)
struct WBP_GradientChargeGauge_C_FeedbackOnTurnStart final
{
public:
	class ABP_jRPG_Character_Battle_Base_C*       Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GradientChargeGauge_C_FeedbackOnTurnStart) == 0x000008, "Wrong alignment on WBP_GradientChargeGauge_C_FeedbackOnTurnStart");
static_assert(sizeof(WBP_GradientChargeGauge_C_FeedbackOnTurnStart) == 0x000008, "Wrong size on WBP_GradientChargeGauge_C_FeedbackOnTurnStart");
static_assert(offsetof(WBP_GradientChargeGauge_C_FeedbackOnTurnStart, Character) == 0x000000, "Member 'WBP_GradientChargeGauge_C_FeedbackOnTurnStart::Character' has a wrong offset!");

// Function WBP_GradientChargeGauge.WBP_GradientChargeGauge_C.FX_SetParameters
// 0x0050 (0x0050 - 0x0000)
struct WBP_GradientChargeGauge_C_FX_SetParameters final
{
public:
	class UFXSystemComponent*                     System;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Size;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Gravity;                                           // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CenterColor;                                       // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           OuterColor;                                        // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Lifetime;                                          // 0x0048(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpawnRate;                                         // 0x004C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GradientChargeGauge_C_FX_SetParameters) == 0x000008, "Wrong alignment on WBP_GradientChargeGauge_C_FX_SetParameters");
static_assert(sizeof(WBP_GradientChargeGauge_C_FX_SetParameters) == 0x000050, "Wrong size on WBP_GradientChargeGauge_C_FX_SetParameters");
static_assert(offsetof(WBP_GradientChargeGauge_C_FX_SetParameters, System) == 0x000000, "Member 'WBP_GradientChargeGauge_C_FX_SetParameters::System' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_FX_SetParameters, Size) == 0x000008, "Member 'WBP_GradientChargeGauge_C_FX_SetParameters::Size' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_FX_SetParameters, Gravity) == 0x000010, "Member 'WBP_GradientChargeGauge_C_FX_SetParameters::Gravity' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_FX_SetParameters, CenterColor) == 0x000028, "Member 'WBP_GradientChargeGauge_C_FX_SetParameters::CenterColor' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_FX_SetParameters, OuterColor) == 0x000038, "Member 'WBP_GradientChargeGauge_C_FX_SetParameters::OuterColor' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_FX_SetParameters, Lifetime) == 0x000048, "Member 'WBP_GradientChargeGauge_C_FX_SetParameters::Lifetime' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_FX_SetParameters, SpawnRate) == 0x00004C, "Member 'WBP_GradientChargeGauge_C_FX_SetParameters::SpawnRate' has a wrong offset!");

// Function WBP_GradientChargeGauge.WBP_GradientChargeGauge_C.GetChargeColor
// 0x0038 (0x0038 - 0x0000)
struct WBP_GradientChargeGauge_C_GetChargeColor final
{
public:
	int32                                         Charges;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ReturnValue;                                       // 0x0004(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GradientChargeGauge_C_GetChargeColor) == 0x000004, "Wrong alignment on WBP_GradientChargeGauge_C_GetChargeColor");
static_assert(sizeof(WBP_GradientChargeGauge_C_GetChargeColor) == 0x000038, "Wrong size on WBP_GradientChargeGauge_C_GetChargeColor");
static_assert(offsetof(WBP_GradientChargeGauge_C_GetChargeColor, Charges) == 0x000000, "Member 'WBP_GradientChargeGauge_C_GetChargeColor::Charges' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_GetChargeColor, ReturnValue) == 0x000004, "Member 'WBP_GradientChargeGauge_C_GetChargeColor::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_GetChargeColor, Temp_int_Variable) == 0x000014, "Member 'WBP_GradientChargeGauge_C_GetChargeColor::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_GetChargeColor, Temp_struct_Variable) == 0x000018, "Member 'WBP_GradientChargeGauge_C_GetChargeColor::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_GetChargeColor, K2Node_Select_Default) == 0x000028, "Member 'WBP_GradientChargeGauge_C_GetChargeColor::K2Node_Select_Default' has a wrong offset!");

// Function WBP_GradientChargeGauge.WBP_GradientChargeGauge_C.Initialize
// 0x0038 (0x0038 - 0x0000)
struct WBP_GradientChargeGauge_C_Initialize final
{
public:
	bool                                          IsPreview;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAvailableCharges_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetCurrentProgress_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default_1;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_2;                           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GradientChargeGauge_C_Initialize) == 0x000008, "Wrong alignment on WBP_GradientChargeGauge_C_Initialize");
static_assert(sizeof(WBP_GradientChargeGauge_C_Initialize) == 0x000038, "Wrong size on WBP_GradientChargeGauge_C_Initialize");
static_assert(offsetof(WBP_GradientChargeGauge_C_Initialize, IsPreview) == 0x000000, "Member 'WBP_GradientChargeGauge_C_Initialize::IsPreview' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_Initialize, Temp_bool_Variable) == 0x000001, "Member 'WBP_GradientChargeGauge_C_Initialize::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_Initialize, Temp_bool_Variable_1) == 0x000002, "Member 'WBP_GradientChargeGauge_C_Initialize::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_Initialize, Temp_bool_Variable_2) == 0x000003, "Member 'WBP_GradientChargeGauge_C_Initialize::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_Initialize, CallFunc_GetBattleManager_ReturnValue) == 0x000008, "Member 'WBP_GradientChargeGauge_C_Initialize::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_Initialize, CallFunc_GetAvailableCharges_ReturnValue) == 0x000010, "Member 'WBP_GradientChargeGauge_C_Initialize::CallFunc_GetAvailableCharges_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_Initialize, CallFunc_GetCurrentProgress_ReturnValue) == 0x000018, "Member 'WBP_GradientChargeGauge_C_Initialize::CallFunc_GetCurrentProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_Initialize, K2Node_Select_Default) == 0x000020, "Member 'WBP_GradientChargeGauge_C_Initialize::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_Initialize, K2Node_Select_Default_1) == 0x000028, "Member 'WBP_GradientChargeGauge_C_Initialize::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_Initialize, K2Node_Select_Default_2) == 0x000030, "Member 'WBP_GradientChargeGauge_C_Initialize::K2Node_Select_Default_2' has a wrong offset!");

// Function WBP_GradientChargeGauge.WBP_GradientChargeGauge_C.IsGainingCharges
// 0x0002 (0x0002 - 0x0000)
struct WBP_GradientChargeGauge_C_IsGainingCharges final
{
public:
	bool                                          IsGainingCharges_0;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GradientChargeGauge_C_IsGainingCharges) == 0x000001, "Wrong alignment on WBP_GradientChargeGauge_C_IsGainingCharges");
static_assert(sizeof(WBP_GradientChargeGauge_C_IsGainingCharges) == 0x000002, "Wrong size on WBP_GradientChargeGauge_C_IsGainingCharges");
static_assert(offsetof(WBP_GradientChargeGauge_C_IsGainingCharges, IsGainingCharges_0) == 0x000000, "Member 'WBP_GradientChargeGauge_C_IsGainingCharges::IsGainingCharges_0' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_IsGainingCharges, CallFunc_Greater_IntInt_ReturnValue) == 0x000001, "Member 'WBP_GradientChargeGauge_C_IsGainingCharges::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_GradientChargeGauge.WBP_GradientChargeGauge_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct WBP_GradientChargeGauge_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GradientChargeGauge_C_OnAnimationFinished) == 0x000008, "Wrong alignment on WBP_GradientChargeGauge_C_OnAnimationFinished");
static_assert(sizeof(WBP_GradientChargeGauge_C_OnAnimationFinished) == 0x000008, "Wrong size on WBP_GradientChargeGauge_C_OnAnimationFinished");
static_assert(offsetof(WBP_GradientChargeGauge_C_OnAnimationFinished, Animation) == 0x000000, "Member 'WBP_GradientChargeGauge_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function WBP_GradientChargeGauge.WBP_GradientChargeGauge_C.OnGradientGaugeChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_GradientChargeGauge_C_OnGradientGaugeChanged final
{
public:
	double                                        PreviousProgress;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PreviousCharges;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GradientChargeGauge_C_OnGradientGaugeChanged) == 0x000008, "Wrong alignment on WBP_GradientChargeGauge_C_OnGradientGaugeChanged");
static_assert(sizeof(WBP_GradientChargeGauge_C_OnGradientGaugeChanged) == 0x000010, "Wrong size on WBP_GradientChargeGauge_C_OnGradientGaugeChanged");
static_assert(offsetof(WBP_GradientChargeGauge_C_OnGradientGaugeChanged, PreviousProgress) == 0x000000, "Member 'WBP_GradientChargeGauge_C_OnGradientGaugeChanged::PreviousProgress' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_OnGradientGaugeChanged, PreviousCharges) == 0x000008, "Member 'WBP_GradientChargeGauge_C_OnGradientGaugeChanged::PreviousCharges' has a wrong offset!");

// Function WBP_GradientChargeGauge.WBP_GradientChargeGauge_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_GradientChargeGauge_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GradientChargeGauge_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_GradientChargeGauge_C_PreConstruct");
static_assert(sizeof(WBP_GradientChargeGauge_C_PreConstruct) == 0x000001, "Wrong size on WBP_GradientChargeGauge_C_PreConstruct");
static_assert(offsetof(WBP_GradientChargeGauge_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_GradientChargeGauge_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_GradientChargeGauge.WBP_GradientChargeGauge_C.SetCharges
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_GradientChargeGauge_C_SetCharges final
{
public:
	int32                                         PreviousCharges;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentCharges;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_2;                            // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_3;                            // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default;                             // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetChargeColor_ReturnValue;               // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0078(0x0010)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0088(0x0014)()
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraUIComponent*                    CallFunc_GetNiagaraComponent_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGainingCharges_IsGainingCharges;        // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetChargeColor_ReturnValue_1;             // 0x00AC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GradientChargeGauge_C_SetCharges) == 0x000008, "Wrong alignment on WBP_GradientChargeGauge_C_SetCharges");
static_assert(sizeof(WBP_GradientChargeGauge_C_SetCharges) == 0x0000C8, "Wrong size on WBP_GradientChargeGauge_C_SetCharges");
static_assert(offsetof(WBP_GradientChargeGauge_C_SetCharges, PreviousCharges) == 0x000000, "Member 'WBP_GradientChargeGauge_C_SetCharges::PreviousCharges' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_SetCharges, CurrentCharges) == 0x000004, "Member 'WBP_GradientChargeGauge_C_SetCharges::CurrentCharges' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_SetCharges, Temp_struct_Variable) == 0x000008, "Member 'WBP_GradientChargeGauge_C_SetCharges::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_SetCharges, Temp_struct_Variable_1) == 0x000018, "Member 'WBP_GradientChargeGauge_C_SetCharges::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_SetCharges, Temp_struct_Variable_2) == 0x000028, "Member 'WBP_GradientChargeGauge_C_SetCharges::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_SetCharges, Temp_struct_Variable_3) == 0x000038, "Member 'WBP_GradientChargeGauge_C_SetCharges::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_SetCharges, Temp_int_Variable) == 0x000048, "Member 'WBP_GradientChargeGauge_C_SetCharges::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_SetCharges, K2Node_Select_Default) == 0x000050, "Member 'WBP_GradientChargeGauge_C_SetCharges::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_SetCharges, CallFunc_Greater_IntInt_ReturnValue) == 0x000060, "Member 'WBP_GradientChargeGauge_C_SetCharges::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_SetCharges, CallFunc_GetChargeColor_ReturnValue) == 0x000064, "Member 'WBP_GradientChargeGauge_C_SetCharges::CallFunc_GetChargeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_SetCharges, CallFunc_Conv_IntToText_ReturnValue) == 0x000078, "Member 'WBP_GradientChargeGauge_C_SetCharges::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_SetCharges, K2Node_MakeStruct_SlateColor) == 0x000088, "Member 'WBP_GradientChargeGauge_C_SetCharges::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_SetCharges, CallFunc_GetNiagaraComponent_ReturnValue) == 0x0000A0, "Member 'WBP_GradientChargeGauge_C_SetCharges::CallFunc_GetNiagaraComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_SetCharges, CallFunc_IsGainingCharges_IsGainingCharges) == 0x0000A8, "Member 'WBP_GradientChargeGauge_C_SetCharges::CallFunc_IsGainingCharges_IsGainingCharges' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_SetCharges, CallFunc_GetChargeColor_ReturnValue_1) == 0x0000AC, "Member 'WBP_GradientChargeGauge_C_SetCharges::CallFunc_GetChargeColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_SetCharges, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000C0, "Member 'WBP_GradientChargeGauge_C_SetCharges::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WBP_GradientChargeGauge.WBP_GradientChargeGauge_C.SetDistortLerpAlpha
// 0x0048 (0x0048 - 0x0000)
struct WBP_GradientChargeGauge_C_SetDistortLerpAlpha final
{
public:
	double                                        DistortLerpAlpha_0;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GradientChargeGauge_C_SetDistortLerpAlpha) == 0x000008, "Wrong alignment on WBP_GradientChargeGauge_C_SetDistortLerpAlpha");
static_assert(sizeof(WBP_GradientChargeGauge_C_SetDistortLerpAlpha) == 0x000048, "Wrong size on WBP_GradientChargeGauge_C_SetDistortLerpAlpha");
static_assert(offsetof(WBP_GradientChargeGauge_C_SetDistortLerpAlpha, DistortLerpAlpha_0) == 0x000000, "Member 'WBP_GradientChargeGauge_C_SetDistortLerpAlpha::DistortLerpAlpha_0' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_SetDistortLerpAlpha, CallFunc_BreakVector2D_X) == 0x000008, "Member 'WBP_GradientChargeGauge_C_SetDistortLerpAlpha::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_SetDistortLerpAlpha, CallFunc_BreakVector2D_Y) == 0x000010, "Member 'WBP_GradientChargeGauge_C_SetDistortLerpAlpha::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_SetDistortLerpAlpha, CallFunc_BreakVector2D_X_1) == 0x000018, "Member 'WBP_GradientChargeGauge_C_SetDistortLerpAlpha::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_SetDistortLerpAlpha, CallFunc_BreakVector2D_Y_1) == 0x000020, "Member 'WBP_GradientChargeGauge_C_SetDistortLerpAlpha::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_SetDistortLerpAlpha, CallFunc_Lerp_ReturnValue) == 0x000028, "Member 'WBP_GradientChargeGauge_C_SetDistortLerpAlpha::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_SetDistortLerpAlpha, CallFunc_Lerp_ReturnValue_1) == 0x000030, "Member 'WBP_GradientChargeGauge_C_SetDistortLerpAlpha::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_SetDistortLerpAlpha, CallFunc_MakeVector2D_ReturnValue) == 0x000038, "Member 'WBP_GradientChargeGauge_C_SetDistortLerpAlpha::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function WBP_GradientChargeGauge.WBP_GradientChargeGauge_C.SetGaugeLerpAlpha
// 0x0040 (0x0040 - 0x0000)
struct WBP_GradientChargeGauge_C_SetGaugeLerpAlpha final
{
public:
	double                                        GaugeLerpAlpha_0;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GradientChargeGauge_C_SetGaugeLerpAlpha) == 0x000008, "Wrong alignment on WBP_GradientChargeGauge_C_SetGaugeLerpAlpha");
static_assert(sizeof(WBP_GradientChargeGauge_C_SetGaugeLerpAlpha) == 0x000040, "Wrong size on WBP_GradientChargeGauge_C_SetGaugeLerpAlpha");
static_assert(offsetof(WBP_GradientChargeGauge_C_SetGaugeLerpAlpha, GaugeLerpAlpha_0) == 0x000000, "Member 'WBP_GradientChargeGauge_C_SetGaugeLerpAlpha::GaugeLerpAlpha_0' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_SetGaugeLerpAlpha, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'WBP_GradientChargeGauge_C_SetGaugeLerpAlpha::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_SetGaugeLerpAlpha, CallFunc_Lerp_ReturnValue) == 0x000010, "Member 'WBP_GradientChargeGauge_C_SetGaugeLerpAlpha::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_SetGaugeLerpAlpha, CallFunc_MapRangeClamped_ReturnValue) == 0x000018, "Member 'WBP_GradientChargeGauge_C_SetGaugeLerpAlpha::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_SetGaugeLerpAlpha, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000020, "Member 'WBP_GradientChargeGauge_C_SetGaugeLerpAlpha::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_SetGaugeLerpAlpha, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000028, "Member 'WBP_GradientChargeGauge_C_SetGaugeLerpAlpha::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_SetGaugeLerpAlpha, CallFunc_MakeVector2D_ReturnValue) == 0x000030, "Member 'WBP_GradientChargeGauge_C_SetGaugeLerpAlpha::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function WBP_GradientChargeGauge.WBP_GradientChargeGauge_C.SetGlowLerpAlpha
// 0x0020 (0x0020 - 0x0000)
struct WBP_GradientChargeGauge_C_SetGlowLerpAlpha final
{
public:
	double                                        GlowLerpAlpha_0;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GradientChargeGauge_C_SetGlowLerpAlpha) == 0x000008, "Wrong alignment on WBP_GradientChargeGauge_C_SetGlowLerpAlpha");
static_assert(sizeof(WBP_GradientChargeGauge_C_SetGlowLerpAlpha) == 0x000020, "Wrong size on WBP_GradientChargeGauge_C_SetGlowLerpAlpha");
static_assert(offsetof(WBP_GradientChargeGauge_C_SetGlowLerpAlpha, GlowLerpAlpha_0) == 0x000000, "Member 'WBP_GradientChargeGauge_C_SetGlowLerpAlpha::GlowLerpAlpha_0' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_SetGlowLerpAlpha, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'WBP_GradientChargeGauge_C_SetGlowLerpAlpha::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_SetGlowLerpAlpha, CallFunc_GetEffectMaterial_ReturnValue) == 0x000010, "Member 'WBP_GradientChargeGauge_C_SetGlowLerpAlpha::CallFunc_GetEffectMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_SetGlowLerpAlpha, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000018, "Member 'WBP_GradientChargeGauge_C_SetGlowLerpAlpha::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_GradientChargeGauge.WBP_GradientChargeGauge_C.SetProgress
// 0x0038 (0x0038 - 0x0000)
struct WBP_GradientChargeGauge_C_SetProgress final
{
public:
	double                                        TargetProgress;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GradientChargeGauge_C_SetProgress) == 0x000008, "Wrong alignment on WBP_GradientChargeGauge_C_SetProgress");
static_assert(sizeof(WBP_GradientChargeGauge_C_SetProgress) == 0x000038, "Wrong size on WBP_GradientChargeGauge_C_SetProgress");
static_assert(offsetof(WBP_GradientChargeGauge_C_SetProgress, TargetProgress) == 0x000000, "Member 'WBP_GradientChargeGauge_C_SetProgress::TargetProgress' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_SetProgress, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_GradientChargeGauge_C_SetProgress::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GradientChargeGauge_C_SetProgress, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_GradientChargeGauge_C_SetProgress::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
