#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AttributesWheel

#include "Basic.hpp"

#include "ECharacterAttribute_structs.hpp"
#include "EAttributeScalingGrade_structs.hpp"


namespace SDK::Params
{

// Function WBP_AttributesWheel.WBP_AttributesWheel_C.ExecuteUbergraph_WBP_AttributesWheel
// 0x0060 (0x0060 - 0x0000)
struct WBP_AttributesWheel_C_ExecuteUbergraph_WBP_AttributesWheel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterAttribute                           CallFunc_GetAttributeType_OutAttribute;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterAttribute                           CallFunc_GetAttributeType_OutAttribute_1;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterAttribute                           CallFunc_GetAttributeType_OutAttribute_2;          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterAttribute                           CallFunc_GetAttributeType_OutAttribute_3;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterAttribute                           CallFunc_GetAttributeType_OutAttribute_4;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<ECharacterAttribute, class UWBP_AttributeStat_C*> K2Node_MakeMap_Map;                       // 0x0010(0x0050)(ContainsInstancedReference)
};
static_assert(alignof(WBP_AttributesWheel_C_ExecuteUbergraph_WBP_AttributesWheel) == 0x000008, "Wrong alignment on WBP_AttributesWheel_C_ExecuteUbergraph_WBP_AttributesWheel");
static_assert(sizeof(WBP_AttributesWheel_C_ExecuteUbergraph_WBP_AttributesWheel) == 0x000060, "Wrong size on WBP_AttributesWheel_C_ExecuteUbergraph_WBP_AttributesWheel");
static_assert(offsetof(WBP_AttributesWheel_C_ExecuteUbergraph_WBP_AttributesWheel, EntryPoint) == 0x000000, "Member 'WBP_AttributesWheel_C_ExecuteUbergraph_WBP_AttributesWheel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_ExecuteUbergraph_WBP_AttributesWheel, CallFunc_GetAttributeType_OutAttribute) == 0x000004, "Member 'WBP_AttributesWheel_C_ExecuteUbergraph_WBP_AttributesWheel::CallFunc_GetAttributeType_OutAttribute' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_ExecuteUbergraph_WBP_AttributesWheel, K2Node_Event_IsDesignTime) == 0x000005, "Member 'WBP_AttributesWheel_C_ExecuteUbergraph_WBP_AttributesWheel::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_ExecuteUbergraph_WBP_AttributesWheel, CallFunc_GetAttributeType_OutAttribute_1) == 0x000006, "Member 'WBP_AttributesWheel_C_ExecuteUbergraph_WBP_AttributesWheel::CallFunc_GetAttributeType_OutAttribute_1' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_ExecuteUbergraph_WBP_AttributesWheel, CallFunc_GetAttributeType_OutAttribute_2) == 0x000007, "Member 'WBP_AttributesWheel_C_ExecuteUbergraph_WBP_AttributesWheel::CallFunc_GetAttributeType_OutAttribute_2' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_ExecuteUbergraph_WBP_AttributesWheel, CallFunc_GetAttributeType_OutAttribute_3) == 0x000008, "Member 'WBP_AttributesWheel_C_ExecuteUbergraph_WBP_AttributesWheel::CallFunc_GetAttributeType_OutAttribute_3' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_ExecuteUbergraph_WBP_AttributesWheel, CallFunc_GetAttributeType_OutAttribute_4) == 0x000009, "Member 'WBP_AttributesWheel_C_ExecuteUbergraph_WBP_AttributesWheel::CallFunc_GetAttributeType_OutAttribute_4' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_ExecuteUbergraph_WBP_AttributesWheel, K2Node_MakeMap_Map) == 0x000010, "Member 'WBP_AttributesWheel_C_ExecuteUbergraph_WBP_AttributesWheel::K2Node_MakeMap_Map' has a wrong offset!");

// Function WBP_AttributesWheel.WBP_AttributesWheel_C.LoadCharacterData
// 0x0108 (0x0108 - 0x0000)
struct WBP_AttributesWheel_C_LoadCharacterData final
{
public:
	class UBP_CharacterData_C*                    InCharacterData;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEquippedWeaponItemInstance_Valid;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ItemInstance_Gear_Weapon_C*         CallFunc_GetEquippedWeaponItemInstance_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<ECharacterAttribute, EAttributeScalingGrade> CallFunc_GetCurrentAttributeScaling_ReturnValue; // 0x0020(0x0050)()
	class FName                                   Temp_name_Variable_1;                              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_4;                              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_5;                              // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_6;                              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterAttribute                           Temp_byte_Variable;                                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ECharacterAttribute>                   CallFunc_Map_Keys_Keys;                            // 0x00C8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterAttribute                           CallFunc_Array_Get_Item;                           // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DE[0x2];                                       // 0x00DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAssignedAttributePoints_Value;         // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAttributeScalingGrade                        CallFunc_Map_Find_Value;                           // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EE[0x2];                                       // 0x00EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_AttributeStat_C*                   CallFunc_Map_Find_Value_1;                         // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AttributesWheel_C_LoadCharacterData) == 0x000008, "Wrong alignment on WBP_AttributesWheel_C_LoadCharacterData");
static_assert(sizeof(WBP_AttributesWheel_C_LoadCharacterData) == 0x000108, "Wrong size on WBP_AttributesWheel_C_LoadCharacterData");
static_assert(offsetof(WBP_AttributesWheel_C_LoadCharacterData, InCharacterData) == 0x000000, "Member 'WBP_AttributesWheel_C_LoadCharacterData::InCharacterData' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_LoadCharacterData, Temp_name_Variable) == 0x000008, "Member 'WBP_AttributesWheel_C_LoadCharacterData::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_LoadCharacterData, CallFunc_GetEquippedWeaponItemInstance_Valid) == 0x000010, "Member 'WBP_AttributesWheel_C_LoadCharacterData::CallFunc_GetEquippedWeaponItemInstance_Valid' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_LoadCharacterData, CallFunc_GetEquippedWeaponItemInstance_ReturnValue) == 0x000018, "Member 'WBP_AttributesWheel_C_LoadCharacterData::CallFunc_GetEquippedWeaponItemInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_LoadCharacterData, CallFunc_GetCurrentAttributeScaling_ReturnValue) == 0x000020, "Member 'WBP_AttributesWheel_C_LoadCharacterData::CallFunc_GetCurrentAttributeScaling_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_LoadCharacterData, Temp_name_Variable_1) == 0x000070, "Member 'WBP_AttributesWheel_C_LoadCharacterData::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_LoadCharacterData, Temp_name_Variable_2) == 0x000078, "Member 'WBP_AttributesWheel_C_LoadCharacterData::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_LoadCharacterData, Temp_name_Variable_3) == 0x000080, "Member 'WBP_AttributesWheel_C_LoadCharacterData::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_LoadCharacterData, Temp_name_Variable_4) == 0x000088, "Member 'WBP_AttributesWheel_C_LoadCharacterData::Temp_name_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_LoadCharacterData, Temp_int_Array_Index_Variable) == 0x000090, "Member 'WBP_AttributesWheel_C_LoadCharacterData::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_LoadCharacterData, Temp_int_Loop_Counter_Variable) == 0x000094, "Member 'WBP_AttributesWheel_C_LoadCharacterData::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_LoadCharacterData, CallFunc_Add_IntInt_ReturnValue) == 0x000098, "Member 'WBP_AttributesWheel_C_LoadCharacterData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_LoadCharacterData, Temp_name_Variable_5) == 0x00009C, "Member 'WBP_AttributesWheel_C_LoadCharacterData::Temp_name_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_LoadCharacterData, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000A8, "Member 'WBP_AttributesWheel_C_LoadCharacterData::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_LoadCharacterData, CallFunc_PlayAnimation_ReturnValue) == 0x0000B0, "Member 'WBP_AttributesWheel_C_LoadCharacterData::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_LoadCharacterData, Temp_name_Variable_6) == 0x0000B8, "Member 'WBP_AttributesWheel_C_LoadCharacterData::Temp_name_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_LoadCharacterData, Temp_byte_Variable) == 0x0000C0, "Member 'WBP_AttributesWheel_C_LoadCharacterData::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_LoadCharacterData, CallFunc_Map_Keys_Keys) == 0x0000C8, "Member 'WBP_AttributesWheel_C_LoadCharacterData::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_LoadCharacterData, CallFunc_Array_Length_ReturnValue) == 0x0000D8, "Member 'WBP_AttributesWheel_C_LoadCharacterData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_LoadCharacterData, CallFunc_Array_Get_Item) == 0x0000DC, "Member 'WBP_AttributesWheel_C_LoadCharacterData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_LoadCharacterData, CallFunc_Less_IntInt_ReturnValue) == 0x0000DD, "Member 'WBP_AttributesWheel_C_LoadCharacterData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_LoadCharacterData, K2Node_Select_Default) == 0x0000E0, "Member 'WBP_AttributesWheel_C_LoadCharacterData::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_LoadCharacterData, CallFunc_GetAssignedAttributePoints_Value) == 0x0000E8, "Member 'WBP_AttributesWheel_C_LoadCharacterData::CallFunc_GetAssignedAttributePoints_Value' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_LoadCharacterData, CallFunc_Map_Find_Value) == 0x0000EC, "Member 'WBP_AttributesWheel_C_LoadCharacterData::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_LoadCharacterData, CallFunc_Map_Find_ReturnValue) == 0x0000ED, "Member 'WBP_AttributesWheel_C_LoadCharacterData::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_LoadCharacterData, CallFunc_Conv_IntToDouble_ReturnValue) == 0x0000F0, "Member 'WBP_AttributesWheel_C_LoadCharacterData::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_LoadCharacterData, CallFunc_Map_Find_Value_1) == 0x0000F8, "Member 'WBP_AttributesWheel_C_LoadCharacterData::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_LoadCharacterData, CallFunc_Map_Find_ReturnValue_1) == 0x000100, "Member 'WBP_AttributesWheel_C_LoadCharacterData::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_LoadCharacterData, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000104, "Member 'WBP_AttributesWheel_C_LoadCharacterData::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_AttributesWheel.WBP_AttributesWheel_C.LoadPreviewCharacterData
// 0x0048 (0x0048 - 0x0000)
struct WBP_AttributesWheel_C_LoadPreviewCharacterData final
{
public:
	class UBP_CharacterData_C*                    InCharacterData;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ECharacterAttribute>                   CallFunc_Map_Keys_Keys;                            // 0x0018(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterAttribute                           CallFunc_Array_Get_Item;                           // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAssignedAttributePoints_Value;         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_AttributeStat_C*                   CallFunc_Map_Find_Value;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AttributesWheel_C_LoadPreviewCharacterData) == 0x000008, "Wrong alignment on WBP_AttributesWheel_C_LoadPreviewCharacterData");
static_assert(sizeof(WBP_AttributesWheel_C_LoadPreviewCharacterData) == 0x000048, "Wrong size on WBP_AttributesWheel_C_LoadPreviewCharacterData");
static_assert(offsetof(WBP_AttributesWheel_C_LoadPreviewCharacterData, InCharacterData) == 0x000000, "Member 'WBP_AttributesWheel_C_LoadPreviewCharacterData::InCharacterData' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_LoadPreviewCharacterData, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_AttributesWheel_C_LoadPreviewCharacterData::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_LoadPreviewCharacterData, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_AttributesWheel_C_LoadPreviewCharacterData::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_LoadPreviewCharacterData, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_AttributesWheel_C_LoadPreviewCharacterData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_LoadPreviewCharacterData, CallFunc_Map_Keys_Keys) == 0x000018, "Member 'WBP_AttributesWheel_C_LoadPreviewCharacterData::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_LoadPreviewCharacterData, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WBP_AttributesWheel_C_LoadPreviewCharacterData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_LoadPreviewCharacterData, CallFunc_Array_Get_Item) == 0x00002C, "Member 'WBP_AttributesWheel_C_LoadPreviewCharacterData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_LoadPreviewCharacterData, CallFunc_Less_IntInt_ReturnValue) == 0x00002D, "Member 'WBP_AttributesWheel_C_LoadPreviewCharacterData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_LoadPreviewCharacterData, CallFunc_GetAssignedAttributePoints_Value) == 0x000030, "Member 'WBP_AttributesWheel_C_LoadPreviewCharacterData::CallFunc_GetAssignedAttributePoints_Value' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_LoadPreviewCharacterData, CallFunc_Map_Find_Value) == 0x000038, "Member 'WBP_AttributesWheel_C_LoadPreviewCharacterData::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_LoadPreviewCharacterData, CallFunc_Map_Find_ReturnValue) == 0x000040, "Member 'WBP_AttributesWheel_C_LoadPreviewCharacterData::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function WBP_AttributesWheel.WBP_AttributesWheel_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_AttributesWheel_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AttributesWheel_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_AttributesWheel_C_PreConstruct");
static_assert(sizeof(WBP_AttributesWheel_C_PreConstruct) == 0x000001, "Wrong size on WBP_AttributesWheel_C_PreConstruct");
static_assert(offsetof(WBP_AttributesWheel_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_AttributesWheel_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_AttributesWheel.WBP_AttributesWheel_C.SetPentagonAnimProgress
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_AttributesWheel_C_SetPentagonAnimProgress final
{
public:
	double                                        PentagonAnimProgress_0;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_4;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_5;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_6;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterAttribute                           Temp_byte_Variable;                                // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ECharacterAttribute>                   CallFunc_Map_Keys_Keys;                            // 0x0050(0x0010)(ReferenceParm)
	ECharacterAttribute                           CallFunc_Array_Get_Item;                           // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Map_Find_Value;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Find_Value_1;                         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AttributesWheel_C_SetPentagonAnimProgress) == 0x000008, "Wrong alignment on WBP_AttributesWheel_C_SetPentagonAnimProgress");
static_assert(sizeof(WBP_AttributesWheel_C_SetPentagonAnimProgress) == 0x0000A8, "Wrong size on WBP_AttributesWheel_C_SetPentagonAnimProgress");
static_assert(offsetof(WBP_AttributesWheel_C_SetPentagonAnimProgress, PentagonAnimProgress_0) == 0x000000, "Member 'WBP_AttributesWheel_C_SetPentagonAnimProgress::PentagonAnimProgress_0' has a wrong offset!");
static_assert(offsetof(WBP_AttributesWheel_C_SetPentagonAnimProgress, Temp_name_Variable) == 0x000008, "Member 'WBP_AttributesWheel_C_SetPentagonAnimProgress::Temp_name_Variable' has a wrong offset!");
