#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PictoLevel

#include "Basic.hpp"

#include "EWeaponQuality_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PictoLevel.WBP_PictoLevel_C
// 0x0048 (0x0328 - 0x02E0)
class UWBP_PictoLevel_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       Level;                                             // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       LevelTitle;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TSubclassOf<class UCommonTextStyle>           LevelStyle;                                        // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCommonTextStyle>           LevelTitleStyle;                                   // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FMargin                                LevelPadding;                                      // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                LevelTitlePadding;                                 // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void LoadState(int32 Level_0, EWeaponQuality Quality);
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WBP_PictoLevel(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PictoLevel_C">();
	}
	static class UWBP_PictoLevel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PictoLevel_C>();
	}
};
static_assert(alignof(UWBP_PictoLevel_C) == 0x000008, "Wrong alignment on UWBP_PictoLevel_C");
static_assert(sizeof(UWBP_PictoLevel_C) == 0x000328, "Wrong size on UWBP_PictoLevel_C");
static_assert(offsetof(UWBP_PictoLevel_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_PictoLevel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PictoLevel_C, Level) == 0x0002E8, "Member 'UWBP_PictoLevel_C::Level' has a wrong offset!");
static_assert(offsetof(UWBP_PictoLevel_C, LevelTitle) == 0x0002F0, "Member 'UWBP_PictoLevel_C::LevelTitle' has a wrong offset!");
static_assert(offsetof(UWBP_PictoLevel_C, LevelStyle) == 0x0002F8, "Member 'UWBP_PictoLevel_C::LevelStyle' has a wrong offset!");
static_assert(offsetof(UWBP_PictoLevel_C, LevelTitleStyle) == 0x000300, "Member 'UWBP_PictoLevel_C::LevelTitleStyle' has a wrong offset!");
static_assert(offsetof(UWBP_PictoLevel_C, LevelPadding) == 0x000308, "Member 'UWBP_PictoLevel_C::LevelPadding' has a wrong offset!");
static_assert(offsetof(UWBP_PictoLevel_C, LevelTitlePadding) == 0x000318, "Member 'UWBP_PictoLevel_C::LevelTitlePadding' has a wrong offset!");

}

