#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Debug_BattleDamageDetails

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "EElementalAffinity_structs.hpp"
#include "EAttackType_structs.hpp"
#include "EDamageReason_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Debug_BattleDamageDetails.WBP_Debug_BattleDamageDetails_C
// 0x00E8 (0x03C8 - 0x02E0)
class UWBP_Debug_BattleDamageDetails_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UExpandableArea*                        ExpandableArea_54;                                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_BaseDamageAffinity;                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_BaseDamageType;                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_BreakBase_Amount;                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_CancelReason;                            // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_CriticalDetails;                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_CriticalRoll;                            // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Final_BreakAmount;                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_FinalDamage;                             // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_HEADER_CancelReason;                     // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_HEADER_CriticalDetails;                  // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_HEADER_DamageReason;                     // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_HEADER_FinalDamage_Details;              // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_HEADER_FinalDamage_Total;                // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_HEADER_Number;                           // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_HEADER_Source;                           // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_HEADER_Target;                           // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_InputMultiplier;                         // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_PreFinalDamage_Base;                     // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_RawDamage_Base;                          // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Source;                                  // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Target;                                  // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_ModifiersList;                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_ModifiersList_Final;                   // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_ModifiersList_Type;                    // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_1;                                  // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_HEADER;                             // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BattleDamages_C*                    BattleDamagesObject;                               // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void AddLog(const class FText& InText, class UPanelWidget* List);
	void Construct();
	void ExecuteUbergraph_WBP_Debug_BattleDamageDetails(int32 EntryPoint);
	class FString GetAffinityDisplayName(EElementalAffinity Affinity);
	class FString GetDamageDetails();
	void InitFinalDamages();
	void LoadCriticalRoll(bool IsCritical, const class FText& Details);
	void LogDamageTypeModifier(const class FText& Text);
	void LogFinalModifier(const class FText& Text);
	void LogRawModifier(const class FText& Text);
	void OnAffinitiesSet();
	void OnCalculationCompleted();
	void OnCanceled(const class FText& Reason);
	void OnExpansionChanged(class UExpandableArea* Area, bool bIsExpanded);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Debug_BattleDamageDetails_C">();
	}
	static class UWBP_Debug_BattleDamageDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Debug_BattleDamageDetails_C>();
	}
};
static_assert(alignof(UWBP_Debug_BattleDamageDetails_C) == 0x000008, "Wrong alignment on UWBP_Debug_BattleDamageDetails_C");
static_assert(sizeof(UWBP_Debug_BattleDamageDetails_C) == 0x0003C8, "Wrong size on UWBP_Debug_BattleDamageDetails_C");
static_assert(offsetof(UWBP_Debug_BattleDamageDetails_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_Debug_BattleDamageDetails_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_BattleDamageDetails_C, ExpandableArea_54) == 0x0002E8, "Member 'UWBP_Debug_BattleDamageDetails_C::ExpandableArea_54' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_BattleDamageDetails_C, TextBlock_BaseDamageAffinity) == 0x0002F0, "Member 'UWBP_Debug_BattleDamageDetails_C::TextBlock_BaseDamageAffinity' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_BattleDamageDetails_C, TextBlock_BaseDamageType) == 0x0002F8, "Member 'UWBP_Debug_BattleDamageDetails_C::TextBlock_BaseDamageType' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_BattleDamageDetails_C, TextBlock_BreakBase_Amount) == 0x000300, "Member 'UWBP_Debug_BattleDamageDetails_C::TextBlock_BreakBase_Amount' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_BattleDamageDetails_C, TextBlock_CancelReason) == 0x000308, "Member 'UWBP_Debug_BattleDamageDetails_C::TextBlock_CancelReason' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_BattleDamageDetails_C, TextBlock_CriticalDetails) == 0x000310, "Member 'UWBP_Debug_BattleDamageDetails_C::TextBlock_CriticalDetails' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_BattleDamageDetails_C, TextBlock_CriticalRoll) == 0x000318, "Member 'UWBP_Debug_BattleDamageDetails_C::TextBlock_CriticalRoll' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_BattleDamageDetails_C, TextBlock_Final_BreakAmount) == 0x000320, "Member 'UWBP_Debug_BattleDamageDetails_C::TextBlock_Final_BreakAmount' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_BattleDamageDetails_C, TextBlock_FinalDamage) == 0x000328, "Member 'UWBP_Debug_BattleDamageDetails_C::TextBlock_FinalDamage' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_BattleDamageDetails_C, TextBlock_HEADER_CancelReason) == 0x000330, "Member 'UWBP_Debug_BattleDamageDetails_C::TextBlock_HEADER_CancelReason' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_BattleDamageDetails_C, TextBlock_HEADER_CriticalDetails) == 0x000338, "Member 'UWBP_Debug_BattleDamageDetails_C::TextBlock_HEADER_CriticalDetails' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_BattleDamageDetails_C, TextBlock_HEADER_DamageReason) == 0x000340, "Member 'UWBP_Debug_BattleDamageDetails_C::TextBlock_HEADER_DamageReason' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_BattleDamageDetails_C, TextBlock_HEADER_FinalDamage_Details) == 0x000348, "Member 'UWBP_Debug_BattleDamageDetails_C::TextBlock_HEADER_FinalDamage_Details' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_BattleDamageDetails_C, TextBlock_HEADER_FinalDamage_Total) == 0x000350, "Member 'UWBP_Debug_BattleDamageDetails_C::TextBlock_HEADER_FinalDamage_Total' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_BattleDamageDetails_C, TextBlock_HEADER_Number) == 0x000358, "Member 'UWBP_Debug_BattleDamageDetails_C::TextBlock_HEADER_Number' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_BattleDamageDetails_C, TextBlock_HEADER_Source) == 0x000360, "Member 'UWBP_Debug_BattleDamageDetails_C::TextBlock_HEADER_Source' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_BattleDamageDetails_C, TextBlock_HEADER_Target) == 0x000368, "Member 'UWBP_Debug_BattleDamageDetails_C::TextBlock_HEADER_Target' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_BattleDamageDetails_C, TextBlock_InputMultiplier) == 0x000370, "Member 'UWBP_Debug_BattleDamageDetails_C::TextBlock_InputMultiplier' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_BattleDamageDetails_C, TextBlock_PreFinalDamage_Base) == 0x000378, "Member 'UWBP_Debug_BattleDamageDetails_C::TextBlock_PreFinalDamage_Base' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_BattleDamageDetails_C, TextBlock_RawDamage_Base) == 0x000380, "Member 'UWBP_Debug_BattleDamageDetails_C::TextBlock_RawDamage_Base' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_BattleDamageDetails_C, TextBlock_Source) == 0x000388, "Member 'UWBP_Debug_BattleDamageDetails_C::TextBlock_Source' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_BattleDamageDetails_C, TextBlock_Target) == 0x000390, "Member 'UWBP_Debug_BattleDamageDetails_C::TextBlock_Target' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_BattleDamageDetails_C, VerticalBox_ModifiersList) == 0x000398, "Member 'UWBP_Debug_BattleDamageDetails_C::VerticalBox_ModifiersList' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_BattleDamageDetails_C, VerticalBox_ModifiersList_Final) == 0x0003A0, "Member 'UWBP_Debug_BattleDamageDetails_C::VerticalBox_ModifiersList_Final' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_BattleDamageDetails_C, VerticalBox_ModifiersList_Type) == 0x0003A8, "Member 'UWBP_Debug_BattleDamageDetails_C::VerticalBox_ModifiersList_Type' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_BattleDamageDetails_C, WidgetSwitcher_1) == 0x0003B0, "Member 'UWBP_Debug_BattleDamageDetails_C::WidgetSwitcher_1' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_BattleDamageDetails_C, WidgetSwitcher_HEADER) == 0x0003B8, "Member 'UWBP_Debug_BattleDamageDetails_C::WidgetSwitcher_HEADER' has a wrong offset!");
static_assert(offsetof(UWBP_Debug_BattleDamageDetails_C, BattleDamagesObject) == 0x0003C0, "Member 'UWBP_Debug_BattleDamageDetails_C::BattleDamagesObject' has a wrong offset!");

}

