#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BattleWheelButton_Background_TRAILER_AIM

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_BattleWheelButton_Background_TRAILER_AIM.WBP_BattleWheelButton_Background_TRAILER_AIM_C.ExecuteUbergraph_WBP_BattleWheelButton_Background_TRAILER_AIM
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_BattleWheelButton_Background_TRAILER_AIM_C_ExecuteUbergraph_WBP_BattleWheelButton_Background_TRAILER_AIM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 K2Node_CustomEvent_Image;                          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_CustomEvent_Texture;                        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UImage*, class UTexture2D*>        K2Node_MakeMap_Map;                                // 0x0038(0x0050)(ConstParm, ContainsInstancedReference)
	TArray<class UImage*>                         CallFunc_Map_Keys_Keys;                            // 0x0088(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 CallFunc_Array_Get_Item;                           // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Map_Find_Value;                           // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleWheelButton_Background_TRAILER_AIM_C_ExecuteUbergraph_WBP_BattleWheelButton_Background_TRAILER_AIM) == 0x000008, "Wrong alignment on WBP_BattleWheelButton_Background_TRAILER_AIM_C_ExecuteUbergraph_WBP_BattleWheelButton_Background_TRAILER_AIM");
static_assert(sizeof(WBP_BattleWheelButton_Background_TRAILER_AIM_C_ExecuteUbergraph_WBP_BattleWheelButton_Background_TRAILER_AIM) == 0x0000C0, "Wrong size on WBP_BattleWheelButton_Background_TRAILER_AIM_C_ExecuteUbergraph_WBP_BattleWheelButton_Background_TRAILER_AIM");
static_assert(offsetof(WBP_BattleWheelButton_Background_TRAILER_AIM_C_ExecuteUbergraph_WBP_BattleWheelButton_Background_TRAILER_AIM, EntryPoint) == 0x000000, "Member 'WBP_BattleWheelButton_Background_TRAILER_AIM_C_ExecuteUbergraph_WBP_BattleWheelButton_Background_TRAILER_AIM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheelButton_Background_TRAILER_AIM_C_ExecuteUbergraph_WBP_BattleWheelButton_Background_TRAILER_AIM, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_BattleWheelButton_Background_TRAILER_AIM_C_ExecuteUbergraph_WBP_BattleWheelButton_Background_TRAILER_AIM::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheelButton_Background_TRAILER_AIM_C_ExecuteUbergraph_WBP_BattleWheelButton_Background_TRAILER_AIM, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_BattleWheelButton_Background_TRAILER_AIM_C_ExecuteUbergraph_WBP_BattleWheelButton_Background_TRAILER_AIM::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheelButton_Background_TRAILER_AIM_C_ExecuteUbergraph_WBP_BattleWheelButton_Background_TRAILER_AIM, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_BattleWheelButton_Background_TRAILER_AIM_C_ExecuteUbergraph_WBP_BattleWheelButton_Background_TRAILER_AIM::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheelButton_Background_TRAILER_AIM_C_ExecuteUbergraph_WBP_BattleWheelButton_Background_TRAILER_AIM, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_BattleWheelButton_Background_TRAILER_AIM_C_ExecuteUbergraph_WBP_BattleWheelButton_Background_TRAILER_AIM::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheelButton_Background_TRAILER_AIM_C_ExecuteUbergraph_WBP_BattleWheelButton_Background_TRAILER_AIM, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'WBP_BattleWheelButton_Background_TRAILER_AIM_C_ExecuteUbergraph_WBP_BattleWheelButton_Background_TRAILER_AIM::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheelButton_Background_TRAILER_AIM_C_ExecuteUbergraph_WBP_BattleWheelButton_Background_TRAILER_AIM, K2Node_CustomEvent_Image) == 0x000020, "Member 'WBP_BattleWheelButton_Background_TRAILER_AIM_C_ExecuteUbergraph_WBP_BattleWheelButton_Background_TRAILER_AIM::K2Node_CustomEvent_Image' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheelButton_Background_TRAILER_AIM_C_ExecuteUbergraph_WBP_BattleWheelButton_Background_TRAILER_AIM, K2Node_CustomEvent_Texture) == 0x000028, "Member 'WBP_BattleWheelButton_Background_TRAILER_AIM_C_ExecuteUbergraph_WBP_BattleWheelButton_Background_TRAILER_AIM::K2Node_CustomEvent_Texture' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheelButton_Background_TRAILER_AIM_C_ExecuteUbergraph_WBP_BattleWheelButton_Background_TRAILER_AIM, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_BattleWheelButton_Background_TRAILER_AIM_C_ExecuteUbergraph_WBP_BattleWheelButton_Background_TRAILER_AIM::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheelButton_Background_TRAILER_AIM_C_ExecuteUbergraph_WBP_BattleWheelButton_Background_TRAILER_AIM, K2Node_MakeMap_Map) == 0x000038, "Member 'WBP_BattleWheelButton_Background_TRAILER_AIM_C_ExecuteUbergraph_WBP_BattleWheelButton_Background_TRAILER_AIM::K2Node_MakeMap_Map' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheelButton_Background_TRAILER_AIM_C_ExecuteUbergraph_WBP_BattleWheelButton_Background_TRAILER_AIM, CallFunc_Map_Keys_Keys) == 0x000088, "Member 'WBP_BattleWheelButton_Background_TRAILER_AIM_C_ExecuteUbergraph_WBP_BattleWheelButton_Background_TRAILER_AIM::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheelButton_Background_TRAILER_AIM_C_ExecuteUbergraph_WBP_BattleWheelButton_Background_TRAILER_AIM, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'WBP_BattleWheelButton_Background_TRAILER_AIM_C_ExecuteUbergraph_WBP_BattleWheelButton_Background_TRAILER_AIM::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheelButton_Background_TRAILER_AIM_C_ExecuteUbergraph_WBP_BattleWheelButton_Background_TRAILER_AIM, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'WBP_BattleWheelButton_Background_TRAILER_AIM_C_ExecuteUbergraph_WBP_BattleWheelButton_Background_TRAILER_AIM::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheelButton_Background_TRAILER_AIM_C_ExecuteUbergraph_WBP_BattleWheelButton_Background_TRAILER_AIM, CallFunc_Less_IntInt_ReturnValue) == 0x0000A8, "Member 'WBP_BattleWheelButton_Background_TRAILER_AIM_C_ExecuteUbergraph_WBP_BattleWheelButton_Background_TRAILER_AIM::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheelButton_Background_TRAILER_AIM_C_ExecuteUbergraph_WBP_BattleWheelButton_Background_TRAILER_AIM, CallFunc_Map_Find_Value) == 0x0000B0, "Member 'WBP_BattleWheelButton_Background_TRAILER_AIM_C_ExecuteUbergraph_WBP_BattleWheelButton_Background_TRAILER_AIM::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheelButton_Background_TRAILER_AIM_C_ExecuteUbergraph_WBP_BattleWheelButton_Background_TRAILER_AIM, CallFunc_Map_Find_ReturnValue) == 0x0000B8, "Member 'WBP_BattleWheelButton_Background_TRAILER_AIM_C_ExecuteUbergraph_WBP_BattleWheelButton_Background_TRAILER_AIM::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function WBP_BattleWheelButton_Background_TRAILER_AIM.WBP_BattleWheelButton_Background_TRAILER_AIM_C.LoadParameter
// 0x0010 (0x0010 - 0x0000)
struct WBP_BattleWheelButton_Background_TRAILER_AIM_C_LoadParameter final
{
public:
	class UImage*                                 Image;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Texture;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleWheelButton_Background_TRAILER_AIM_C_LoadParameter) == 0x000008, "Wrong alignment on WBP_BattleWheelButton_Background_TRAILER_AIM_C_LoadParameter");
static_assert(sizeof(WBP_BattleWheelButton_Background_TRAILER_AIM_C_LoadParameter) == 0x000010, "Wrong size on WBP_BattleWheelButton_Background_TRAILER_AIM_C_LoadParameter");
static_assert(offsetof(WBP_BattleWheelButton_Background_TRAILER_AIM_C_LoadParameter, Image) == 0x000000, "Member 'WBP_BattleWheelButton_Background_TRAILER_AIM_C_LoadParameter::Image' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheelButton_Background_TRAILER_AIM_C_LoadParameter, Texture) == 0x000008, "Member 'WBP_BattleWheelButton_Background_TRAILER_AIM_C_LoadParameter::Texture' has a wrong offset!");

// Function WBP_BattleWheelButton_Background_TRAILER_AIM.WBP_BattleWheelButton_Background_TRAILER_AIM_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_BattleWheelButton_Background_TRAILER_AIM_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleWheelButton_Background_TRAILER_AIM_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_BattleWheelButton_Background_TRAILER_AIM_C_PreConstruct");
static_assert(sizeof(WBP_BattleWheelButton_Background_TRAILER_AIM_C_PreConstruct) == 0x000001, "Wrong size on WBP_BattleWheelButton_Background_TRAILER_AIM_C_PreConstruct");
static_assert(offsetof(WBP_BattleWheelButton_Background_TRAILER_AIM_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_BattleWheelButton_Background_TRAILER_AIM_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

