#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Name_UniqueMechanics

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Name_UniqueMechanics.WBP_Name_UniqueMechanics_C
// 0x0050 (0x0330 - 0x02E0)
class UWBP_Name_UniqueMechanics_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_StateUpdate;                                  // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       MechaNameText;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GlowContainer_C*                   MechaStateGlow;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MechaStateText;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   MechaName;                                         // 0x0308(0x0010)(Edit, BlueprintVisible)
	class FText                                   MechaState;                                        // 0x0318(0x0010)(Edit, BlueprintVisible)
	ESlateVisibility                              MechaNameVisibility;                               // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Name_UniqueMechanics(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetNameText(const class FText& MechaName_0);
	void SetStateText(const class FText& MechaState_0, const struct FSlateColor& InColorAndOpacity);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Name_UniqueMechanics_C">();
	}
	static class UWBP_Name_UniqueMechanics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Name_UniqueMechanics_C>();
	}
};
static_assert(alignof(UWBP_Name_UniqueMechanics_C) == 0x000008, "Wrong alignment on UWBP_Name_UniqueMechanics_C");
static_assert(sizeof(UWBP_Name_UniqueMechanics_C) == 0x000330, "Wrong size on UWBP_Name_UniqueMechanics_C");
static_assert(offsetof(UWBP_Name_UniqueMechanics_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_Name_UniqueMechanics_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Name_UniqueMechanics_C, Anim_StateUpdate) == 0x0002E8, "Member 'UWBP_Name_UniqueMechanics_C::Anim_StateUpdate' has a wrong offset!");
static_assert(offsetof(UWBP_Name_UniqueMechanics_C, MechaNameText) == 0x0002F0, "Member 'UWBP_Name_UniqueMechanics_C::MechaNameText' has a wrong offset!");
static_assert(offsetof(UWBP_Name_UniqueMechanics_C, MechaStateGlow) == 0x0002F8, "Member 'UWBP_Name_UniqueMechanics_C::MechaStateGlow' has a wrong offset!");
static_assert(offsetof(UWBP_Name_UniqueMechanics_C, MechaStateText) == 0x000300, "Member 'UWBP_Name_UniqueMechanics_C::MechaStateText' has a wrong offset!");
static_assert(offsetof(UWBP_Name_UniqueMechanics_C, MechaName) == 0x000308, "Member 'UWBP_Name_UniqueMechanics_C::MechaName' has a wrong offset!");
static_assert(offsetof(UWBP_Name_UniqueMechanics_C, MechaState) == 0x000318, "Member 'UWBP_Name_UniqueMechanics_C::MechaState' has a wrong offset!");
static_assert(offsetof(UWBP_Name_UniqueMechanics_C, MechaNameVisibility) == 0x000328, "Member 'UWBP_Name_UniqueMechanics_C::MechaNameVisibility' has a wrong offset!");

}

