#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_GM_EndBattle_Panel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_BattleRewards_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUD_GM_EndBattle_Panel.WBP_HUD_GM_EndBattle_Panel_C
// 0x00B8 (0x04E8 - 0x0430)
class UWBP_HUD_GM_EndBattle_Panel_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_ContinueBlur;                                 // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_ShowEndBattle;                                // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           NoDamageBox;                                       // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone;                                          // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BattleLoot_Box_C*                  WBP_BattleLoot_Box;                                // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BattleStats_Box_C*                 WBP_BattleStats_Box;                               // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EndBattle_CharacterBox_C*          WBP_EndBattle_CharacterBox;                        // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_EnemyKill_Box_C*                   WBP_EnemyKill_Box;                                 // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GM_PromptGeneric_C*                WBP_GM_PromptGeneric_Continue;                     // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_GM_ShowExperience_C*           WBP_ShowExperience;                                // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_VictoryHeader_C*                   WBP_VictoryHeader;                                 // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnClosed;                                          // 0x0490(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FDataTableRowHandle                    SDMenuDisappear;                                   // 0x04A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    SDMenuAppear;                                      // 0x04B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	TArray<class UAC_jRPG_CharacterBattleStats_C*> CharacterBattleStats;                             // 0x04C0(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, ContainsInstancedReference)
	struct FS_BattleRewards                       Battle_Rewards;                                    // 0x04D0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)

public:
	void BndEvt__WBP_HUD_GM_EndBattle_Panel_WBP_GM_PromptGeneric_Continue_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature(class UWBP_GM_PromptGeneric_C* PromptWidget);
	void Construct();
	void ExecuteUbergraph_WBP_HUD_GM_EndBattle_Panel(int32 EntryPoint);
	void Load_Battle_Stats_and_Rewards(const struct FS_BattleSummaryStats& BattleSummaryStats, const struct FS_BattleRewards& Battle_Rewards_0);
	void LoadCharacterBattleStats(TArray<class UAC_jRPG_CharacterBattleStats_C*>& CharacterBattleStats_0);
	void LoadInitialCharacterStates(TArray<class UBP_CharacterData_C*>& CharacterDatas);
	void LoadKilledEnemies(TArray<class ABP_jRPG_Character_Battle_Base_C*>& KilledEnemies);
	void OnDisappearAnimationFinished();
	void OnShowAnimationFinished();
	void PlayAllAnimations();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUD_GM_EndBattle_Panel_C">();
	}
	static class UWBP_HUD_GM_EndBattle_Panel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_GM_EndBattle_Panel_C>();
	}
};
static_assert(alignof(UWBP_HUD_GM_EndBattle_Panel_C) == 0x000008, "Wrong alignment on UWBP_HUD_GM_EndBattle_Panel_C");
static_assert(sizeof(UWBP_HUD_GM_EndBattle_Panel_C) == 0x0004E8, "Wrong size on UWBP_HUD_GM_EndBattle_Panel_C");
static_assert(offsetof(UWBP_HUD_GM_EndBattle_Panel_C, UberGraphFrame) == 0x000430, "Member 'UWBP_HUD_GM_EndBattle_Panel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_GM_EndBattle_Panel_C, Anim_ContinueBlur) == 0x000438, "Member 'UWBP_HUD_GM_EndBattle_Panel_C::Anim_ContinueBlur' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_GM_EndBattle_Panel_C, Anim_ShowEndBattle) == 0x000440, "Member 'UWBP_HUD_GM_EndBattle_Panel_C::Anim_ShowEndBattle' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_GM_EndBattle_Panel_C, NoDamageBox) == 0x000448, "Member 'UWBP_HUD_GM_EndBattle_Panel_C::NoDamageBox' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_GM_EndBattle_Panel_C, SafeZone) == 0x000450, "Member 'UWBP_HUD_GM_EndBattle_Panel_C::SafeZone' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_GM_EndBattle_Panel_C, WBP_BattleLoot_Box) == 0x000458, "Member 'UWBP_HUD_GM_EndBattle_Panel_C::WBP_BattleLoot_Box' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_GM_EndBattle_Panel_C, WBP_BattleStats_Box) == 0x000460, "Member 'UWBP_HUD_GM_EndBattle_Panel_C::WBP_BattleStats_Box' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_GM_EndBattle_Panel_C, WBP_EndBattle_CharacterBox) == 0x000468, "Member 'UWBP_HUD_GM_EndBattle_Panel_C::WBP_EndBattle_CharacterBox' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_GM_EndBattle_Panel_C, WBP_EnemyKill_Box) == 0x000470, "Member 'UWBP_HUD_GM_EndBattle_Panel_C::WBP_EnemyKill_Box' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_GM_EndBattle_Panel_C, WBP_GM_PromptGeneric_Continue) == 0x000478, "Member 'UWBP_HUD_GM_EndBattle_Panel_C::WBP_GM_PromptGeneric_Continue' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_GM_EndBattle_Panel_C, WBP_ShowExperience) == 0x000480, "Member 'UWBP_HUD_GM_EndBattle_Panel_C::WBP_ShowExperience' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_GM_EndBattle_Panel_C, WBP_VictoryHeader) == 0x000488, "Member 'UWBP_HUD_GM_EndBattle_Panel_C::WBP_VictoryHeader' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_GM_EndBattle_Panel_C, OnClosed) == 0x000490, "Member 'UWBP_HUD_GM_EndBattle_Panel_C::OnClosed' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_GM_EndBattle_Panel_C, SDMenuDisappear) == 0x0004A0, "Member 'UWBP_HUD_GM_EndBattle_Panel_C::SDMenuDisappear' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_GM_EndBattle_Panel_C, SDMenuAppear) == 0x0004B0, "Member 'UWBP_HUD_GM_EndBattle_Panel_C::SDMenuAppear' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_GM_EndBattle_Panel_C, CharacterBattleStats) == 0x0004C0, "Member 'UWBP_HUD_GM_EndBattle_Panel_C::CharacterBattleStats' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_GM_EndBattle_Panel_C, Battle_Rewards) == 0x0004D0, "Member 'UWBP_HUD_GM_EndBattle_Panel_C::Battle_Rewards' has a wrong offset!");

}

