#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SlotSquare_CustomizationPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S_jRPG_Item_StaticData_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SlotSquare_CustomizationPanel.WBP_SlotSquare_CustomizationPanel_C
// 0x0170 (0x0478 - 0x0308)
class UWBP_SlotSquare_CustomizationPanel_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_BaseButton_C*                      BaseButton;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CustomizationIcon_C*               CustomizationIcon;                                 // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WrappingText_C*                    CustomizationName;                                 // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               EquippedOverlay;                                   // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NotificationBullet_C*              NotificationBullet;                                // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FS_jRPG_Item_StaticData                ItemStaticData;                                    // 0x0338(0x0130)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const struct FS_jRPG_Item_StaticData& Item)> OnItemClicked;        // 0x0468(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_SlotSquare_CustomizationPanel_BaseButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_SlotSquare_CustomizationPanel_BaseButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature(class UCommonButtonBase* Button, bool Selected);
	void BndEvt__WBP_SlotSquare_CustomizationPanel_BaseButton_K2Node_ComponentBoundEvent_2_OnButtonBaseFocusedHold__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_SlotSquare_CustomizationPanel(int32 EntryPoint);
	void GetItem(struct FS_jRPG_Item_StaticData* Item);
	void LoadItemData(class UBP_ItemInstance_Base_C* Item);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SlotSquare_CustomizationPanel_C">();
	}
	static class UWBP_SlotSquare_CustomizationPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SlotSquare_CustomizationPanel_C>();
	}
};
static_assert(alignof(UWBP_SlotSquare_CustomizationPanel_C) == 0x000008, "Wrong alignment on UWBP_SlotSquare_CustomizationPanel_C");
static_assert(sizeof(UWBP_SlotSquare_CustomizationPanel_C) == 0x000478, "Wrong size on UWBP_SlotSquare_CustomizationPanel_C");
static_assert(offsetof(UWBP_SlotSquare_CustomizationPanel_C, UberGraphFrame) == 0x000308, "Member 'UWBP_SlotSquare_CustomizationPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SlotSquare_CustomizationPanel_C, BaseButton) == 0x000310, "Member 'UWBP_SlotSquare_CustomizationPanel_C::BaseButton' has a wrong offset!");
static_assert(offsetof(UWBP_SlotSquare_CustomizationPanel_C, CustomizationIcon) == 0x000318, "Member 'UWBP_SlotSquare_CustomizationPanel_C::CustomizationIcon' has a wrong offset!");
static_assert(offsetof(UWBP_SlotSquare_CustomizationPanel_C, CustomizationName) == 0x000320, "Member 'UWBP_SlotSquare_CustomizationPanel_C::CustomizationName' has a wrong offset!");
static_assert(offsetof(UWBP_SlotSquare_CustomizationPanel_C, EquippedOverlay) == 0x000328, "Member 'UWBP_SlotSquare_CustomizationPanel_C::EquippedOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_SlotSquare_CustomizationPanel_C, NotificationBullet) == 0x000330, "Member 'UWBP_SlotSquare_CustomizationPanel_C::NotificationBullet' has a wrong offset!");
static_assert(offsetof(UWBP_SlotSquare_CustomizationPanel_C, ItemStaticData) == 0x000338, "Member 'UWBP_SlotSquare_CustomizationPanel_C::ItemStaticData' has a wrong offset!");
static_assert(offsetof(UWBP_SlotSquare_CustomizationPanel_C, OnItemClicked) == 0x000468, "Member 'UWBP_SlotSquare_CustomizationPanel_C::OnItemClicked' has a wrong offset!");

}

