#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharacterSelector

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_CharacterSelector.WBP_CharacterSelector_C.BndEvt__WBP_CharacterSelector_WBP_ButtonBinding_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterSelector_C_BndEvt__WBP_CharacterSelector_WBP_ButtonBinding_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature final
{
public:
	class UWBP_ButtonBinding_C*                   PromptWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelector_C_BndEvt__WBP_CharacterSelector_WBP_ButtonBinding_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterSelector_C_BndEvt__WBP_CharacterSelector_WBP_ButtonBinding_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_CharacterSelector_C_BndEvt__WBP_CharacterSelector_WBP_ButtonBinding_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature) == 0x000008, "Wrong size on WBP_CharacterSelector_C_BndEvt__WBP_CharacterSelector_WBP_ButtonBinding_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_CharacterSelector_C_BndEvt__WBP_CharacterSelector_WBP_ButtonBinding_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature, PromptWidget) == 0x000000, "Member 'WBP_CharacterSelector_C_BndEvt__WBP_CharacterSelector_WBP_ButtonBinding_K2Node_ComponentBoundEvent_1_OnPressed__DelegateSignature::PromptWidget' has a wrong offset!");

// Function WBP_CharacterSelector.WBP_CharacterSelector_C.BndEvt__WBP_CharacterSelector_WBP_ButtonBinding_RightSelection_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterSelector_C_BndEvt__WBP_CharacterSelector_WBP_ButtonBinding_RightSelection_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature final
{
public:
	class UWBP_ButtonBinding_C*                   PromptWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelector_C_BndEvt__WBP_CharacterSelector_WBP_ButtonBinding_RightSelection_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterSelector_C_BndEvt__WBP_CharacterSelector_WBP_ButtonBinding_RightSelection_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_CharacterSelector_C_BndEvt__WBP_CharacterSelector_WBP_ButtonBinding_RightSelection_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000008, "Wrong size on WBP_CharacterSelector_C_BndEvt__WBP_CharacterSelector_WBP_ButtonBinding_RightSelection_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_CharacterSelector_C_BndEvt__WBP_CharacterSelector_WBP_ButtonBinding_RightSelection_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature, PromptWidget) == 0x000000, "Member 'WBP_CharacterSelector_C_BndEvt__WBP_CharacterSelector_WBP_ButtonBinding_RightSelection_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature::PromptWidget' has a wrong offset!");

// Function WBP_CharacterSelector.WBP_CharacterSelector_C.ExecuteUbergraph_WBP_CharacterSelector
// 0x0060 (0x0060 - 0x0000)
struct WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ButtonBinding_C*                   K2Node_ComponentBoundEvent_PromptWidget_1;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_ButtonBinding_C*                   K2Node_ComponentBoundEvent_PromptWidget;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CharacterData_C*                    CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterData_C*                    CallFunc_Array_Get_Item_1;                         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector) == 0x000008, "Wrong alignment on WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector");
static_assert(sizeof(WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector) == 0x000060, "Wrong size on WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector");
static_assert(offsetof(WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector, EntryPoint) == 0x000000, "Member 'WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector, K2Node_ComponentBoundEvent_PromptWidget_1) == 0x000008, "Member 'WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector::K2Node_ComponentBoundEvent_PromptWidget_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector, CallFunc_Array_Find_ReturnValue) == 0x000014, "Member 'WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector, K2Node_ComponentBoundEvent_PromptWidget) == 0x000018, "Member 'WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector::K2Node_ComponentBoundEvent_PromptWidget' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector, CallFunc_Percent_IntInt_ReturnValue) == 0x000024, "Member 'WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector, CallFunc_Array_Length_ReturnValue_1) == 0x000028, "Member 'WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector, CallFunc_Array_Find_ReturnValue_1) == 0x000038, "Member 'WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector::CallFunc_Array_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector, CallFunc_Subtract_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector, CallFunc_Add_IntInt_ReturnValue_1) == 0x000040, "Member 'WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector, CallFunc_Percent_IntInt_ReturnValue_1) == 0x000044, "Member 'WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector, CallFunc_Array_Get_Item_1) == 0x000048, "Member 'WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector, CallFunc_PlayAnimation_ReturnValue) == 0x000050, "Member 'WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector, CallFunc_PlayAnimation_ReturnValue_1) == 0x000058, "Member 'WBP_CharacterSelector_C_ExecuteUbergraph_WBP_CharacterSelector::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function WBP_CharacterSelector.WBP_CharacterSelector_C.LoadCharacterCollection
// 0x0060 (0x0060 - 0x0000)
struct WBP_CharacterSelector_C_LoadCharacterCollection final
{
public:
	TArray<class UBP_CharacterData_C*>            CharacterList_0;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CharacterSelectorEntry_C*          CallFunc_SpawnObject_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UBP_CharacterData_C* CharacterData)> K2Node_CreateDelegate_OutputDelegate;  // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterData_C*                    CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelector_C_LoadCharacterCollection) == 0x000008, "Wrong alignment on WBP_CharacterSelector_C_LoadCharacterCollection");
static_assert(sizeof(WBP_CharacterSelector_C_LoadCharacterCollection) == 0x000060, "Wrong size on WBP_CharacterSelector_C_LoadCharacterCollection");
static_assert(offsetof(WBP_CharacterSelector_C_LoadCharacterCollection, CharacterList_0) == 0x000000, "Member 'WBP_CharacterSelector_C_LoadCharacterCollection::CharacterList_0' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_LoadCharacterCollection, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_CharacterSelector_C_LoadCharacterCollection::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_LoadCharacterCollection, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_CharacterSelector_C_LoadCharacterCollection::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_LoadCharacterCollection, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_CharacterSelector_C_LoadCharacterCollection::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_LoadCharacterCollection, K2Node_MakeStruct_Margin) == 0x00001C, "Member 'WBP_CharacterSelector_C_LoadCharacterCollection::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_LoadCharacterCollection, CallFunc_SpawnObject_ReturnValue) == 0x000030, "Member 'WBP_CharacterSelector_C_LoadCharacterCollection::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_LoadCharacterCollection, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'WBP_CharacterSelector_C_LoadCharacterCollection::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_LoadCharacterCollection, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000048, "Member 'WBP_CharacterSelector_C_LoadCharacterCollection::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_LoadCharacterCollection, CallFunc_Array_Get_Item) == 0x000050, "Member 'WBP_CharacterSelector_C_LoadCharacterCollection::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_LoadCharacterCollection, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'WBP_CharacterSelector_C_LoadCharacterCollection::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_LoadCharacterCollection, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'WBP_CharacterSelector_C_LoadCharacterCollection::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_CharacterSelector.WBP_CharacterSelector_C.LockCharacterSelector
// 0x0040 (0x0040 - 0x0000)
struct WBP_CharacterSelector_C_LockCharacterSelector final
{
public:
	bool                                          IsLocked;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelector_C_LockCharacterSelector) == 0x000008, "Wrong alignment on WBP_CharacterSelector_C_LockCharacterSelector");
static_assert(sizeof(WBP_CharacterSelector_C_LockCharacterSelector) == 0x000040, "Wrong size on WBP_CharacterSelector_C_LockCharacterSelector");
static_assert(offsetof(WBP_CharacterSelector_C_LockCharacterSelector, IsLocked) == 0x000000, "Member 'WBP_CharacterSelector_C_LockCharacterSelector::IsLocked' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_LockCharacterSelector, Temp_byte_Variable) == 0x000001, "Member 'WBP_CharacterSelector_C_LockCharacterSelector::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_LockCharacterSelector, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_CharacterSelector_C_LockCharacterSelector::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_LockCharacterSelector, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_CharacterSelector_C_LockCharacterSelector::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_LockCharacterSelector, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_CharacterSelector_C_LockCharacterSelector::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_LockCharacterSelector, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_CharacterSelector_C_LockCharacterSelector::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_LockCharacterSelector, Temp_bool_Variable) == 0x000010, "Member 'WBP_CharacterSelector_C_LockCharacterSelector::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_LockCharacterSelector, CallFunc_GetAllChildren_ReturnValue) == 0x000018, "Member 'WBP_CharacterSelector_C_LockCharacterSelector::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_LockCharacterSelector, K2Node_Select_Default) == 0x000028, "Member 'WBP_CharacterSelector_C_LockCharacterSelector::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_LockCharacterSelector, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_CharacterSelector_C_LockCharacterSelector::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_LockCharacterSelector, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WBP_CharacterSelector_C_LockCharacterSelector::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_LockCharacterSelector, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_CharacterSelector_C_LockCharacterSelector::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_CharacterSelector.WBP_CharacterSelector_C.PreSetSelectedCharacter
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterSelector_C_PreSetSelectedCharacter final
{
public:
	class UBP_CharacterData_C*                    SelectedCharacter_0;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelector_C_PreSetSelectedCharacter) == 0x000008, "Wrong alignment on WBP_CharacterSelector_C_PreSetSelectedCharacter");
static_assert(sizeof(WBP_CharacterSelector_C_PreSetSelectedCharacter) == 0x000008, "Wrong size on WBP_CharacterSelector_C_PreSetSelectedCharacter");
static_assert(offsetof(WBP_CharacterSelector_C_PreSetSelectedCharacter, SelectedCharacter_0) == 0x000000, "Member 'WBP_CharacterSelector_C_PreSetSelectedCharacter::SelectedCharacter_0' has a wrong offset!");

// Function WBP_CharacterSelector.WBP_CharacterSelector_C.SetSelectedCharacter
// 0x0030 (0x0030 - 0x0000)
struct WBP_CharacterSelector_C_SetSelectedCharacter final
{
public:
	class UBP_CharacterData_C*                    CharacterData;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CharacterSelectorEntry_C*          CallFunc_Map_Find_Value;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CharacterSelectorEntry_C*          CallFunc_Map_Find_Value_1;                         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelector_C_SetSelectedCharacter) == 0x000008, "Wrong alignment on WBP_CharacterSelector_C_SetSelectedCharacter");
static_assert(sizeof(WBP_CharacterSelector_C_SetSelectedCharacter) == 0x000030, "Wrong size on WBP_CharacterSelector_C_SetSelectedCharacter");
static_assert(offsetof(WBP_CharacterSelector_C_SetSelectedCharacter, CharacterData) == 0x000000, "Member 'WBP_CharacterSelector_C_SetSelectedCharacter::CharacterData' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_SetSelectedCharacter, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_CharacterSelector_C_SetSelectedCharacter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_SetSelectedCharacter, CallFunc_Map_Find_Value) == 0x000010, "Member 'WBP_CharacterSelector_C_SetSelectedCharacter::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_SetSelectedCharacter, CallFunc_Map_Find_ReturnValue) == 0x000018, "Member 'WBP_CharacterSelector_C_SetSelectedCharacter::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_SetSelectedCharacter, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'WBP_CharacterSelector_C_SetSelectedCharacter::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_SetSelectedCharacter, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x00001A, "Member 'WBP_CharacterSelector_C_SetSelectedCharacter::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_SetSelectedCharacter, CallFunc_Map_Find_Value_1) == 0x000020, "Member 'WBP_CharacterSelector_C_SetSelectedCharacter::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelector_C_SetSelectedCharacter, CallFunc_Map_Find_ReturnValue_1) == 0x000028, "Member 'WBP_CharacterSelector_C_SetSelectedCharacter::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");

// Function WBP_CharacterSelector.WBP_CharacterSelector_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterSelector_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelector_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_CharacterSelector_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_CharacterSelector_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_CharacterSelector_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_CharacterSelector_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_CharacterSelector_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

