#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ItemIcon

#include "Basic.hpp"

#include "S_jRPG_Item_StaticData_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_ItemIcon.WBP_ItemIcon_C.LoadItemIcon
// 0x0150 (0x0150 - 0x0000)
struct WBP_ItemIcon_C_LoadItemIcon final
{
public:
	struct FS_jRPG_Item_StaticData                ItemData;                                          // 0x0000(0x0130)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0133(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0136(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0137(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x013E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x013F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0143(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0146(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0147(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ItemIcon_C_LoadItemIcon) == 0x000008, "Wrong alignment on WBP_ItemIcon_C_LoadItemIcon");
static_assert(sizeof(WBP_ItemIcon_C_LoadItemIcon) == 0x000150, "Wrong size on WBP_ItemIcon_C_LoadItemIcon");
static_assert(offsetof(WBP_ItemIcon_C_LoadItemIcon, ItemData) == 0x000000, "Member 'WBP_ItemIcon_C_LoadItemIcon::ItemData' has a wrong offset!");
static_assert(offsetof(WBP_ItemIcon_C_LoadItemIcon, Temp_byte_Variable) == 0x000130, "Member 'WBP_ItemIcon_C_LoadItemIcon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemIcon_C_LoadItemIcon, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000131, "Member 'WBP_ItemIcon_C_LoadItemIcon::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemIcon_C_LoadItemIcon, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000132, "Member 'WBP_ItemIcon_C_LoadItemIcon::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemIcon_C_LoadItemIcon, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000133, "Member 'WBP_ItemIcon_C_LoadItemIcon::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ItemIcon_C_LoadItemIcon, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000134, "Member 'WBP_ItemIcon_C_LoadItemIcon::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ItemIcon_C_LoadItemIcon, CallFunc_BooleanOR_ReturnValue) == 0x000135, "Member 'WBP_ItemIcon_C_LoadItemIcon::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemIcon_C_LoadItemIcon, CallFunc_BooleanOR_ReturnValue_1) == 0x000136, "Member 'WBP_ItemIcon_C_LoadItemIcon::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemIcon_C_LoadItemIcon, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x000137, "Member 'WBP_ItemIcon_C_LoadItemIcon::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_ItemIcon_C_LoadItemIcon, CallFunc_Not_PreBool_ReturnValue) == 0x000138, "Member 'WBP_ItemIcon_C_LoadItemIcon::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ItemIcon_C_LoadItemIcon, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x000139, "Member 'WBP_ItemIcon_C_LoadItemIcon::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_ItemIcon_C_LoadItemIcon, Temp_bool_Variable) == 0x00013A, "Member 'WBP_ItemIcon_C_LoadItemIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ItemIcon_C_LoadItemIcon, Temp_byte_Variable_1) == 0x00013B, "Member 'WBP_ItemIcon_C_LoadItemIcon::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemIcon_C_LoadItemIcon, Temp_byte_Variable_2) == 0x00013C, "Member 'WBP_ItemIcon_C_LoadItemIcon::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ItemIcon_C_LoadItemIcon, Temp_bool_Variable_1) == 0x00013D, "Member 'WBP_ItemIcon_C_LoadItemIcon::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemIcon_C_LoadItemIcon, K2Node_Select_Default) == 0x00013E, "Member 'WBP_ItemIcon_C_LoadItemIcon::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ItemIcon_C_LoadItemIcon, Temp_byte_Variable_3) == 0x00013F, "Member 'WBP_ItemIcon_C_LoadItemIcon::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ItemIcon_C_LoadItemIcon, Temp_byte_Variable_4) == 0x000140, "Member 'WBP_ItemIcon_C_LoadItemIcon::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ItemIcon_C_LoadItemIcon, Temp_bool_Variable_2) == 0x000141, "Member 'WBP_ItemIcon_C_LoadItemIcon::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ItemIcon_C_LoadItemIcon, K2Node_Select_Default_1) == 0x000142, "Member 'WBP_ItemIcon_C_LoadItemIcon::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ItemIcon_C_LoadItemIcon, Temp_byte_Variable_5) == 0x000143, "Member 'WBP_ItemIcon_C_LoadItemIcon::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_ItemIcon_C_LoadItemIcon, Temp_byte_Variable_6) == 0x000144, "Member 'WBP_ItemIcon_C_LoadItemIcon::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_ItemIcon_C_LoadItemIcon, Temp_byte_Variable_7) == 0x000145, "Member 'WBP_ItemIcon_C_LoadItemIcon::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_ItemIcon_C_LoadItemIcon, K2Node_Select_Default_2) == 0x000146, "Member 'WBP_ItemIcon_C_LoadItemIcon::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_ItemIcon_C_LoadItemIcon, Temp_bool_Variable_3) == 0x000147, "Member 'WBP_ItemIcon_C_LoadItemIcon::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ItemIcon_C_LoadItemIcon, K2Node_Select_Default_3) == 0x000148, "Member 'WBP_ItemIcon_C_LoadItemIcon::K2Node_Select_Default_3' has a wrong offset!");

}

