#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_AccessibilityOptionsList

#include "Basic.hpp"

#include "WBP_Settings_OptionsList_Abstract_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Settings_AccessibilityOptionsList.WBP_Settings_AccessibilityOptionsList_C
// 0x0098 (0x04D0 - 0x0438)
class UWBP_Settings_AccessibilityOptionsList_C final : public UWBP_Settings_OptionsList_Abstract_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_Settings_AccessibilityOptionsList_C; // 0x0438(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_NamedBoolSelector_C*               WBP_NamedBoolSelector_AutomaticQTE;                // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NamedBoolSelector_C*               WBP_NamedBoolSelector_CameraMovement;              // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NamedBoolSelector_C*               WBP_NamedBoolSelector_CameraShake;                 // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NamedBoolSelector_C*               WBP_NamedBoolSelector_PersistentCenterDot;         // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NamedIntegerSelector_C*            WBP_NamedIntegerSelector_ColorblindMode;           // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_OptionEntriesHeader_C*    WBP_Settings_OptionEntriesHeader_Battle;           // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_OptionEntriesHeader_C*    WBP_Settings_OptionEntriesHeader_Camera;           // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_OptionEntriesHeader_C*    WBP_Settings_OptionEntriesHeader_Image;            // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_OptionEntry_C*            WBP_Settings_OptionEntry_ApplicationScale;         // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_OptionEntry_C*            WBP_Settings_OptionEntry_AutomaticQTE;             // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_OptionEntry_C*            WBP_Settings_OptionEntry_CameraMovement;           // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_OptionEntry_C*            WBP_Settings_OptionEntry_CameraShake;              // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_OptionEntry_C*            WBP_Settings_OptionEntry_ColorblindMode;           // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_OptionEntry_C*            WBP_Settings_OptionEntry_ColorblindModeIntensity;  // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Settings_OptionEntry_C*            WBP_Settings_OptionEntry_PersistentCenterDot;      // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SliderSelector_C*                  WBP_SliderSelector_ApplicationScale;               // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SliderSelector_C*                  WBP_SliderSelector_ColorblindModeIntensity;        // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConfigurableGameUserSettings*          GameUserSettings;                                  // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BindOnOptionEntryFocused(const TDelegate<void(class UWBP_Settings_OptionEntry_C* Widget)>& Event);
	void BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_AutomaticQTE_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature(bool Value, const class FText& Name_0, class UUserWidget* Widget);
	void BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_CameraMovement_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature(bool Value, const class FText& Name_0, class UUserWidget* Widget);
	void BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_CameraShake_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature(bool Value, const class FText& Name_0, class UUserWidget* Widget);
	void BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_PersistentCenterDot_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature(bool Value, const class FText& Name_0, class UUserWidget* Widget);
	void BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedIntegerSelector_ColorblindMode_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature(int32 Value, const class FText& Name_0, class UUserWidget* Widget);
	void BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_SliderSelector_ApplicationScale_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature(double Value, class UUserWidget* Widget);
	void BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_SliderSelector_ColorblindModeIntensity_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature(double Value, class UUserWidget* Widget);
	void Construct();
	void ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList(int32 EntryPoint);
	void LoadUserSettings();
	void SetupAvailableOptions();
	void UnbindOnOptionEntryFocused(const TDelegate<void(class UWBP_Settings_OptionEntry_C* Widget)>& Event);
	void UpdateColorblindModeIntensityWidget();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Settings_AccessibilityOptionsList_C">();
	}
	static class UWBP_Settings_AccessibilityOptionsList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Settings_AccessibilityOptionsList_C>();
	}
};
static_assert(alignof(UWBP_Settings_AccessibilityOptionsList_C) == 0x000008, "Wrong alignment on UWBP_Settings_AccessibilityOptionsList_C");
static_assert(sizeof(UWBP_Settings_AccessibilityOptionsList_C) == 0x0004D0, "Wrong size on UWBP_Settings_AccessibilityOptionsList_C");
static_assert(offsetof(UWBP_Settings_AccessibilityOptionsList_C, UberGraphFrame_WBP_Settings_AccessibilityOptionsList_C) == 0x000438, "Member 'UWBP_Settings_AccessibilityOptionsList_C::UberGraphFrame_WBP_Settings_AccessibilityOptionsList_C' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_AccessibilityOptionsList_C, WBP_NamedBoolSelector_AutomaticQTE) == 0x000440, "Member 'UWBP_Settings_AccessibilityOptionsList_C::WBP_NamedBoolSelector_AutomaticQTE' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_AccessibilityOptionsList_C, WBP_NamedBoolSelector_CameraMovement) == 0x000448, "Member 'UWBP_Settings_AccessibilityOptionsList_C::WBP_NamedBoolSelector_CameraMovement' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_AccessibilityOptionsList_C, WBP_NamedBoolSelector_CameraShake) == 0x000450, "Member 'UWBP_Settings_AccessibilityOptionsList_C::WBP_NamedBoolSelector_CameraShake' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_AccessibilityOptionsList_C, WBP_NamedBoolSelector_PersistentCenterDot) == 0x000458, "Member 'UWBP_Settings_AccessibilityOptionsList_C::WBP_NamedBoolSelector_PersistentCenterDot' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_AccessibilityOptionsList_C, WBP_NamedIntegerSelector_ColorblindMode) == 0x000460, "Member 'UWBP_Settings_AccessibilityOptionsList_C::WBP_NamedIntegerSelector_ColorblindMode' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_AccessibilityOptionsList_C, WBP_Settings_OptionEntriesHeader_Battle) == 0x000468, "Member 'UWBP_Settings_AccessibilityOptionsList_C::WBP_Settings_OptionEntriesHeader_Battle' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_AccessibilityOptionsList_C, WBP_Settings_OptionEntriesHeader_Camera) == 0x000470, "Member 'UWBP_Settings_AccessibilityOptionsList_C::WBP_Settings_OptionEntriesHeader_Camera' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_AccessibilityOptionsList_C, WBP_Settings_OptionEntriesHeader_Image) == 0x000478, "Member 'UWBP_Settings_AccessibilityOptionsList_C::WBP_Settings_OptionEntriesHeader_Image' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_AccessibilityOptionsList_C, WBP_Settings_OptionEntry_ApplicationScale) == 0x000480, "Member 'UWBP_Settings_AccessibilityOptionsList_C::WBP_Settings_OptionEntry_ApplicationScale' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_AccessibilityOptionsList_C, WBP_Settings_OptionEntry_AutomaticQTE) == 0x000488, "Member 'UWBP_Settings_AccessibilityOptionsList_C::WBP_Settings_OptionEntry_AutomaticQTE' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_AccessibilityOptionsList_C, WBP_Settings_OptionEntry_CameraMovement) == 0x000490, "Member 'UWBP_Settings_AccessibilityOptionsList_C::WBP_Settings_OptionEntry_CameraMovement' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_AccessibilityOptionsList_C, WBP_Settings_OptionEntry_CameraShake) == 0x000498, "Member 'UWBP_Settings_AccessibilityOptionsList_C::WBP_Settings_OptionEntry_CameraShake' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_AccessibilityOptionsList_C, WBP_Settings_OptionEntry_ColorblindMode) == 0x0004A0, "Member 'UWBP_Settings_AccessibilityOptionsList_C::WBP_Settings_OptionEntry_ColorblindMode' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_AccessibilityOptionsList_C, WBP_Settings_OptionEntry_ColorblindModeIntensity) == 0x0004A8, "Member 'UWBP_Settings_AccessibilityOptionsList_C::WBP_Settings_OptionEntry_ColorblindModeIntensity' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_AccessibilityOptionsList_C, WBP_Settings_OptionEntry_PersistentCenterDot) == 0x0004B0, "Member 'UWBP_Settings_AccessibilityOptionsList_C::WBP_Settings_OptionEntry_PersistentCenterDot' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_AccessibilityOptionsList_C, WBP_SliderSelector_ApplicationScale) == 0x0004B8, "Member 'UWBP_Settings_AccessibilityOptionsList_C::WBP_SliderSelector_ApplicationScale' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_AccessibilityOptionsList_C, WBP_SliderSelector_ColorblindModeIntensity) == 0x0004C0, "Member 'UWBP_Settings_AccessibilityOptionsList_C::WBP_SliderSelector_ColorblindModeIntensity' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_AccessibilityOptionsList_C, GameUserSettings) == 0x0004C8, "Member 'UWBP_Settings_AccessibilityOptionsList_C::GameUserSettings' has a wrong offset!");

}

