#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BattleInput_SelectTarget

#include "Basic.hpp"

#include "EnhancedInput_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_BattleInput_SelectTarget.WBP_BattleInput_SelectTarget_C.ExecuteUbergraph_WBP_BattleInput_SelectTarget
// 0x0158 (0x0158 - 0x0000)
struct WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0008(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_InputActionValueToAxis1D_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0070(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0098(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_1; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_1;                            // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3_0;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5;                              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4_0;                            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_1;                      // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;            // 0x0104(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0116(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_117[0x1];                                      // 0x0117(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Controller_World_C*            K2Node_DynamicCast_AsBP_J_RPG_Controller_World;    // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_jRPG_Controller_World_C*            K2Node_DynamicCast_AsBP_J_RPG_Controller_World_1;  // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0153(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget) == 0x000008, "Wrong alignment on WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget");
static_assert(sizeof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget) == 0x000158, "Wrong size on WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, EntryPoint) == 0x000000, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, K2Node_EnhancedInputActionEvent_ActionValue_1) == 0x000008, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::K2Node_EnhancedInputActionEvent_ActionValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, K2Node_EnhancedInputActionEvent_ElapsedTime_1) == 0x000028, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::K2Node_EnhancedInputActionEvent_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, K2Node_EnhancedInputActionEvent_TriggeredTime_1) == 0x00002C, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::K2Node_EnhancedInputActionEvent_TriggeredTime_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, K2Node_EnhancedInputActionEvent_SourceAction_1) == 0x000030, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::K2Node_EnhancedInputActionEvent_SourceAction_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, Temp_object_Variable) == 0x000038, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, CallFunc_Conv_InputActionValueToAxis1D_ReturnValue) == 0x000040, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::CallFunc_Conv_InputActionValueToAxis1D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, Temp_real_Variable) == 0x000048, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, Temp_real_Variable_1) == 0x000050, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, Temp_real_Variable_0) == 0x000058, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, Temp_real_Variable_1_0) == 0x000060, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, Temp_real_Variable_2) == 0x000068, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000070, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000090, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x000094, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000098, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, CallFunc_FClamp_ReturnValue) == 0x0000A0, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_1) == 0x0000A8, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, CallFunc_Round_ReturnValue) == 0x0000B0, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, Temp_object_Variable_1) == 0x0000B8, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, Temp_real_Variable_3) == 0x0000C0, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, Temp_real_Variable_3_0) == 0x0000C8, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::Temp_real_Variable_3_0' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, Temp_real_Variable_4) == 0x0000D0, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, Temp_real_Variable_5) == 0x0000D8, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, Temp_real_Variable_4_0) == 0x0000E0, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::Temp_real_Variable_4_0' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, CallFunc_FClamp_ReturnValue_1) == 0x0000E8, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, CallFunc_Round_ReturnValue_1) == 0x0000F0, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::CallFunc_Round_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x0000F8, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, CallFunc_GetCurrentInputType_ReturnValue) == 0x000100, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, K2Node_CreateDelegate_OutputDelegate) == 0x000104, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, Temp_bool_Variable) == 0x000114, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, Temp_byte_Variable) == 0x000115, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, Temp_byte_Variable_1) == 0x000116, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, CallFunc_PlayAnimation_ReturnValue) == 0x000118, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, CallFunc_PlayAnimation_ReturnValue_1) == 0x000120, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, CallFunc_GetPlayerController_ReturnValue) == 0x000128, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, CallFunc_GetPlayerController_ReturnValue_1) == 0x000130, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, K2Node_DynamicCast_AsBP_J_RPG_Controller_World) == 0x000138, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::K2Node_DynamicCast_AsBP_J_RPG_Controller_World' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, K2Node_DynamicCast_bSuccess) == 0x000140, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, K2Node_DynamicCast_AsBP_J_RPG_Controller_World_1) == 0x000148, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::K2Node_DynamicCast_AsBP_J_RPG_Controller_World_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, K2Node_DynamicCast_bSuccess_1) == 0x000150, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, K2Node_CustomEvent_bNewInputType) == 0x000151, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000152, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget, K2Node_Select_Default) == 0x000153, "Member 'WBP_BattleInput_SelectTarget_C_ExecuteUbergraph_WBP_BattleInput_SelectTarget::K2Node_Select_Default' has a wrong offset!");

// Function WBP_BattleInput_SelectTarget.WBP_BattleInput_SelectTarget_C.InpActEvt_IA_Battle_Targeting_Left_K2Node_EnhancedInputActionEvent_1
// 0x0030 (0x0030 - 0x0000)
struct WBP_BattleInput_SelectTarget_C_InpActEvt_IA_Battle_Targeting_Left_K2Node_EnhancedInputActionEvent_1 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleInput_SelectTarget_C_InpActEvt_IA_Battle_Targeting_Left_K2Node_EnhancedInputActionEvent_1) == 0x000008, "Wrong alignment on WBP_BattleInput_SelectTarget_C_InpActEvt_IA_Battle_Targeting_Left_K2Node_EnhancedInputActionEvent_1");
static_assert(sizeof(WBP_BattleInput_SelectTarget_C_InpActEvt_IA_Battle_Targeting_Left_K2Node_EnhancedInputActionEvent_1) == 0x000030, "Wrong size on WBP_BattleInput_SelectTarget_C_InpActEvt_IA_Battle_Targeting_Left_K2Node_EnhancedInputActionEvent_1");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_InpActEvt_IA_Battle_Targeting_Left_K2Node_EnhancedInputActionEvent_1, ActionValue) == 0x000000, "Member 'WBP_BattleInput_SelectTarget_C_InpActEvt_IA_Battle_Targeting_Left_K2Node_EnhancedInputActionEvent_1::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_InpActEvt_IA_Battle_Targeting_Left_K2Node_EnhancedInputActionEvent_1, ElapsedTime) == 0x000020, "Member 'WBP_BattleInput_SelectTarget_C_InpActEvt_IA_Battle_Targeting_Left_K2Node_EnhancedInputActionEvent_1::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_InpActEvt_IA_Battle_Targeting_Left_K2Node_EnhancedInputActionEvent_1, TriggeredTime) == 0x000024, "Member 'WBP_BattleInput_SelectTarget_C_InpActEvt_IA_Battle_Targeting_Left_K2Node_EnhancedInputActionEvent_1::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_InpActEvt_IA_Battle_Targeting_Left_K2Node_EnhancedInputActionEvent_1, SourceAction) == 0x000028, "Member 'WBP_BattleInput_SelectTarget_C_InpActEvt_IA_Battle_Targeting_Left_K2Node_EnhancedInputActionEvent_1::SourceAction' has a wrong offset!");

// Function WBP_BattleInput_SelectTarget.WBP_BattleInput_SelectTarget_C.InpActEvt_IA_Battle_Targeting_Right_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct WBP_BattleInput_SelectTarget_C_InpActEvt_IA_Battle_Targeting_Right_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleInput_SelectTarget_C_InpActEvt_IA_Battle_Targeting_Right_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on WBP_BattleInput_SelectTarget_C_InpActEvt_IA_Battle_Targeting_Right_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(WBP_BattleInput_SelectTarget_C_InpActEvt_IA_Battle_Targeting_Right_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on WBP_BattleInput_SelectTarget_C_InpActEvt_IA_Battle_Targeting_Right_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_InpActEvt_IA_Battle_Targeting_Right_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'WBP_BattleInput_SelectTarget_C_InpActEvt_IA_Battle_Targeting_Right_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_InpActEvt_IA_Battle_Targeting_Right_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'WBP_BattleInput_SelectTarget_C_InpActEvt_IA_Battle_Targeting_Right_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_InpActEvt_IA_Battle_Targeting_Right_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'WBP_BattleInput_SelectTarget_C_InpActEvt_IA_Battle_Targeting_Right_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_InpActEvt_IA_Battle_Targeting_Right_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'WBP_BattleInput_SelectTarget_C_InpActEvt_IA_Battle_Targeting_Right_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function WBP_BattleInput_SelectTarget.WBP_BattleInput_SelectTarget_C.OnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_BattleInput_SelectTarget_C_OnInputMethodChanged final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleInput_SelectTarget_C_OnInputMethodChanged) == 0x000001, "Wrong alignment on WBP_BattleInput_SelectTarget_C_OnInputMethodChanged");
static_assert(sizeof(WBP_BattleInput_SelectTarget_C_OnInputMethodChanged) == 0x000001, "Wrong size on WBP_BattleInput_SelectTarget_C_OnInputMethodChanged");
static_assert(offsetof(WBP_BattleInput_SelectTarget_C_OnInputMethodChanged, bNewInputType) == 0x000000, "Member 'WBP_BattleInput_SelectTarget_C_OnInputMethodChanged::bNewInputType' has a wrong offset!");

}

