#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SavePointUpgradeAttributesButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_SavePointUpgradeAttributesButton.WBP_SavePointUpgradeAttributesButton_C.BndEvt__WBP_SavePointUpgradeAttributesButton_UpgradeAttributesButton_K2Node_ComponentBoundEvent_0_OnButtonBaseFocused__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SavePointUpgradeAttributesButton_C_BndEvt__WBP_SavePointUpgradeAttributesButton_UpgradeAttributesButton_K2Node_ComponentBoundEvent_0_OnButtonBaseFocused__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavePointUpgradeAttributesButton_C_BndEvt__WBP_SavePointUpgradeAttributesButton_UpgradeAttributesButton_K2Node_ComponentBoundEvent_0_OnButtonBaseFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SavePointUpgradeAttributesButton_C_BndEvt__WBP_SavePointUpgradeAttributesButton_UpgradeAttributesButton_K2Node_ComponentBoundEvent_0_OnButtonBaseFocused__DelegateSignature");
static_assert(sizeof(WBP_SavePointUpgradeAttributesButton_C_BndEvt__WBP_SavePointUpgradeAttributesButton_UpgradeAttributesButton_K2Node_ComponentBoundEvent_0_OnButtonBaseFocused__DelegateSignature) == 0x000008, "Wrong size on WBP_SavePointUpgradeAttributesButton_C_BndEvt__WBP_SavePointUpgradeAttributesButton_UpgradeAttributesButton_K2Node_ComponentBoundEvent_0_OnButtonBaseFocused__DelegateSignature");
static_assert(offsetof(WBP_SavePointUpgradeAttributesButton_C_BndEvt__WBP_SavePointUpgradeAttributesButton_UpgradeAttributesButton_K2Node_ComponentBoundEvent_0_OnButtonBaseFocused__DelegateSignature, Button) == 0x000000, "Member 'WBP_SavePointUpgradeAttributesButton_C_BndEvt__WBP_SavePointUpgradeAttributesButton_UpgradeAttributesButton_K2Node_ComponentBoundEvent_0_OnButtonBaseFocused__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SavePointUpgradeAttributesButton.WBP_SavePointUpgradeAttributesButton_C.BndEvt__WBP_SavePointUpgradeAttributesButton_UpgradeAttributesButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SavePointUpgradeAttributesButton_C_BndEvt__WBP_SavePointUpgradeAttributesButton_UpgradeAttributesButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavePointUpgradeAttributesButton_C_BndEvt__WBP_SavePointUpgradeAttributesButton_UpgradeAttributesButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SavePointUpgradeAttributesButton_C_BndEvt__WBP_SavePointUpgradeAttributesButton_UpgradeAttributesButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_SavePointUpgradeAttributesButton_C_BndEvt__WBP_SavePointUpgradeAttributesButton_UpgradeAttributesButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SavePointUpgradeAttributesButton_C_BndEvt__WBP_SavePointUpgradeAttributesButton_UpgradeAttributesButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_SavePointUpgradeAttributesButton_C_BndEvt__WBP_SavePointUpgradeAttributesButton_UpgradeAttributesButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_SavePointUpgradeAttributesButton_C_BndEvt__WBP_SavePointUpgradeAttributesButton_UpgradeAttributesButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SavePointUpgradeAttributesButton.WBP_SavePointUpgradeAttributesButton_C.BPI_OnMarkNotificationAsRead
// 0x0008 (0x0008 - 0x0000)
struct WBP_SavePointUpgradeAttributesButton_C_BPI_OnMarkNotificationAsRead final
{
public:
	class UUserWidget*                            MarkCaller;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavePointUpgradeAttributesButton_C_BPI_OnMarkNotificationAsRead) == 0x000008, "Wrong alignment on WBP_SavePointUpgradeAttributesButton_C_BPI_OnMarkNotificationAsRead");
static_assert(sizeof(WBP_SavePointUpgradeAttributesButton_C_BPI_OnMarkNotificationAsRead) == 0x000008, "Wrong size on WBP_SavePointUpgradeAttributesButton_C_BPI_OnMarkNotificationAsRead");
static_assert(offsetof(WBP_SavePointUpgradeAttributesButton_C_BPI_OnMarkNotificationAsRead, MarkCaller) == 0x000000, "Member 'WBP_SavePointUpgradeAttributesButton_C_BPI_OnMarkNotificationAsRead::MarkCaller' has a wrong offset!");

// Function WBP_SavePointUpgradeAttributesButton.WBP_SavePointUpgradeAttributesButton_C.BPI_ShouldShowNotification
// 0x0048 (0x0048 - 0x0000)
struct WBP_SavePointUpgradeAttributesButton_C_BPI_ShouldShowNotification final
{
public:
	bool                                          bShouldShow;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue_1;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_CharacterData_C*>            CallFunc_Map_Values_Values;                        // 0x0020(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CharacterData_C*                    CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldObjectBeNotified_IsNotified;        // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavePointUpgradeAttributesButton_C_BPI_ShouldShowNotification) == 0x000008, "Wrong alignment on WBP_SavePointUpgradeAttributesButton_C_BPI_ShouldShowNotification");
static_assert(sizeof(WBP_SavePointUpgradeAttributesButton_C_BPI_ShouldShowNotification) == 0x000048, "Wrong size on WBP_SavePointUpgradeAttributesButton_C_BPI_ShouldShowNotification");
static_assert(offsetof(WBP_SavePointUpgradeAttributesButton_C_BPI_ShouldShowNotification, bShouldShow) == 0x000000, "Member 'WBP_SavePointUpgradeAttributesButton_C_BPI_ShouldShowNotification::bShouldShow' has a wrong offset!");
static_assert(offsetof(WBP_SavePointUpgradeAttributesButton_C_BPI_ShouldShowNotification, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_SavePointUpgradeAttributesButton_C_BPI_ShouldShowNotification::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SavePointUpgradeAttributesButton_C_BPI_ShouldShowNotification, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_SavePointUpgradeAttributesButton_C_BPI_ShouldShowNotification::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SavePointUpgradeAttributesButton_C_BPI_ShouldShowNotification, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_SavePointUpgradeAttributesButton_C_BPI_ShouldShowNotification::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SavePointUpgradeAttributesButton_C_BPI_ShouldShowNotification, CallFunc_GetCustomGI_ReturnValue) == 0x000010, "Member 'WBP_SavePointUpgradeAttributesButton_C_BPI_ShouldShowNotification::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SavePointUpgradeAttributesButton_C_BPI_ShouldShowNotification, CallFunc_GetCustomGI_ReturnValue_1) == 0x000018, "Member 'WBP_SavePointUpgradeAttributesButton_C_BPI_ShouldShowNotification::CallFunc_GetCustomGI_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SavePointUpgradeAttributesButton_C_BPI_ShouldShowNotification, CallFunc_Map_Values_Values) == 0x000020, "Member 'WBP_SavePointUpgradeAttributesButton_C_BPI_ShouldShowNotification::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(WBP_SavePointUpgradeAttributesButton_C_BPI_ShouldShowNotification, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WBP_SavePointUpgradeAttributesButton_C_BPI_ShouldShowNotification::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SavePointUpgradeAttributesButton_C_BPI_ShouldShowNotification, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_SavePointUpgradeAttributesButton_C_BPI_ShouldShowNotification::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_SavePointUpgradeAttributesButton_C_BPI_ShouldShowNotification, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'WBP_SavePointUpgradeAttributesButton_C_BPI_ShouldShowNotification::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SavePointUpgradeAttributesButton_C_BPI_ShouldShowNotification, CallFunc_ShouldObjectBeNotified_IsNotified) == 0x000041, "Member 'WBP_SavePointUpgradeAttributesButton_C_BPI_ShouldShowNotification::CallFunc_ShouldObjectBeNotified_IsNotified' has a wrong offset!");

// Function WBP_SavePointUpgradeAttributesButton.WBP_SavePointUpgradeAttributesButton_C.ExecuteUbergraph_WBP_SavePointUpgradeAttributesButton
// 0x0020 (0x0020 - 0x0000)
struct WBP_SavePointUpgradeAttributesButton_C_ExecuteUbergraph_WBP_SavePointUpgradeAttributesButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_Event_MarkCaller;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavePointUpgradeAttributesButton_C_ExecuteUbergraph_WBP_SavePointUpgradeAttributesButton) == 0x000008, "Wrong alignment on WBP_SavePointUpgradeAttributesButton_C_ExecuteUbergraph_WBP_SavePointUpgradeAttributesButton");
static_assert(sizeof(WBP_SavePointUpgradeAttributesButton_C_ExecuteUbergraph_WBP_SavePointUpgradeAttributesButton) == 0x000020, "Wrong size on WBP_SavePointUpgradeAttributesButton_C_ExecuteUbergraph_WBP_SavePointUpgradeAttributesButton");
static_assert(offsetof(WBP_SavePointUpgradeAttributesButton_C_ExecuteUbergraph_WBP_SavePointUpgradeAttributesButton, EntryPoint) == 0x000000, "Member 'WBP_SavePointUpgradeAttributesButton_C_ExecuteUbergraph_WBP_SavePointUpgradeAttributesButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SavePointUpgradeAttributesButton_C_ExecuteUbergraph_WBP_SavePointUpgradeAttributesButton, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'WBP_SavePointUpgradeAttributesButton_C_ExecuteUbergraph_WBP_SavePointUpgradeAttributesButton::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_SavePointUpgradeAttributesButton_C_ExecuteUbergraph_WBP_SavePointUpgradeAttributesButton, K2Node_Event_MarkCaller) == 0x000010, "Member 'WBP_SavePointUpgradeAttributesButton_C_ExecuteUbergraph_WBP_SavePointUpgradeAttributesButton::K2Node_Event_MarkCaller' has a wrong offset!");
static_assert(offsetof(WBP_SavePointUpgradeAttributesButton_C_ExecuteUbergraph_WBP_SavePointUpgradeAttributesButton, K2Node_ComponentBoundEvent_Button_1) == 0x000018, "Member 'WBP_SavePointUpgradeAttributesButton_C_ExecuteUbergraph_WBP_SavePointUpgradeAttributesButton::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");

// Function WBP_SavePointUpgradeAttributesButton.WBP_SavePointUpgradeAttributesButton_C.LoadNotification
// 0x0010 (0x0010 - 0x0000)
struct WBP_SavePointUpgradeAttributesButton_C_LoadNotification final
{
public:
	TScriptInterface<class IBPI_UINotifiedObject_C> CallFunc_LoadNotificationData_NotifiedObject_CastInput; // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavePointUpgradeAttributesButton_C_LoadNotification) == 0x000008, "Wrong alignment on WBP_SavePointUpgradeAttributesButton_C_LoadNotification");
static_assert(sizeof(WBP_SavePointUpgradeAttributesButton_C_LoadNotification) == 0x000010, "Wrong size on WBP_SavePointUpgradeAttributesButton_C_LoadNotification");
static_assert(offsetof(WBP_SavePointUpgradeAttributesButton_C_LoadNotification, CallFunc_LoadNotificationData_NotifiedObject_CastInput) == 0x000000, "Member 'WBP_SavePointUpgradeAttributesButton_C_LoadNotification::CallFunc_LoadNotificationData_NotifiedObject_CastInput' has a wrong offset!");

}

