#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PictoTooltip

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_PictoTooltip.WBP_PictoTooltip_C.SetPictoData
// 0x0010 (0x0010 - 0x0000)
struct WBP_PictoTooltip_C_SetPictoData final
{
public:
	class UBP_PictoViewItem_C*                    PictoViewItem;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PictoTooltip_C_SetPictoData) == 0x000008, "Wrong alignment on WBP_PictoTooltip_C_SetPictoData");
static_assert(sizeof(WBP_PictoTooltip_C_SetPictoData) == 0x000010, "Wrong size on WBP_PictoTooltip_C_SetPictoData");
static_assert(offsetof(WBP_PictoTooltip_C_SetPictoData, PictoViewItem) == 0x000000, "Member 'WBP_PictoTooltip_C_SetPictoData::PictoViewItem' has a wrong offset!");
static_assert(offsetof(WBP_PictoTooltip_C_SetPictoData, Temp_bool_Variable) == 0x000008, "Member 'WBP_PictoTooltip_C_SetPictoData::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PictoTooltip_C_SetPictoData, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'WBP_PictoTooltip_C_SetPictoData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PictoTooltip_C_SetPictoData, Temp_byte_Variable) == 0x00000A, "Member 'WBP_PictoTooltip_C_SetPictoData::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PictoTooltip_C_SetPictoData, Temp_byte_Variable_1) == 0x00000B, "Member 'WBP_PictoTooltip_C_SetPictoData::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PictoTooltip_C_SetPictoData, K2Node_Select_Default) == 0x00000C, "Member 'WBP_PictoTooltip_C_SetPictoData::K2Node_Select_Default' has a wrong offset!");

}

