#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharacterStatusPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CharacterStatusPanel.WBP_CharacterStatusPanel_C
// 0x0030 (0x0310 - 0x02E0)
class UWBP_CharacterStatusPanel_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BG;                                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDynamicEntryBox*                       StatusEffectsBox;                                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WrappingText_C*                    TextBlock_Title;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBoxStatusPanel;                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAC_jRPG_CharacterBattleStats_C*        CurrentCharacterStats;                             // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Appear();
	void Disappear();
	void ExecuteUbergraph_WBP_CharacterStatusPanel(int32 EntryPoint);
	void LoadCharacterStats(class UAC_jRPG_CharacterBattleStats_C* CharacterBattleStats);
	void OnAggregatorChildrenChanged();
	void OnBuffChanged(class UBP_BattleBuffInstance_C* BuffInstance);
	void PreConstruct(bool IsDesignTime);
	void RefreshBuffs(class UAC_jRPG_CharacterBattleStats_C* CharacterBattleStats);
	void SetIsEmpty(bool IsEmpty);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CharacterStatusPanel_C">();
	}
	static class UWBP_CharacterStatusPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CharacterStatusPanel_C>();
	}
};
static_assert(alignof(UWBP_CharacterStatusPanel_C) == 0x000008, "Wrong alignment on UWBP_CharacterStatusPanel_C");
static_assert(sizeof(UWBP_CharacterStatusPanel_C) == 0x000310, "Wrong size on UWBP_CharacterStatusPanel_C");
static_assert(offsetof(UWBP_CharacterStatusPanel_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_CharacterStatusPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterStatusPanel_C, BG) == 0x0002E8, "Member 'UWBP_CharacterStatusPanel_C::BG' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterStatusPanel_C, StatusEffectsBox) == 0x0002F0, "Member 'UWBP_CharacterStatusPanel_C::StatusEffectsBox' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterStatusPanel_C, TextBlock_Title) == 0x0002F8, "Member 'UWBP_CharacterStatusPanel_C::TextBlock_Title' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterStatusPanel_C, VerticalBoxStatusPanel) == 0x000300, "Member 'UWBP_CharacterStatusPanel_C::VerticalBoxStatusPanel' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterStatusPanel_C, CurrentCharacterStats) == 0x000308, "Member 'UWBP_CharacterStatusPanel_C::CurrentCharacterStats' has a wrong offset!");

}

