#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MM_BackupSavesBox

#include "Basic.hpp"

#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MM_BackupSavesBox.WBP_MM_BackupSavesBox_C
// 0x0038 (0x0468 - 0x0430)
class UWBP_MM_BackupSavesBox_C final : public UCommonActivatableWidget
{
public:
	class UCommonLazyImage*                       Background;                                        // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDynamicEntryBox*                       DynamicEntryBox;                                   // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox;                                         // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const class FString& Save)> OnBackupSaveNavigated;                 // 0x0448(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(const class FString& Save)> OnBackupSaveClicked;                   // 0x0458(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnBackUpSaveEntryClicked(class UWBP_MM_BackupSaveEntry_C* BackUpSaveEntry);
	void OnBackUpSaveEntryFocused(class UWBP_MM_BackupSaveEntry_C* BackUpSaveEntry);
	void SetBackUpSaves(TArray<class FString>& BackupSaveStrings, TArray<class UBP_SaveGameData_C*>& BackupSaveDatas);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MM_BackupSavesBox_C">();
	}
	static class UWBP_MM_BackupSavesBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MM_BackupSavesBox_C>();
	}
};
static_assert(alignof(UWBP_MM_BackupSavesBox_C) == 0x000008, "Wrong alignment on UWBP_MM_BackupSavesBox_C");
static_assert(sizeof(UWBP_MM_BackupSavesBox_C) == 0x000468, "Wrong size on UWBP_MM_BackupSavesBox_C");
static_assert(offsetof(UWBP_MM_BackupSavesBox_C, Background) == 0x000430, "Member 'UWBP_MM_BackupSavesBox_C::Background' has a wrong offset!");
static_assert(offsetof(UWBP_MM_BackupSavesBox_C, DynamicEntryBox) == 0x000438, "Member 'UWBP_MM_BackupSavesBox_C::DynamicEntryBox' has a wrong offset!");
static_assert(offsetof(UWBP_MM_BackupSavesBox_C, ScrollBox) == 0x000440, "Member 'UWBP_MM_BackupSavesBox_C::ScrollBox' has a wrong offset!");
static_assert(offsetof(UWBP_MM_BackupSavesBox_C, OnBackupSaveNavigated) == 0x000448, "Member 'UWBP_MM_BackupSavesBox_C::OnBackupSaveNavigated' has a wrong offset!");
static_assert(offsetof(UWBP_MM_BackupSavesBox_C, OnBackupSaveClicked) == 0x000458, "Member 'UWBP_MM_BackupSavesBox_C::OnBackupSaveClicked' has a wrong offset!");

}

