#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_AccessibilityOptionsList

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Settings_AccessibilityOptionsList.WBP_Settings_AccessibilityOptionsList_C.BindOnOptionEntryFocused
// 0x0010 (0x0010 - 0x0000)
struct WBP_Settings_AccessibilityOptionsList_C_BindOnOptionEntryFocused final
{
public:
	TDelegate<void(class UWBP_Settings_OptionEntry_C* Widget)> Event;                                // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_AccessibilityOptionsList_C_BindOnOptionEntryFocused) == 0x000004, "Wrong alignment on WBP_Settings_AccessibilityOptionsList_C_BindOnOptionEntryFocused");
static_assert(sizeof(WBP_Settings_AccessibilityOptionsList_C_BindOnOptionEntryFocused) == 0x000010, "Wrong size on WBP_Settings_AccessibilityOptionsList_C_BindOnOptionEntryFocused");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_BindOnOptionEntryFocused, Event) == 0x000000, "Member 'WBP_Settings_AccessibilityOptionsList_C_BindOnOptionEntryFocused::Event' has a wrong offset!");

// Function WBP_Settings_AccessibilityOptionsList.WBP_Settings_AccessibilityOptionsList_C.BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_AutomaticQTE_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_AutomaticQTE_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_0;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUserWidget*                            Widget;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_AutomaticQTE_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_AutomaticQTE_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_AutomaticQTE_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_AutomaticQTE_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_AutomaticQTE_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_AutomaticQTE_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_AutomaticQTE_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature, Name_0) == 0x000008, "Member 'WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_AutomaticQTE_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature::Name_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_AutomaticQTE_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature, Widget) == 0x000018, "Member 'WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_AutomaticQTE_K2Node_ComponentBoundEvent_10_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_AccessibilityOptionsList.WBP_Settings_AccessibilityOptionsList_C.BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_CameraMovement_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_CameraMovement_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_0;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUserWidget*                            Widget;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_CameraMovement_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_CameraMovement_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_CameraMovement_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_CameraMovement_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_CameraMovement_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_CameraMovement_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_CameraMovement_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature, Name_0) == 0x000008, "Member 'WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_CameraMovement_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature::Name_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_CameraMovement_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature, Widget) == 0x000018, "Member 'WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_CameraMovement_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_AccessibilityOptionsList.WBP_Settings_AccessibilityOptionsList_C.BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_CameraShake_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_CameraShake_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_0;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUserWidget*                            Widget;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_CameraShake_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_CameraShake_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_CameraShake_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_CameraShake_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_CameraShake_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_CameraShake_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_CameraShake_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature, Name_0) == 0x000008, "Member 'WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_CameraShake_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature::Name_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_CameraShake_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature, Widget) == 0x000018, "Member 'WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_CameraShake_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_AccessibilityOptionsList.WBP_Settings_AccessibilityOptionsList_C.BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_PersistentCenterDot_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_PersistentCenterDot_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_0;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUserWidget*                            Widget;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_PersistentCenterDot_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_PersistentCenterDot_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_PersistentCenterDot_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_PersistentCenterDot_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_PersistentCenterDot_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_PersistentCenterDot_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_PersistentCenterDot_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature, Name_0) == 0x000008, "Member 'WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_PersistentCenterDot_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature::Name_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_PersistentCenterDot_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature, Widget) == 0x000018, "Member 'WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedBoolSelector_PersistentCenterDot_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_AccessibilityOptionsList.WBP_Settings_AccessibilityOptionsList_C.BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedIntegerSelector_ColorblindMode_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedIntegerSelector_ColorblindMode_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_0;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUserWidget*                            Widget;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedIntegerSelector_ColorblindMode_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedIntegerSelector_ColorblindMode_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedIntegerSelector_ColorblindMode_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedIntegerSelector_ColorblindMode_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedIntegerSelector_ColorblindMode_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedIntegerSelector_ColorblindMode_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedIntegerSelector_ColorblindMode_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature, Name_0) == 0x000008, "Member 'WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedIntegerSelector_ColorblindMode_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature::Name_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedIntegerSelector_ColorblindMode_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature, Widget) == 0x000018, "Member 'WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_NamedIntegerSelector_ColorblindMode_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_AccessibilityOptionsList.WBP_Settings_AccessibilityOptionsList_C.BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_SliderSelector_ApplicationScale_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_SliderSelector_ApplicationScale_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_SliderSelector_ApplicationScale_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_SliderSelector_ApplicationScale_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_SliderSelector_ApplicationScale_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_SliderSelector_ApplicationScale_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_SliderSelector_ApplicationScale_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_SliderSelector_ApplicationScale_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_SliderSelector_ApplicationScale_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature, Widget) == 0x000008, "Member 'WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_SliderSelector_ApplicationScale_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_AccessibilityOptionsList.WBP_Settings_AccessibilityOptionsList_C.BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_SliderSelector_ColorblindModeIntensity_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_SliderSelector_ColorblindModeIntensity_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_SliderSelector_ColorblindModeIntensity_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_SliderSelector_ColorblindModeIntensity_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_SliderSelector_ColorblindModeIntensity_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_SliderSelector_ColorblindModeIntensity_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_SliderSelector_ColorblindModeIntensity_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_SliderSelector_ColorblindModeIntensity_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_SliderSelector_ColorblindModeIntensity_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature, Widget) == 0x000008, "Member 'WBP_Settings_AccessibilityOptionsList_C_BndEvt__WBP_Settings_AccessibilityOptionsList_WBP_SliderSelector_ColorblindModeIntensity_K2Node_ComponentBoundEvent_1_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_AccessibilityOptionsList.WBP_Settings_AccessibilityOptionsList_C.ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Value_6;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Name_4;                 // 0x0008(0x0010)()
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget_6;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Value_5;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Name_3;                 // 0x0028(0x0010)()
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget_5;               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_ComponentBoundEvent_Value_4;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget_4;               // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SliderSelector_C*                  K2Node_DynamicCast_AsWBP_Slider_Selector;          // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetMapRangedClampedValue_ReturnValue;     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Value_3;                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Name_2;                 // 0x0078(0x0010)()
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget_3;               // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Value_2;                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Name_1;                 // 0x0098(0x0010)()
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget_2;               // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Value_1;                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Name;                   // 0x00B8(0x0010)()
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget_1;               // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_Value;                  // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget;                 // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetColorVisionDeficiencyCorrectionSeverity_Value_ImplicitCast; // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetApplicationScale_Value_ImplicitCast;   // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList) == 0x000008, "Wrong alignment on WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList");
static_assert(sizeof(WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList) == 0x0000F0, "Wrong size on WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList, EntryPoint) == 0x000000, "Member 'WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList, K2Node_ComponentBoundEvent_Value_6) == 0x000004, "Member 'WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList::K2Node_ComponentBoundEvent_Value_6' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList, K2Node_ComponentBoundEvent_Name_4) == 0x000008, "Member 'WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList::K2Node_ComponentBoundEvent_Name_4' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList, K2Node_ComponentBoundEvent_Widget_6) == 0x000018, "Member 'WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList::K2Node_ComponentBoundEvent_Widget_6' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList, K2Node_ComponentBoundEvent_Value_5) == 0x000020, "Member 'WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList::K2Node_ComponentBoundEvent_Value_5' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList, K2Node_ComponentBoundEvent_Name_3) == 0x000028, "Member 'WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList::K2Node_ComponentBoundEvent_Name_3' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList, K2Node_ComponentBoundEvent_Widget_5) == 0x000038, "Member 'WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList::K2Node_ComponentBoundEvent_Widget_5' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList, CallFunc_Conv_IntToByte_ReturnValue) == 0x000040, "Member 'WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList, CallFunc_GetValidValue_ReturnValue) == 0x000041, "Member 'WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList, K2Node_ComponentBoundEvent_Value_4) == 0x000048, "Member 'WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList::K2Node_ComponentBoundEvent_Value_4' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList, K2Node_ComponentBoundEvent_Widget_4) == 0x000050, "Member 'WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList::K2Node_ComponentBoundEvent_Widget_4' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList, K2Node_DynamicCast_AsWBP_Slider_Selector) == 0x000058, "Member 'WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList::K2Node_DynamicCast_AsWBP_Slider_Selector' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList, CallFunc_GetMapRangedClampedValue_ReturnValue) == 0x000068, "Member 'WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList::CallFunc_GetMapRangedClampedValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList, K2Node_ComponentBoundEvent_Value_3) == 0x000070, "Member 'WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList::K2Node_ComponentBoundEvent_Value_3' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList, K2Node_ComponentBoundEvent_Name_2) == 0x000078, "Member 'WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList::K2Node_ComponentBoundEvent_Name_2' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList, K2Node_ComponentBoundEvent_Widget_3) == 0x000088, "Member 'WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList::K2Node_ComponentBoundEvent_Widget_3' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList, K2Node_ComponentBoundEvent_Value_2) == 0x000090, "Member 'WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList::K2Node_ComponentBoundEvent_Value_2' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList, K2Node_ComponentBoundEvent_Name_1) == 0x000098, "Member 'WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList::K2Node_ComponentBoundEvent_Name_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList, K2Node_ComponentBoundEvent_Widget_2) == 0x0000A8, "Member 'WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList::K2Node_ComponentBoundEvent_Widget_2' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList, K2Node_ComponentBoundEvent_Value_1) == 0x0000B0, "Member 'WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList::K2Node_ComponentBoundEvent_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList, K2Node_ComponentBoundEvent_Name) == 0x0000B8, "Member 'WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList::K2Node_ComponentBoundEvent_Name' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList, K2Node_ComponentBoundEvent_Widget_1) == 0x0000C8, "Member 'WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList::K2Node_ComponentBoundEvent_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList, K2Node_ComponentBoundEvent_Value) == 0x0000D0, "Member 'WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList, K2Node_ComponentBoundEvent_Widget) == 0x0000D8, "Member 'WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000E0, "Member 'WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList, CallFunc_SetColorVisionDeficiencyCorrectionSeverity_Value_ImplicitCast) == 0x0000E8, "Member 'WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList::CallFunc_SetColorVisionDeficiencyCorrectionSeverity_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList, CallFunc_SetApplicationScale_Value_ImplicitCast) == 0x0000EC, "Member 'WBP_Settings_AccessibilityOptionsList_C_ExecuteUbergraph_WBP_Settings_AccessibilityOptionsList::CallFunc_SetApplicationScale_Value_ImplicitCast' has a wrong offset!");

// Function WBP_Settings_AccessibilityOptionsList.WBP_Settings_AccessibilityOptionsList_C.LoadUserSettings
// 0x0108 (0x0108 - 0x0000)
struct WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings final
{
public:
	TMap<class UWBP_NamedBoolSelector_C*, bool>   local_BoolWidgetToValue;                           // 0x0000(0x0050)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_NamedBoolSelector_C*>       CallFunc_Map_Keys_Keys;                            // 0x0060(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_NamedBoolSelector_C*               CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEnablePersistentCenterDot_ReturnValue; // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEnableCameraMovement_ReturnValue;      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEnableCameraShakes_ReturnValue;        // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEnableAutomaticBattleQTE_ReturnValue;  // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_Value;                           // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83[0x1];                                       // 0x0083(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetApplicationScale_ReturnValue;          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetColorVisionDeficiencyCorrectionSeverity_ReturnValue; // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EColorVisionDeficiency                        CallFunc_GetColorVisionDeficiency_ReturnValue;     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class UWBP_NamedBoolSelector_C*, bool>   K2Node_MakeMap_Map;                                // 0x00A0(0x0050)(ContainsInstancedReference)
	class UConfigurableGameUserSettings*          CallFunc_GetConfigurableGameUserSettings_GameUserSettings; // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetCurrentValueWithMapRanged_Value_ImplicitCast; // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings) == 0x000008, "Wrong alignment on WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings");
static_assert(sizeof(WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings) == 0x000108, "Wrong size on WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings, local_BoolWidgetToValue) == 0x000000, "Member 'WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings::local_BoolWidgetToValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings, Temp_int_Array_Index_Variable) == 0x000050, "Member 'WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings, Temp_int_Loop_Counter_Variable) == 0x000054, "Member 'WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings, CallFunc_Map_Keys_Keys) == 0x000060, "Member 'WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings, CallFunc_Array_Get_Item) == 0x000070, "Member 'WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings, CallFunc_GetEnablePersistentCenterDot_ReturnValue) == 0x000078, "Member 'WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings::CallFunc_GetEnablePersistentCenterDot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings, CallFunc_GetEnableCameraMovement_ReturnValue) == 0x000079, "Member 'WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings::CallFunc_GetEnableCameraMovement_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings, CallFunc_GetEnableCameraShakes_ReturnValue) == 0x00007A, "Member 'WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings::CallFunc_GetEnableCameraShakes_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings, CallFunc_GetEnableAutomaticBattleQTE_ReturnValue) == 0x00007B, "Member 'WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings::CallFunc_GetEnableAutomaticBattleQTE_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings, CallFunc_Array_Length_ReturnValue) == 0x00007C, "Member 'WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings, CallFunc_Map_Find_Value) == 0x000081, "Member 'WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings, CallFunc_Map_Find_ReturnValue) == 0x000082, "Member 'WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings, CallFunc_GetApplicationScale_ReturnValue) == 0x000084, "Member 'WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings::CallFunc_GetApplicationScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings, CallFunc_GetColorVisionDeficiencyCorrectionSeverity_ReturnValue) == 0x000088, "Member 'WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings::CallFunc_GetColorVisionDeficiencyCorrectionSeverity_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000090, "Member 'WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings, CallFunc_GetColorVisionDeficiency_ReturnValue) == 0x000098, "Member 'WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings::CallFunc_GetColorVisionDeficiency_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00009C, "Member 'WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings, K2Node_MakeMap_Map) == 0x0000A0, "Member 'WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings::K2Node_MakeMap_Map' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings, CallFunc_GetConfigurableGameUserSettings_GameUserSettings) == 0x0000F0, "Member 'WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings::CallFunc_GetConfigurableGameUserSettings_GameUserSettings' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0000F8, "Member 'WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings, CallFunc_SetCurrentValueWithMapRanged_Value_ImplicitCast) == 0x000100, "Member 'WBP_Settings_AccessibilityOptionsList_C_LoadUserSettings::CallFunc_SetCurrentValueWithMapRanged_Value_ImplicitCast' has a wrong offset!");

// Function WBP_Settings_AccessibilityOptionsList.WBP_Settings_AccessibilityOptionsList_C.SetupAvailableOptions
// 0x0050 (0x0050 - 0x0000)
struct WBP_Settings_AccessibilityOptionsList_C_SetupAvailableOptions final
{
public:
	TMap<int32, class FText>                      K2Node_MakeMap_Map;                                // 0x0000(0x0050)()
};
static_assert(alignof(WBP_Settings_AccessibilityOptionsList_C_SetupAvailableOptions) == 0x000008, "Wrong alignment on WBP_Settings_AccessibilityOptionsList_C_SetupAvailableOptions");
static_assert(sizeof(WBP_Settings_AccessibilityOptionsList_C_SetupAvailableOptions) == 0x000050, "Wrong size on WBP_Settings_AccessibilityOptionsList_C_SetupAvailableOptions");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_SetupAvailableOptions, K2Node_MakeMap_Map) == 0x000000, "Member 'WBP_Settings_AccessibilityOptionsList_C_SetupAvailableOptions::K2Node_MakeMap_Map' has a wrong offset!");

// Function WBP_Settings_AccessibilityOptionsList.WBP_Settings_AccessibilityOptionsList_C.UnbindOnOptionEntryFocused
// 0x0010 (0x0010 - 0x0000)
struct WBP_Settings_AccessibilityOptionsList_C_UnbindOnOptionEntryFocused final
{
public:
	TDelegate<void(class UWBP_Settings_OptionEntry_C* Widget)> Event;                                // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_AccessibilityOptionsList_C_UnbindOnOptionEntryFocused) == 0x000004, "Wrong alignment on WBP_Settings_AccessibilityOptionsList_C_UnbindOnOptionEntryFocused");
static_assert(sizeof(WBP_Settings_AccessibilityOptionsList_C_UnbindOnOptionEntryFocused) == 0x000010, "Wrong size on WBP_Settings_AccessibilityOptionsList_C_UnbindOnOptionEntryFocused");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_UnbindOnOptionEntryFocused, Event) == 0x000000, "Member 'WBP_Settings_AccessibilityOptionsList_C_UnbindOnOptionEntryFocused::Event' has a wrong offset!");

// Function WBP_Settings_AccessibilityOptionsList.WBP_Settings_AccessibilityOptionsList_C.UpdateColorblindModeIntensityWidget
// 0x0002 (0x0002 - 0x0000)
struct WBP_Settings_AccessibilityOptionsList_C_UpdateColorblindModeIntensityWidget final
{
public:
	EColorVisionDeficiency                        CallFunc_GetColorVisionDeficiency_ReturnValue;     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_AccessibilityOptionsList_C_UpdateColorblindModeIntensityWidget) == 0x000001, "Wrong alignment on WBP_Settings_AccessibilityOptionsList_C_UpdateColorblindModeIntensityWidget");
static_assert(sizeof(WBP_Settings_AccessibilityOptionsList_C_UpdateColorblindModeIntensityWidget) == 0x000002, "Wrong size on WBP_Settings_AccessibilityOptionsList_C_UpdateColorblindModeIntensityWidget");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_UpdateColorblindModeIntensityWidget, CallFunc_GetColorVisionDeficiency_ReturnValue) == 0x000000, "Member 'WBP_Settings_AccessibilityOptionsList_C_UpdateColorblindModeIntensityWidget::CallFunc_GetColorVisionDeficiency_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_UpdateColorblindModeIntensityWidget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'WBP_Settings_AccessibilityOptionsList_C_UpdateColorblindModeIntensityWidget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_Settings_AccessibilityOptionsList.WBP_Settings_AccessibilityOptionsList_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_Settings_AccessibilityOptionsList_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_AccessibilityOptionsList_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_Settings_AccessibilityOptionsList_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_Settings_AccessibilityOptionsList_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_Settings_AccessibilityOptionsList_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_Settings_AccessibilityOptionsList_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_Settings_AccessibilityOptionsList_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

