#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HealingElixirCount

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SandFall_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HealingElixirCount.WBP_HealingElixirCount_C
// 0x0028 (0x0330 - 0x0308)
class UWBP_HealingElixirCount_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraSystemWidget*                   NiagaraSystemWidget_Explosion;                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       QuantityText;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSoundEventDataTableRowHandle          SD_OnHeal;                                         // 0x0320(0x0010)(Edit, BlueprintVisible, NoDestructor)

public:
	bool HasCharacterToHeal();
	void LoadState();
	void PreConstruct(bool IsDesignTime);
	void TriggerHeal();
	void ExecuteUbergraph_WBP_HealingElixirCount(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HealingElixirCount_C">();
	}
	static class UWBP_HealingElixirCount_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HealingElixirCount_C>();
	}
};
static_assert(alignof(UWBP_HealingElixirCount_C) == 0x000008, "Wrong alignment on UWBP_HealingElixirCount_C");
static_assert(sizeof(UWBP_HealingElixirCount_C) == 0x000330, "Wrong size on UWBP_HealingElixirCount_C");
static_assert(offsetof(UWBP_HealingElixirCount_C, UberGraphFrame) == 0x000308, "Member 'UWBP_HealingElixirCount_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HealingElixirCount_C, NiagaraSystemWidget_Explosion) == 0x000310, "Member 'UWBP_HealingElixirCount_C::NiagaraSystemWidget_Explosion' has a wrong offset!");
static_assert(offsetof(UWBP_HealingElixirCount_C, QuantityText) == 0x000318, "Member 'UWBP_HealingElixirCount_C::QuantityText' has a wrong offset!");
static_assert(offsetof(UWBP_HealingElixirCount_C, SD_OnHeal) == 0x000320, "Member 'UWBP_HealingElixirCount_C::SD_OnHeal' has a wrong offset!");

}

