#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BattleTransition

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_BattleTransition.WBP_BattleTransition_C.ExecuteUbergraph_WBP_BattleTransition
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Conv_DoubleToVector2D_ReturnValue;        // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0018(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DVector2D_ReturnValue;      // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1; // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_2; // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_3; // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_R_ImplicitCast;                  // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_G_ImplicitCast;                  // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition) == 0x000008, "Wrong alignment on WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition");
static_assert(sizeof(WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition) == 0x0000F8, "Wrong size on WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition");
static_assert(offsetof(WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition, EntryPoint) == 0x000000, "Member 'WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition, CallFunc_Conv_DoubleToVector2D_ReturnValue) == 0x000008, "Member 'WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition::CallFunc_Conv_DoubleToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition, K2Node_Event_MyGeometry) == 0x000018, "Member 'WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition, K2Node_Event_InDeltaTime) == 0x000050, "Member 'WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition, CallFunc_PlayAnimation_ReturnValue) == 0x000058, "Member 'WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition, CallFunc_PlayAnimation_ReturnValue_1) == 0x000060, "Member 'WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition, K2Node_CreateDelegate_OutputDelegate) == 0x000068, "Member 'WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition, CallFunc_GetViewportSize_ReturnValue) == 0x000078, "Member 'WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition::CallFunc_GetViewportSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000088, "Member 'WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition, CallFunc_Divide_Vector2DVector2D_ReturnValue) == 0x000090, "Member 'WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition::CallFunc_Divide_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition, CallFunc_BreakVector2D_X) == 0x0000A0, "Member 'WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition, CallFunc_BreakVector2D_Y) == 0x0000A8, "Member 'WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000B0, "Member 'WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000B8, "Member 'WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000C0, "Member 'WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x0000C8, "Member 'WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition, K2Node_MakeStruct_LinearColor) == 0x0000D0, "Member 'WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast) == 0x0000E0, "Member 'WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1) == 0x0000E4, "Member 'WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_2) == 0x0000E8, "Member 'WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_3) == 0x0000EC, "Member 'WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition, K2Node_MakeStruct_R_ImplicitCast) == 0x0000F0, "Member 'WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition::K2Node_MakeStruct_R_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition, K2Node_MakeStruct_G_ImplicitCast) == 0x0000F4, "Member 'WBP_BattleTransition_C_ExecuteUbergraph_WBP_BattleTransition::K2Node_MakeStruct_G_ImplicitCast' has a wrong offset!");

// Function WBP_BattleTransition.WBP_BattleTransition_C.SetDesaturationScreen
// 0x0008 (0x0008 - 0x0000)
struct WBP_BattleTransition_C_SetDesaturationScreen final
{
public:
	double                                        NewValue;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleTransition_C_SetDesaturationScreen) == 0x000008, "Wrong alignment on WBP_BattleTransition_C_SetDesaturationScreen");
static_assert(sizeof(WBP_BattleTransition_C_SetDesaturationScreen) == 0x000008, "Wrong size on WBP_BattleTransition_C_SetDesaturationScreen");
static_assert(offsetof(WBP_BattleTransition_C_SetDesaturationScreen, NewValue) == 0x000000, "Member 'WBP_BattleTransition_C_SetDesaturationScreen::NewValue' has a wrong offset!");

// Function WBP_BattleTransition.WBP_BattleTransition_C.SetFishEyeRadius
// 0x0008 (0x0008 - 0x0000)
struct WBP_BattleTransition_C_SetFishEyeRadius final
{
public:
	double                                        NewValue;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleTransition_C_SetFishEyeRadius) == 0x000008, "Wrong alignment on WBP_BattleTransition_C_SetFishEyeRadius");
static_assert(sizeof(WBP_BattleTransition_C_SetFishEyeRadius) == 0x000008, "Wrong size on WBP_BattleTransition_C_SetFishEyeRadius");
static_assert(offsetof(WBP_BattleTransition_C_SetFishEyeRadius, NewValue) == 0x000000, "Member 'WBP_BattleTransition_C_SetFishEyeRadius::NewValue' has a wrong offset!");

// Function WBP_BattleTransition.WBP_BattleTransition_C.SetOpacity
// 0x0008 (0x0008 - 0x0000)
struct WBP_BattleTransition_C_SetOpacity final
{
public:
	double                                        NewValue;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleTransition_C_SetOpacity) == 0x000008, "Wrong alignment on WBP_BattleTransition_C_SetOpacity");
static_assert(sizeof(WBP_BattleTransition_C_SetOpacity) == 0x000008, "Wrong size on WBP_BattleTransition_C_SetOpacity");
static_assert(offsetof(WBP_BattleTransition_C_SetOpacity, NewValue) == 0x000000, "Member 'WBP_BattleTransition_C_SetOpacity::NewValue' has a wrong offset!");

// Function WBP_BattleTransition.WBP_BattleTransition_C.SetScreenScaling
// 0x0008 (0x0008 - 0x0000)
struct WBP_BattleTransition_C_SetScreenScaling final
{
public:
	double                                        NewValue;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleTransition_C_SetScreenScaling) == 0x000008, "Wrong alignment on WBP_BattleTransition_C_SetScreenScaling");
static_assert(sizeof(WBP_BattleTransition_C_SetScreenScaling) == 0x000008, "Wrong size on WBP_BattleTransition_C_SetScreenScaling");
static_assert(offsetof(WBP_BattleTransition_C_SetScreenScaling, NewValue) == 0x000000, "Member 'WBP_BattleTransition_C_SetScreenScaling::NewValue' has a wrong offset!");

// Function WBP_BattleTransition.WBP_BattleTransition_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_BattleTransition_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleTransition_C_Tick) == 0x000004, "Wrong alignment on WBP_BattleTransition_C_Tick");
static_assert(sizeof(WBP_BattleTransition_C_Tick) == 0x00003C, "Wrong size on WBP_BattleTransition_C_Tick");
static_assert(offsetof(WBP_BattleTransition_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_BattleTransition_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_BattleTransition_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_BattleTransition_C_Tick::InDeltaTime' has a wrong offset!");

}

