#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GM_AssignedSkillsShort

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_GM_AssignedSkillsShort.WBP_GM_AssignedSkillsShort_C.ExecuteUbergraph_WBP_GM_AssignedSkillsShort
// 0x01B8 (0x01B8 - 0x0000)
struct WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate;           // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_1;         // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_2;         // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_3;         // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_4;         // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_5;         // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_6;         // 0x0064(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_7;         // 0x0074(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_8;         // 0x0084(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_9;         // 0x0094(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_10;        // 0x00A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_11;        // 0x00B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_12;        // 0x00C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_13;        // 0x00D4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_14;        // 0x00E4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_15;        // 0x00F4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_16;        // 0x0104(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_17;        // 0x0114(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_CustomEvent_Button_17;                      // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_CustomEvent_Button_16;                      // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_CustomEvent_Button_15;                      // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_CustomEvent_Button_14;                      // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_CustomEvent_Button_13;                      // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_CustomEvent_Button_12;                      // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_CustomEvent_Button_11;                      // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_CustomEvent_Button_10;                      // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_CustomEvent_Button_9;                       // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_CustomEvent_Button_8;                       // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_CustomEvent_Button_7;                       // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_CustomEvent_Button_6;                       // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_CustomEvent_Button_5;                       // 0x0188(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_CustomEvent_Button_4;                       // 0x0190(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_CustomEvent_Button_3;                       // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_CustomEvent_Button_2;                       // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_CustomEvent_Button_1;                       // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_CustomEvent_Button;                         // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort) == 0x000008, "Wrong alignment on WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort");
static_assert(sizeof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort) == 0x0001B8, "Wrong size on WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort, EntryPoint) == 0x000000, "Member 'WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort, K2Node_CreateDelegate_OutputDelegate_3) == 0x000034, "Member 'WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort, K2Node_CreateDelegate_OutputDelegate_4) == 0x000044, "Member 'WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort, K2Node_CreateDelegate_OutputDelegate_5) == 0x000054, "Member 'WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort, K2Node_CreateDelegate_OutputDelegate_6) == 0x000064, "Member 'WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort, K2Node_CreateDelegate_OutputDelegate_7) == 0x000074, "Member 'WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort, K2Node_CreateDelegate_OutputDelegate_8) == 0x000084, "Member 'WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort, K2Node_CreateDelegate_OutputDelegate_9) == 0x000094, "Member 'WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort, K2Node_CreateDelegate_OutputDelegate_10) == 0x0000A4, "Member 'WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort, K2Node_CreateDelegate_OutputDelegate_11) == 0x0000B4, "Member 'WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort, K2Node_CreateDelegate_OutputDelegate_12) == 0x0000C4, "Member 'WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort, K2Node_CreateDelegate_OutputDelegate_13) == 0x0000D4, "Member 'WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort, K2Node_CreateDelegate_OutputDelegate_14) == 0x0000E4, "Member 'WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort, K2Node_CreateDelegate_OutputDelegate_15) == 0x0000F4, "Member 'WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort::K2Node_CreateDelegate_OutputDelegate_15' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort, K2Node_CreateDelegate_OutputDelegate_16) == 0x000104, "Member 'WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort::K2Node_CreateDelegate_OutputDelegate_16' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort, K2Node_CreateDelegate_OutputDelegate_17) == 0x000114, "Member 'WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort::K2Node_CreateDelegate_OutputDelegate_17' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort, K2Node_CustomEvent_Button_17) == 0x000128, "Member 'WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort::K2Node_CustomEvent_Button_17' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort, K2Node_CustomEvent_Button_16) == 0x000130, "Member 'WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort::K2Node_CustomEvent_Button_16' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort, K2Node_CustomEvent_Button_15) == 0x000138, "Member 'WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort::K2Node_CustomEvent_Button_15' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort, K2Node_CustomEvent_Button_14) == 0x000140, "Member 'WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort::K2Node_CustomEvent_Button_14' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort, K2Node_CustomEvent_Button_13) == 0x000148, "Member 'WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort::K2Node_CustomEvent_Button_13' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort, K2Node_CustomEvent_Button_12) == 0x000150, "Member 'WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort::K2Node_CustomEvent_Button_12' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort, K2Node_CustomEvent_Button_11) == 0x000158, "Member 'WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort::K2Node_CustomEvent_Button_11' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort, K2Node_CustomEvent_Button_10) == 0x000160, "Member 'WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort::K2Node_CustomEvent_Button_10' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort, K2Node_CustomEvent_Button_9) == 0x000168, "Member 'WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort::K2Node_CustomEvent_Button_9' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort, K2Node_CustomEvent_Button_8) == 0x000170, "Member 'WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort::K2Node_CustomEvent_Button_8' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort, K2Node_CustomEvent_Button_7) == 0x000178, "Member 'WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort::K2Node_CustomEvent_Button_7' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort, K2Node_CustomEvent_Button_6) == 0x000180, "Member 'WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort::K2Node_CustomEvent_Button_6' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort, K2Node_CustomEvent_Button_5) == 0x000188, "Member 'WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort::K2Node_CustomEvent_Button_5' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort, K2Node_CustomEvent_Button_4) == 0x000190, "Member 'WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort::K2Node_CustomEvent_Button_4' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort, K2Node_CustomEvent_Button_3) == 0x000198, "Member 'WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort::K2Node_CustomEvent_Button_3' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort, K2Node_CustomEvent_Button_2) == 0x0001A0, "Member 'WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort::K2Node_CustomEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort, K2Node_CustomEvent_Button_1) == 0x0001A8, "Member 'WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort::K2Node_CustomEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort, K2Node_CustomEvent_Button) == 0x0001B0, "Member 'WBP_GM_AssignedSkillsShort_C_ExecuteUbergraph_WBP_GM_AssignedSkillsShort::K2Node_CustomEvent_Button' has a wrong offset!");

// Function WBP_GM_AssignedSkillsShort.WBP_GM_AssignedSkillsShort_C.InstantReset
// 0x0038 (0x0038 - 0x0000)
struct WBP_GM_AssignedSkillsShort_C_InstantReset final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_GM_SkillElementShort_C*>    K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GM_SkillElementShort_C*            CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_AssignedSkillsShort_C_InstantReset) == 0x000008, "Wrong alignment on WBP_GM_AssignedSkillsShort_C_InstantReset");
static_assert(sizeof(WBP_GM_AssignedSkillsShort_C_InstantReset) == 0x000038, "Wrong size on WBP_GM_AssignedSkillsShort_C_InstantReset");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_InstantReset, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_GM_AssignedSkillsShort_C_InstantReset::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_InstantReset, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_GM_AssignedSkillsShort_C_InstantReset::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_InstantReset, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_GM_AssignedSkillsShort_C_InstantReset::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_InstantReset, K2Node_MakeArray_Array) == 0x000010, "Member 'WBP_GM_AssignedSkillsShort_C_InstantReset::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_InstantReset, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_GM_AssignedSkillsShort_C_InstantReset::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_InstantReset, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_GM_AssignedSkillsShort_C_InstantReset::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_InstantReset, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WBP_GM_AssignedSkillsShort_C_InstantReset::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_GM_AssignedSkillsShort.WBP_GM_AssignedSkillsShort_C.LoadCharacterData
// 0x0070 (0x0070 - 0x0000)
struct WBP_GM_AssignedSkillsShort_C_LoadCharacterData final
{
public:
	class UBP_CharacterData_C*                    InCharacterData;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_DataAsset_Skill_C*>          Temp_wildcard_Variable;                            // 0x0008(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_DataAsset_Skill_C*>          CallFunc_GetEquippedSkills_EquippedSkills;         // 0x0020(0x0010)(ReferenceParm)
	class UBP_DataAsset_Skill_C*                  CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x1];                                       // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_GM_SkillElementShort_C*>    K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GM_SkillElementShort_C*            CallFunc_Array_Get_Item_1;                         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_AssignedSkillsShort_C_LoadCharacterData) == 0x000008, "Wrong alignment on WBP_GM_AssignedSkillsShort_C_LoadCharacterData");
static_assert(sizeof(WBP_GM_AssignedSkillsShort_C_LoadCharacterData) == 0x000070, "Wrong size on WBP_GM_AssignedSkillsShort_C_LoadCharacterData");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_LoadCharacterData, InCharacterData) == 0x000000, "Member 'WBP_GM_AssignedSkillsShort_C_LoadCharacterData::InCharacterData' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_LoadCharacterData, Temp_wildcard_Variable) == 0x000008, "Member 'WBP_GM_AssignedSkillsShort_C_LoadCharacterData::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_LoadCharacterData, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WBP_GM_AssignedSkillsShort_C_LoadCharacterData::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_LoadCharacterData, CallFunc_GetEquippedSkills_EquippedSkills) == 0x000020, "Member 'WBP_GM_AssignedSkillsShort_C_LoadCharacterData::CallFunc_GetEquippedSkills_EquippedSkills' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_LoadCharacterData, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_GM_AssignedSkillsShort_C_LoadCharacterData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_LoadCharacterData, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WBP_GM_AssignedSkillsShort_C_LoadCharacterData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_LoadCharacterData, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000039, "Member 'WBP_GM_AssignedSkillsShort_C_LoadCharacterData::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_LoadCharacterData, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00003A, "Member 'WBP_GM_AssignedSkillsShort_C_LoadCharacterData::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_LoadCharacterData, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'WBP_GM_AssignedSkillsShort_C_LoadCharacterData::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_LoadCharacterData, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'WBP_GM_AssignedSkillsShort_C_LoadCharacterData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_LoadCharacterData, K2Node_MakeArray_Array) == 0x000048, "Member 'WBP_GM_AssignedSkillsShort_C_LoadCharacterData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_LoadCharacterData, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'WBP_GM_AssignedSkillsShort_C_LoadCharacterData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_LoadCharacterData, CallFunc_Array_Get_Item_1) == 0x000060, "Member 'WBP_GM_AssignedSkillsShort_C_LoadCharacterData::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_LoadCharacterData, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'WBP_GM_AssignedSkillsShort_C_LoadCharacterData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_GM_AssignedSkillsShort.WBP_GM_AssignedSkillsShort_C.OnSkill0Clicked
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_AssignedSkillsShort_C_OnSkill0Clicked final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_AssignedSkillsShort_C_OnSkill0Clicked) == 0x000008, "Wrong alignment on WBP_GM_AssignedSkillsShort_C_OnSkill0Clicked");
static_assert(sizeof(WBP_GM_AssignedSkillsShort_C_OnSkill0Clicked) == 0x000008, "Wrong size on WBP_GM_AssignedSkillsShort_C_OnSkill0Clicked");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_OnSkill0Clicked, Button) == 0x000000, "Member 'WBP_GM_AssignedSkillsShort_C_OnSkill0Clicked::Button' has a wrong offset!");

// Function WBP_GM_AssignedSkillsShort.WBP_GM_AssignedSkillsShort_C.OnSkill0Focused
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_AssignedSkillsShort_C_OnSkill0Focused final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_AssignedSkillsShort_C_OnSkill0Focused) == 0x000008, "Wrong alignment on WBP_GM_AssignedSkillsShort_C_OnSkill0Focused");
static_assert(sizeof(WBP_GM_AssignedSkillsShort_C_OnSkill0Focused) == 0x000008, "Wrong size on WBP_GM_AssignedSkillsShort_C_OnSkill0Focused");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_OnSkill0Focused, Button) == 0x000000, "Member 'WBP_GM_AssignedSkillsShort_C_OnSkill0Focused::Button' has a wrong offset!");

// Function WBP_GM_AssignedSkillsShort.WBP_GM_AssignedSkillsShort_C.OnSkill0Unfocused
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_AssignedSkillsShort_C_OnSkill0Unfocused final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_AssignedSkillsShort_C_OnSkill0Unfocused) == 0x000008, "Wrong alignment on WBP_GM_AssignedSkillsShort_C_OnSkill0Unfocused");
static_assert(sizeof(WBP_GM_AssignedSkillsShort_C_OnSkill0Unfocused) == 0x000008, "Wrong size on WBP_GM_AssignedSkillsShort_C_OnSkill0Unfocused");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_OnSkill0Unfocused, Button) == 0x000000, "Member 'WBP_GM_AssignedSkillsShort_C_OnSkill0Unfocused::Button' has a wrong offset!");

// Function WBP_GM_AssignedSkillsShort.WBP_GM_AssignedSkillsShort_C.OnSkill1Clicked
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_AssignedSkillsShort_C_OnSkill1Clicked final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_AssignedSkillsShort_C_OnSkill1Clicked) == 0x000008, "Wrong alignment on WBP_GM_AssignedSkillsShort_C_OnSkill1Clicked");
static_assert(sizeof(WBP_GM_AssignedSkillsShort_C_OnSkill1Clicked) == 0x000008, "Wrong size on WBP_GM_AssignedSkillsShort_C_OnSkill1Clicked");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_OnSkill1Clicked, Button) == 0x000000, "Member 'WBP_GM_AssignedSkillsShort_C_OnSkill1Clicked::Button' has a wrong offset!");

// Function WBP_GM_AssignedSkillsShort.WBP_GM_AssignedSkillsShort_C.OnSkill1Focused
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_AssignedSkillsShort_C_OnSkill1Focused final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_AssignedSkillsShort_C_OnSkill1Focused) == 0x000008, "Wrong alignment on WBP_GM_AssignedSkillsShort_C_OnSkill1Focused");
static_assert(sizeof(WBP_GM_AssignedSkillsShort_C_OnSkill1Focused) == 0x000008, "Wrong size on WBP_GM_AssignedSkillsShort_C_OnSkill1Focused");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_OnSkill1Focused, Button) == 0x000000, "Member 'WBP_GM_AssignedSkillsShort_C_OnSkill1Focused::Button' has a wrong offset!");

// Function WBP_GM_AssignedSkillsShort.WBP_GM_AssignedSkillsShort_C.OnSkill1Unfocused
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_AssignedSkillsShort_C_OnSkill1Unfocused final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_AssignedSkillsShort_C_OnSkill1Unfocused) == 0x000008, "Wrong alignment on WBP_GM_AssignedSkillsShort_C_OnSkill1Unfocused");
static_assert(sizeof(WBP_GM_AssignedSkillsShort_C_OnSkill1Unfocused) == 0x000008, "Wrong size on WBP_GM_AssignedSkillsShort_C_OnSkill1Unfocused");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_OnSkill1Unfocused, Button) == 0x000000, "Member 'WBP_GM_AssignedSkillsShort_C_OnSkill1Unfocused::Button' has a wrong offset!");

// Function WBP_GM_AssignedSkillsShort.WBP_GM_AssignedSkillsShort_C.OnSkill2Clicked
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_AssignedSkillsShort_C_OnSkill2Clicked final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_AssignedSkillsShort_C_OnSkill2Clicked) == 0x000008, "Wrong alignment on WBP_GM_AssignedSkillsShort_C_OnSkill2Clicked");
static_assert(sizeof(WBP_GM_AssignedSkillsShort_C_OnSkill2Clicked) == 0x000008, "Wrong size on WBP_GM_AssignedSkillsShort_C_OnSkill2Clicked");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_OnSkill2Clicked, Button) == 0x000000, "Member 'WBP_GM_AssignedSkillsShort_C_OnSkill2Clicked::Button' has a wrong offset!");

// Function WBP_GM_AssignedSkillsShort.WBP_GM_AssignedSkillsShort_C.OnSkill2Focused
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_AssignedSkillsShort_C_OnSkill2Focused final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_AssignedSkillsShort_C_OnSkill2Focused) == 0x000008, "Wrong alignment on WBP_GM_AssignedSkillsShort_C_OnSkill2Focused");
static_assert(sizeof(WBP_GM_AssignedSkillsShort_C_OnSkill2Focused) == 0x000008, "Wrong size on WBP_GM_AssignedSkillsShort_C_OnSkill2Focused");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_OnSkill2Focused, Button) == 0x000000, "Member 'WBP_GM_AssignedSkillsShort_C_OnSkill2Focused::Button' has a wrong offset!");

// Function WBP_GM_AssignedSkillsShort.WBP_GM_AssignedSkillsShort_C.OnSkill2Unfocused
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_AssignedSkillsShort_C_OnSkill2Unfocused final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_AssignedSkillsShort_C_OnSkill2Unfocused) == 0x000008, "Wrong alignment on WBP_GM_AssignedSkillsShort_C_OnSkill2Unfocused");
static_assert(sizeof(WBP_GM_AssignedSkillsShort_C_OnSkill2Unfocused) == 0x000008, "Wrong size on WBP_GM_AssignedSkillsShort_C_OnSkill2Unfocused");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_OnSkill2Unfocused, Button) == 0x000000, "Member 'WBP_GM_AssignedSkillsShort_C_OnSkill2Unfocused::Button' has a wrong offset!");

// Function WBP_GM_AssignedSkillsShort.WBP_GM_AssignedSkillsShort_C.OnSkill3Clicked
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_AssignedSkillsShort_C_OnSkill3Clicked final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_AssignedSkillsShort_C_OnSkill3Clicked) == 0x000008, "Wrong alignment on WBP_GM_AssignedSkillsShort_C_OnSkill3Clicked");
static_assert(sizeof(WBP_GM_AssignedSkillsShort_C_OnSkill3Clicked) == 0x000008, "Wrong size on WBP_GM_AssignedSkillsShort_C_OnSkill3Clicked");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_OnSkill3Clicked, Button) == 0x000000, "Member 'WBP_GM_AssignedSkillsShort_C_OnSkill3Clicked::Button' has a wrong offset!");

// Function WBP_GM_AssignedSkillsShort.WBP_GM_AssignedSkillsShort_C.OnSkill3Focused
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_AssignedSkillsShort_C_OnSkill3Focused final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_AssignedSkillsShort_C_OnSkill3Focused) == 0x000008, "Wrong alignment on WBP_GM_AssignedSkillsShort_C_OnSkill3Focused");
static_assert(sizeof(WBP_GM_AssignedSkillsShort_C_OnSkill3Focused) == 0x000008, "Wrong size on WBP_GM_AssignedSkillsShort_C_OnSkill3Focused");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_OnSkill3Focused, Button) == 0x000000, "Member 'WBP_GM_AssignedSkillsShort_C_OnSkill3Focused::Button' has a wrong offset!");

// Function WBP_GM_AssignedSkillsShort.WBP_GM_AssignedSkillsShort_C.OnSkill3Unfocused
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_AssignedSkillsShort_C_OnSkill3Unfocused final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_AssignedSkillsShort_C_OnSkill3Unfocused) == 0x000008, "Wrong alignment on WBP_GM_AssignedSkillsShort_C_OnSkill3Unfocused");
static_assert(sizeof(WBP_GM_AssignedSkillsShort_C_OnSkill3Unfocused) == 0x000008, "Wrong size on WBP_GM_AssignedSkillsShort_C_OnSkill3Unfocused");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_OnSkill3Unfocused, Button) == 0x000000, "Member 'WBP_GM_AssignedSkillsShort_C_OnSkill3Unfocused::Button' has a wrong offset!");

// Function WBP_GM_AssignedSkillsShort.WBP_GM_AssignedSkillsShort_C.OnSkill4Clicked
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_AssignedSkillsShort_C_OnSkill4Clicked final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_AssignedSkillsShort_C_OnSkill4Clicked) == 0x000008, "Wrong alignment on WBP_GM_AssignedSkillsShort_C_OnSkill4Clicked");
static_assert(sizeof(WBP_GM_AssignedSkillsShort_C_OnSkill4Clicked) == 0x000008, "Wrong size on WBP_GM_AssignedSkillsShort_C_OnSkill4Clicked");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_OnSkill4Clicked, Button) == 0x000000, "Member 'WBP_GM_AssignedSkillsShort_C_OnSkill4Clicked::Button' has a wrong offset!");

// Function WBP_GM_AssignedSkillsShort.WBP_GM_AssignedSkillsShort_C.OnSkill4Focused
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_AssignedSkillsShort_C_OnSkill4Focused final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_AssignedSkillsShort_C_OnSkill4Focused) == 0x000008, "Wrong alignment on WBP_GM_AssignedSkillsShort_C_OnSkill4Focused");
static_assert(sizeof(WBP_GM_AssignedSkillsShort_C_OnSkill4Focused) == 0x000008, "Wrong size on WBP_GM_AssignedSkillsShort_C_OnSkill4Focused");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_OnSkill4Focused, Button) == 0x000000, "Member 'WBP_GM_AssignedSkillsShort_C_OnSkill4Focused::Button' has a wrong offset!");

// Function WBP_GM_AssignedSkillsShort.WBP_GM_AssignedSkillsShort_C.OnSkill4Unfocused
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_AssignedSkillsShort_C_OnSkill4Unfocused final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_AssignedSkillsShort_C_OnSkill4Unfocused) == 0x000008, "Wrong alignment on WBP_GM_AssignedSkillsShort_C_OnSkill4Unfocused");
static_assert(sizeof(WBP_GM_AssignedSkillsShort_C_OnSkill4Unfocused) == 0x000008, "Wrong size on WBP_GM_AssignedSkillsShort_C_OnSkill4Unfocused");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_OnSkill4Unfocused, Button) == 0x000000, "Member 'WBP_GM_AssignedSkillsShort_C_OnSkill4Unfocused::Button' has a wrong offset!");

// Function WBP_GM_AssignedSkillsShort.WBP_GM_AssignedSkillsShort_C.OnSkill5Clicked
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_AssignedSkillsShort_C_OnSkill5Clicked final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_AssignedSkillsShort_C_OnSkill5Clicked) == 0x000008, "Wrong alignment on WBP_GM_AssignedSkillsShort_C_OnSkill5Clicked");
static_assert(sizeof(WBP_GM_AssignedSkillsShort_C_OnSkill5Clicked) == 0x000008, "Wrong size on WBP_GM_AssignedSkillsShort_C_OnSkill5Clicked");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_OnSkill5Clicked, Button) == 0x000000, "Member 'WBP_GM_AssignedSkillsShort_C_OnSkill5Clicked::Button' has a wrong offset!");

// Function WBP_GM_AssignedSkillsShort.WBP_GM_AssignedSkillsShort_C.OnSkill5Focused
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_AssignedSkillsShort_C_OnSkill5Focused final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_AssignedSkillsShort_C_OnSkill5Focused) == 0x000008, "Wrong alignment on WBP_GM_AssignedSkillsShort_C_OnSkill5Focused");
static_assert(sizeof(WBP_GM_AssignedSkillsShort_C_OnSkill5Focused) == 0x000008, "Wrong size on WBP_GM_AssignedSkillsShort_C_OnSkill5Focused");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_OnSkill5Focused, Button) == 0x000000, "Member 'WBP_GM_AssignedSkillsShort_C_OnSkill5Focused::Button' has a wrong offset!");

// Function WBP_GM_AssignedSkillsShort.WBP_GM_AssignedSkillsShort_C.OnSkill5Unfocused
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_AssignedSkillsShort_C_OnSkill5Unfocused final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_AssignedSkillsShort_C_OnSkill5Unfocused) == 0x000008, "Wrong alignment on WBP_GM_AssignedSkillsShort_C_OnSkill5Unfocused");
static_assert(sizeof(WBP_GM_AssignedSkillsShort_C_OnSkill5Unfocused) == 0x000008, "Wrong size on WBP_GM_AssignedSkillsShort_C_OnSkill5Unfocused");
static_assert(offsetof(WBP_GM_AssignedSkillsShort_C_OnSkill5Unfocused, Button) == 0x000000, "Member 'WBP_GM_AssignedSkillsShort_C_OnSkill5Unfocused::Button' has a wrong offset!");

}

