#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SlotSquare_CustomizationPanel

#include "Basic.hpp"

#include "S_jRPG_Item_StaticData_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_SlotSquare_CustomizationPanel.WBP_SlotSquare_CustomizationPanel_C.BndEvt__WBP_SlotSquare_CustomizationPanel_BaseButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SlotSquare_CustomizationPanel_C_BndEvt__WBP_SlotSquare_CustomizationPanel_BaseButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SlotSquare_CustomizationPanel_C_BndEvt__WBP_SlotSquare_CustomizationPanel_BaseButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SlotSquare_CustomizationPanel_C_BndEvt__WBP_SlotSquare_CustomizationPanel_BaseButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_SlotSquare_CustomizationPanel_C_BndEvt__WBP_SlotSquare_CustomizationPanel_BaseButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SlotSquare_CustomizationPanel_C_BndEvt__WBP_SlotSquare_CustomizationPanel_BaseButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_SlotSquare_CustomizationPanel_C_BndEvt__WBP_SlotSquare_CustomizationPanel_BaseButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_SlotSquare_CustomizationPanel_C_BndEvt__WBP_SlotSquare_CustomizationPanel_BaseButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SlotSquare_CustomizationPanel.WBP_SlotSquare_CustomizationPanel_C.BndEvt__WBP_SlotSquare_CustomizationPanel_BaseButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_SlotSquare_CustomizationPanel_C_BndEvt__WBP_SlotSquare_CustomizationPanel_BaseButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Selected;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SlotSquare_CustomizationPanel_C_BndEvt__WBP_SlotSquare_CustomizationPanel_BaseButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SlotSquare_CustomizationPanel_C_BndEvt__WBP_SlotSquare_CustomizationPanel_BaseButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature");
static_assert(sizeof(WBP_SlotSquare_CustomizationPanel_C_BndEvt__WBP_SlotSquare_CustomizationPanel_BaseButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature) == 0x000010, "Wrong size on WBP_SlotSquare_CustomizationPanel_C_BndEvt__WBP_SlotSquare_CustomizationPanel_BaseButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature");
static_assert(offsetof(WBP_SlotSquare_CustomizationPanel_C_BndEvt__WBP_SlotSquare_CustomizationPanel_BaseButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature, Button) == 0x000000, "Member 'WBP_SlotSquare_CustomizationPanel_C_BndEvt__WBP_SlotSquare_CustomizationPanel_BaseButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_SlotSquare_CustomizationPanel_C_BndEvt__WBP_SlotSquare_CustomizationPanel_BaseButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature, Selected) == 0x000008, "Member 'WBP_SlotSquare_CustomizationPanel_C_BndEvt__WBP_SlotSquare_CustomizationPanel_BaseButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature::Selected' has a wrong offset!");

// Function WBP_SlotSquare_CustomizationPanel.WBP_SlotSquare_CustomizationPanel_C.ExecuteUbergraph_WBP_SlotSquare_CustomizationPanel
// 0x0038 (0x0038 - 0x0000)
struct WBP_SlotSquare_CustomizationPanel_C_ExecuteUbergraph_WBP_SlotSquare_CustomizationPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UCommonTextStyle>           Temp_class_Variable;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCommonTextStyle>           Temp_class_Variable_1;                             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Selected;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCommonTextStyle>           K2Node_Select_Default_1;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SlotSquare_CustomizationPanel_C_ExecuteUbergraph_WBP_SlotSquare_CustomizationPanel) == 0x000008, "Wrong alignment on WBP_SlotSquare_CustomizationPanel_C_ExecuteUbergraph_WBP_SlotSquare_CustomizationPanel");
static_assert(sizeof(WBP_SlotSquare_CustomizationPanel_C_ExecuteUbergraph_WBP_SlotSquare_CustomizationPanel) == 0x000038, "Wrong size on WBP_SlotSquare_CustomizationPanel_C_ExecuteUbergraph_WBP_SlotSquare_CustomizationPanel");
static_assert(offsetof(WBP_SlotSquare_CustomizationPanel_C_ExecuteUbergraph_WBP_SlotSquare_CustomizationPanel, EntryPoint) == 0x000000, "Member 'WBP_SlotSquare_CustomizationPanel_C_ExecuteUbergraph_WBP_SlotSquare_CustomizationPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SlotSquare_CustomizationPanel_C_ExecuteUbergraph_WBP_SlotSquare_CustomizationPanel, Temp_bool_Variable) == 0x000004, "Member 'WBP_SlotSquare_CustomizationPanel_C_ExecuteUbergraph_WBP_SlotSquare_CustomizationPanel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SlotSquare_CustomizationPanel_C_ExecuteUbergraph_WBP_SlotSquare_CustomizationPanel, Temp_byte_Variable) == 0x000005, "Member 'WBP_SlotSquare_CustomizationPanel_C_ExecuteUbergraph_WBP_SlotSquare_CustomizationPanel::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SlotSquare_CustomizationPanel_C_ExecuteUbergraph_WBP_SlotSquare_CustomizationPanel, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_SlotSquare_CustomizationPanel_C_ExecuteUbergraph_WBP_SlotSquare_CustomizationPanel::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SlotSquare_CustomizationPanel_C_ExecuteUbergraph_WBP_SlotSquare_CustomizationPanel, Temp_bool_Variable_1) == 0x000007, "Member 'WBP_SlotSquare_CustomizationPanel_C_ExecuteUbergraph_WBP_SlotSquare_CustomizationPanel::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SlotSquare_CustomizationPanel_C_ExecuteUbergraph_WBP_SlotSquare_CustomizationPanel, Temp_class_Variable) == 0x000008, "Member 'WBP_SlotSquare_CustomizationPanel_C_ExecuteUbergraph_WBP_SlotSquare_CustomizationPanel::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SlotSquare_CustomizationPanel_C_ExecuteUbergraph_WBP_SlotSquare_CustomizationPanel, Temp_class_Variable_1) == 0x000010, "Member 'WBP_SlotSquare_CustomizationPanel_C_ExecuteUbergraph_WBP_SlotSquare_CustomizationPanel::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SlotSquare_CustomizationPanel_C_ExecuteUbergraph_WBP_SlotSquare_CustomizationPanel, K2Node_ComponentBoundEvent_Button_1) == 0x000018, "Member 'WBP_SlotSquare_CustomizationPanel_C_ExecuteUbergraph_WBP_SlotSquare_CustomizationPanel::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_SlotSquare_CustomizationPanel_C_ExecuteUbergraph_WBP_SlotSquare_CustomizationPanel, K2Node_ComponentBoundEvent_Button) == 0x000020, "Member 'WBP_SlotSquare_CustomizationPanel_C_ExecuteUbergraph_WBP_SlotSquare_CustomizationPanel::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_SlotSquare_CustomizationPanel_C_ExecuteUbergraph_WBP_SlotSquare_CustomizationPanel, K2Node_ComponentBoundEvent_Selected) == 0x000028, "Member 'WBP_SlotSquare_CustomizationPanel_C_ExecuteUbergraph_WBP_SlotSquare_CustomizationPanel::K2Node_ComponentBoundEvent_Selected' has a wrong offset!");
static_assert(offsetof(WBP_SlotSquare_CustomizationPanel_C_ExecuteUbergraph_WBP_SlotSquare_CustomizationPanel, K2Node_Select_Default) == 0x000029, "Member 'WBP_SlotSquare_CustomizationPanel_C_ExecuteUbergraph_WBP_SlotSquare_CustomizationPanel::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_SlotSquare_CustomizationPanel_C_ExecuteUbergraph_WBP_SlotSquare_CustomizationPanel, K2Node_Select_Default_1) == 0x000030, "Member 'WBP_SlotSquare_CustomizationPanel_C_ExecuteUbergraph_WBP_SlotSquare_CustomizationPanel::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_SlotSquare_CustomizationPanel.WBP_SlotSquare_CustomizationPanel_C.GetItem
// 0x0130 (0x0130 - 0x0000)
struct WBP_SlotSquare_CustomizationPanel_C_GetItem final
{
public:
	struct FS_jRPG_Item_StaticData                Item;                                              // 0x0000(0x0130)(Parm, OutParm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SlotSquare_CustomizationPanel_C_GetItem) == 0x000008, "Wrong alignment on WBP_SlotSquare_CustomizationPanel_C_GetItem");
static_assert(sizeof(WBP_SlotSquare_CustomizationPanel_C_GetItem) == 0x000130, "Wrong size on WBP_SlotSquare_CustomizationPanel_C_GetItem");
static_assert(offsetof(WBP_SlotSquare_CustomizationPanel_C_GetItem, Item) == 0x000000, "Member 'WBP_SlotSquare_CustomizationPanel_C_GetItem::Item' has a wrong offset!");

// Function WBP_SlotSquare_CustomizationPanel.WBP_SlotSquare_CustomizationPanel_C.LoadItemData
// 0x0150 (0x0150 - 0x0000)
struct WBP_SlotSquare_CustomizationPanel_C_LoadItemData final
{
public:
	class UBP_ItemInstance_Base_C*                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_jRPG_Item_StaticData                CallFunc_GetItemStaticData_ItemStaticData;         // 0x0008(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UINotifiedObject_C> CallFunc_LoadNotificationData_NotifiedObject_CastInput; // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SlotSquare_CustomizationPanel_C_LoadItemData) == 0x000008, "Wrong alignment on WBP_SlotSquare_CustomizationPanel_C_LoadItemData");
static_assert(sizeof(WBP_SlotSquare_CustomizationPanel_C_LoadItemData) == 0x000150, "Wrong size on WBP_SlotSquare_CustomizationPanel_C_LoadItemData");
static_assert(offsetof(WBP_SlotSquare_CustomizationPanel_C_LoadItemData, Item) == 0x000000, "Member 'WBP_SlotSquare_CustomizationPanel_C_LoadItemData::Item' has a wrong offset!");
static_assert(offsetof(WBP_SlotSquare_CustomizationPanel_C_LoadItemData, CallFunc_GetItemStaticData_ItemStaticData) == 0x000008, "Member 'WBP_SlotSquare_CustomizationPanel_C_LoadItemData::CallFunc_GetItemStaticData_ItemStaticData' has a wrong offset!");
static_assert(offsetof(WBP_SlotSquare_CustomizationPanel_C_LoadItemData, CallFunc_LoadNotificationData_NotifiedObject_CastInput) == 0x000138, "Member 'WBP_SlotSquare_CustomizationPanel_C_LoadItemData::CallFunc_LoadNotificationData_NotifiedObject_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_SlotSquare_CustomizationPanel_C_LoadItemData, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000148, "Member 'WBP_SlotSquare_CustomizationPanel_C_LoadItemData::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

}

