#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MediaPlayerCinematic

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MediaPlayerCinematic.WBP_MediaPlayerCinematic_C
// 0x0028 (0x0308 - 0x02E0)
class UWBP_MediaPlayerCinematic_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_BlackMask;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_VideoContent;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMediaPlayer*                           Video;                                             // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMediaSource*                           Media_Source;                                      // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_MediaPlayerCinematic(int32 EntryPoint);
	void OnEndReached();
	void PauseVideo();
	void PlayMedia();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MediaPlayerCinematic_C">();
	}
	static class UWBP_MediaPlayerCinematic_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MediaPlayerCinematic_C>();
	}
};
static_assert(alignof(UWBP_MediaPlayerCinematic_C) == 0x000008, "Wrong alignment on UWBP_MediaPlayerCinematic_C");
static_assert(sizeof(UWBP_MediaPlayerCinematic_C) == 0x000308, "Wrong size on UWBP_MediaPlayerCinematic_C");
static_assert(offsetof(UWBP_MediaPlayerCinematic_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_MediaPlayerCinematic_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MediaPlayerCinematic_C, Image_BlackMask) == 0x0002E8, "Member 'UWBP_MediaPlayerCinematic_C::Image_BlackMask' has a wrong offset!");
static_assert(offsetof(UWBP_MediaPlayerCinematic_C, Image_VideoContent) == 0x0002F0, "Member 'UWBP_MediaPlayerCinematic_C::Image_VideoContent' has a wrong offset!");
static_assert(offsetof(UWBP_MediaPlayerCinematic_C, Video) == 0x0002F8, "Member 'UWBP_MediaPlayerCinematic_C::Video' has a wrong offset!");
static_assert(offsetof(UWBP_MediaPlayerCinematic_C, Media_Source) == 0x000300, "Member 'UWBP_MediaPlayerCinematic_C::Media_Source' has a wrong offset!");

}

