#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_StartGameOptionsList

#include "Basic.hpp"

#include "SandFall_structs.hpp"
#include "E_GameDifficulty_structs.hpp"


namespace SDK::Params
{

// Function WBP_Settings_StartGameOptionsList.WBP_Settings_StartGameOptionsList_C.BindOnOptionEntryFocused
// 0x0010 (0x0010 - 0x0000)
struct WBP_Settings_StartGameOptionsList_C_BindOnOptionEntryFocused final
{
public:
	TDelegate<void(class UWBP_Settings_OptionEntry_C* Widget)> Event;                                // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_StartGameOptionsList_C_BindOnOptionEntryFocused) == 0x000004, "Wrong alignment on WBP_Settings_StartGameOptionsList_C_BindOnOptionEntryFocused");
static_assert(sizeof(WBP_Settings_StartGameOptionsList_C_BindOnOptionEntryFocused) == 0x000010, "Wrong size on WBP_Settings_StartGameOptionsList_C_BindOnOptionEntryFocused");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_BindOnOptionEntryFocused, Event) == 0x000000, "Member 'WBP_Settings_StartGameOptionsList_C_BindOnOptionEntryFocused::Event' has a wrong offset!");

// Function WBP_Settings_StartGameOptionsList.WBP_Settings_StartGameOptionsList_C.BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_CustomizationInCinematics_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_CustomizationInCinematics_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_0;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUserWidget*                            Widget;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_CustomizationInCinematics_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_CustomizationInCinematics_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_CustomizationInCinematics_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_CustomizationInCinematics_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_CustomizationInCinematics_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_CustomizationInCinematics_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_CustomizationInCinematics_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature, Name_0) == 0x000008, "Member 'WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_CustomizationInCinematics_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature::Name_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_CustomizationInCinematics_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature, Widget) == 0x000018, "Member 'WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_CustomizationInCinematics_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_StartGameOptionsList.WBP_Settings_StartGameOptionsList_C.BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_Tutorials_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_Tutorials_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_0;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUserWidget*                            Widget;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_Tutorials_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_Tutorials_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_Tutorials_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_Tutorials_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_Tutorials_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_Tutorials_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_Tutorials_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature, Name_0) == 0x000008, "Member 'WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_Tutorials_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature::Name_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_Tutorials_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature, Widget) == 0x000018, "Member 'WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedBoolSelector_Tutorials_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_StartGameOptionsList.WBP_Settings_StartGameOptionsList_C.BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedIntegerSelector_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedIntegerSelector_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_0;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUserWidget*                            Widget;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedIntegerSelector_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedIntegerSelector_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedIntegerSelector_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedIntegerSelector_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedIntegerSelector_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedIntegerSelector_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedIntegerSelector_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature, Name_0) == 0x000008, "Member 'WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedIntegerSelector_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature::Name_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedIntegerSelector_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature, Widget) == 0x000018, "Member 'WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GameplayOptionsList_WBP_NamedIntegerSelector_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_StartGameOptionsList.WBP_Settings_StartGameOptionsList_C.BndEvt__WBP_Settings_GeneralOptionsList_WBP_NamedIntegerSelector_AudioLanguage_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GeneralOptionsList_WBP_NamedIntegerSelector_AudioLanguage_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_0;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUserWidget*                            Widget;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GeneralOptionsList_WBP_NamedIntegerSelector_AudioLanguage_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GeneralOptionsList_WBP_NamedIntegerSelector_AudioLanguage_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GeneralOptionsList_WBP_NamedIntegerSelector_AudioLanguage_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GeneralOptionsList_WBP_NamedIntegerSelector_AudioLanguage_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GeneralOptionsList_WBP_NamedIntegerSelector_AudioLanguage_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GeneralOptionsList_WBP_NamedIntegerSelector_AudioLanguage_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GeneralOptionsList_WBP_NamedIntegerSelector_AudioLanguage_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature, Name_0) == 0x000008, "Member 'WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GeneralOptionsList_WBP_NamedIntegerSelector_AudioLanguage_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature::Name_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GeneralOptionsList_WBP_NamedIntegerSelector_AudioLanguage_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature, Widget) == 0x000018, "Member 'WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GeneralOptionsList_WBP_NamedIntegerSelector_AudioLanguage_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_StartGameOptionsList.WBP_Settings_StartGameOptionsList_C.BndEvt__WBP_Settings_GeneralOptionsList_WBP_NamedIntegerSelector_Language_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GeneralOptionsList_WBP_NamedIntegerSelector_Language_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_0;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUserWidget*                            Widget;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GeneralOptionsList_WBP_NamedIntegerSelector_Language_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GeneralOptionsList_WBP_NamedIntegerSelector_Language_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GeneralOptionsList_WBP_NamedIntegerSelector_Language_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GeneralOptionsList_WBP_NamedIntegerSelector_Language_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GeneralOptionsList_WBP_NamedIntegerSelector_Language_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GeneralOptionsList_WBP_NamedIntegerSelector_Language_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GeneralOptionsList_WBP_NamedIntegerSelector_Language_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature, Name_0) == 0x000008, "Member 'WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GeneralOptionsList_WBP_NamedIntegerSelector_Language_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature::Name_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GeneralOptionsList_WBP_NamedIntegerSelector_Language_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature, Widget) == 0x000018, "Member 'WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_GeneralOptionsList_WBP_NamedIntegerSelector_Language_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_StartGameOptionsList.WBP_Settings_StartGameOptionsList_C.BndEvt__WBP_Settings_SoundOptionsList_WBP_SliderSelector_MasterVolume_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_SoundOptionsList_WBP_SliderSelector_MasterVolume_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_SoundOptionsList_WBP_SliderSelector_MasterVolume_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_SoundOptionsList_WBP_SliderSelector_MasterVolume_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature");
static_assert(sizeof(WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_SoundOptionsList_WBP_SliderSelector_MasterVolume_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_SoundOptionsList_WBP_SliderSelector_MasterVolume_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_SoundOptionsList_WBP_SliderSelector_MasterVolume_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_SoundOptionsList_WBP_SliderSelector_MasterVolume_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature::Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_SoundOptionsList_WBP_SliderSelector_MasterVolume_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature, Widget) == 0x000008, "Member 'WBP_Settings_StartGameOptionsList_C_BndEvt__WBP_Settings_SoundOptionsList_WBP_SliderSelector_MasterVolume_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Settings_StartGameOptionsList.WBP_Settings_StartGameOptionsList_C.ExecuteUbergraph_WBP_Settings_StartGameOptionsList
// 0x0150 (0x0150 - 0x0000)
struct WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Value_5;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Name_4;                 // 0x0008(0x0010)()
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget_5;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Value_4;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Name_3;                 // 0x0028(0x0010)()
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget_4;               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USF_LocalizationGISubsystem*            CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetAudioAssetGroupName_ReturnValue;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_GameDifficultyManager_C*            CallFunc_GetDifficultyManager_ReturnValue;         // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAssetGroupCultureData                 CallFunc_GetAssetGroupCultureData_ReturnValue;     // 0x0058(0x0030)()
	int32                                         K2Node_ComponentBoundEvent_Value_3;                // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Name_2;                 // 0x0090(0x0010)()
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget_3;               // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USF_LocalizationGISubsystem*            CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FProjectCultureData                    CallFunc_GetGameCultureData_ReturnValue;           // 0x00B8(0x0028)()
	bool                                          K2Node_ComponentBoundEvent_Value_2;                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Name_1;                 // 0x00E8(0x0010)()
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget_2;               // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Value_1;                // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Name;                   // 0x0108(0x0010)()
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget_1;               // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_Value;                  // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget;                 // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SliderSelector_C*                  K2Node_DynamicCast_AsWBP_Slider_Selector;          // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetMapRangedClampedValue_ReturnValue;     // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetMasterVolume_Value_ImplicitCast;       // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList) == 0x000008, "Wrong alignment on WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList");
static_assert(sizeof(WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList) == 0x000150, "Wrong size on WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList, EntryPoint) == 0x000000, "Member 'WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList, K2Node_ComponentBoundEvent_Value_5) == 0x000004, "Member 'WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList::K2Node_ComponentBoundEvent_Value_5' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList, K2Node_ComponentBoundEvent_Name_4) == 0x000008, "Member 'WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList::K2Node_ComponentBoundEvent_Name_4' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList, K2Node_ComponentBoundEvent_Widget_5) == 0x000018, "Member 'WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList::K2Node_ComponentBoundEvent_Widget_5' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList, K2Node_ComponentBoundEvent_Value_4) == 0x000020, "Member 'WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList::K2Node_ComponentBoundEvent_Value_4' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList, K2Node_ComponentBoundEvent_Name_3) == 0x000028, "Member 'WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList::K2Node_ComponentBoundEvent_Name_3' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList, K2Node_ComponentBoundEvent_Widget_4) == 0x000038, "Member 'WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList::K2Node_ComponentBoundEvent_Widget_4' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000040, "Member 'WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList, CallFunc_GetAudioAssetGroupName_ReturnValue) == 0x000048, "Member 'WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList::CallFunc_GetAudioAssetGroupName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList, CallFunc_GetDifficultyManager_ReturnValue) == 0x000050, "Member 'WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList::CallFunc_GetDifficultyManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList, CallFunc_GetAssetGroupCultureData_ReturnValue) == 0x000058, "Member 'WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList::CallFunc_GetAssetGroupCultureData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList, K2Node_ComponentBoundEvent_Value_3) == 0x000088, "Member 'WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList::K2Node_ComponentBoundEvent_Value_3' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList, K2Node_ComponentBoundEvent_Name_2) == 0x000090, "Member 'WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList::K2Node_ComponentBoundEvent_Name_2' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList, K2Node_ComponentBoundEvent_Widget_3) == 0x0000A0, "Member 'WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList::K2Node_ComponentBoundEvent_Widget_3' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList, CallFunc_Conv_IntToByte_ReturnValue) == 0x0000A8, "Member 'WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList, CallFunc_GetValidValue_ReturnValue) == 0x0000A9, "Member 'WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x0000B0, "Member 'WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList, CallFunc_GetGameCultureData_ReturnValue) == 0x0000B8, "Member 'WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList::CallFunc_GetGameCultureData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList, K2Node_ComponentBoundEvent_Value_2) == 0x0000E0, "Member 'WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList::K2Node_ComponentBoundEvent_Value_2' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList, K2Node_ComponentBoundEvent_Name_1) == 0x0000E8, "Member 'WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList::K2Node_ComponentBoundEvent_Name_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList, K2Node_ComponentBoundEvent_Widget_2) == 0x0000F8, "Member 'WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList::K2Node_ComponentBoundEvent_Widget_2' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList, K2Node_ComponentBoundEvent_Value_1) == 0x000100, "Member 'WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList::K2Node_ComponentBoundEvent_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList, K2Node_ComponentBoundEvent_Name) == 0x000108, "Member 'WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList::K2Node_ComponentBoundEvent_Name' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList, K2Node_ComponentBoundEvent_Widget_1) == 0x000118, "Member 'WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList::K2Node_ComponentBoundEvent_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList, K2Node_ComponentBoundEvent_Value) == 0x000120, "Member 'WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList, K2Node_ComponentBoundEvent_Widget) == 0x000128, "Member 'WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList, K2Node_DynamicCast_AsWBP_Slider_Selector) == 0x000130, "Member 'WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList::K2Node_DynamicCast_AsWBP_Slider_Selector' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList, K2Node_DynamicCast_bSuccess) == 0x000138, "Member 'WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList, CallFunc_GetMapRangedClampedValue_ReturnValue) == 0x000140, "Member 'WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList::CallFunc_GetMapRangedClampedValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList, CallFunc_SetMasterVolume_Value_ImplicitCast) == 0x000148, "Member 'WBP_Settings_StartGameOptionsList_C_ExecuteUbergraph_WBP_Settings_StartGameOptionsList::CallFunc_SetMasterVolume_Value_ImplicitCast' has a wrong offset!");

// Function WBP_Settings_StartGameOptionsList.WBP_Settings_StartGameOptionsList_C.GetAudioLanguageAvailableValues
// 0x0120 (0x0120 - 0x0000)
struct WBP_Settings_StartGameOptionsList_C_GetAudioLanguageAvailableValues final
{
public:
	TMap<int32, class FText>                      Values;                                            // 0x0000(0x0050)(Parm, OutParm)
	TMap<int32, class FText>                      local_Values;                                      // 0x0050(0x0050)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USF_LocalizationGISubsystem*            CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetAudioAssetGroupName_ReturnValue;       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAssetGroupCultureData                 CallFunc_GetAssetGroupCultureData_ReturnValue;     // 0x00C0(0x0030)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0110(0x0010)()
};
static_assert(alignof(WBP_Settings_StartGameOptionsList_C_GetAudioLanguageAvailableValues) == 0x000008, "Wrong alignment on WBP_Settings_StartGameOptionsList_C_GetAudioLanguageAvailableValues");
static_assert(sizeof(WBP_Settings_StartGameOptionsList_C_GetAudioLanguageAvailableValues) == 0x000120, "Wrong size on WBP_Settings_StartGameOptionsList_C_GetAudioLanguageAvailableValues");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_GetAudioLanguageAvailableValues, Values) == 0x000000, "Member 'WBP_Settings_StartGameOptionsList_C_GetAudioLanguageAvailableValues::Values' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_GetAudioLanguageAvailableValues, local_Values) == 0x000050, "Member 'WBP_Settings_StartGameOptionsList_C_GetAudioLanguageAvailableValues::local_Values' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_GetAudioLanguageAvailableValues, Temp_int_Array_Index_Variable) == 0x0000A0, "Member 'WBP_Settings_StartGameOptionsList_C_GetAudioLanguageAvailableValues::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_GetAudioLanguageAvailableValues, Temp_int_Loop_Counter_Variable) == 0x0000A4, "Member 'WBP_Settings_StartGameOptionsList_C_GetAudioLanguageAvailableValues::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_GetAudioLanguageAvailableValues, CallFunc_Add_IntInt_ReturnValue) == 0x0000A8, "Member 'WBP_Settings_StartGameOptionsList_C_GetAudioLanguageAvailableValues::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_GetAudioLanguageAvailableValues, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0000B0, "Member 'WBP_Settings_StartGameOptionsList_C_GetAudioLanguageAvailableValues::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_GetAudioLanguageAvailableValues, CallFunc_GetAudioAssetGroupName_ReturnValue) == 0x0000B8, "Member 'WBP_Settings_StartGameOptionsList_C_GetAudioLanguageAvailableValues::CallFunc_GetAudioAssetGroupName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_GetAudioLanguageAvailableValues, CallFunc_GetAssetGroupCultureData_ReturnValue) == 0x0000C0, "Member 'WBP_Settings_StartGameOptionsList_C_GetAudioLanguageAvailableValues::CallFunc_GetAssetGroupCultureData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_GetAudioLanguageAvailableValues, CallFunc_Array_Length_ReturnValue) == 0x0000F0, "Member 'WBP_Settings_StartGameOptionsList_C_GetAudioLanguageAvailableValues::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_GetAudioLanguageAvailableValues, CallFunc_Array_Get_Item) == 0x0000F8, "Member 'WBP_Settings_StartGameOptionsList_C_GetAudioLanguageAvailableValues::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_GetAudioLanguageAvailableValues, CallFunc_Less_IntInt_ReturnValue) == 0x000108, "Member 'WBP_Settings_StartGameOptionsList_C_GetAudioLanguageAvailableValues::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_GetAudioLanguageAvailableValues, CallFunc_Conv_StringToText_ReturnValue) == 0x000110, "Member 'WBP_Settings_StartGameOptionsList_C_GetAudioLanguageAvailableValues::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_Settings_StartGameOptionsList.WBP_Settings_StartGameOptionsList_C.GetAudioLanguageSelectedCultureIndex
// 0x0098 (0x0098 - 0x0000)
struct WBP_Settings_StartGameOptionsList_C_GetAudioLanguageSelectedCultureIndex final
{
public:
	int32                                         Selected_Culture;                                  // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, class FText>                      local_Values;                                      // 0x0008(0x0050)(Edit, BlueprintVisible)
	class USF_LocalizationGISubsystem*            CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetAudioAssetGroupName_ReturnValue;       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAssetGroupCultureData                 CallFunc_GetAssetGroupCultureData_ReturnValue;     // 0x0068(0x0030)()
};
static_assert(alignof(WBP_Settings_StartGameOptionsList_C_GetAudioLanguageSelectedCultureIndex) == 0x000008, "Wrong alignment on WBP_Settings_StartGameOptionsList_C_GetAudioLanguageSelectedCultureIndex");
static_assert(sizeof(WBP_Settings_StartGameOptionsList_C_GetAudioLanguageSelectedCultureIndex) == 0x000098, "Wrong size on WBP_Settings_StartGameOptionsList_C_GetAudioLanguageSelectedCultureIndex");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_GetAudioLanguageSelectedCultureIndex, Selected_Culture) == 0x000000, "Member 'WBP_Settings_StartGameOptionsList_C_GetAudioLanguageSelectedCultureIndex::Selected_Culture' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_GetAudioLanguageSelectedCultureIndex, local_Values) == 0x000008, "Member 'WBP_Settings_StartGameOptionsList_C_GetAudioLanguageSelectedCultureIndex::local_Values' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_GetAudioLanguageSelectedCultureIndex, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000058, "Member 'WBP_Settings_StartGameOptionsList_C_GetAudioLanguageSelectedCultureIndex::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_GetAudioLanguageSelectedCultureIndex, CallFunc_GetAudioAssetGroupName_ReturnValue) == 0x000060, "Member 'WBP_Settings_StartGameOptionsList_C_GetAudioLanguageSelectedCultureIndex::CallFunc_GetAudioAssetGroupName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_GetAudioLanguageSelectedCultureIndex, CallFunc_GetAssetGroupCultureData_ReturnValue) == 0x000068, "Member 'WBP_Settings_StartGameOptionsList_C_GetAudioLanguageSelectedCultureIndex::CallFunc_GetAssetGroupCultureData_ReturnValue' has a wrong offset!");

// Function WBP_Settings_StartGameOptionsList.WBP_Settings_StartGameOptionsList_C.GetLanguageAvailableValues
// 0x0110 (0x0110 - 0x0000)
struct WBP_Settings_StartGameOptionsList_C_GetLanguageAvailableValues final
{
public:
	TMap<int32, class FText>                      Values;                                            // 0x0000(0x0050)(Parm, OutParm)
	TMap<int32, class FText>                      local_Values;                                      // 0x0050(0x0050)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USF_LocalizationGISubsystem*            CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FProjectCultureData                    CallFunc_GetGameCultureData_ReturnValue;           // 0x00B8(0x0028)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0100(0x0010)()
};
static_assert(alignof(WBP_Settings_StartGameOptionsList_C_GetLanguageAvailableValues) == 0x000008, "Wrong alignment on WBP_Settings_StartGameOptionsList_C_GetLanguageAvailableValues");
static_assert(sizeof(WBP_Settings_StartGameOptionsList_C_GetLanguageAvailableValues) == 0x000110, "Wrong size on WBP_Settings_StartGameOptionsList_C_GetLanguageAvailableValues");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_GetLanguageAvailableValues, Values) == 0x000000, "Member 'WBP_Settings_StartGameOptionsList_C_GetLanguageAvailableValues::Values' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_GetLanguageAvailableValues, local_Values) == 0x000050, "Member 'WBP_Settings_StartGameOptionsList_C_GetLanguageAvailableValues::local_Values' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_GetLanguageAvailableValues, Temp_int_Array_Index_Variable) == 0x0000A0, "Member 'WBP_Settings_StartGameOptionsList_C_GetLanguageAvailableValues::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_GetLanguageAvailableValues, Temp_int_Loop_Counter_Variable) == 0x0000A4, "Member 'WBP_Settings_StartGameOptionsList_C_GetLanguageAvailableValues::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_GetLanguageAvailableValues, CallFunc_Add_IntInt_ReturnValue) == 0x0000A8, "Member 'WBP_Settings_StartGameOptionsList_C_GetLanguageAvailableValues::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_GetLanguageAvailableValues, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0000B0, "Member 'WBP_Settings_StartGameOptionsList_C_GetLanguageAvailableValues::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_GetLanguageAvailableValues, CallFunc_GetGameCultureData_ReturnValue) == 0x0000B8, "Member 'WBP_Settings_StartGameOptionsList_C_GetLanguageAvailableValues::CallFunc_GetGameCultureData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_GetLanguageAvailableValues, CallFunc_Array_Length_ReturnValue) == 0x0000E0, "Member 'WBP_Settings_StartGameOptionsList_C_GetLanguageAvailableValues::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_GetLanguageAvailableValues, CallFunc_Array_Get_Item) == 0x0000E8, "Member 'WBP_Settings_StartGameOptionsList_C_GetLanguageAvailableValues::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_GetLanguageAvailableValues, CallFunc_Less_IntInt_ReturnValue) == 0x0000F8, "Member 'WBP_Settings_StartGameOptionsList_C_GetLanguageAvailableValues::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_GetLanguageAvailableValues, CallFunc_Conv_StringToText_ReturnValue) == 0x000100, "Member 'WBP_Settings_StartGameOptionsList_C_GetLanguageAvailableValues::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_Settings_StartGameOptionsList.WBP_Settings_StartGameOptionsList_C.GetLanguageSelectedCultureIndex
// 0x0088 (0x0088 - 0x0000)
struct WBP_Settings_StartGameOptionsList_C_GetLanguageSelectedCultureIndex final
{
public:
	int32                                         Selected_Culture;                                  // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, class FText>                      local_Values;                                      // 0x0008(0x0050)(Edit, BlueprintVisible)
	class USF_LocalizationGISubsystem*            CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FProjectCultureData                    CallFunc_GetGameCultureData_ReturnValue;           // 0x0060(0x0028)()
};
static_assert(alignof(WBP_Settings_StartGameOptionsList_C_GetLanguageSelectedCultureIndex) == 0x000008, "Wrong alignment on WBP_Settings_StartGameOptionsList_C_GetLanguageSelectedCultureIndex");
static_assert(sizeof(WBP_Settings_StartGameOptionsList_C_GetLanguageSelectedCultureIndex) == 0x000088, "Wrong size on WBP_Settings_StartGameOptionsList_C_GetLanguageSelectedCultureIndex");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_GetLanguageSelectedCultureIndex, Selected_Culture) == 0x000000, "Member 'WBP_Settings_StartGameOptionsList_C_GetLanguageSelectedCultureIndex::Selected_Culture' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_GetLanguageSelectedCultureIndex, local_Values) == 0x000008, "Member 'WBP_Settings_StartGameOptionsList_C_GetLanguageSelectedCultureIndex::local_Values' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_GetLanguageSelectedCultureIndex, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000058, "Member 'WBP_Settings_StartGameOptionsList_C_GetLanguageSelectedCultureIndex::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_StartGameOptionsList_C_GetLanguageSelectedCultureIndex, CallFunc_GetGameCultureData_ReturnValue) == 0x000060, "Member 'WBP_Settings_StartGameOptionsList_C_GetLanguageSelectedCultureIndex::CallFunc_GetGameCultureData_ReturnValue' has a wrong offset!");

// Function WBP_Settings_StartGameOptionsList.WBP_Settings_StartGameOptionsList_C.LoadUserSettings
// 0x01A0 (0x01A0 - 0x0000)
struct WBP_Settings_StartGameOptionsList_C_LoadUserSettings final
{
public:
	E_GameDifficulty                              LocalExpeditionner;                                // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UWBP_NamedBoolSelector_C*, bool>   local_BoolWidgetToValue;                           // 0x0008(0x0050)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GameDifficultyManager_C*            CallFunc_GetDifficultyManager_ReturnValue;         // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEnableTutorials_ReturnValue;           // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEnableCustomizationDuringCinematics_ReturnValue; // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UWBP_NamedBoolSelector_C*, bool>   K2Node_MakeMap_Map;                                // 0x0080(0x0050)(ContainsInstancedReference)
	float                                         CallFunc_GetMasterVolume_ReturnValue;              // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAudioLanguageSelectedCultureIndex_Selected_Culture; // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_NamedBoolSelector_C*>       CallFunc_Map_Keys_Keys;                            // 0x00E0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_NamedBoolSelector_C*               CallFunc_Array_Get_Item;                           // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_Value;                           // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FF[0x1];                                       // 0x00FF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetLanguageSelectedCultureIndex_Selected_Culture; // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UConfigurableGameUserSettings*          CallFunc_GetConfigurableGameUserSettings_GameUserSettings; // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<class UWBP_NamedIntegerSelector_C*, int32> K2Node_MakeMap_Map_1;                            // 0x0110(0x0050)(ConstParm, ContainsInstancedReference)
