#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BaseButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "FSoundEvent_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_BaseButton.WBP_BaseButton_C.IsHold
// 0x0002 (0x0002 - 0x0000)
struct WBP_BaseButton_C_IsHold final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BaseButton_C_IsHold) == 0x000001, "Wrong alignment on WBP_BaseButton_C_IsHold");
static_assert(sizeof(WBP_BaseButton_C_IsHold) == 0x000002, "Wrong size on WBP_BaseButton_C_IsHold");
static_assert(offsetof(WBP_BaseButton_C_IsHold, ReturnValue) == 0x000000, "Member 'WBP_BaseButton_C_IsHold::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseButton_C_IsHold, CallFunc_IsValidClass_ReturnValue) == 0x000001, "Member 'WBP_BaseButton_C_IsHold::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");

// Function WBP_BaseButton.WBP_BaseButton_C.SetHoverLerp
// 0x0058 (0x0058 - 0x0000)
struct WBP_BaseButton_C_SetHoverLerp final
{
public:
	double                                        HoverLerp_0;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0038(0x0014)()
	float                                         CallFunc_MakeColor_R_ImplicitCast;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_G_ImplicitCast;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeColor_B_ImplicitCast;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BaseButton_C_SetHoverLerp) == 0x000008, "Wrong alignment on WBP_BaseButton_C_SetHoverLerp");
static_assert(sizeof(WBP_BaseButton_C_SetHoverLerp) == 0x000058, "Wrong size on WBP_BaseButton_C_SetHoverLerp");
static_assert(offsetof(WBP_BaseButton_C_SetHoverLerp, HoverLerp_0) == 0x000000, "Member 'WBP_BaseButton_C_SetHoverLerp::HoverLerp_0' has a wrong offset!");
static_assert(offsetof(WBP_BaseButton_C_SetHoverLerp, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'WBP_BaseButton_C_SetHoverLerp::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseButton_C_SetHoverLerp, CallFunc_Lerp_ReturnValue_1) == 0x000010, "Member 'WBP_BaseButton_C_SetHoverLerp::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BaseButton_C_SetHoverLerp, CallFunc_MakeVector2D_ReturnValue) == 0x000018, "Member 'WBP_BaseButton_C_SetHoverLerp::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseButton_C_SetHoverLerp, CallFunc_MakeColor_ReturnValue) == 0x000028, "Member 'WBP_BaseButton_C_SetHoverLerp::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseButton_C_SetHoverLerp, K2Node_MakeStruct_SlateColor) == 0x000038, "Member 'WBP_BaseButton_C_SetHoverLerp::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_BaseButton_C_SetHoverLerp, CallFunc_MakeColor_R_ImplicitCast) == 0x00004C, "Member 'WBP_BaseButton_C_SetHoverLerp::CallFunc_MakeColor_R_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_BaseButton_C_SetHoverLerp, CallFunc_MakeColor_G_ImplicitCast) == 0x000050, "Member 'WBP_BaseButton_C_SetHoverLerp::CallFunc_MakeColor_G_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_BaseButton_C_SetHoverLerp, CallFunc_MakeColor_B_ImplicitCast) == 0x000054, "Member 'WBP_BaseButton_C_SetHoverLerp::CallFunc_MakeColor_B_ImplicitCast' has a wrong offset!");

// Function WBP_BaseButton.WBP_BaseButton_C.SetHoverStainMaterialInstance
// 0x0020 (0x0020 - 0x0000)
struct WBP_BaseButton_C_SetHoverStainMaterialInstance final
{
public:
	class UTexture2D*                             InHoverStainTexture;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Mid;                                               // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BaseButton_C_SetHoverStainMaterialInstance) == 0x000008, "Wrong alignment on WBP_BaseButton_C_SetHoverStainMaterialInstance");
static_assert(sizeof(WBP_BaseButton_C_SetHoverStainMaterialInstance) == 0x000020, "Wrong size on WBP_BaseButton_C_SetHoverStainMaterialInstance");
static_assert(offsetof(WBP_BaseButton_C_SetHoverStainMaterialInstance, InHoverStainTexture) == 0x000000, "Member 'WBP_BaseButton_C_SetHoverStainMaterialInstance::InHoverStainTexture' has a wrong offset!");
static_assert(offsetof(WBP_BaseButton_C_SetHoverStainMaterialInstance, Mid) == 0x000008, "Member 'WBP_BaseButton_C_SetHoverStainMaterialInstance::Mid' has a wrong offset!");
static_assert(offsetof(WBP_BaseButton_C_SetHoverStainMaterialInstance, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000010, "Member 'WBP_BaseButton_C_SetHoverStainMaterialInstance::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseButton_C_SetHoverStainMaterialInstance, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_BaseButton_C_SetHoverStainMaterialInstance::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_BaseButton.WBP_BaseButton_C.SetHidePressedAnim
// 0x0001 (0x0001 - 0x0000)
struct WBP_BaseButton_C_SetHidePressedAnim final
{
public:
	bool                                          HidePressedAnim_0;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BaseButton_C_SetHidePressedAnim) == 0x000001, "Wrong alignment on WBP_BaseButton_C_SetHidePressedAnim");
static_assert(sizeof(WBP_BaseButton_C_SetHidePressedAnim) == 0x000001, "Wrong size on WBP_BaseButton_C_SetHidePressedAnim");
static_assert(offsetof(WBP_BaseButton_C_SetHidePressedAnim, HidePressedAnim_0) == 0x000000, "Member 'WBP_BaseButton_C_SetHidePressedAnim::HidePressedAnim_0' has a wrong offset!");

// Function WBP_BaseButton.WBP_BaseButton_C.SetHoverStainScalePercent
// 0x0010 (0x0010 - 0x0000)
struct WBP_BaseButton_C_SetHoverStainScalePercent final
{
public:
	struct FVector2D                              HoverStainScalePercent_0;                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BaseButton_C_SetHoverStainScalePercent) == 0x000008, "Wrong alignment on WBP_BaseButton_C_SetHoverStainScalePercent");
static_assert(sizeof(WBP_BaseButton_C_SetHoverStainScalePercent) == 0x000010, "Wrong size on WBP_BaseButton_C_SetHoverStainScalePercent");
static_assert(offsetof(WBP_BaseButton_C_SetHoverStainScalePercent, HoverStainScalePercent_0) == 0x000000, "Member 'WBP_BaseButton_C_SetHoverStainScalePercent::HoverStainScalePercent_0' has a wrong offset!");

// Function WBP_BaseButton.WBP_BaseButton_C.SetHoverStainTransform
// 0x0038 (0x0038 - 0x0000)
struct WBP_BaseButton_C_SetHoverStainTransform final
{
public:
	struct FWidgetTransform                       HoverStainTransform_0;                             // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_BaseButton_C_SetHoverStainTransform) == 0x000008, "Wrong alignment on WBP_BaseButton_C_SetHoverStainTransform");
static_assert(sizeof(WBP_BaseButton_C_SetHoverStainTransform) == 0x000038, "Wrong size on WBP_BaseButton_C_SetHoverStainTransform");
static_assert(offsetof(WBP_BaseButton_C_SetHoverStainTransform, HoverStainTransform_0) == 0x000000, "Member 'WBP_BaseButton_C_SetHoverStainTransform::HoverStainTransform_0' has a wrong offset!");

// Function WBP_BaseButton.WBP_BaseButton_C.Set Background Material Instance
// 0x0028 (0x0028 - 0x0000)
struct WBP_BaseButton_C_Set_Background_Material_Instance final
{
public:
	class UMaterialInstance*                      BackgroundMaterialInstance_0;                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Mid;                                               // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BaseButton_C_Set_Background_Material_Instance) == 0x000008, "Wrong alignment on WBP_BaseButton_C_Set_Background_Material_Instance");
static_assert(sizeof(WBP_BaseButton_C_Set_Background_Material_Instance) == 0x000028, "Wrong size on WBP_BaseButton_C_Set_Background_Material_Instance");
static_assert(offsetof(WBP_BaseButton_C_Set_Background_Material_Instance, BackgroundMaterialInstance_0) == 0x000000, "Member 'WBP_BaseButton_C_Set_Background_Material_Instance::BackgroundMaterialInstance_0' has a wrong offset!");
static_assert(offsetof(WBP_BaseButton_C_Set_Background_Material_Instance, Mid) == 0x000008, "Member 'WBP_BaseButton_C_Set_Background_Material_Instance::Mid' has a wrong offset!");
static_assert(offsetof(WBP_BaseButton_C_Set_Background_Material_Instance, Temp_bool_Variable) == 0x000010, "Member 'WBP_BaseButton_C_Set_Background_Material_Instance::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BaseButton_C_Set_Background_Material_Instance, Temp_byte_Variable) == 0x000011, "Member 'WBP_BaseButton_C_Set_Background_Material_Instance::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BaseButton_C_Set_Background_Material_Instance, Temp_byte_Variable_1) == 0x000012, "Member 'WBP_BaseButton_C_Set_Background_Material_Instance::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_BaseButton_C_Set_Background_Material_Instance, CallFunc_IsValid_ReturnValue) == 0x000013, "Member 'WBP_BaseButton_C_Set_Background_Material_Instance::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseButton_C_Set_Background_Material_Instance, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000018, "Member 'WBP_BaseButton_C_Set_Background_Material_Instance::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BaseButton_C_Set_Background_Material_Instance, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'WBP_BaseButton_C_Set_Background_Material_Instance::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BaseButton_C_Set_Background_Material_Instance, K2Node_Select_Default) == 0x000021, "Member 'WBP_BaseButton_C_Set_Background_Material_Instance::K2Node_Select_Default' has a wrong offset!");

// Function WBP_BaseButton.WBP_BaseButton_C.InstantReset
// 0x0008 (0x0008 - 0x0000)
struct WBP_BaseButton_C_InstantReset final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BaseButton_C_InstantReset) == 0x000008, "Wrong alignment on WBP_BaseButton_C_InstantReset");
static_assert(sizeof(WBP_BaseButton_C_InstantReset) == 0x000008, "Wrong size on WBP_BaseButton_C_InstantReset");
static_assert(offsetof(WBP_BaseButton_C_InstantReset, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000000, "Member 'WBP_BaseButton_C_InstantReset::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_BaseButton.WBP_BaseButton_C.GetHoverStainAnim
// 0x0008 (0x0008 - 0x0000)
struct WBP_BaseButton_C_GetHoverStainAnim final
{
public:
	class UWidgetAnimation*                       OutHoverStain;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BaseButton_C_GetHoverStainAnim) == 0x000008, "Wrong alignment on WBP_BaseButton_C_GetHoverStainAnim");
static_assert(sizeof(WBP_BaseButton_C_GetHoverStainAnim) == 0x000008, "Wrong size on WBP_BaseButton_C_GetHoverStainAnim");
static_assert(offsetof(WBP_BaseButton_C_GetHoverStainAnim, OutHoverStain) == 0x000000, "Member 'WBP_BaseButton_C_GetHoverStainAnim::OutHoverStain' has a wrong offset!");

// Function WBP_BaseButton.WBP_BaseButton_C.OnLoaded_B6C9877A4231213B085278973469AC46
// 0x0008 (0x0008 - 0x0000)
struct WBP_BaseButton_C_OnLoaded_B6C9877A4231213B085278973469AC46 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BaseButton_C_OnLoaded_B6C9877A4231213B085278973469AC46) == 0x000008, "Wrong alignment on WBP_BaseButton_C_OnLoaded_B6C9877A4231213B085278973469AC46");
static_assert(sizeof(WBP_BaseButton_C_OnLoaded_B6C9877A4231213B085278973469AC46) == 0x000008, "Wrong size on WBP_BaseButton_C_OnLoaded_B6C9877A4231213B085278973469AC46");
static_assert(offsetof(WBP_BaseButton_C_OnLoaded_B6C9877A4231213B085278973469AC46, Loaded) == 0x000000, "Member 'WBP_BaseButton_C_OnLoaded_B6C9877A4231213B085278973469AC46::Loaded' has a wrong offset!");

// Function WBP_BaseButton.WBP_BaseButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_BaseButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BaseButton_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_BaseButton_C_PreConstruct");
static_assert(sizeof(WBP_BaseButton_C_PreConstruct) == 0x000001, "Wrong size on WBP_BaseButton_C_PreConstruct");
static_assert(offsetof(WBP_BaseButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_BaseButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_BaseButton.WBP_BaseButton_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_BaseButton_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_BaseButton_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on WBP_BaseButton_C_OnAddedToFocusPath");
static_assert(sizeof(WBP_BaseButton_C_OnAddedToFocusPath) == 0x000008, "Wrong size on WBP_BaseButton_C_OnAddedToFocusPath");
static_assert(offsetof(WBP_BaseButton_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_BaseButton_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_BaseButton.WBP_BaseButton_C.OnActionProgress
// 0x0004 (0x0004 - 0x0000)
struct WBP_BaseButton_C_OnActionProgress final
{
public:
	float                                         HeldPercent;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BaseButton_C_OnActionProgress) == 0x000004, "Wrong alignment on WBP_BaseButton_C_OnActionProgress");
static_assert(sizeof(WBP_BaseButton_C_OnActionProgress) == 0x000004, "Wrong size on WBP_BaseButton_C_OnActionProgress");
static_assert(offsetof(WBP_BaseButton_C_OnActionProgress, HeldPercent) == 0x000000, "Member 'WBP_BaseButton_C_OnActionProgress::HeldPercent' has a wrong offset!");

// Function WBP_BaseButton.WBP_BaseButton_C.ExecuteUbergraph_WBP_BaseButton
// 0x0188 (0x0188 - 0x0000)
struct WBP_BaseButton_C_ExecuteUbergraph_WBP_BaseButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInGamepadOrKeyboardNavigationMode_ReturnValue; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CallFunc_GetHoverStainAnim_OutHoverStain;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_2;       // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           K2Node_DynamicCast_AsOverlay_Slot;                 // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_3;       // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_3;       // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0070(0x0008)(NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_Set_Background_Material_Instance_MID;     // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNameValid_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_HeldPercent;                          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Set_Background_Material_Instance_MID_1;   // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_1;    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_2;    // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue;    // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_4;       // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_4;       // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_5;       // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNameValid_ReturnValue_1;                // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C3[0x5];                                       // 0x00C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_SetHoverStainMaterialInstance_MID;        // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHold_ReturnValue;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHold_ReturnValue_1;                     // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FB[0x5];                                       // 0x00FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFSoundEvent                           CallFunc_GetDataTableRowFromName_OutRow;           // 0x0100(0x0008)(ZeroConstructor, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x011C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x012E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12F[0x1];                                      // 0x012F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0130(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0140(0x0008)(NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAudioParameterControllerInterface> CallFunc_SetFloatParameter_self_CastInput; // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CallDelegate_Progress_ImplicitCast;         // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_1; // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_2; // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BaseButton_C_ExecuteUbergraph_WBP_BaseButton) == 0x000008, "Wrong alignment on WBP_BaseButton_C_ExecuteUbergraph_WBP_BaseButton");
static_assert(sizeof(WBP_BaseButton_C_ExecuteUbergraph_WBP_BaseButton) == 0x000188, "Wrong size on WBP_BaseButton_C_ExecuteUbergraph_WBP_BaseButton");
static_assert(offsetof(WBP_BaseButton_C_ExecuteUbergraph_WBP_BaseButton, EntryPoint) == 0x000000, "Member 'WBP_BaseButton_C_ExecuteUbergraph_WBP_BaseButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_BaseButton_C_ExecuteUbergraph_WBP_BaseButton, CallFunc_IsInGamepadOrKeyboardNavigationMode_ReturnValue) == 0x000004, "Member 'WBP_BaseButton_C_ExecuteUbergraph_WBP_BaseButton::CallFunc_IsInGamepadOrKeyboardNavigationMode_ReturnValue' has a wrong offset!");
