#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PictosList

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "S_SortDropdownEntry_structs.hpp"
#include "E_jRPG_StatType_structs.hpp"
#include "FEquipmentSlot_structs.hpp"
#include "BlueprintSorting_structs.hpp"
#include "S_jRPG_Item_DynamicData_structs.hpp"


namespace SDK::Params
{

// Function WBP_PictosList.WBP_PictosList_C.BndEvt__WBP_PictosList_PictosTileView_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PictosList_C_BndEvt__WBP_PictosList_PictosTileView_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PictosList_C_BndEvt__WBP_PictosList_PictosTileView_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PictosList_C_BndEvt__WBP_PictosList_PictosTileView_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature");
static_assert(sizeof(WBP_PictosList_C_BndEvt__WBP_PictosList_PictosTileView_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature) == 0x000008, "Wrong size on WBP_PictosList_C_BndEvt__WBP_PictosList_PictosTileView_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature");
static_assert(offsetof(WBP_PictosList_C_BndEvt__WBP_PictosList_PictosTileView_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature, Widget) == 0x000000, "Member 'WBP_PictosList_C_BndEvt__WBP_PictosList_PictosTileView_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_PictosList.WBP_PictosList_C.DoCustomNavigationVerticalWrapping
// 0x0050 (0x0050 - 0x0000)
struct WBP_PictosList_C_DoCustomNavigationVerticalWrapping final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        CallFunc_GetListItems_ReturnValue;                 // 0x0018(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_2;                           // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PictosList_C_DoCustomNavigationVerticalWrapping) == 0x000008, "Wrong alignment on WBP_PictosList_C_DoCustomNavigationVerticalWrapping");
static_assert(sizeof(WBP_PictosList_C_DoCustomNavigationVerticalWrapping) == 0x000050, "Wrong size on WBP_PictosList_C_DoCustomNavigationVerticalWrapping");
static_assert(offsetof(WBP_PictosList_C_DoCustomNavigationVerticalWrapping, Navigation_0) == 0x000000, "Member 'WBP_PictosList_C_DoCustomNavigationVerticalWrapping::Navigation_0' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_DoCustomNavigationVerticalWrapping, Temp_bool_Variable) == 0x000001, "Member 'WBP_PictosList_C_DoCustomNavigationVerticalWrapping::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_DoCustomNavigationVerticalWrapping, K2Node_SwitchEnum_CmpSuccess) == 0x000002, "Member 'WBP_PictosList_C_DoCustomNavigationVerticalWrapping::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_DoCustomNavigationVerticalWrapping, Temp_bool_Variable_1) == 0x000003, "Member 'WBP_PictosList_C_DoCustomNavigationVerticalWrapping::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_DoCustomNavigationVerticalWrapping, Temp_int_Variable) == 0x000004, "Member 'WBP_PictosList_C_DoCustomNavigationVerticalWrapping::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_DoCustomNavigationVerticalWrapping, Temp_int_Variable_1) == 0x000008, "Member 'WBP_PictosList_C_DoCustomNavigationVerticalWrapping::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_DoCustomNavigationVerticalWrapping, Temp_int_Variable_2) == 0x00000C, "Member 'WBP_PictosList_C_DoCustomNavigationVerticalWrapping::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_DoCustomNavigationVerticalWrapping, Temp_int_Variable_3) == 0x000010, "Member 'WBP_PictosList_C_DoCustomNavigationVerticalWrapping::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_DoCustomNavigationVerticalWrapping, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000014, "Member 'WBP_PictosList_C_DoCustomNavigationVerticalWrapping::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_DoCustomNavigationVerticalWrapping, Temp_bool_Variable_2) == 0x000015, "Member 'WBP_PictosList_C_DoCustomNavigationVerticalWrapping::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_DoCustomNavigationVerticalWrapping, CallFunc_GetListItems_ReturnValue) == 0x000018, "Member 'WBP_PictosList_C_DoCustomNavigationVerticalWrapping::CallFunc_GetListItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_DoCustomNavigationVerticalWrapping, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WBP_PictosList_C_DoCustomNavigationVerticalWrapping::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_DoCustomNavigationVerticalWrapping, CallFunc_Percent_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_PictosList_C_DoCustomNavigationVerticalWrapping::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_DoCustomNavigationVerticalWrapping, CallFunc_Subtract_IntInt_ReturnValue) == 0x000030, "Member 'WBP_PictosList_C_DoCustomNavigationVerticalWrapping::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_DoCustomNavigationVerticalWrapping, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000034, "Member 'WBP_PictosList_C_DoCustomNavigationVerticalWrapping::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_DoCustomNavigationVerticalWrapping, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000038, "Member 'WBP_PictosList_C_DoCustomNavigationVerticalWrapping::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_DoCustomNavigationVerticalWrapping, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x00003C, "Member 'WBP_PictosList_C_DoCustomNavigationVerticalWrapping::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_DoCustomNavigationVerticalWrapping, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x00003D, "Member 'WBP_PictosList_C_DoCustomNavigationVerticalWrapping::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_DoCustomNavigationVerticalWrapping, K2Node_Select_Default) == 0x000040, "Member 'WBP_PictosList_C_DoCustomNavigationVerticalWrapping::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_DoCustomNavigationVerticalWrapping, K2Node_Select_Default_1) == 0x000044, "Member 'WBP_PictosList_C_DoCustomNavigationVerticalWrapping::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_DoCustomNavigationVerticalWrapping, K2Node_Select_Default_2) == 0x000048, "Member 'WBP_PictosList_C_DoCustomNavigationVerticalWrapping::K2Node_Select_Default_2' has a wrong offset!");

// Function WBP_PictosList.WBP_PictosList_C.ExecuteUbergraph_WBP_PictosList
// 0x0090 (0x0090 - 0x0000)
struct WBP_PictosList_C_ExecuteUbergraph_WBP_PictosList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UBP_PictoViewItem_C* PictoViewItem)> K2Node_CreateDelegate_OutputDelegate;  // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UBP_PictoViewItem_C* PictoViewItem, const struct FVector2D& AbsolutePos)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget;                 // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Panel_PictosElement_C*             K2Node_DynamicCast_AsWBP_Panel_Pictos_Element;     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_PictoViewItem_C*                    K2Node_CustomEvent_PictoViewItem_1;                // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_PictoViewItem_C*                    K2Node_CustomEvent_PictoViewItem;                  // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_AbsolutePos;                    // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        CallFunc_GetListItems_ReturnValue;                 // 0x0078(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PictosList_C_ExecuteUbergraph_WBP_PictosList) == 0x000008, "Wrong alignment on WBP_PictosList_C_ExecuteUbergraph_WBP_PictosList");
static_assert(sizeof(WBP_PictosList_C_ExecuteUbergraph_WBP_PictosList) == 0x000090, "Wrong size on WBP_PictosList_C_ExecuteUbergraph_WBP_PictosList");
static_assert(offsetof(WBP_PictosList_C_ExecuteUbergraph_WBP_PictosList, EntryPoint) == 0x000000, "Member 'WBP_PictosList_C_ExecuteUbergraph_WBP_PictosList::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_ExecuteUbergraph_WBP_PictosList, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_PictosList_C_ExecuteUbergraph_WBP_PictosList::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_ExecuteUbergraph_WBP_PictosList, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_PictosList_C_ExecuteUbergraph_WBP_PictosList::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_ExecuteUbergraph_WBP_PictosList, K2Node_ComponentBoundEvent_Widget) == 0x000028, "Member 'WBP_PictosList_C_ExecuteUbergraph_WBP_PictosList::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_ExecuteUbergraph_WBP_PictosList, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'WBP_PictosList_C_ExecuteUbergraph_WBP_PictosList::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_ExecuteUbergraph_WBP_PictosList, K2Node_DynamicCast_AsWBP_Panel_Pictos_Element) == 0x000038, "Member 'WBP_PictosList_C_ExecuteUbergraph_WBP_PictosList::K2Node_DynamicCast_AsWBP_Panel_Pictos_Element' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_ExecuteUbergraph_WBP_PictosList, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_PictosList_C_ExecuteUbergraph_WBP_PictosList::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_ExecuteUbergraph_WBP_PictosList, K2Node_CustomEvent_PictoViewItem_1) == 0x000048, "Member 'WBP_PictosList_C_ExecuteUbergraph_WBP_PictosList::K2Node_CustomEvent_PictoViewItem_1' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_ExecuteUbergraph_WBP_PictosList, K2Node_CustomEvent_PictoViewItem) == 0x000050, "Member 'WBP_PictosList_C_ExecuteUbergraph_WBP_PictosList::K2Node_CustomEvent_PictoViewItem' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_ExecuteUbergraph_WBP_PictosList, K2Node_CustomEvent_AbsolutePos) == 0x000058, "Member 'WBP_PictosList_C_ExecuteUbergraph_WBP_PictosList::K2Node_CustomEvent_AbsolutePos' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_ExecuteUbergraph_WBP_PictosList, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000068, "Member 'WBP_PictosList_C_ExecuteUbergraph_WBP_PictosList::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_ExecuteUbergraph_WBP_PictosList, CallFunc_PlayAnimationForward_ReturnValue) == 0x000070, "Member 'WBP_PictosList_C_ExecuteUbergraph_WBP_PictosList::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_ExecuteUbergraph_WBP_PictosList, CallFunc_GetListItems_ReturnValue) == 0x000078, "Member 'WBP_PictosList_C_ExecuteUbergraph_WBP_PictosList::CallFunc_GetListItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_ExecuteUbergraph_WBP_PictosList, CallFunc_Array_Find_ReturnValue) == 0x000088, "Member 'WBP_PictosList_C_ExecuteUbergraph_WBP_PictosList::CallFunc_Array_Find_ReturnValue' has a wrong offset!");

// Function WBP_PictosList.WBP_PictosList_C.LoadItemsForCharacter
// 0x01C8 (0x01C8 - 0x0000)
struct WBP_PictosList_C_LoadItemsForCharacter final
{
public:
	class UBP_CharacterData_C*                    CharacterData;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         InsertIndex;                                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_PictoViewItem_C*                    CallFunc_SpawnObject_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_PictoViewItem_C*>            Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable; // 0x0020(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_PictoViewItem_C*>            Temp_wildcard_Temp_buffer_array_Variable;          // 0x0040(0x0010)(ConstParm, ReferenceParm)
	class UAC_jRPG_InventoryManager_C*            CallFunc_GetInventoryManager_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumItems_ReturnValue;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F[0x1];                                       // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_InventoryManager_C*            CallFunc_GetInventoryManager_ReturnValue_1;        // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_jRPG_Item_DynamicData>       CallFunc_GetOwnedItemsByType_FilteredArray;        // 0x0078(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FS_jRPG_Item_DynamicData               CallFunc_Array_Get_Item;                           // 0x0088(0x0138)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanEquipItem_ReturnValue;                 // 0x01C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x01C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x01C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PictosList_C_LoadItemsForCharacter) == 0x000008, "Wrong alignment on WBP_PictosList_C_LoadItemsForCharacter");
static_assert(sizeof(WBP_PictosList_C_LoadItemsForCharacter) == 0x0001C8, "Wrong size on WBP_PictosList_C_LoadItemsForCharacter");
static_assert(offsetof(WBP_PictosList_C_LoadItemsForCharacter, CharacterData) == 0x000000, "Member 'WBP_PictosList_C_LoadItemsForCharacter::CharacterData' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_LoadItemsForCharacter, InsertIndex) == 0x000008, "Member 'WBP_PictosList_C_LoadItemsForCharacter::InsertIndex' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_LoadItemsForCharacter, Temp_bool_Variable) == 0x00000C, "Member 'WBP_PictosList_C_LoadItemsForCharacter::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_LoadItemsForCharacter, CallFunc_SpawnObject_ReturnValue) == 0x000010, "Member 'WBP_PictosList_C_LoadItemsForCharacter::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_LoadItemsForCharacter, Temp_byte_Variable) == 0x000018, "Member 'WBP_PictosList_C_LoadItemsForCharacter::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_LoadItemsForCharacter, Temp_byte_Variable_1) == 0x000019, "Member 'WBP_PictosList_C_LoadItemsForCharacter::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_LoadItemsForCharacter, Temp_bool_Variable_1) == 0x00001A, "Member 'WBP_PictosList_C_LoadItemsForCharacter::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_LoadItemsForCharacter, Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable) == 0x000020, "Member 'WBP_PictosList_C_LoadItemsForCharacter::Temp_wildcard_We_need_a_second_array_to_store_the_result_and_be_able_to_wipe_the_first__buffer__array_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_LoadItemsForCharacter, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'WBP_PictosList_C_LoadItemsForCharacter::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_LoadItemsForCharacter, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'WBP_PictosList_C_LoadItemsForCharacter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_LoadItemsForCharacter, Temp_int_Array_Index_Variable) == 0x000038, "Member 'WBP_PictosList_C_LoadItemsForCharacter::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_LoadItemsForCharacter, Temp_wildcard_Temp_buffer_array_Variable) == 0x000040, "Member 'WBP_PictosList_C_LoadItemsForCharacter::Temp_wildcard_Temp_buffer_array_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_LoadItemsForCharacter, CallFunc_GetInventoryManager_ReturnValue) == 0x000050, "Member 'WBP_PictosList_C_LoadItemsForCharacter::CallFunc_GetInventoryManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_LoadItemsForCharacter, CallFunc_Array_Add_ReturnValue) == 0x000058, "Member 'WBP_PictosList_C_LoadItemsForCharacter::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_LoadItemsForCharacter, CallFunc_GetCustomGI_ReturnValue) == 0x000060, "Member 'WBP_PictosList_C_LoadItemsForCharacter::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_LoadItemsForCharacter, CallFunc_GetNumItems_ReturnValue) == 0x000068, "Member 'WBP_PictosList_C_LoadItemsForCharacter::CallFunc_GetNumItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_LoadItemsForCharacter, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00006C, "Member 'WBP_PictosList_C_LoadItemsForCharacter::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_LoadItemsForCharacter, Temp_byte_Variable_2) == 0x00006D, "Member 'WBP_PictosList_C_LoadItemsForCharacter::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_LoadItemsForCharacter, K2Node_Select_Default) == 0x00006E, "Member 'WBP_PictosList_C_LoadItemsForCharacter::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_LoadItemsForCharacter, CallFunc_GetInventoryManager_ReturnValue_1) == 0x000070, "Member 'WBP_PictosList_C_LoadItemsForCharacter::CallFunc_GetInventoryManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_LoadItemsForCharacter, CallFunc_GetOwnedItemsByType_FilteredArray) == 0x000078, "Member 'WBP_PictosList_C_LoadItemsForCharacter::CallFunc_GetOwnedItemsByType_FilteredArray' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_LoadItemsForCharacter, CallFunc_Array_Get_Item) == 0x000088, "Member 'WBP_PictosList_C_LoadItemsForCharacter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_LoadItemsForCharacter, CallFunc_Array_Length_ReturnValue) == 0x0001C0, "Member 'WBP_PictosList_C_LoadItemsForCharacter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_LoadItemsForCharacter, CallFunc_Less_IntInt_ReturnValue) == 0x0001C4, "Member 'WBP_PictosList_C_LoadItemsForCharacter::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_LoadItemsForCharacter, CallFunc_CanEquipItem_ReturnValue) == 0x0001C5, "Member 'WBP_PictosList_C_LoadItemsForCharacter::CallFunc_CanEquipItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_LoadItemsForCharacter, Temp_byte_Variable_3) == 0x0001C6, "Member 'WBP_PictosList_C_LoadItemsForCharacter::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_LoadItemsForCharacter, K2Node_Select_Default_1) == 0x0001C7, "Member 'WBP_PictosList_C_LoadItemsForCharacter::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_PictosList.WBP_PictosList_C.OnElementClicked
// 0x0008 (0x0008 - 0x0000)
struct WBP_PictosList_C_OnElementClicked final
{
public:
	class UBP_PictoViewItem_C*                    PictoViewItem;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PictosList_C_OnElementClicked) == 0x000008, "Wrong alignment on WBP_PictosList_C_OnElementClicked");
static_assert(sizeof(WBP_PictosList_C_OnElementClicked) == 0x000008, "Wrong size on WBP_PictosList_C_OnElementClicked");
static_assert(offsetof(WBP_PictosList_C_OnElementClicked, PictoViewItem) == 0x000000, "Member 'WBP_PictosList_C_OnElementClicked::PictoViewItem' has a wrong offset!");

// Function WBP_PictosList.WBP_PictosList_C.OnElementNavigated
// 0x0018 (0x0018 - 0x0000)
struct WBP_PictosList_C_OnElementNavigated final
{
public:
	class UBP_PictoViewItem_C*                    PictoViewItem;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              AbsolutePos;                                       // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PictosList_C_OnElementNavigated) == 0x000008, "Wrong alignment on WBP_PictosList_C_OnElementNavigated");
static_assert(sizeof(WBP_PictosList_C_OnElementNavigated) == 0x000018, "Wrong size on WBP_PictosList_C_OnElementNavigated");
static_assert(offsetof(WBP_PictosList_C_OnElementNavigated, PictoViewItem) == 0x000000, "Member 'WBP_PictosList_C_OnElementNavigated::PictoViewItem' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_OnElementNavigated, AbsolutePos) == 0x000008, "Member 'WBP_PictosList_C_OnElementNavigated::AbsolutePos' has a wrong offset!");

// Function WBP_PictosList.WBP_PictosList_C.PictoSortLambda
// 0x0800 (0x0800 - 0x0000)
struct WBP_PictosList_C_PictoSortLambda final
{
public:
	class UBP_PictoViewItem_C*                    PictoItemLhs;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_PictoViewItem_C*                    PictoItemRhs;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOrderingResult*                        OrderingResult;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, E_jRPG_StatType>            NameToStatMap;                                     // 0x0018(0x0050)(Edit, BlueprintVisible)
	struct FFEquipmentSlot                        NewLocalVar;                                       // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortOrdering                                 Temp_byte_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_jRPG_Item_DynamicData               CallFunc_GetItemDynamicData_ItemDynamicData;       // 0x0078(0x0138)(ContainsInstancedReference, HasGetValueTypeHash)
	class UBP_ItemInstance_Gear_Pictos_C*         CallFunc_GetGearPictosInstance_AsBP_Item_Instance_Gear_Pictos; // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<E_jRPG_StatType, double>                 CallFunc_GetCurrentStats_CurrentStats;             // 0x01B8(0x0050)()
	bool                                          CallFunc_IsEquippedByCurrentCharacter_IsEquipped;  // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ItemInstance_Gear_Pictos_C*         CallFunc_GetGearPictosInstance_AsBP_Item_Instance_Gear_Pictos_1; // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentLevel_ReturnValue;              // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_jRPG_Item_DynamicData               CallFunc_GetItemDynamicData_ItemDynamicData_1;     // 0x0220(0x0138)(ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_jRPG_Item_DynamicData               CallFunc_GetItemDynamicData_ItemDynamicData_2;     // 0x0358(0x0138)(ContainsInstancedReference, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0490(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UBP_ItemInstance_Gear_Pictos_C*         CallFunc_GetGearPictosInstance_AsBP_Item_Instance_Gear_Pictos_2; // 0x04A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEquippedByCurrentCharacter_IsEquipped_1; // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<E_jRPG_StatType, double>                 CallFunc_GetCurrentStats_CurrentStats_1;           // 0x04B0(0x0050)()
	bool                                          CallFunc_BooleanXOR_ReturnValue;                   // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_501[0x7];                                      // 0x0501(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ItemInstance_Gear_Pictos_C*         CallFunc_GetGearPictosInstance_AsBP_Item_Instance_Gear_Pictos_3; // 0x0508(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_511[0x3];                                      // 0x0511(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentLevel_ReturnValue_1;            // 0x0514(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_519[0x3];                                      // 0x0519(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x051C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SignOfInteger_ReturnValue;                // 0x0520(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_524[0x4];                                      // 0x0524(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_jRPG_Item_DynamicData               CallFunc_GetItemDynamicData_ItemDynamicData_3;     // 0x0528(0x0138)(ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0660(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortOrdering                                 Temp_byte_Variable_1;                              // 0x0664(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_665[0x3];                                      // 0x0665(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0668(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESortOrdering                                 Temp_byte_Variable_2;                              // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_679[0x3];                                      // 0x0679(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CompareStrings_ReturnValue;               // 0x067C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SignOfInteger_ReturnValue_1;              // 0x0680(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0684(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0688(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortOrdering                                 Temp_byte_Variable_3;                              // 0x068C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortOrdering                                 Temp_byte_Variable_4;                              // 0x068D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortOrdering                                 Temp_byte_Variable_5;                              // 0x068E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68F[0x1];                                      // 0x068F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0690(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortOrdering                                 Temp_byte_Variable_6;                              // 0x0694(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortOrdering                                 Temp_byte_Variable_7;                              // 0x0695(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortOrdering                                 Temp_byte_Variable_8;                              // 0x0696(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_697[0x1];                                      // 0x0697(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, E_jRPG_StatType>            K2Node_MakeVariable_MakeVariableOutput;            // 0x0698(0x0050)()
	ESortOrdering                                 K2Node_Select_Default;                             // 0x06E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E9[0x3];                                      // 0x06E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x06EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x06F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortOrdering                                 K2Node_Select_Default_1;                           // 0x06F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortOrdering                                 Temp_wildcard_Variable;                            // 0x06F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortOrdering                                 Temp_wildcard_Variable_1;                          // 0x06F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F4[0x4];                                      // 0x06F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x06F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue_1;                // 0x0700(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsObjectFavorite_IsFavorite;              // 0x0708(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsObjectFavorite_IsFavorite_1;            // 0x0709(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanXOR_ReturnValue_1;                 // 0x070A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_70B[0x5];                                      // 0x070B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0710(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0718(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0719(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71A[0x6];                                      // 0x071A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_SortDropdownEntry                   CallFunc_GetActiveDropdownEntry_ActiveDropdownEntry; // 0x0720(0x0018)(HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0738(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0740(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0741(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_742[0x6];                                      // 0x0742(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_SortDropdownEntry                   CallFunc_GetActiveDropdownEntry_ActiveDropdownEntry_1; // 0x0748(0x0018)(HasGetValueTypeHash)
	struct FS_SortDropdownEntry                   CallFunc_GetActiveDropdownEntry_ActiveDropdownEntry_2; // 0x0760(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0778(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_2;        // 0x0779(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x077A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x077B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x077C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77D[0x3];                                      // 0x077D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_SortDropdownEntry                   CallFunc_GetActiveDropdownEntry_ActiveDropdownEntry_3; // 0x0780(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_3;        // 0x0798(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_jRPG_StatType                               CallFunc_Map_Find_Value;                           // 0x0799(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x079A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79B[0x5];                                      // 0x079B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Find_Value_1;                         // 0x07A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x07A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A9[0x7];                                      // 0x07A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Find_Value_2;                         // 0x07B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x07B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B9[0x7];                                      // 0x07B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default_2;                           // 0x07C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_3;                           // 0x07C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x07D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D1[0x7];                                      // 0x07D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x07D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x07E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E1[0x7];                                      // 0x07E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SignOfFloat_ReturnValue;                  // 0x07E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x07F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F1[0x3];                                      // 0x07F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x07F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x07F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortOrdering                                 K2Node_Select_Default_4;                           // 0x07FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PictosList_C_PictoSortLambda) == 0x000008, "Wrong alignment on WBP_PictosList_C_PictoSortLambda");
static_assert(sizeof(WBP_PictosList_C_PictoSortLambda) == 0x000800, "Wrong size on WBP_PictosList_C_PictoSortLambda");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, PictoItemLhs) == 0x000000, "Member 'WBP_PictosList_C_PictoSortLambda::PictoItemLhs' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, PictoItemRhs) == 0x000008, "Member 'WBP_PictosList_C_PictoSortLambda::PictoItemRhs' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, OrderingResult) == 0x000010, "Member 'WBP_PictosList_C_PictoSortLambda::OrderingResult' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, NameToStatMap) == 0x000018, "Member 'WBP_PictosList_C_PictoSortLambda::NameToStatMap' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, NewLocalVar) == 0x000068, "Member 'WBP_PictosList_C_PictoSortLambda::NewLocalVar' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, Temp_byte_Variable) == 0x000070, "Member 'WBP_PictosList_C_PictoSortLambda::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, CallFunc_GetItemDynamicData_ItemDynamicData) == 0x000078, "Member 'WBP_PictosList_C_PictoSortLambda::CallFunc_GetItemDynamicData_ItemDynamicData' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, CallFunc_GetGearPictosInstance_AsBP_Item_Instance_Gear_Pictos) == 0x0001B0, "Member 'WBP_PictosList_C_PictoSortLambda::CallFunc_GetGearPictosInstance_AsBP_Item_Instance_Gear_Pictos' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, CallFunc_GetCurrentStats_CurrentStats) == 0x0001B8, "Member 'WBP_PictosList_C_PictoSortLambda::CallFunc_GetCurrentStats_CurrentStats' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, CallFunc_IsEquippedByCurrentCharacter_IsEquipped) == 0x000208, "Member 'WBP_PictosList_C_PictoSortLambda::CallFunc_IsEquippedByCurrentCharacter_IsEquipped' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, CallFunc_GetGearPictosInstance_AsBP_Item_Instance_Gear_Pictos_1) == 0x000210, "Member 'WBP_PictosList_C_PictoSortLambda::CallFunc_GetGearPictosInstance_AsBP_Item_Instance_Gear_Pictos_1' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, CallFunc_GetCurrentLevel_ReturnValue) == 0x000218, "Member 'WBP_PictosList_C_PictoSortLambda::CallFunc_GetCurrentLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, CallFunc_GetItemDynamicData_ItemDynamicData_1) == 0x000220, "Member 'WBP_PictosList_C_PictoSortLambda::CallFunc_GetItemDynamicData_ItemDynamicData_1' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, CallFunc_GetItemDynamicData_ItemDynamicData_2) == 0x000358, "Member 'WBP_PictosList_C_PictoSortLambda::CallFunc_GetItemDynamicData_ItemDynamicData_2' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, CallFunc_Conv_TextToString_ReturnValue) == 0x000490, "Member 'WBP_PictosList_C_PictoSortLambda::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, CallFunc_GetGearPictosInstance_AsBP_Item_Instance_Gear_Pictos_2) == 0x0004A0, "Member 'WBP_PictosList_C_PictoSortLambda::CallFunc_GetGearPictosInstance_AsBP_Item_Instance_Gear_Pictos_2' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, CallFunc_IsEquippedByCurrentCharacter_IsEquipped_1) == 0x0004A8, "Member 'WBP_PictosList_C_PictoSortLambda::CallFunc_IsEquippedByCurrentCharacter_IsEquipped_1' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, CallFunc_GetCurrentStats_CurrentStats_1) == 0x0004B0, "Member 'WBP_PictosList_C_PictoSortLambda::CallFunc_GetCurrentStats_CurrentStats_1' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, CallFunc_BooleanXOR_ReturnValue) == 0x000500, "Member 'WBP_PictosList_C_PictoSortLambda::CallFunc_BooleanXOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, CallFunc_GetGearPictosInstance_AsBP_Item_Instance_Gear_Pictos_3) == 0x000508, "Member 'WBP_PictosList_C_PictoSortLambda::CallFunc_GetGearPictosInstance_AsBP_Item_Instance_Gear_Pictos_3' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, CallFunc_Not_PreBool_ReturnValue) == 0x000510, "Member 'WBP_PictosList_C_PictoSortLambda::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, CallFunc_GetCurrentLevel_ReturnValue_1) == 0x000514, "Member 'WBP_PictosList_C_PictoSortLambda::CallFunc_GetCurrentLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000518, "Member 'WBP_PictosList_C_PictoSortLambda::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, CallFunc_Subtract_IntInt_ReturnValue) == 0x00051C, "Member 'WBP_PictosList_C_PictoSortLambda::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, CallFunc_SignOfInteger_ReturnValue) == 0x000520, "Member 'WBP_PictosList_C_PictoSortLambda::CallFunc_SignOfInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, CallFunc_GetItemDynamicData_ItemDynamicData_3) == 0x000528, "Member 'WBP_PictosList_C_PictoSortLambda::CallFunc_GetItemDynamicData_ItemDynamicData_3' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, CallFunc_Add_IntInt_ReturnValue) == 0x000660, "Member 'WBP_PictosList_C_PictoSortLambda::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, Temp_byte_Variable_1) == 0x000664, "Member 'WBP_PictosList_C_PictoSortLambda::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000668, "Member 'WBP_PictosList_C_PictoSortLambda::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, Temp_byte_Variable_2) == 0x000678, "Member 'WBP_PictosList_C_PictoSortLambda::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, CallFunc_CompareStrings_ReturnValue) == 0x00067C, "Member 'WBP_PictosList_C_PictoSortLambda::CallFunc_CompareStrings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, CallFunc_SignOfInteger_ReturnValue_1) == 0x000680, "Member 'WBP_PictosList_C_PictoSortLambda::CallFunc_SignOfInteger_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, Temp_int_Variable) == 0x000684, "Member 'WBP_PictosList_C_PictoSortLambda::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, CallFunc_Add_IntInt_ReturnValue_1) == 0x000688, "Member 'WBP_PictosList_C_PictoSortLambda::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, Temp_byte_Variable_3) == 0x00068C, "Member 'WBP_PictosList_C_PictoSortLambda::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, Temp_byte_Variable_4) == 0x00068D, "Member 'WBP_PictosList_C_PictoSortLambda::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, Temp_byte_Variable_5) == 0x00068E, "Member 'WBP_PictosList_C_PictoSortLambda::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, Temp_int_Variable_1) == 0x000690, "Member 'WBP_PictosList_C_PictoSortLambda::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, Temp_byte_Variable_6) == 0x000694, "Member 'WBP_PictosList_C_PictoSortLambda::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_PictosList_C_PictoSortLambda, Temp_byte_Variable_7) == 0x000695, "Member 'WBP_PictosList_C_PictoSortLambda::Temp_byte_Variable_7' has a wrong offset!");
