#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BattleWheel

#include "Basic.hpp"

#include "EAttackType_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "S_WeaponDefinition_structs.hpp"


namespace SDK::Params
{

// Function WBP_BattleWheel.WBP_BattleWheel_C.ExecuteUbergraph_WBP_BattleWheel
// 0x0428 (0x0428 - 0x0000)
struct WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CharacterData_C*                    CallFunc_GetCharacterData_CharacterData;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USF_LocalizationGISubsystem*            CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEquippedWeaponItemInstance_Valid;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ItemInstance_Gear_Weapon_C*         CallFunc_GetEquippedWeaponItemInstance_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_WeaponDefinition                    CallFunc_GetWeaponDefinition_WeaponDefinition;     // 0x0038(0x00F0)(HasGetValueTypeHash)
	TDelegate<void(double PreviousProgress, int32 PreviousCharges)> K2Node_CreateDelegate_OutputDelegate; // 0x0128(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_BattleWheel_Button_C*>      Temp_wildcard_Variable;                            // 0x0158(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_BattleWheel_Button_C*              CallFunc_Array_Get_Item;                           // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWheelButtonAvailable_ReturnValue;       // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWheelButtonVisible_ReturnValue;         // 0x0175(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0176(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_177[0x1];                                      // 0x0177(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_BattleWheel_Button_C*>      Temp_wildcard_Variable_1;                          // 0x0198(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_BattleWheel_Button_C*              CallFunc_Array_Get_Item_1;                         // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x01B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D2[0x6];                                      // 0x01D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_BattleWheel_Button_C*>      CallFunc_GetAllButtons_ReturnValue;                // 0x01E0(0x0010)(ReferenceParm, ContainsInstancedReference)
	TMap<class UWBP_BattleWheel_Button_C*, int32> K2Node_MakeMap_Map;                                // 0x01F0(0x0050)(ConstParm, ContainsInstancedReference)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue_1;           // 0x0240(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewAP;                          // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PreviousAP;                     // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_CharacterBattleStats_C*        K2Node_CustomEvent_CharacterStats;                 // 0x0258(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_BattleWheel_Button_C*              K2Node_CustomEvent_ButtonWidget;                   // 0x0268(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_BattleWheel_Button_C*>      Temp_wildcard_Variable_2;                          // 0x0270(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Map_Find_Value;                           // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_285[0x3];                                      // 0x0285(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28D[0x3];                                      // 0x028D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_BattleWheel_Button_C*>      CallFunc_GetAllButtons_ReturnValue_1;              // 0x0290(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UWBP_BattleWheel_Button_C*>      CallFunc_GetAllButtons_ReturnValue_2;              // 0x02A0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_Debug_UMG_AnimationDebugger_C*     CallFunc_DEBUG_GetUMGDebugger_ReturnValue;         // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidgetAnimation*>               K2Node_MakeArray_Array;                            // 0x02C0(0x0010)(ConstParm, ReferenceParm)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E2[0x6];                                      // 0x02E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FA[0x2];                                      // 0x02FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_BattleWheel_Button_C*              CallFunc_Array_Get_Item_2;                         // 0x0300(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidgetAnimation*>               K2Node_MakeArray_Array_1;                          // 0x0308(0x0010)(ReferenceParm)
	TMap<class UWBP_BattleWheel_Button_C*, double> K2Node_MakeMap_Map_1;                             // 0x0318(0x0050)(ConstParm, ContainsInstancedReference)
	double                                        CallFunc_Map_Find_Value_1;                         // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidgetAnimation*>               K2Node_MakeArray_Array_2;                          // 0x0378(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue_2;           // 0x0390(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_BattleWheel_Button_C* ButtonWidget)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0398(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetReferenceCounterState_ReturnValue;     // 0x03A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x03AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_1;                           // 0x03AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 NewAP, int32 PreviousAP, class UAC_jRPG_CharacterBattleStats_C* CharacterStats)> K2Node_CreateDelegate_OutputDelegate_3; // 0x03AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x03BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC[0x4];                                      // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue_3;           // 0x03D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_PreviousProgress;               // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PreviousCharges;                // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAvailableCharges_ReturnValue;          // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue_4;           // 0x03E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x03F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default_2;                           // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0408(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetAnimationCurrentTime_InTime_ImplicitCast; // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ActivateWidgetWithDelay_Duration_ImplicitCast; // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel) == 0x000008, "Wrong alignment on WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel");
static_assert(sizeof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel) == 0x000428, "Wrong size on WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, EntryPoint) == 0x000000, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_GetBattleManager_ReturnValue) == 0x000008, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, Temp_byte_Variable) == 0x000010, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, Temp_bool_Variable) == 0x000011, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_GetCharacterData_CharacterData) == 0x000018, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_GetCharacterData_CharacterData' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000020, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_GetEquippedWeaponItemInstance_Valid) == 0x000028, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_GetEquippedWeaponItemInstance_Valid' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_GetEquippedWeaponItemInstance_ReturnValue) == 0x000030, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_GetEquippedWeaponItemInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_GetWeaponDefinition_WeaponDefinition) == 0x000038, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_GetWeaponDefinition_WeaponDefinition' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, K2Node_CreateDelegate_OutputDelegate) == 0x000128, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, Temp_bool_Variable_1) == 0x000138, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, Temp_real_Variable) == 0x000140, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, Temp_real_Variable_1) == 0x000148, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, Temp_int_Array_Index_Variable) == 0x000150, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, Temp_wildcard_Variable) == 0x000158, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_Array_Get_Item) == 0x000168, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_Array_Length_ReturnValue) == 0x000170, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_IsWheelButtonAvailable_ReturnValue) == 0x000174, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_IsWheelButtonAvailable_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_IsWheelButtonVisible_ReturnValue) == 0x000175, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_IsWheelButtonVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_Not_PreBool_ReturnValue) == 0x000176, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, Temp_int_Loop_Counter_Variable) == 0x000178, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, Temp_int_Loop_Counter_Variable_1) == 0x00017C, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_Add_IntInt_ReturnValue) == 0x000180, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_Less_IntInt_ReturnValue) == 0x000184, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_Add_IntInt_ReturnValue_1) == 0x000188, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, Temp_int_Array_Index_Variable_1) == 0x00018C, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, Temp_byte_Variable_1) == 0x000190, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, Temp_wildcard_Variable_1) == 0x000198, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::Temp_wildcard_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_Array_Get_Item_1) == 0x0001A8, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001B0, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_Array_Length_ReturnValue_1) == 0x0001C0, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, Temp_int_Loop_Counter_Variable_2) == 0x0001C4, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001C8, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_Add_IntInt_ReturnValue_2) == 0x0001CC, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x0001D0, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_Not_PreBool_ReturnValue_1) == 0x0001D1, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_PlayAnimation_ReturnValue) == 0x0001D8, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_GetAllButtons_ReturnValue) == 0x0001E0, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_GetAllButtons_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, K2Node_MakeMap_Map) == 0x0001F0, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::K2Node_MakeMap_Map' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_GetBattleManager_ReturnValue_1) == 0x000240, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_GetBattleManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_Round_ReturnValue) == 0x000248, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, K2Node_CustomEvent_NewAP) == 0x00024C, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::K2Node_CustomEvent_NewAP' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, K2Node_CustomEvent_PreviousAP) == 0x000250, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::K2Node_CustomEvent_PreviousAP' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, K2Node_CustomEvent_CharacterStats) == 0x000258, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::K2Node_CustomEvent_CharacterStats' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_MakeLiteralInt_ReturnValue) == 0x000260, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, K2Node_CustomEvent_ButtonWidget) == 0x000268, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::K2Node_CustomEvent_ButtonWidget' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, Temp_wildcard_Variable_2) == 0x000270, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::Temp_wildcard_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_Map_Find_Value) == 0x000280, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_Map_Find_ReturnValue) == 0x000284, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_Array_Length_ReturnValue_2) == 0x000288, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_Less_IntInt_ReturnValue_2) == 0x00028C, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_GetAllButtons_ReturnValue_1) == 0x000290, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_GetAllButtons_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_GetAllButtons_ReturnValue_2) == 0x0002A0, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_GetAllButtons_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_DEBUG_GetUMGDebugger_ReturnValue) == 0x0002B0, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_DEBUG_GetUMGDebugger_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_IsValid_ReturnValue) == 0x0002B8, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, K2Node_MakeArray_Array) == 0x0002C0, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_GetEndTime_ReturnValue) == 0x0002D0, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0002D8, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_IsAnimationPlaying_ReturnValue) == 0x0002E0, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, Temp_bool_Variable_2) == 0x0002E1, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x0002E8, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x0002F0, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, K2Node_Select_Default) == 0x0002F8, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_IsValid_ReturnValue_1) == 0x0002F9, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, Temp_int_Array_Index_Variable_2) == 0x0002FC, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_Array_Get_Item_2) == 0x000300, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, K2Node_MakeArray_Array_1) == 0x000308, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, K2Node_MakeMap_Map_1) == 0x000318, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::K2Node_MakeMap_Map_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_Map_Find_Value_1) == 0x000368, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_Map_Find_ReturnValue_1) == 0x000370, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, K2Node_MakeArray_Array_2) == 0x000378, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_Not_PreBool_ReturnValue_2) == 0x000388, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_GetBattleManager_ReturnValue_2) == 0x000390, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_GetBattleManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, K2Node_CreateDelegate_OutputDelegate_2) == 0x000398, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0003A8, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_GetReferenceCounterState_ReturnValue) == 0x0003A9, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_GetReferenceCounterState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_BooleanOR_ReturnValue) == 0x0003AA, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, K2Node_Select_Default_1) == 0x0003AB, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, K2Node_CreateDelegate_OutputDelegate_3) == 0x0003AC, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, K2Node_CreateDelegate_OutputDelegate_4) == 0x0003BC, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_GetBattleManager_ReturnValue_3) == 0x0003D0, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_GetBattleManager_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, K2Node_CustomEvent_PreviousProgress) == 0x0003D8, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::K2Node_CustomEvent_PreviousProgress' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, K2Node_CustomEvent_PreviousCharges) == 0x0003E0, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::K2Node_CustomEvent_PreviousCharges' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_GetAvailableCharges_ReturnValue) == 0x0003E4, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_GetAvailableCharges_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_GetBattleManager_ReturnValue_4) == 0x0003E8, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_GetBattleManager_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x0003F0, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0003F8, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, K2Node_Select_Default_2) == 0x000400, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_MakeVector2D_ReturnValue) == 0x000408, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000418, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_SetAnimationCurrentTime_InTime_ImplicitCast) == 0x000420, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_SetAnimationCurrentTime_InTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel, CallFunc_ActivateWidgetWithDelay_Duration_ImplicitCast) == 0x000424, "Member 'WBP_BattleWheel_C_ExecuteUbergraph_WBP_BattleWheel::CallFunc_ActivateWidgetWithDelay_Duration_ImplicitCast' has a wrong offset!");

// Function WBP_BattleWheel.WBP_BattleWheel_C.GetAllButtons
// 0x0020 (0x0020 - 0x0000)
struct WBP_BattleWheel_C_GetAllButtons final
{
public:
	TArray<class UWBP_BattleWheel_Button_C*>      ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<class UWBP_BattleWheel_Button_C*>      K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_BattleWheel_C_GetAllButtons) == 0x000008, "Wrong alignment on WBP_BattleWheel_C_GetAllButtons");
static_assert(sizeof(WBP_BattleWheel_C_GetAllButtons) == 0x000020, "Wrong size on WBP_BattleWheel_C_GetAllButtons");
static_assert(offsetof(WBP_BattleWheel_C_GetAllButtons, ReturnValue) == 0x000000, "Member 'WBP_BattleWheel_C_GetAllButtons::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_GetAllButtons, K2Node_MakeArray_Array) == 0x000010, "Member 'WBP_BattleWheel_C_GetAllButtons::K2Node_MakeArray_Array' has a wrong offset!");

// Function WBP_BattleWheel.WBP_BattleWheel_C.IsGradientButtonVisible
// 0x0028 (0x0028 - 0x0000)
struct WBP_BattleWheel_C_IsGradientButtonVisible final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_DataAsset_Skill_C*>          CallFunc_GetEquippedCharacterGradientAttacks_EquippedSkills; // 0x0010(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleWheel_C_IsGradientButtonVisible) == 0x000008, "Wrong alignment on WBP_BattleWheel_C_IsGradientButtonVisible");
static_assert(sizeof(WBP_BattleWheel_C_IsGradientButtonVisible) == 0x000028, "Wrong size on WBP_BattleWheel_C_IsGradientButtonVisible");
static_assert(offsetof(WBP_BattleWheel_C_IsGradientButtonVisible, ReturnValue) == 0x000000, "Member 'WBP_BattleWheel_C_IsGradientButtonVisible::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_IsGradientButtonVisible, CallFunc_GetBattleManager_ReturnValue) == 0x000008, "Member 'WBP_BattleWheel_C_IsGradientButtonVisible::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_IsGradientButtonVisible, CallFunc_GetEquippedCharacterGradientAttacks_EquippedSkills) == 0x000010, "Member 'WBP_BattleWheel_C_IsGradientButtonVisible::CallFunc_GetEquippedCharacterGradientAttacks_EquippedSkills' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_IsGradientButtonVisible, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000020, "Member 'WBP_BattleWheel_C_IsGradientButtonVisible::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");

// Function WBP_BattleWheel.WBP_BattleWheel_C.IsWheelButtonAvailable
// 0x0010 (0x0010 - 0x0000)
struct WBP_BattleWheel_C_IsWheelButtonAvailable final
{
public:
	class UWidget*                                Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleWheel_C_IsWheelButtonAvailable) == 0x000008, "Wrong alignment on WBP_BattleWheel_C_IsWheelButtonAvailable");
static_assert(sizeof(WBP_BattleWheel_C_IsWheelButtonAvailable) == 0x000010, "Wrong size on WBP_BattleWheel_C_IsWheelButtonAvailable");
static_assert(offsetof(WBP_BattleWheel_C_IsWheelButtonAvailable, Button) == 0x000000, "Member 'WBP_BattleWheel_C_IsWheelButtonAvailable::Button' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_IsWheelButtonAvailable, ReturnValue) == 0x000008, "Member 'WBP_BattleWheel_C_IsWheelButtonAvailable::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_IsWheelButtonAvailable, CallFunc_IsVisible_ReturnValue) == 0x000009, "Member 'WBP_BattleWheel_C_IsWheelButtonAvailable::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_IsWheelButtonAvailable, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00000A, "Member 'WBP_BattleWheel_C_IsWheelButtonAvailable::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_IsWheelButtonAvailable, CallFunc_IsValid_ReturnValue) == 0x00000B, "Member 'WBP_BattleWheel_C_IsWheelButtonAvailable::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_IsWheelButtonAvailable, CallFunc_Not_PreBool_ReturnValue) == 0x00000C, "Member 'WBP_BattleWheel_C_IsWheelButtonAvailable::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_IsWheelButtonAvailable, CallFunc_BooleanOR_ReturnValue) == 0x00000D, "Member 'WBP_BattleWheel_C_IsWheelButtonAvailable::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_IsWheelButtonAvailable, CallFunc_BooleanAND_ReturnValue) == 0x00000E, "Member 'WBP_BattleWheel_C_IsWheelButtonAvailable::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_BattleWheel.WBP_BattleWheel_C.IsWheelButtonVisible
// 0x0020 (0x0020 - 0x0000)
struct WBP_BattleWheel_C_IsWheelButtonVisible final
{
public:
	class UWidget*                                Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGradientButtonVisible_ReturnValue;      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualsObjects_ReturnValue;                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualsObjects_ReturnValue_1;              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetHasAimingSkill_HasAimingSkill;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleWheel_C_IsWheelButtonVisible) == 0x000008, "Wrong alignment on WBP_BattleWheel_C_IsWheelButtonVisible");
static_assert(sizeof(WBP_BattleWheel_C_IsWheelButtonVisible) == 0x000020, "Wrong size on WBP_BattleWheel_C_IsWheelButtonVisible");
static_assert(offsetof(WBP_BattleWheel_C_IsWheelButtonVisible, Button) == 0x000000, "Member 'WBP_BattleWheel_C_IsWheelButtonVisible::Button' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_IsWheelButtonVisible, ReturnValue) == 0x000008, "Member 'WBP_BattleWheel_C_IsWheelButtonVisible::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_IsWheelButtonVisible, CallFunc_IsGradientButtonVisible_ReturnValue) == 0x000009, "Member 'WBP_BattleWheel_C_IsWheelButtonVisible::CallFunc_IsGradientButtonVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_IsWheelButtonVisible, CallFunc_EqualsObjects_ReturnValue) == 0x00000A, "Member 'WBP_BattleWheel_C_IsWheelButtonVisible::CallFunc_EqualsObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_IsWheelButtonVisible, CallFunc_EqualsObjects_ReturnValue_1) == 0x00000B, "Member 'WBP_BattleWheel_C_IsWheelButtonVisible::CallFunc_EqualsObjects_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_IsWheelButtonVisible, CallFunc_GetBattleManager_ReturnValue) == 0x000010, "Member 'WBP_BattleWheel_C_IsWheelButtonVisible::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_IsWheelButtonVisible, CallFunc_GetHasAimingSkill_HasAimingSkill) == 0x000018, "Member 'WBP_BattleWheel_C_IsWheelButtonVisible::CallFunc_GetHasAimingSkill_HasAimingSkill' has a wrong offset!");

// Function WBP_BattleWheel.WBP_BattleWheel_C.OnGradientGaugeChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_BattleWheel_C_OnGradientGaugeChanged final
{
public:
	double                                        PreviousProgress;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PreviousCharges;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleWheel_C_OnGradientGaugeChanged) == 0x000008, "Wrong alignment on WBP_BattleWheel_C_OnGradientGaugeChanged");
static_assert(sizeof(WBP_BattleWheel_C_OnGradientGaugeChanged) == 0x000010, "Wrong size on WBP_BattleWheel_C_OnGradientGaugeChanged");
static_assert(offsetof(WBP_BattleWheel_C_OnGradientGaugeChanged, PreviousProgress) == 0x000000, "Member 'WBP_BattleWheel_C_OnGradientGaugeChanged::PreviousProgress' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_OnGradientGaugeChanged, PreviousCharges) == 0x000008, "Member 'WBP_BattleWheel_C_OnGradientGaugeChanged::PreviousCharges' has a wrong offset!");

// Function WBP_BattleWheel.WBP_BattleWheel_C.ProcessOnButtonClicked
// 0x0008 (0x0008 - 0x0000)
struct WBP_BattleWheel_C_ProcessOnButtonClicked final
{
public:
	class UWBP_BattleWheel_Button_C*              ButtonWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleWheel_C_ProcessOnButtonClicked) == 0x000008, "Wrong alignment on WBP_BattleWheel_C_ProcessOnButtonClicked");
static_assert(sizeof(WBP_BattleWheel_C_ProcessOnButtonClicked) == 0x000008, "Wrong size on WBP_BattleWheel_C_ProcessOnButtonClicked");
static_assert(offsetof(WBP_BattleWheel_C_ProcessOnButtonClicked, ButtonWidget) == 0x000000, "Member 'WBP_BattleWheel_C_ProcessOnButtonClicked::ButtonWidget' has a wrong offset!");

// Function WBP_BattleWheel.WBP_BattleWheel_C.RefreshAP
// 0x0010 (0x0010 - 0x0000)
struct WBP_BattleWheel_C_RefreshAP final
{
public:
	int32                                         NewAP;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PreviousAP;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAC_jRPG_CharacterBattleStats_C*        CharacterStats;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleWheel_C_RefreshAP) == 0x000008, "Wrong alignment on WBP_BattleWheel_C_RefreshAP");
static_assert(sizeof(WBP_BattleWheel_C_RefreshAP) == 0x000010, "Wrong size on WBP_BattleWheel_C_RefreshAP");
static_assert(offsetof(WBP_BattleWheel_C_RefreshAP, NewAP) == 0x000000, "Member 'WBP_BattleWheel_C_RefreshAP::NewAP' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_RefreshAP, PreviousAP) == 0x000004, "Member 'WBP_BattleWheel_C_RefreshAP::PreviousAP' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_RefreshAP, CharacterStats) == 0x000008, "Member 'WBP_BattleWheel_C_RefreshAP::CharacterStats' has a wrong offset!");

// Function WBP_BattleWheel.WBP_BattleWheel_C.SetAttackAndAimElementIcon
// 0x0028 (0x0028 - 0x0000)
struct WBP_BattleWheel_C_SetAttackAndAimElementIcon final
{
public:
	EAttackType                                   WeaponElement;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               CallFunc_GetAttackElementTypeIcon_Texture;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleWheel_C_SetAttackAndAimElementIcon) == 0x000008, "Wrong alignment on WBP_BattleWheel_C_SetAttackAndAimElementIcon");
static_assert(sizeof(WBP_BattleWheel_C_SetAttackAndAimElementIcon) == 0x000028, "Wrong size on WBP_BattleWheel_C_SetAttackAndAimElementIcon");
static_assert(offsetof(WBP_BattleWheel_C_SetAttackAndAimElementIcon, WeaponElement) == 0x000000, "Member 'WBP_BattleWheel_C_SetAttackAndAimElementIcon::WeaponElement' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_C_SetAttackAndAimElementIcon, Temp_byte_Variable) == 0x000001, "Member 'WBP_BattleWheel_C_SetAttackAndAimElementIcon::Temp_byte_Variable' has a wrong offset!");
