#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AttributesStatsPanel

#include "Basic.hpp"

#include "ECharacterAttribute_structs.hpp"
#include "E_jRPG_StatType_structs.hpp"
#include "EAttributeScalingGrade_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_AttributesStatsPanel.WBP_AttributesStatsPanel_C
// 0x02A0 (0x06D0 - 0x0430)
class UWBP_AttributesStatsPanel_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           APBox;                                             // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Raw_Stats_Display_C*               APStatDisplay;                                     // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TextualInputActionBinding_C*       AssignAttributesBinding;                           // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BaseButton_C*                      AssignButton;                                      // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Raw_Attributes_Display_C*          AttributeDisplayAgility;                           // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Raw_Attributes_Display_C*          AttributeDisplayDefense;                           // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Raw_Attributes_Display_C*          AttributeDisplayLuck;                              // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Raw_Attributes_Display_C*          AttributeDisplayMight;                             // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Raw_Attributes_Display_C*          AttributeDisplayVitality;                          // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       AttributePointsText;                               // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       AttrPointsLine;                                    // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       AttrPointsSquare;                                  // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           CritRateBox;                                       // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Raw_Stats_Display_C*               CritRateStatDisplay;                               // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           DefenseBox;                                        // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Raw_Stats_Display_C*               DefenseStatDisplay;                                // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDynamicEntryBox*                       DynamicEntryBox_ResourceCost;                      // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           HealthBox;                                         // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Raw_Stats_Display_C*               HealthStatDisplay;                                 // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   NiagaraSystemWidget_Canalize;                      // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   NiagaraSystemWidget_Explode;                       // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TextualInputActionBinding_C*       ResetAttributesBinding;                            // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BaseButton_C*                      ResetButton;                                       // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ResetOverlay;                                      // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           SpeedBox;                                          // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Raw_Stats_Display_C*               SpeedStatDisplay;                                  // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_AttributeList;                         // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_StatList;                              // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CharacterLevel_C*                  WBP_CharacterLevel;                                // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<ECharacterAttribute, class UWBP_Raw_Attributes_Display_C*> AttributeWidgets;                // 0x0520(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<E_jRPG_StatType, class UWBP_Raw_Stats_Display_C*> StatWidgets;                              // 0x0570(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UBP_CharacterData_C*                    CurrentCharacterData;                              // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<ECharacterAttribute, int32>              PreviewAttributes;                                 // 0x05C8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UBP_CharacterData_C*                    PreviewCharacterData;                              // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          HasModifiedAttributes;                             // 0x0620(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_621[0x7];                                      // 0x0621(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnCharacterUpdated;                                // 0x0628(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FDataTableRowHandle                    SDChangeValue;                                     // 0x0638(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	TMap<E_jRPG_StatType, class UVerticalBox*>    StatBoxes;                                         // 0x0648(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UWBP_Raw_Attributes_Display_C*          FocusedAttribute;                                  // 0x0698(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UBP_CharacterData_C* PreviewCharacter)> OnPreviewCharacterLoaded; // 0x06A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FDataTableRowHandle                    SDAttributeUpgrade;                                // 0x06B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    SDRecoatUsed;                                      // 0x06C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void BndEvt__WBP_AttributesStatsPanel_AssignButton_K2Node_ComponentBoundEvent_2_OnButtonBaseActionProgress__DelegateSignature(double Progress);
	void BndEvt__WBP_AttributesStatsPanel_AssignButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Panel_SkillTree_ResetButton_K2Node_ComponentBoundEvent_0_OnButtonBaseActionProgress__DelegateSignature(double Progress);
	void BndEvt__WBP_Panel_SkillTree_ResetButton_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void Construct();
	void ExecuteUbergraph_WBP_AttributesStatsPanel(int32 EntryPoint);
	void InitializeDynamicWidgets();
	void LoadCharacterState(class UBP_CharacterData_C* CharacterData);
	void LoadPreviewCharacterState(class UBP_CharacterData_C* PreviewCharacter);
	void OnAttributeChanged(class UWBP_Raw_Attributes_Display_C* AttributeWidget, bool IsUpgrade);
	void OnAttributeFocused(class UWBP_Raw_Attributes_Display_C* AttributeWidget);
	void PreConstruct(bool IsDesignTime);
	void Set_Change_Allowed(bool ChangeAllowed);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_AttributesStatsPanel_C">();
	}
	static class UWBP_AttributesStatsPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_AttributesStatsPanel_C>();
	}
};
static_assert(alignof(UWBP_AttributesStatsPanel_C) == 0x000008, "Wrong alignment on UWBP_AttributesStatsPanel_C");
static_assert(sizeof(UWBP_AttributesStatsPanel_C) == 0x0006D0, "Wrong size on UWBP_AttributesStatsPanel_C");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, UberGraphFrame) == 0x000430, "Member 'UWBP_AttributesStatsPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, APBox) == 0x000438, "Member 'UWBP_AttributesStatsPanel_C::APBox' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, APStatDisplay) == 0x000440, "Member 'UWBP_AttributesStatsPanel_C::APStatDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, AssignAttributesBinding) == 0x000448, "Member 'UWBP_AttributesStatsPanel_C::AssignAttributesBinding' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, AssignButton) == 0x000450, "Member 'UWBP_AttributesStatsPanel_C::AssignButton' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, AttributeDisplayAgility) == 0x000458, "Member 'UWBP_AttributesStatsPanel_C::AttributeDisplayAgility' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, AttributeDisplayDefense) == 0x000460, "Member 'UWBP_AttributesStatsPanel_C::AttributeDisplayDefense' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, AttributeDisplayLuck) == 0x000468, "Member 'UWBP_AttributesStatsPanel_C::AttributeDisplayLuck' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, AttributeDisplayMight) == 0x000470, "Member 'UWBP_AttributesStatsPanel_C::AttributeDisplayMight' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, AttributeDisplayVitality) == 0x000478, "Member 'UWBP_AttributesStatsPanel_C::AttributeDisplayVitality' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, AttributePointsText) == 0x000480, "Member 'UWBP_AttributesStatsPanel_C::AttributePointsText' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, AttrPointsLine) == 0x000488, "Member 'UWBP_AttributesStatsPanel_C::AttrPointsLine' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, AttrPointsSquare) == 0x000490, "Member 'UWBP_AttributesStatsPanel_C::AttrPointsSquare' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, CritRateBox) == 0x000498, "Member 'UWBP_AttributesStatsPanel_C::CritRateBox' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, CritRateStatDisplay) == 0x0004A0, "Member 'UWBP_AttributesStatsPanel_C::CritRateStatDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, DefenseBox) == 0x0004A8, "Member 'UWBP_AttributesStatsPanel_C::DefenseBox' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, DefenseStatDisplay) == 0x0004B0, "Member 'UWBP_AttributesStatsPanel_C::DefenseStatDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, DynamicEntryBox_ResourceCost) == 0x0004B8, "Member 'UWBP_AttributesStatsPanel_C::DynamicEntryBox_ResourceCost' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, HealthBox) == 0x0004C0, "Member 'UWBP_AttributesStatsPanel_C::HealthBox' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, HealthStatDisplay) == 0x0004C8, "Member 'UWBP_AttributesStatsPanel_C::HealthStatDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, NiagaraSystemWidget_Canalize) == 0x0004D0, "Member 'UWBP_AttributesStatsPanel_C::NiagaraSystemWidget_Canalize' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, NiagaraSystemWidget_Explode) == 0x0004D8, "Member 'UWBP_AttributesStatsPanel_C::NiagaraSystemWidget_Explode' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, ResetAttributesBinding) == 0x0004E0, "Member 'UWBP_AttributesStatsPanel_C::ResetAttributesBinding' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, ResetButton) == 0x0004E8, "Member 'UWBP_AttributesStatsPanel_C::ResetButton' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, ResetOverlay) == 0x0004F0, "Member 'UWBP_AttributesStatsPanel_C::ResetOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, SpeedBox) == 0x0004F8, "Member 'UWBP_AttributesStatsPanel_C::SpeedBox' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, SpeedStatDisplay) == 0x000500, "Member 'UWBP_AttributesStatsPanel_C::SpeedStatDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, VerticalBox_AttributeList) == 0x000508, "Member 'UWBP_AttributesStatsPanel_C::VerticalBox_AttributeList' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, VerticalBox_StatList) == 0x000510, "Member 'UWBP_AttributesStatsPanel_C::VerticalBox_StatList' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, WBP_CharacterLevel) == 0x000518, "Member 'UWBP_AttributesStatsPanel_C::WBP_CharacterLevel' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, AttributeWidgets) == 0x000520, "Member 'UWBP_AttributesStatsPanel_C::AttributeWidgets' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, StatWidgets) == 0x000570, "Member 'UWBP_AttributesStatsPanel_C::StatWidgets' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, CurrentCharacterData) == 0x0005C0, "Member 'UWBP_AttributesStatsPanel_C::CurrentCharacterData' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, PreviewAttributes) == 0x0005C8, "Member 'UWBP_AttributesStatsPanel_C::PreviewAttributes' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, PreviewCharacterData) == 0x000618, "Member 'UWBP_AttributesStatsPanel_C::PreviewCharacterData' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, HasModifiedAttributes) == 0x000620, "Member 'UWBP_AttributesStatsPanel_C::HasModifiedAttributes' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, OnCharacterUpdated) == 0x000628, "Member 'UWBP_AttributesStatsPanel_C::OnCharacterUpdated' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, SDChangeValue) == 0x000638, "Member 'UWBP_AttributesStatsPanel_C::SDChangeValue' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, StatBoxes) == 0x000648, "Member 'UWBP_AttributesStatsPanel_C::StatBoxes' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, FocusedAttribute) == 0x000698, "Member 'UWBP_AttributesStatsPanel_C::FocusedAttribute' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, OnPreviewCharacterLoaded) == 0x0006A0, "Member 'UWBP_AttributesStatsPanel_C::OnPreviewCharacterLoaded' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, SDAttributeUpgrade) == 0x0006B0, "Member 'UWBP_AttributesStatsPanel_C::SDAttributeUpgrade' has a wrong offset!");
static_assert(offsetof(UWBP_AttributesStatsPanel_C, SDRecoatUsed) == 0x0006C0, "Member 'UWBP_AttributesStatsPanel_C::SDRecoatUsed' has a wrong offset!");

}

