#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Panel_CharacterCustomization

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SandFall_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Panel_CharacterCustomization.WBP_Panel_CharacterCustomization_C
// 0x0068 (0x0498 - 0x0430)
class UWBP_Panel_CharacterCustomization_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCircularThrobber*                      CircularThrobber_42;                               // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Center;                                      // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_center_Square;                               // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Square;                                      // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ThobberPanel;                                      // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Category_Customization_C*          WBP_Costume_Customization;                         // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Category_Customization_C*          WBP_HairCut_Customization;                         // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_CharacterData_C*                    CharacterData;                                     // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FSoundEventDataTableRowHandle          SD_OnActivated;                                    // 0x0478(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FSoundEventDataTableRowHandle          SD_OnDeactivated;                                  // 0x0488(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void BndEvt__WBP_Panel_CharacterCustomization_WBP_Costume_Customization_K2Node_ComponentBoundEvent_0_OnWaitForPSOCaching__DelegateSignature(bool IsWaiting);
	void BndEvt__WBP_Panel_CharacterCustomization_WBP_HairCut_Customization_K2Node_ComponentBoundEvent_1_OnWaitForPSOCaching__DelegateSignature(bool IsWaiting);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void BPI_GetCharacterNotificationState(class UBP_CharacterData_C* CharacterData_0, bool* HasNotification);
	void BPI_LoadCharacter(class UBP_CharacterData_C* CharacterData_0);
	void ExecuteUbergraph_WBP_Panel_CharacterCustomization(int32 EntryPoint);
	void OnNextTick();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Panel_CharacterCustomization_C">();
	}
	static class UWBP_Panel_CharacterCustomization_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Panel_CharacterCustomization_C>();
	}
};
static_assert(alignof(UWBP_Panel_CharacterCustomization_C) == 0x000008, "Wrong alignment on UWBP_Panel_CharacterCustomization_C");
static_assert(sizeof(UWBP_Panel_CharacterCustomization_C) == 0x000498, "Wrong size on UWBP_Panel_CharacterCustomization_C");
static_assert(offsetof(UWBP_Panel_CharacterCustomization_C, UberGraphFrame) == 0x000430, "Member 'UWBP_Panel_CharacterCustomization_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_CharacterCustomization_C, CircularThrobber_42) == 0x000438, "Member 'UWBP_Panel_CharacterCustomization_C::CircularThrobber_42' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_CharacterCustomization_C, Image_Center) == 0x000440, "Member 'UWBP_Panel_CharacterCustomization_C::Image_Center' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_CharacterCustomization_C, Image_center_Square) == 0x000448, "Member 'UWBP_Panel_CharacterCustomization_C::Image_center_Square' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_CharacterCustomization_C, Image_Square) == 0x000450, "Member 'UWBP_Panel_CharacterCustomization_C::Image_Square' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_CharacterCustomization_C, ThobberPanel) == 0x000458, "Member 'UWBP_Panel_CharacterCustomization_C::ThobberPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_CharacterCustomization_C, WBP_Costume_Customization) == 0x000460, "Member 'UWBP_Panel_CharacterCustomization_C::WBP_Costume_Customization' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_CharacterCustomization_C, WBP_HairCut_Customization) == 0x000468, "Member 'UWBP_Panel_CharacterCustomization_C::WBP_HairCut_Customization' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_CharacterCustomization_C, CharacterData) == 0x000470, "Member 'UWBP_Panel_CharacterCustomization_C::CharacterData' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_CharacterCustomization_C, SD_OnActivated) == 0x000478, "Member 'UWBP_Panel_CharacterCustomization_C::SD_OnActivated' has a wrong offset!");
static_assert(offsetof(UWBP_Panel_CharacterCustomization_C, SD_OnDeactivated) == 0x000488, "Member 'UWBP_Panel_CharacterCustomization_C::SD_OnDeactivated' has a wrong offset!");

}

