#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_StartGameOptions

#include "Basic.hpp"

#include "WBP_Settings_GenericPage_classes.hpp"
#include "Engine_structs.hpp"
#include "EModalUIResponse_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Settings_StartGameOptions.WBP_Settings_StartGameOptions_C
// 0x0040 (0x0508 - 0x04C8)
class UWBP_Settings_StartGameOptions_C final : public UWBP_Settings_GenericPage_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_Settings_StartGameOptions_C;    // 0x04C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Settings_StartGameOptionsList_C*   WBP_Settings_StartGameOptionsList;                 // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnStartGameOptionsApplied;                         // 0x04D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnBackToTitleClicked;                              // 0x04E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnBackToNewGameClicked;                            // 0x04F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_Settings_GenericPage_WBP_CommonBoundActionButton_ApplySettings_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Settings_GenericPage_WBP_CommonBoundActionButton_Back_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnActivated();
	void ExecuteUbergraph_WBP_Settings_StartGameOptions(int32 EntryPoint);
	void OnStartGameResponse(EModalUIResponse InUserResponse);
	void RefreshWidgetsWithUserSettings();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Settings_StartGameOptions_C">();
	}
	static class UWBP_Settings_StartGameOptions_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Settings_StartGameOptions_C>();
	}
};
static_assert(alignof(UWBP_Settings_StartGameOptions_C) == 0x000008, "Wrong alignment on UWBP_Settings_StartGameOptions_C");
static_assert(sizeof(UWBP_Settings_StartGameOptions_C) == 0x000508, "Wrong size on UWBP_Settings_StartGameOptions_C");
static_assert(offsetof(UWBP_Settings_StartGameOptions_C, UberGraphFrame_WBP_Settings_StartGameOptions_C) == 0x0004C8, "Member 'UWBP_Settings_StartGameOptions_C::UberGraphFrame_WBP_Settings_StartGameOptions_C' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_StartGameOptions_C, WBP_Settings_StartGameOptionsList) == 0x0004D0, "Member 'UWBP_Settings_StartGameOptions_C::WBP_Settings_StartGameOptionsList' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_StartGameOptions_C, OnStartGameOptionsApplied) == 0x0004D8, "Member 'UWBP_Settings_StartGameOptions_C::OnStartGameOptionsApplied' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_StartGameOptions_C, OnBackToTitleClicked) == 0x0004E8, "Member 'UWBP_Settings_StartGameOptions_C::OnBackToTitleClicked' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_StartGameOptions_C, OnBackToNewGameClicked) == 0x0004F8, "Member 'UWBP_Settings_StartGameOptions_C::OnBackToNewGameClicked' has a wrong offset!");

}

