#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LevelNameWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LevelNameWidget.WBP_LevelNameWidget_C
// 0x0048 (0x0328 - 0x02E0)
class UWBP_LevelNameWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Disappear;                                    // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Appear;                                       // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             Text_Danger;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_LevelName;                               // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnAppearAnimationFinished;                         // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnDisappearAnimationFinished;                      // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_WBP_LevelNameWidget(int32 EntryPoint);
	void OnAppearAnimationDone();
	void OnDisappearAnimationDone();
	void OnInitialized();
	void PlayAppearAnimation();
	void PlayDisappearAnimation();
	void PreConstruct(bool IsDesignTime);
	void SetDangerTextVisbility(ESlateVisibility InVisibility);
	void SetLevelNameText(const class FText& LevelNameText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LevelNameWidget_C">();
	}
	static class UWBP_LevelNameWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LevelNameWidget_C>();
	}
};
static_assert(alignof(UWBP_LevelNameWidget_C) == 0x000008, "Wrong alignment on UWBP_LevelNameWidget_C");
static_assert(sizeof(UWBP_LevelNameWidget_C) == 0x000328, "Wrong size on UWBP_LevelNameWidget_C");
static_assert(offsetof(UWBP_LevelNameWidget_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_LevelNameWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_LevelNameWidget_C, Anim_Disappear) == 0x0002E8, "Member 'UWBP_LevelNameWidget_C::Anim_Disappear' has a wrong offset!");
static_assert(offsetof(UWBP_LevelNameWidget_C, Anim_Appear) == 0x0002F0, "Member 'UWBP_LevelNameWidget_C::Anim_Appear' has a wrong offset!");
static_assert(offsetof(UWBP_LevelNameWidget_C, Text_Danger) == 0x0002F8, "Member 'UWBP_LevelNameWidget_C::Text_Danger' has a wrong offset!");
static_assert(offsetof(UWBP_LevelNameWidget_C, TextBlock_LevelName) == 0x000300, "Member 'UWBP_LevelNameWidget_C::TextBlock_LevelName' has a wrong offset!");
static_assert(offsetof(UWBP_LevelNameWidget_C, OnAppearAnimationFinished) == 0x000308, "Member 'UWBP_LevelNameWidget_C::OnAppearAnimationFinished' has a wrong offset!");
static_assert(offsetof(UWBP_LevelNameWidget_C, OnDisappearAnimationFinished) == 0x000318, "Member 'UWBP_LevelNameWidget_C::OnDisappearAnimationFinished' has a wrong offset!");

}

