#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_GM_ShowExperience

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUD_GM_ShowExperience.WBP_HUD_GM_ShowExperience_C
// 0x0028 (0x0330 - 0x0308)
class UWBP_HUD_GM_ShowExperience_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_ExperienceGain;                               // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBlock_ExperienceNumber;                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         ExperienceTarget;                                  // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ExperienceGainProgress;                            // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_HUD_GM_ShowExperience(int32 EntryPoint);
	void SetExperienceGainProgress(double ExperienceGainProgress_0);
	void SetExperienceTarget(int32 Number);
	void TriggerExperienceGainAnim();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUD_GM_ShowExperience_C">();
	}
	static class UWBP_HUD_GM_ShowExperience_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_GM_ShowExperience_C>();
	}
};
static_assert(alignof(UWBP_HUD_GM_ShowExperience_C) == 0x000008, "Wrong alignment on UWBP_HUD_GM_ShowExperience_C");
static_assert(sizeof(UWBP_HUD_GM_ShowExperience_C) == 0x000330, "Wrong size on UWBP_HUD_GM_ShowExperience_C");
static_assert(offsetof(UWBP_HUD_GM_ShowExperience_C, UberGraphFrame) == 0x000308, "Member 'UWBP_HUD_GM_ShowExperience_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_GM_ShowExperience_C, Anim_ExperienceGain) == 0x000310, "Member 'UWBP_HUD_GM_ShowExperience_C::Anim_ExperienceGain' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_GM_ShowExperience_C, TextBlock_ExperienceNumber) == 0x000318, "Member 'UWBP_HUD_GM_ShowExperience_C::TextBlock_ExperienceNumber' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_GM_ShowExperience_C, ExperienceTarget) == 0x000320, "Member 'UWBP_HUD_GM_ShowExperience_C::ExperienceTarget' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_GM_ShowExperience_C, ExperienceGainProgress) == 0x000328, "Member 'UWBP_HUD_GM_ShowExperience_C::ExperienceGainProgress' has a wrong offset!");

}

