#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AttributeStat

#include "Basic.hpp"

#include "EAttributeScalingGrade_structs.hpp"
#include "Engine_structs.hpp"
#include "ECharacterAttribute_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_AttributeStat.WBP_AttributeStat_C
// 0x0038 (0x0340 - 0x0308)
class UWBP_AttributeStat_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_WrappingText_C*                    AttributeLabel;                                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       AttributeScaling;                                  // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       AttributeValue;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              IndicatorScale;                                    // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ECharacterAttribute                           AttributeType;                                     // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_331[0x3];                                      // 0x0331(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EditorAttributeValue;                              // 0x0334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAttributeScalingGrade                        EditorScaling;                                     // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x3];                                      // 0x0339(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentAttributeValue;                             // 0x033C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_AttributeStat(int32 EntryPoint);
	void GetAttributeType(ECharacterAttribute* OutAttribute);
	void PreConstruct(bool IsDesignTime);
	void SetAttributeValueAndScaling(int32 InAttributeValue, EAttributeScalingGrade InAttributeScaling);
	void SetPreviewAttributeValue(int32 PreviewValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_AttributeStat_C">();
	}
	static class UWBP_AttributeStat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_AttributeStat_C>();
	}
};
static_assert(alignof(UWBP_AttributeStat_C) == 0x000008, "Wrong alignment on UWBP_AttributeStat_C");
static_assert(sizeof(UWBP_AttributeStat_C) == 0x000340, "Wrong size on UWBP_AttributeStat_C");
static_assert(offsetof(UWBP_AttributeStat_C, UberGraphFrame) == 0x000308, "Member 'UWBP_AttributeStat_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_AttributeStat_C, AttributeLabel) == 0x000310, "Member 'UWBP_AttributeStat_C::AttributeLabel' has a wrong offset!");
static_assert(offsetof(UWBP_AttributeStat_C, AttributeScaling) == 0x000318, "Member 'UWBP_AttributeStat_C::AttributeScaling' has a wrong offset!");
static_assert(offsetof(UWBP_AttributeStat_C, AttributeValue) == 0x000320, "Member 'UWBP_AttributeStat_C::AttributeValue' has a wrong offset!");
static_assert(offsetof(UWBP_AttributeStat_C, IndicatorScale) == 0x000328, "Member 'UWBP_AttributeStat_C::IndicatorScale' has a wrong offset!");
static_assert(offsetof(UWBP_AttributeStat_C, AttributeType) == 0x000330, "Member 'UWBP_AttributeStat_C::AttributeType' has a wrong offset!");
static_assert(offsetof(UWBP_AttributeStat_C, EditorAttributeValue) == 0x000334, "Member 'UWBP_AttributeStat_C::EditorAttributeValue' has a wrong offset!");
static_assert(offsetof(UWBP_AttributeStat_C, EditorScaling) == 0x000338, "Member 'UWBP_AttributeStat_C::EditorScaling' has a wrong offset!");
static_assert(offsetof(UWBP_AttributeStat_C, CurrentAttributeValue) == 0x00033C, "Member 'UWBP_AttributeStat_C::CurrentAttributeValue' has a wrong offset!");

}

