#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UniqueMechanic_Charge

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_UniqueMechanic_Charge.WBP_UniqueMechanic_Charge_C.ExecuteUbergraph_WBP_UniqueMechanic_Charge
// 0x0088 (0x0088 - 0x0000)
struct WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UOverlay*                         Temp_object_Variable;                              // 0x0008(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0010)()
	TArray<class UOverlay*>                       K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UImage*>                         K2Node_MakeArray_Array_1;                          // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UOverlay*>                       K2Node_MakeArray_Array_2;                          // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0068(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge) == 0x000008, "Wrong alignment on WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge");
static_assert(sizeof(WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge) == 0x000088, "Wrong size on WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge");
static_assert(offsetof(WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge, EntryPoint) == 0x000000, "Member 'WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge, Temp_object_Variable) == 0x000008, "Member 'WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge, Temp_int_Variable) == 0x000010, "Member 'WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge, CallFunc_Conv_IntToText_ReturnValue) == 0x000018, "Member 'WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge, K2Node_MakeArray_Array) == 0x000028, "Member 'WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge, K2Node_MakeArray_Array_1) == 0x000038, "Member 'WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge, K2Node_MakeArray_Array_2) == 0x000048, "Member 'WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge, CallFunc_PlayAnimation_ReturnValue) == 0x000058, "Member 'WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge, CallFunc_PlayAnimation_ReturnValue_1) == 0x000060, "Member 'WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge, K2Node_Event_Animation) == 0x000068, "Member 'WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge, CallFunc_Array_Get_Item) == 0x000070, "Member 'WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000078, "Member 'WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge, CallFunc_Array_Length_ReturnValue) == 0x00007C, "Member 'WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000081, "Member 'WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge, CallFunc_BooleanAND_ReturnValue) == 0x000082, "Member 'WBP_UniqueMechanic_Charge_C_ExecuteUbergraph_WBP_UniqueMechanic_Charge::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_UniqueMechanic_Charge.WBP_UniqueMechanic_Charge_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct WBP_UniqueMechanic_Charge_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UniqueMechanic_Charge_C_OnAnimationFinished) == 0x000008, "Wrong alignment on WBP_UniqueMechanic_Charge_C_OnAnimationFinished");
static_assert(sizeof(WBP_UniqueMechanic_Charge_C_OnAnimationFinished) == 0x000008, "Wrong size on WBP_UniqueMechanic_Charge_C_OnAnimationFinished");
static_assert(offsetof(WBP_UniqueMechanic_Charge_C_OnAnimationFinished, Animation) == 0x000000, "Member 'WBP_UniqueMechanic_Charge_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function WBP_UniqueMechanic_Charge.WBP_UniqueMechanic_Charge_C.UpdateChargeUI
// 0x0190 (0x0190 - 0x0000)
struct WBP_UniqueMechanic_Charge_C_UpdateChargeUI final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PreviousValue;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0038(0x0014)()
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0050(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             K2Node_DynamicCast_AsText;                         // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlay*                               CallFunc_Array_Get_Item_1;                         // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_1;             // 0x0098(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_2;                         // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 K2Node_DynamicCast_AsImage;                        // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00D0(0x0010)()
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x00E8(0x0010)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0100(0x0010)()
	bool                                          Temp_bool_Variable_1;                              // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_1;                           // 0x0120(0x0010)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               CallFunc_Array_Get_Item_3;                         // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_2;                           // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0174(0x0014)()
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UniqueMechanic_Charge_C_UpdateChargeUI) == 0x000008, "Wrong alignment on WBP_UniqueMechanic_Charge_C_UpdateChargeUI");
static_assert(sizeof(WBP_UniqueMechanic_Charge_C_UpdateChargeUI) == 0x000190, "Wrong size on WBP_UniqueMechanic_Charge_C_UpdateChargeUI");
static_assert(offsetof(WBP_UniqueMechanic_Charge_C_UpdateChargeUI, NewValue) == 0x000000, "Member 'WBP_UniqueMechanic_Charge_C_UpdateChargeUI::NewValue' has a wrong offset!");
static_assert(offsetof(WBP_UniqueMechanic_Charge_C_UpdateChargeUI, PreviousValue) == 0x000004, "Member 'WBP_UniqueMechanic_Charge_C_UpdateChargeUI::PreviousValue' has a wrong offset!");
static_assert(offsetof(WBP_UniqueMechanic_Charge_C_UpdateChargeUI, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'WBP_UniqueMechanic_Charge_C_UpdateChargeUI::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
