#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FullScreenNotification_Generic

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_FullScreenNotification_Generic.WBP_FullScreenNotification_Generic_C
// 0x0070 (0x04A0 - 0x0430)
class UWBP_FullScreenNotification_Generic_C : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_ShowText;                                     // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_ShowPrompt;                                   // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_GM_PromptGeneric_C*                ConfirmPromptBase;                                 // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   FX_PetalText;                                      // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   FX_Smoke;                                          // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   FX_Smoke_1;                                        // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WrappingText_C*                    NotificationDescription;                           // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WrappingText_C*                    NotificationHeader;                                // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_PostProcessGradient_C*              GradientPostProcess;                               // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnNotificationEnded;                               // 0x0480(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FDataTableRowHandle                    Sound_Event_Data;                                  // 0x0490(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void BndEvt__WBP_FullScreenNotification_Generic_ConfirmPrompt_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void LoadNotification(class UBP_DataAsset_FullscreenNotification_C* NotificationData);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void PreConstruct(bool IsDesignTime);
	void ShowConfirmPrompt();
	void ExecuteUbergraph_WBP_FullScreenNotification_Generic(int32 EntryPoint);
	void SequenceEvent__ENTRYPOINTWBP_FullScreenNotification_Generic_1(class UNiagaraSystemWidget* FX_Smoke_0);
	void SequenceEvent__ENTRYPOINTWBP_FullScreenNotification_Generic_0(class UNiagaraSystemWidget* FX_Smoke_0);
	void SequenceEvent__ENTRYPOINTWBP_FullScreenNotification_Generic(class UNiagaraSystemWidget* FX_Petals);
	void FX_Petals_Event(class UNiagaraSystemWidget* FX_Petals);
	void FX_Smoke_Event(class UNiagaraSystemWidget* FX_Smoke_0);
	void FX_Smoke_Event_0(class UNiagaraSystemWidget* FX_Smoke_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_FullScreenNotification_Generic_C">();
	}
	static class UWBP_FullScreenNotification_Generic_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_FullScreenNotification_Generic_C>();
	}
};
static_assert(alignof(UWBP_FullScreenNotification_Generic_C) == 0x000008, "Wrong alignment on UWBP_FullScreenNotification_Generic_C");
static_assert(sizeof(UWBP_FullScreenNotification_Generic_C) == 0x0004A0, "Wrong size on UWBP_FullScreenNotification_Generic_C");
static_assert(offsetof(UWBP_FullScreenNotification_Generic_C, UberGraphFrame) == 0x000430, "Member 'UWBP_FullScreenNotification_Generic_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenNotification_Generic_C, Anim_ShowText) == 0x000438, "Member 'UWBP_FullScreenNotification_Generic_C::Anim_ShowText' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenNotification_Generic_C, Anim_ShowPrompt) == 0x000440, "Member 'UWBP_FullScreenNotification_Generic_C::Anim_ShowPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenNotification_Generic_C, ConfirmPromptBase) == 0x000448, "Member 'UWBP_FullScreenNotification_Generic_C::ConfirmPromptBase' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenNotification_Generic_C, FX_PetalText) == 0x000450, "Member 'UWBP_FullScreenNotification_Generic_C::FX_PetalText' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenNotification_Generic_C, FX_Smoke) == 0x000458, "Member 'UWBP_FullScreenNotification_Generic_C::FX_Smoke' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenNotification_Generic_C, FX_Smoke_1) == 0x000460, "Member 'UWBP_FullScreenNotification_Generic_C::FX_Smoke_1' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenNotification_Generic_C, NotificationDescription) == 0x000468, "Member 'UWBP_FullScreenNotification_Generic_C::NotificationDescription' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenNotification_Generic_C, NotificationHeader) == 0x000470, "Member 'UWBP_FullScreenNotification_Generic_C::NotificationHeader' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenNotification_Generic_C, GradientPostProcess) == 0x000478, "Member 'UWBP_FullScreenNotification_Generic_C::GradientPostProcess' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenNotification_Generic_C, OnNotificationEnded) == 0x000480, "Member 'UWBP_FullScreenNotification_Generic_C::OnNotificationEnded' has a wrong offset!");
static_assert(offsetof(UWBP_FullScreenNotification_Generic_C, Sound_Event_Data) == 0x000490, "Member 'UWBP_FullScreenNotification_Generic_C::Sound_Event_Data' has a wrong offset!");

}

