#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BattleStats_Box

#include "Basic.hpp"

#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BattleStats_Box.WBP_BattleStats_Box_C
// 0x0030 (0x0338 - 0x0308)
class UWBP_BattleStats_Box_C final : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                       DmgDealt;                                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       DmgReceived;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       HighestDmg;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SuccessDodges;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SuccessParries;                                    // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Time;                                              // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void LoadBattleSummaryStats(const struct FS_BattleSummaryStats& BattleSummaryStats);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BattleStats_Box_C">();
	}
	static class UWBP_BattleStats_Box_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BattleStats_Box_C>();
	}
};
static_assert(alignof(UWBP_BattleStats_Box_C) == 0x000008, "Wrong alignment on UWBP_BattleStats_Box_C");
static_assert(sizeof(UWBP_BattleStats_Box_C) == 0x000338, "Wrong size on UWBP_BattleStats_Box_C");
static_assert(offsetof(UWBP_BattleStats_Box_C, DmgDealt) == 0x000308, "Member 'UWBP_BattleStats_Box_C::DmgDealt' has a wrong offset!");
static_assert(offsetof(UWBP_BattleStats_Box_C, DmgReceived) == 0x000310, "Member 'UWBP_BattleStats_Box_C::DmgReceived' has a wrong offset!");
static_assert(offsetof(UWBP_BattleStats_Box_C, HighestDmg) == 0x000318, "Member 'UWBP_BattleStats_Box_C::HighestDmg' has a wrong offset!");
static_assert(offsetof(UWBP_BattleStats_Box_C, SuccessDodges) == 0x000320, "Member 'UWBP_BattleStats_Box_C::SuccessDodges' has a wrong offset!");
static_assert(offsetof(UWBP_BattleStats_Box_C, SuccessParries) == 0x000328, "Member 'UWBP_BattleStats_Box_C::SuccessParries' has a wrong offset!");
static_assert(offsetof(UWBP_BattleStats_Box_C, Time) == 0x000330, "Member 'UWBP_BattleStats_Box_C::Time' has a wrong offset!");

}

