#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Dialogue_ChoiceOption

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Dialogue_ChoiceOption.WBP_Dialogue_ChoiceOption_C
// 0x0070 (0x1610 - 0x15A0)
class UWBP_Dialogue_ChoiceOption_C final : public UCommonButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x15A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_dotList;                                     // 0x15A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BackgroundDialog_C*                WBP_BackgroundDialog;                              // 0x15B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SF_RichTextBlock_C*                WBP_SF_RichTextBlock_OptionText;                   // 0x15B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ChoiceText;                                        // 0x15C0(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	TMulticastInlineDelegate<void(class UWBP_Dialogue_ChoiceOption_C* ChoiceOptionWidget)> OnChoiceClicked; // 0x15D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsRegistered;                                      // 0x15E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15E1[0x7];                                     // 0x15E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UWBP_Dialogue_ChoiceOption_C* ChoiceOptionWidget)> OnChoiceHovered; // 0x15E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FDataTableRowHandle                    SDNavigate;                                        // 0x15F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void BP_OnFocusLost();
	void BP_OnFocusReceived();
	void BP_OnHovered();
	void BP_OnPressed();
	void BP_OnUnhovered();
	void Disable();
	void ExecuteUbergraph_WBP_Dialogue_ChoiceOption(int32 EntryPoint);
	void GetTiedObject(class UObject** Object);
	void OnUIAction();
	void OnUINavigationFocus(const class UBP_UINavigationFocusEvent_C* FocusEventBP);
	void OnUINavigationFocusLost();
	void PreConstruct(bool IsDesignTime);
	void SetOptionTextColor(bool bIsEnabled_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Dialogue_ChoiceOption_C">();
	}
	static class UWBP_Dialogue_ChoiceOption_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Dialogue_ChoiceOption_C>();
	}
};
static_assert(alignof(UWBP_Dialogue_ChoiceOption_C) == 0x000010, "Wrong alignment on UWBP_Dialogue_ChoiceOption_C");
static_assert(sizeof(UWBP_Dialogue_ChoiceOption_C) == 0x001610, "Wrong size on UWBP_Dialogue_ChoiceOption_C");
static_assert(offsetof(UWBP_Dialogue_ChoiceOption_C, UberGraphFrame) == 0x0015A0, "Member 'UWBP_Dialogue_ChoiceOption_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Dialogue_ChoiceOption_C, Image_dotList) == 0x0015A8, "Member 'UWBP_Dialogue_ChoiceOption_C::Image_dotList' has a wrong offset!");
static_assert(offsetof(UWBP_Dialogue_ChoiceOption_C, WBP_BackgroundDialog) == 0x0015B0, "Member 'UWBP_Dialogue_ChoiceOption_C::WBP_BackgroundDialog' has a wrong offset!");
static_assert(offsetof(UWBP_Dialogue_ChoiceOption_C, WBP_SF_RichTextBlock_OptionText) == 0x0015B8, "Member 'UWBP_Dialogue_ChoiceOption_C::WBP_SF_RichTextBlock_OptionText' has a wrong offset!");
static_assert(offsetof(UWBP_Dialogue_ChoiceOption_C, ChoiceText) == 0x0015C0, "Member 'UWBP_Dialogue_ChoiceOption_C::ChoiceText' has a wrong offset!");
static_assert(offsetof(UWBP_Dialogue_ChoiceOption_C, OnChoiceClicked) == 0x0015D0, "Member 'UWBP_Dialogue_ChoiceOption_C::OnChoiceClicked' has a wrong offset!");
static_assert(offsetof(UWBP_Dialogue_ChoiceOption_C, IsRegistered) == 0x0015E0, "Member 'UWBP_Dialogue_ChoiceOption_C::IsRegistered' has a wrong offset!");
static_assert(offsetof(UWBP_Dialogue_ChoiceOption_C, OnChoiceHovered) == 0x0015E8, "Member 'UWBP_Dialogue_ChoiceOption_C::OnChoiceHovered' has a wrong offset!");
static_assert(offsetof(UWBP_Dialogue_ChoiceOption_C, SDNavigate) == 0x0015F8, "Member 'UWBP_Dialogue_ChoiceOption_C::SDNavigate' has a wrong offset!");

}

