#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_QA_EditorOverlay

#include "Basic.hpp"

#include "ECharacterTeamSelector_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "EBattleEndResult_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_QA_EditorOverlay.WBP_QA_EditorOverlay_C
// 0x0068 (0x0348 - 0x02E0)
class UWBP_QA_EditorOverlay_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UProgressBar*                           ProgressBar_97;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_BuildType;                               // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Counter;                                 // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_MemoryState;                             // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Quality;                                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_SaveManagerDebugState;                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Version;                                 // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Loading;                               // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 SavePresetName;                                    // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UBP_LoadingSystemComponent_C*           BattleLoadingSystem;                               // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CVar_HideDebugOverlay;                             // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ComputeSaveManagerDebugData(class FText* DebugString, struct FSlateColor* Color);
	void Construct();
	void CustomEvent(bool NewValue);
	void ExecuteUbergraph_WBP_QA_EditorOverlay(int32 EntryPoint);
	void OnCvarChanged_LoadDebugSave(const class FString& NewValue);
	void OnQualitySettingCvarChanged(int32 NewValue);
	void PreConstruct(bool IsDesignTime);
	bool ShouldDisplaySaveManagerDebug();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateSaveManagerWidgetData();

	void DrawDebugTextWithOutline(struct FPaintContext& Context, const class FText& Text, const struct FVector2D& position, double SizeOverride, class UFont* FontOverride) const;
	double EvaluateCurrentFPS() const;
	class FText GetOverlayDebugText() const;
	void OnPaint(struct FPaintContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_QA_EditorOverlay_C">();
	}
	static class UWBP_QA_EditorOverlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_QA_EditorOverlay_C>();
	}
};
static_assert(alignof(UWBP_QA_EditorOverlay_C) == 0x000008, "Wrong alignment on UWBP_QA_EditorOverlay_C");
static_assert(sizeof(UWBP_QA_EditorOverlay_C) == 0x000348, "Wrong size on UWBP_QA_EditorOverlay_C");
static_assert(offsetof(UWBP_QA_EditorOverlay_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_QA_EditorOverlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_QA_EditorOverlay_C, ProgressBar_97) == 0x0002E8, "Member 'UWBP_QA_EditorOverlay_C::ProgressBar_97' has a wrong offset!");
static_assert(offsetof(UWBP_QA_EditorOverlay_C, TextBlock_BuildType) == 0x0002F0, "Member 'UWBP_QA_EditorOverlay_C::TextBlock_BuildType' has a wrong offset!");
static_assert(offsetof(UWBP_QA_EditorOverlay_C, TextBlock_Counter) == 0x0002F8, "Member 'UWBP_QA_EditorOverlay_C::TextBlock_Counter' has a wrong offset!");
static_assert(offsetof(UWBP_QA_EditorOverlay_C, TextBlock_MemoryState) == 0x000300, "Member 'UWBP_QA_EditorOverlay_C::TextBlock_MemoryState' has a wrong offset!");
static_assert(offsetof(UWBP_QA_EditorOverlay_C, TextBlock_Quality) == 0x000308, "Member 'UWBP_QA_EditorOverlay_C::TextBlock_Quality' has a wrong offset!");
static_assert(offsetof(UWBP_QA_EditorOverlay_C, TextBlock_SaveManagerDebugState) == 0x000310, "Member 'UWBP_QA_EditorOverlay_C::TextBlock_SaveManagerDebugState' has a wrong offset!");
static_assert(offsetof(UWBP_QA_EditorOverlay_C, TextBlock_Version) == 0x000318, "Member 'UWBP_QA_EditorOverlay_C::TextBlock_Version' has a wrong offset!");
static_assert(offsetof(UWBP_QA_EditorOverlay_C, VerticalBox_Loading) == 0x000320, "Member 'UWBP_QA_EditorOverlay_C::VerticalBox_Loading' has a wrong offset!");
static_assert(offsetof(UWBP_QA_EditorOverlay_C, SavePresetName) == 0x000328, "Member 'UWBP_QA_EditorOverlay_C::SavePresetName' has a wrong offset!");
static_assert(offsetof(UWBP_QA_EditorOverlay_C, BattleLoadingSystem) == 0x000338, "Member 'UWBP_QA_EditorOverlay_C::BattleLoadingSystem' has a wrong offset!");
static_assert(offsetof(UWBP_QA_EditorOverlay_C, CVar_HideDebugOverlay) == 0x000340, "Member 'UWBP_QA_EditorOverlay_C::CVar_HideDebugOverlay' has a wrong offset!");

}

