#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PassivePopupContainer

#include "Basic.hpp"

#include "FPassiveEffect_structs.hpp"
#include "S_jRPG_Item_StaticData_structs.hpp"


namespace SDK::Params
{

// Function WBP_PassivePopupContainer.WBP_PassivePopupContainer_C.OnNotificationExpired
// 0x0010 (0x0010 - 0x0000)
struct WBP_PassivePopupContainer_C_OnNotificationExpired final
{
public:
	class UWBP_PassiveEffectNotification_C*       Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PassivePopupContainer_C_OnNotificationExpired) == 0x000008, "Wrong alignment on WBP_PassivePopupContainer_C_OnNotificationExpired");
static_assert(sizeof(WBP_PassivePopupContainer_C_OnNotificationExpired) == 0x000010, "Wrong size on WBP_PassivePopupContainer_C_OnNotificationExpired");
static_assert(offsetof(WBP_PassivePopupContainer_C_OnNotificationExpired, Widget) == 0x000000, "Member 'WBP_PassivePopupContainer_C_OnNotificationExpired::Widget' has a wrong offset!");
static_assert(offsetof(WBP_PassivePopupContainer_C_OnNotificationExpired, CallFunc_Map_Remove_ReturnValue) == 0x000008, "Member 'WBP_PassivePopupContainer_C_OnNotificationExpired::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");

// Function WBP_PassivePopupContainer.WBP_PassivePopupContainer_C.AddPassiveEffectNotification
// 0x01D8 (0x01D8 - 0x0000)
struct WBP_PassivePopupContainer_C_AddPassiveEffectNotification final
{
public:
	class FName                                   PassiveID;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_ItemInstance_Gear_Weapon_C*         RelatedWeapon;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFPassiveEffect                        CallFunc_GetPassiveEffectDefinition_PassiveEffect; // 0x0010(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_GetPassiveEffectDefinition_Found;         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_jRPG_Item_StaticData                CallFunc_GetItemStaticData_ItemStaticData;         // 0x0060(0x0130)(ContainsInstancedReference, HasGetValueTypeHash)
	TDelegate<void(class UWBP_PassiveEffectNotification_C* Widget)> K2Node_CreateDelegate_OutputDelegate; // 0x0190(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetUnlockedPassiveEffectsIDs_PassiveEffectIDs; // 0x01A0(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B2[0x6];                                      // 0x01B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PassiveEffectNotification_C*       CallFunc_Map_Find_Value;                           // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C2[0x6];                                      // 0x01C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PassiveEffectNotification_C*       CallFunc_SpawnObject_ReturnValue;                  // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PassivePopupContainer_C_AddPassiveEffectNotification) == 0x000008, "Wrong alignment on WBP_PassivePopupContainer_C_AddPassiveEffectNotification");
static_assert(sizeof(WBP_PassivePopupContainer_C_AddPassiveEffectNotification) == 0x0001D8, "Wrong size on WBP_PassivePopupContainer_C_AddPassiveEffectNotification");
static_assert(offsetof(WBP_PassivePopupContainer_C_AddPassiveEffectNotification, PassiveID) == 0x000000, "Member 'WBP_PassivePopupContainer_C_AddPassiveEffectNotification::PassiveID' has a wrong offset!");
static_assert(offsetof(WBP_PassivePopupContainer_C_AddPassiveEffectNotification, RelatedWeapon) == 0x000008, "Member 'WBP_PassivePopupContainer_C_AddPassiveEffectNotification::RelatedWeapon' has a wrong offset!");
static_assert(offsetof(WBP_PassivePopupContainer_C_AddPassiveEffectNotification, CallFunc_GetPassiveEffectDefinition_PassiveEffect) == 0x000010, "Member 'WBP_PassivePopupContainer_C_AddPassiveEffectNotification::CallFunc_GetPassiveEffectDefinition_PassiveEffect' has a wrong offset!");
static_assert(offsetof(WBP_PassivePopupContainer_C_AddPassiveEffectNotification, CallFunc_GetPassiveEffectDefinition_Found) == 0x000058, "Member 'WBP_PassivePopupContainer_C_AddPassiveEffectNotification::CallFunc_GetPassiveEffectDefinition_Found' has a wrong offset!");
static_assert(offsetof(WBP_PassivePopupContainer_C_AddPassiveEffectNotification, CallFunc_GetItemStaticData_ItemStaticData) == 0x000060, "Member 'WBP_PassivePopupContainer_C_AddPassiveEffectNotification::CallFunc_GetItemStaticData_ItemStaticData' has a wrong offset!");
static_assert(offsetof(WBP_PassivePopupContainer_C_AddPassiveEffectNotification, K2Node_CreateDelegate_OutputDelegate) == 0x000190, "Member 'WBP_PassivePopupContainer_C_AddPassiveEffectNotification::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PassivePopupContainer_C_AddPassiveEffectNotification, CallFunc_GetUnlockedPassiveEffectsIDs_PassiveEffectIDs) == 0x0001A0, "Member 'WBP_PassivePopupContainer_C_AddPassiveEffectNotification::CallFunc_GetUnlockedPassiveEffectsIDs_PassiveEffectIDs' has a wrong offset!");
static_assert(offsetof(WBP_PassivePopupContainer_C_AddPassiveEffectNotification, CallFunc_IsValid_ReturnValue) == 0x0001B0, "Member 'WBP_PassivePopupContainer_C_AddPassiveEffectNotification::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PassivePopupContainer_C_AddPassiveEffectNotification, CallFunc_Array_Contains_ReturnValue) == 0x0001B1, "Member 'WBP_PassivePopupContainer_C_AddPassiveEffectNotification::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PassivePopupContainer_C_AddPassiveEffectNotification, CallFunc_Map_Find_Value) == 0x0001B8, "Member 'WBP_PassivePopupContainer_C_AddPassiveEffectNotification::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_PassivePopupContainer_C_AddPassiveEffectNotification, CallFunc_Map_Find_ReturnValue) == 0x0001C0, "Member 'WBP_PassivePopupContainer_C_AddPassiveEffectNotification::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PassivePopupContainer_C_AddPassiveEffectNotification, CallFunc_Not_PreBool_ReturnValue) == 0x0001C1, "Member 'WBP_PassivePopupContainer_C_AddPassiveEffectNotification::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PassivePopupContainer_C_AddPassiveEffectNotification, CallFunc_SpawnObject_ReturnValue) == 0x0001C8, "Member 'WBP_PassivePopupContainer_C_AddPassiveEffectNotification::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PassivePopupContainer_C_AddPassiveEffectNotification, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x0001D0, "Member 'WBP_PassivePopupContainer_C_AddPassiveEffectNotification::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

// Function WBP_PassivePopupContainer.WBP_PassivePopupContainer_C.AddBuffNotification
// 0x0008 (0x0008 - 0x0000)
struct WBP_PassivePopupContainer_C_AddBuffNotification final
{
public:
	class UBP_BattleBuffInstance_C*               BuffInstance;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PassivePopupContainer_C_AddBuffNotification) == 0x000008, "Wrong alignment on WBP_PassivePopupContainer_C_AddBuffNotification");
static_assert(sizeof(WBP_PassivePopupContainer_C_AddBuffNotification) == 0x000008, "Wrong size on WBP_PassivePopupContainer_C_AddBuffNotification");
static_assert(offsetof(WBP_PassivePopupContainer_C_AddBuffNotification, BuffInstance) == 0x000000, "Member 'WBP_PassivePopupContainer_C_AddBuffNotification::BuffInstance' has a wrong offset!");

// Function WBP_PassivePopupContainer.WBP_PassivePopupContainer_C.ExecuteUbergraph_WBP_PassivePopupContainer
// 0x0080 (0x0080 - 0x0000)
struct WBP_PassivePopupContainer_C_ExecuteUbergraph_WBP_PassivePopupContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_BattleBuffInstance_C*               K2Node_CustomEvent_BuffInstance;                   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFPassiveEffect                        CallFunc_GetPassiveFromBuff_PassiveEffect;         // 0x0010(0x0048)(HasGetValueTypeHash)
	class FName                                   CallFunc_GetPassiveFromBuff_PassiveID;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPassiveFromBuff_Found;                 // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_CharacterData_C*                    CallFunc_GetCharacterData_CharacterData;           // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEquippedWeaponItemInstance_Valid;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ItemInstance_Gear_Weapon_C*         CallFunc_GetEquippedWeaponItemInstance_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PassivePopupContainer_C_ExecuteUbergraph_WBP_PassivePopupContainer) == 0x000008, "Wrong alignment on WBP_PassivePopupContainer_C_ExecuteUbergraph_WBP_PassivePopupContainer");
static_assert(sizeof(WBP_PassivePopupContainer_C_ExecuteUbergraph_WBP_PassivePopupContainer) == 0x000080, "Wrong size on WBP_PassivePopupContainer_C_ExecuteUbergraph_WBP_PassivePopupContainer");
static_assert(offsetof(WBP_PassivePopupContainer_C_ExecuteUbergraph_WBP_PassivePopupContainer, EntryPoint) == 0x000000, "Member 'WBP_PassivePopupContainer_C_ExecuteUbergraph_WBP_PassivePopupContainer::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PassivePopupContainer_C_ExecuteUbergraph_WBP_PassivePopupContainer, K2Node_CustomEvent_BuffInstance) == 0x000008, "Member 'WBP_PassivePopupContainer_C_ExecuteUbergraph_WBP_PassivePopupContainer::K2Node_CustomEvent_BuffInstance' has a wrong offset!");
static_assert(offsetof(WBP_PassivePopupContainer_C_ExecuteUbergraph_WBP_PassivePopupContainer, CallFunc_GetPassiveFromBuff_PassiveEffect) == 0x000010, "Member 'WBP_PassivePopupContainer_C_ExecuteUbergraph_WBP_PassivePopupContainer::CallFunc_GetPassiveFromBuff_PassiveEffect' has a wrong offset!");
static_assert(offsetof(WBP_PassivePopupContainer_C_ExecuteUbergraph_WBP_PassivePopupContainer, CallFunc_GetPassiveFromBuff_PassiveID) == 0x000058, "Member 'WBP_PassivePopupContainer_C_ExecuteUbergraph_WBP_PassivePopupContainer::CallFunc_GetPassiveFromBuff_PassiveID' has a wrong offset!");
static_assert(offsetof(WBP_PassivePopupContainer_C_ExecuteUbergraph_WBP_PassivePopupContainer, CallFunc_GetPassiveFromBuff_Found) == 0x000060, "Member 'WBP_PassivePopupContainer_C_ExecuteUbergraph_WBP_PassivePopupContainer::CallFunc_GetPassiveFromBuff_Found' has a wrong offset!");
static_assert(offsetof(WBP_PassivePopupContainer_C_ExecuteUbergraph_WBP_PassivePopupContainer, CallFunc_GetCharacterData_CharacterData) == 0x000068, "Member 'WBP_PassivePopupContainer_C_ExecuteUbergraph_WBP_PassivePopupContainer::CallFunc_GetCharacterData_CharacterData' has a wrong offset!");
static_assert(offsetof(WBP_PassivePopupContainer_C_ExecuteUbergraph_WBP_PassivePopupContainer, CallFunc_GetEquippedWeaponItemInstance_Valid) == 0x000070, "Member 'WBP_PassivePopupContainer_C_ExecuteUbergraph_WBP_PassivePopupContainer::CallFunc_GetEquippedWeaponItemInstance_Valid' has a wrong offset!");
static_assert(offsetof(WBP_PassivePopupContainer_C_ExecuteUbergraph_WBP_PassivePopupContainer, CallFunc_GetEquippedWeaponItemInstance_ReturnValue) == 0x000078, "Member 'WBP_PassivePopupContainer_C_ExecuteUbergraph_WBP_PassivePopupContainer::CallFunc_GetEquippedWeaponItemInstance_ReturnValue' has a wrong offset!");

}

