#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SortDropdown

#include "Basic.hpp"

#include "S_SortDropdownEntry_structs.hpp"
#include "BlueprintSorting_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_SortDropdown.WBP_SortDropdown_C.CREATEDELEGATE_PROXYFUNCTION_0
// 0x0018 (0x0018 - 0x0000)
struct WBP_SortDropdown_C_CREATEDELEGATE_PROXYFUNCTION_0 final
{
public:
	struct FS_SortDropdownEntry                   SortDropdownEntry;                                 // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SortDropdown_C_CREATEDELEGATE_PROXYFUNCTION_0) == 0x000008, "Wrong alignment on WBP_SortDropdown_C_CREATEDELEGATE_PROXYFUNCTION_0");
static_assert(sizeof(WBP_SortDropdown_C_CREATEDELEGATE_PROXYFUNCTION_0) == 0x000018, "Wrong size on WBP_SortDropdown_C_CREATEDELEGATE_PROXYFUNCTION_0");
static_assert(offsetof(WBP_SortDropdown_C_CREATEDELEGATE_PROXYFUNCTION_0, SortDropdownEntry) == 0x000000, "Member 'WBP_SortDropdown_C_CREATEDELEGATE_PROXYFUNCTION_0::SortDropdownEntry' has a wrong offset!");

// Function WBP_SortDropdown.WBP_SortDropdown_C.GetSortDirection
// 0x0001 (0x0001 - 0x0000)
struct WBP_SortDropdown_C_GetSortDirection final
{
public:
	ESortDirection                                SortDirection_0;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SortDropdown_C_GetSortDirection) == 0x000001, "Wrong alignment on WBP_SortDropdown_C_GetSortDirection");
static_assert(sizeof(WBP_SortDropdown_C_GetSortDirection) == 0x000001, "Wrong size on WBP_SortDropdown_C_GetSortDirection");
static_assert(offsetof(WBP_SortDropdown_C_GetSortDirection, SortDirection_0) == 0x000000, "Member 'WBP_SortDropdown_C_GetSortDirection::SortDirection_0' has a wrong offset!");

// Function WBP_SortDropdown.WBP_SortDropdown_C.ToggleSortDirection
// 0x0040 (0x0040 - 0x0000)
struct WBP_SortDropdown_C_ToggleSortDirection final
{
public:
	ESortDirection                                Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0018(0x0010)()
	class FText                                   K2Node_Select_Default;                             // 0x0028(0x0010)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SortDropdown_C_ToggleSortDirection) == 0x000008, "Wrong alignment on WBP_SortDropdown_C_ToggleSortDirection");
static_assert(sizeof(WBP_SortDropdown_C_ToggleSortDirection) == 0x000040, "Wrong size on WBP_SortDropdown_C_ToggleSortDirection");
static_assert(offsetof(WBP_SortDropdown_C_ToggleSortDirection, Temp_byte_Variable) == 0x000000, "Member 'WBP_SortDropdown_C_ToggleSortDirection::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_ToggleSortDirection, Temp_text_Variable) == 0x000008, "Member 'WBP_SortDropdown_C_ToggleSortDirection::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_ToggleSortDirection, Temp_text_Variable_1) == 0x000018, "Member 'WBP_SortDropdown_C_ToggleSortDirection::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_ToggleSortDirection, K2Node_Select_Default) == 0x000028, "Member 'WBP_SortDropdown_C_ToggleSortDirection::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_ToggleSortDirection, K2Node_SwitchEnum_CmpSuccess) == 0x000038, "Member 'WBP_SortDropdown_C_ToggleSortDirection::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_SortDropdown.WBP_SortDropdown_C.SetActiveDropdownEntry
// 0x0078 (0x0078 - 0x0000)
struct WBP_SortDropdown_C_SetActiveDropdownEntry final
{
public:
	struct FS_SortDropdownEntry                   InSortDropdownEntry;                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    CallFunc_GetAllEntries_ReturnValue;                // 0x0028(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SortDropdownEntry_C*               K2Node_DynamicCast_AsWBP_Sort_Dropdown_Entry;      // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_SortDropdownEntry                   CallFunc_GetSortDropdownEntry_SortDropdownEntry;   // 0x0058(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SortDropdown_C_SetActiveDropdownEntry) == 0x000008, "Wrong alignment on WBP_SortDropdown_C_SetActiveDropdownEntry");
static_assert(sizeof(WBP_SortDropdown_C_SetActiveDropdownEntry) == 0x000078, "Wrong size on WBP_SortDropdown_C_SetActiveDropdownEntry");
static_assert(offsetof(WBP_SortDropdown_C_SetActiveDropdownEntry, InSortDropdownEntry) == 0x000000, "Member 'WBP_SortDropdown_C_SetActiveDropdownEntry::InSortDropdownEntry' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_SetActiveDropdownEntry, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WBP_SortDropdown_C_SetActiveDropdownEntry::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_SetActiveDropdownEntry, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'WBP_SortDropdown_C_SetActiveDropdownEntry::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_SetActiveDropdownEntry, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WBP_SortDropdown_C_SetActiveDropdownEntry::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_SetActiveDropdownEntry, CallFunc_GetAllEntries_ReturnValue) == 0x000028, "Member 'WBP_SortDropdown_C_SetActiveDropdownEntry::CallFunc_GetAllEntries_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_SetActiveDropdownEntry, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_SortDropdown_C_SetActiveDropdownEntry::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_SetActiveDropdownEntry, K2Node_DynamicCast_AsWBP_Sort_Dropdown_Entry) == 0x000040, "Member 'WBP_SortDropdown_C_SetActiveDropdownEntry::K2Node_DynamicCast_AsWBP_Sort_Dropdown_Entry' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_SetActiveDropdownEntry, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_SortDropdown_C_SetActiveDropdownEntry::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_SetActiveDropdownEntry, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'WBP_SortDropdown_C_SetActiveDropdownEntry::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_SetActiveDropdownEntry, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'WBP_SortDropdown_C_SetActiveDropdownEntry::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_SetActiveDropdownEntry, CallFunc_GetSortDropdownEntry_SortDropdownEntry) == 0x000058, "Member 'WBP_SortDropdown_C_SetActiveDropdownEntry::CallFunc_GetSortDropdownEntry_SortDropdownEntry' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_SetActiveDropdownEntry, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000070, "Member 'WBP_SortDropdown_C_SetActiveDropdownEntry::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function WBP_SortDropdown.WBP_SortDropdown_C.GetActiveDropdownEntry
// 0x0018 (0x0018 - 0x0000)
struct WBP_SortDropdown_C_GetActiveDropdownEntry final
{
public:
	struct FS_SortDropdownEntry                   ActiveDropdownEntry_0;                             // 0x0000(0x0018)(Parm, OutParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SortDropdown_C_GetActiveDropdownEntry) == 0x000008, "Wrong alignment on WBP_SortDropdown_C_GetActiveDropdownEntry");
static_assert(sizeof(WBP_SortDropdown_C_GetActiveDropdownEntry) == 0x000018, "Wrong size on WBP_SortDropdown_C_GetActiveDropdownEntry");
static_assert(offsetof(WBP_SortDropdown_C_GetActiveDropdownEntry, ActiveDropdownEntry_0) == 0x000000, "Member 'WBP_SortDropdown_C_GetActiveDropdownEntry::ActiveDropdownEntry_0' has a wrong offset!");

// Function WBP_SortDropdown.WBP_SortDropdown_C.InitializeDropdownEntries
// 0x0048 (0x0048 - 0x0000)
struct WBP_SortDropdown_C_InitializeDropdownEntries final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FS_SortDropdownEntry& SortDropdownEntry)> K2Node_CreateDelegate_OutputDelegate; // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_SortDropdownEntry                   CallFunc_Array_Get_Item;                           // 0x0020(0x0018)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SortDropdownEntry_C*               CallFunc_BP_CreateEntryOfClass_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SortDropdown_C_InitializeDropdownEntries) == 0x000008, "Wrong alignment on WBP_SortDropdown_C_InitializeDropdownEntries");
static_assert(sizeof(WBP_SortDropdown_C_InitializeDropdownEntries) == 0x000048, "Wrong size on WBP_SortDropdown_C_InitializeDropdownEntries");
static_assert(offsetof(WBP_SortDropdown_C_InitializeDropdownEntries, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_SortDropdown_C_InitializeDropdownEntries::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_InitializeDropdownEntries, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_SortDropdown_C_InitializeDropdownEntries::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_InitializeDropdownEntries, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_SortDropdown_C_InitializeDropdownEntries::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_InitializeDropdownEntries, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'WBP_SortDropdown_C_InitializeDropdownEntries::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_InitializeDropdownEntries, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_SortDropdown_C_InitializeDropdownEntries::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_InitializeDropdownEntries, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WBP_SortDropdown_C_InitializeDropdownEntries::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_InitializeDropdownEntries, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_SortDropdown_C_InitializeDropdownEntries::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_InitializeDropdownEntries, CallFunc_BP_CreateEntryOfClass_ReturnValue) == 0x000040, "Member 'WBP_SortDropdown_C_InitializeDropdownEntries::CallFunc_BP_CreateEntryOfClass_ReturnValue' has a wrong offset!");

// Function WBP_SortDropdown.WBP_SortDropdown_C.BndEvt__WBP_SortDropdown_HeaderButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SortDropdown_C_BndEvt__WBP_SortDropdown_HeaderButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SortDropdown_C_BndEvt__WBP_SortDropdown_HeaderButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SortDropdown_C_BndEvt__WBP_SortDropdown_HeaderButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_SortDropdown_C_BndEvt__WBP_SortDropdown_HeaderButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SortDropdown_C_BndEvt__WBP_SortDropdown_HeaderButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_SortDropdown_C_BndEvt__WBP_SortDropdown_HeaderButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_SortDropdown_C_BndEvt__WBP_SortDropdown_HeaderButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SortDropdown.WBP_SortDropdown_C.BndEvt__WBP_SortDropdown_FocusHandler_K2Node_ComponentBoundEvent_3_OnButtonBaseFocused__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SortDropdown_C_BndEvt__WBP_SortDropdown_FocusHandler_K2Node_ComponentBoundEvent_3_OnButtonBaseFocused__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SortDropdown_C_BndEvt__WBP_SortDropdown_FocusHandler_K2Node_ComponentBoundEvent_3_OnButtonBaseFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SortDropdown_C_BndEvt__WBP_SortDropdown_FocusHandler_K2Node_ComponentBoundEvent_3_OnButtonBaseFocused__DelegateSignature");
static_assert(sizeof(WBP_SortDropdown_C_BndEvt__WBP_SortDropdown_FocusHandler_K2Node_ComponentBoundEvent_3_OnButtonBaseFocused__DelegateSignature) == 0x000008, "Wrong size on WBP_SortDropdown_C_BndEvt__WBP_SortDropdown_FocusHandler_K2Node_ComponentBoundEvent_3_OnButtonBaseFocused__DelegateSignature");
static_assert(offsetof(WBP_SortDropdown_C_BndEvt__WBP_SortDropdown_FocusHandler_K2Node_ComponentBoundEvent_3_OnButtonBaseFocused__DelegateSignature, Button) == 0x000000, "Member 'WBP_SortDropdown_C_BndEvt__WBP_SortDropdown_FocusHandler_K2Node_ComponentBoundEvent_3_OnButtonBaseFocused__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SortDropdown.WBP_SortDropdown_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct WBP_SortDropdown_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_SortDropdown_C_OnMouseLeave) == 0x000008, "Wrong alignment on WBP_SortDropdown_C_OnMouseLeave");
static_assert(sizeof(WBP_SortDropdown_C_OnMouseLeave) == 0x000078, "Wrong size on WBP_SortDropdown_C_OnMouseLeave");
static_assert(offsetof(WBP_SortDropdown_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'WBP_SortDropdown_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function WBP_SortDropdown.WBP_SortDropdown_C.BndEvt__WBP_SortDropdown_FocusAndDirectionHandler_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SortDropdown_C_BndEvt__WBP_SortDropdown_FocusAndDirectionHandler_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SortDropdown_C_BndEvt__WBP_SortDropdown_FocusAndDirectionHandler_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SortDropdown_C_BndEvt__WBP_SortDropdown_FocusAndDirectionHandler_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_SortDropdown_C_BndEvt__WBP_SortDropdown_FocusAndDirectionHandler_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SortDropdown_C_BndEvt__WBP_SortDropdown_FocusAndDirectionHandler_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_SortDropdown_C_BndEvt__WBP_SortDropdown_FocusAndDirectionHandler_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_SortDropdown_C_BndEvt__WBP_SortDropdown_FocusAndDirectionHandler_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SortDropdown.WBP_SortDropdown_C.BndEvt__WBP_SortDropdown_HeaderButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_SortDropdown_C_BndEvt__WBP_SortDropdown_HeaderButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Selected;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SortDropdown_C_BndEvt__WBP_SortDropdown_HeaderButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SortDropdown_C_BndEvt__WBP_SortDropdown_HeaderButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature");
static_assert(sizeof(WBP_SortDropdown_C_BndEvt__WBP_SortDropdown_HeaderButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature) == 0x000010, "Wrong size on WBP_SortDropdown_C_BndEvt__WBP_SortDropdown_HeaderButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature");
static_assert(offsetof(WBP_SortDropdown_C_BndEvt__WBP_SortDropdown_HeaderButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature, Button) == 0x000000, "Member 'WBP_SortDropdown_C_BndEvt__WBP_SortDropdown_HeaderButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_BndEvt__WBP_SortDropdown_HeaderButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature, Selected) == 0x000008, "Member 'WBP_SortDropdown_C_BndEvt__WBP_SortDropdown_HeaderButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature::Selected' has a wrong offset!");

// Function WBP_SortDropdown.WBP_SortDropdown_C.ExecuteUbergraph_WBP_SortDropdown
// 0x0140 (0x0140 - 0x0000)
struct WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInGamepadOrKeyboardNavigationMode_ReturnValue; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESortDirection                                Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputMethodActive_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0030(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0040(0x0010)()
	bool                                          Temp_bool_Variable;                                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCommonTextStyle>           Temp_class_Variable;                               // 0x0058(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCommonTextStyle>           Temp_class_Variable_1;                             // 0x0060(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_3;               // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_SortDropdownEntry_C*               CallFunc_GetActiveDropdownEntryWidget_AsWBP_Sort_Dropdown_Entry; // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0088(0x0078)(ConstParm)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Selected;               // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0128(0x0010)()
	TSubclassOf<class UCommonTextStyle>           K2Node_Select_Default_1;                           // 0x0138(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown) == 0x000008, "Wrong alignment on WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown");
static_assert(sizeof(WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown) == 0x000140, "Wrong size on WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown");
static_assert(offsetof(WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown, EntryPoint) == 0x000000, "Member 'WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown, CallFunc_IsInGamepadOrKeyboardNavigationMode_ReturnValue) == 0x000004, "Member 'WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown::CallFunc_IsInGamepadOrKeyboardNavigationMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000020, "Member 'WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown, Temp_byte_Variable) == 0x000028, "Member 'WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown, CallFunc_IsInputMethodActive_ReturnValue) == 0x000029, "Member 'WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown::CallFunc_IsInputMethodActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown, Temp_text_Variable) == 0x000030, "Member 'WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown, Temp_text_Variable_1) == 0x000040, "Member 'WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown, Temp_bool_Variable) == 0x000050, "Member 'WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown, Temp_class_Variable) == 0x000058, "Member 'WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown, Temp_class_Variable_1) == 0x000060, "Member 'WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown, K2Node_ComponentBoundEvent_Button_3) == 0x000068, "Member 'WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown, CallFunc_IsActivated_ReturnValue) == 0x000070, "Member 'WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown::CallFunc_IsActivated_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown, K2Node_ComponentBoundEvent_Button_2) == 0x000078, "Member 'WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown, CallFunc_GetActiveDropdownEntryWidget_AsWBP_Sort_Dropdown_Entry) == 0x000080, "Member 'WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown::CallFunc_GetActiveDropdownEntryWidget_AsWBP_Sort_Dropdown_Entry' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown, K2Node_Event_MouseEvent) == 0x000088, "Member 'WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown, K2Node_ComponentBoundEvent_Button_1) == 0x000100, "Member 'WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000108, "Member 'WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown, CallFunc_PlayAnimationForward_ReturnValue) == 0x000110, "Member 'WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown, K2Node_ComponentBoundEvent_Button) == 0x000118, "Member 'WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown, K2Node_ComponentBoundEvent_Selected) == 0x000120, "Member 'WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown::K2Node_ComponentBoundEvent_Selected' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown, K2Node_Select_Default) == 0x000128, "Member 'WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown, K2Node_Select_Default_1) == 0x000138, "Member 'WBP_SortDropdown_C_ExecuteUbergraph_WBP_SortDropdown::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_SortDropdown.WBP_SortDropdown_C.GetActiveDropdownEntryWidget
// 0x0070 (0x0070 - 0x0000)
struct WBP_SortDropdown_C_GetActiveDropdownEntryWidget final
{
public:
	class UWBP_SortDropdownEntry_C*               AsWBP_Sort_Dropdown_Entry;                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    CallFunc_GetAllEntries_ReturnValue;                // 0x0018(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SortDropdownEntry_C*               K2Node_DynamicCast_AsWBP_Sort_Dropdown_Entry;      // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_SortDropdownEntry                   CallFunc_GetSortDropdownEntry_SortDropdownEntry;   // 0x0050(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SortDropdown_C_GetActiveDropdownEntryWidget) == 0x000008, "Wrong alignment on WBP_SortDropdown_C_GetActiveDropdownEntryWidget");
static_assert(sizeof(WBP_SortDropdown_C_GetActiveDropdownEntryWidget) == 0x000070, "Wrong size on WBP_SortDropdown_C_GetActiveDropdownEntryWidget");
static_assert(offsetof(WBP_SortDropdown_C_GetActiveDropdownEntryWidget, AsWBP_Sort_Dropdown_Entry) == 0x000000, "Member 'WBP_SortDropdown_C_GetActiveDropdownEntryWidget::AsWBP_Sort_Dropdown_Entry' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_GetActiveDropdownEntryWidget, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_SortDropdown_C_GetActiveDropdownEntryWidget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_GetActiveDropdownEntryWidget, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_SortDropdown_C_GetActiveDropdownEntryWidget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_GetActiveDropdownEntryWidget, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_SortDropdown_C_GetActiveDropdownEntryWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_GetActiveDropdownEntryWidget, CallFunc_GetAllEntries_ReturnValue) == 0x000018, "Member 'WBP_SortDropdown_C_GetActiveDropdownEntryWidget::CallFunc_GetAllEntries_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_GetActiveDropdownEntryWidget, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WBP_SortDropdown_C_GetActiveDropdownEntryWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_GetActiveDropdownEntryWidget, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_SortDropdown_C_GetActiveDropdownEntryWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_GetActiveDropdownEntryWidget, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'WBP_SortDropdown_C_GetActiveDropdownEntryWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_GetActiveDropdownEntryWidget, K2Node_DynamicCast_AsWBP_Sort_Dropdown_Entry) == 0x000040, "Member 'WBP_SortDropdown_C_GetActiveDropdownEntryWidget::K2Node_DynamicCast_AsWBP_Sort_Dropdown_Entry' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_GetActiveDropdownEntryWidget, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_SortDropdown_C_GetActiveDropdownEntryWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_GetActiveDropdownEntryWidget, CallFunc_GetSortDropdownEntry_SortDropdownEntry) == 0x000050, "Member 'WBP_SortDropdown_C_GetActiveDropdownEntryWidget::CallFunc_GetSortDropdownEntry_SortDropdownEntry' has a wrong offset!");
static_assert(offsetof(WBP_SortDropdown_C_GetActiveDropdownEntryWidget, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000068, "Member 'WBP_SortDropdown_C_GetActiveDropdownEntryWidget::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function WBP_SortDropdown.WBP_SortDropdown_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_SortDropdown_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SortDropdown_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_SortDropdown_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_SortDropdown_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_SortDropdown_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_SortDropdown_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_SortDropdown_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

