#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ExplorationPrompt

#include "Basic.hpp"

#include "FPromptParams_structs.hpp"


namespace SDK::Params
{

// Function WBP_ExplorationPrompt.WBP_ExplorationPrompt_C.Appear
// 0x0008 (0x0008 - 0x0000)
struct WBP_ExplorationPrompt_C_Appear final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ExplorationPrompt_C_Appear) == 0x000008, "Wrong alignment on WBP_ExplorationPrompt_C_Appear");
static_assert(sizeof(WBP_ExplorationPrompt_C_Appear) == 0x000008, "Wrong size on WBP_ExplorationPrompt_C_Appear");
static_assert(offsetof(WBP_ExplorationPrompt_C_Appear, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_ExplorationPrompt_C_Appear::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_ExplorationPrompt.WBP_ExplorationPrompt_C.BndEvt__WBP_ExplorationPrompt_WBP_ButtonBinding_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ExplorationPrompt_C_BndEvt__WBP_ExplorationPrompt_WBP_ButtonBinding_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature final
{
public:
	class UWBP_ButtonBinding_C*                   PromptWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ExplorationPrompt_C_BndEvt__WBP_ExplorationPrompt_WBP_ButtonBinding_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ExplorationPrompt_C_BndEvt__WBP_ExplorationPrompt_WBP_ButtonBinding_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(sizeof(WBP_ExplorationPrompt_C_BndEvt__WBP_ExplorationPrompt_WBP_ButtonBinding_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000008, "Wrong size on WBP_ExplorationPrompt_C_BndEvt__WBP_ExplorationPrompt_WBP_ButtonBinding_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(offsetof(WBP_ExplorationPrompt_C_BndEvt__WBP_ExplorationPrompt_WBP_ButtonBinding_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature, PromptWidget) == 0x000000, "Member 'WBP_ExplorationPrompt_C_BndEvt__WBP_ExplorationPrompt_WBP_ButtonBinding_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature::PromptWidget' has a wrong offset!");

// Function WBP_ExplorationPrompt.WBP_ExplorationPrompt_C.DestroyPromptAfterAppearAnimation
// 0x0014 (0x0014 - 0x0000)
struct WBP_ExplorationPrompt_C_DestroyPromptAfterAppearAnimation final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ExplorationPrompt_C_DestroyPromptAfterAppearAnimation) == 0x000004, "Wrong alignment on WBP_ExplorationPrompt_C_DestroyPromptAfterAppearAnimation");
static_assert(sizeof(WBP_ExplorationPrompt_C_DestroyPromptAfterAppearAnimation) == 0x000014, "Wrong size on WBP_ExplorationPrompt_C_DestroyPromptAfterAppearAnimation");
static_assert(offsetof(WBP_ExplorationPrompt_C_DestroyPromptAfterAppearAnimation, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_ExplorationPrompt_C_DestroyPromptAfterAppearAnimation::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ExplorationPrompt_C_DestroyPromptAfterAppearAnimation, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'WBP_ExplorationPrompt_C_DestroyPromptAfterAppearAnimation::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_ExplorationPrompt.WBP_ExplorationPrompt_C.ExecuteUbergraph_WBP_ExplorationPrompt
// 0x0058 (0x0058 - 0x0000)
struct WBP_ExplorationPrompt_C_ExecuteUbergraph_WBP_ExplorationPrompt final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_ButtonBinding_C*                   K2Node_ComponentBoundEvent_PromptWidget;           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ExplorationPrompt_C_ExecuteUbergraph_WBP_ExplorationPrompt) == 0x000008, "Wrong alignment on WBP_ExplorationPrompt_C_ExecuteUbergraph_WBP_ExplorationPrompt");
static_assert(sizeof(WBP_ExplorationPrompt_C_ExecuteUbergraph_WBP_ExplorationPrompt) == 0x000058, "Wrong size on WBP_ExplorationPrompt_C_ExecuteUbergraph_WBP_ExplorationPrompt");
static_assert(offsetof(WBP_ExplorationPrompt_C_ExecuteUbergraph_WBP_ExplorationPrompt, EntryPoint) == 0x000000, "Member 'WBP_ExplorationPrompt_C_ExecuteUbergraph_WBP_ExplorationPrompt::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ExplorationPrompt_C_ExecuteUbergraph_WBP_ExplorationPrompt, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_ExplorationPrompt_C_ExecuteUbergraph_WBP_ExplorationPrompt::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ExplorationPrompt_C_ExecuteUbergraph_WBP_ExplorationPrompt, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WBP_ExplorationPrompt_C_ExecuteUbergraph_WBP_ExplorationPrompt::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ExplorationPrompt_C_ExecuteUbergraph_WBP_ExplorationPrompt, CallFunc_PlayAnimation_ReturnValue_2) == 0x000018, "Member 'WBP_ExplorationPrompt_C_ExecuteUbergraph_WBP_ExplorationPrompt::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ExplorationPrompt_C_ExecuteUbergraph_WBP_ExplorationPrompt, K2Node_ComponentBoundEvent_PromptWidget) == 0x000020, "Member 'WBP_ExplorationPrompt_C_ExecuteUbergraph_WBP_ExplorationPrompt::K2Node_ComponentBoundEvent_PromptWidget' has a wrong offset!");
static_assert(offsetof(WBP_ExplorationPrompt_C_ExecuteUbergraph_WBP_ExplorationPrompt, CallFunc_PlayAnimation_ReturnValue_3) == 0x000028, "Member 'WBP_ExplorationPrompt_C_ExecuteUbergraph_WBP_ExplorationPrompt::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ExplorationPrompt_C_ExecuteUbergraph_WBP_ExplorationPrompt, CallFunc_PlayAnimation_ReturnValue_4) == 0x000030, "Member 'WBP_ExplorationPrompt_C_ExecuteUbergraph_WBP_ExplorationPrompt::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_ExplorationPrompt_C_ExecuteUbergraph_WBP_ExplorationPrompt, K2Node_Event_IsDesignTime) == 0x000038, "Member 'WBP_ExplorationPrompt_C_ExecuteUbergraph_WBP_ExplorationPrompt::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ExplorationPrompt_C_ExecuteUbergraph_WBP_ExplorationPrompt, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000039, "Member 'WBP_ExplorationPrompt_C_ExecuteUbergraph_WBP_ExplorationPrompt::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ExplorationPrompt_C_ExecuteUbergraph_WBP_ExplorationPrompt, CallFunc_PlayAnimation_ReturnValue_5) == 0x000040, "Member 'WBP_ExplorationPrompt_C_ExecuteUbergraph_WBP_ExplorationPrompt::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_ExplorationPrompt_C_ExecuteUbergraph_WBP_ExplorationPrompt, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x000048, "Member 'WBP_ExplorationPrompt_C_ExecuteUbergraph_WBP_ExplorationPrompt::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ExplorationPrompt_C_ExecuteUbergraph_WBP_ExplorationPrompt, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x00004C, "Member 'WBP_ExplorationPrompt_C_ExecuteUbergraph_WBP_ExplorationPrompt::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ExplorationPrompt_C_ExecuteUbergraph_WBP_ExplorationPrompt, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000050, "Member 'WBP_ExplorationPrompt_C_ExecuteUbergraph_WBP_ExplorationPrompt::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_ExplorationPrompt.WBP_ExplorationPrompt_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ExplorationPrompt_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ExplorationPrompt_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ExplorationPrompt_C_PreConstruct");
static_assert(sizeof(WBP_ExplorationPrompt_C_PreConstruct) == 0x000001, "Wrong size on WBP_ExplorationPrompt_C_PreConstruct");
static_assert(offsetof(WBP_ExplorationPrompt_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ExplorationPrompt_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ExplorationPrompt.WBP_ExplorationPrompt_C.SetPromptParams
// 0x0018 (0x0018 - 0x0000)
struct WBP_ExplorationPrompt_C_SetPromptParams final
{
public:
	struct FFPromptParams                         PromptParams;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ExplorationPrompt_C_SetPromptParams) == 0x000008, "Wrong alignment on WBP_ExplorationPrompt_C_SetPromptParams");
static_assert(sizeof(WBP_ExplorationPrompt_C_SetPromptParams) == 0x000018, "Wrong size on WBP_ExplorationPrompt_C_SetPromptParams");
static_assert(offsetof(WBP_ExplorationPrompt_C_SetPromptParams, PromptParams) == 0x000000, "Member 'WBP_ExplorationPrompt_C_SetPromptParams::PromptParams' has a wrong offset!");

}

