#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GM_SkillElementShort

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "S_SkillIconsDataRow_structs.hpp"


namespace SDK::Params
{

// Function WBP_GM_SkillElementShort.WBP_GM_SkillElementShort_C.BPI_ShouldShowNotification
// 0x0018 (0x0018 - 0x0000)
struct WBP_GM_SkillElementShort_C_BPI_ShouldShowNotification final
{
public:
	bool                                          bShouldShow;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldObjectBeNotified_IsNotified;        // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_SkillElementShort_C_BPI_ShouldShowNotification) == 0x000008, "Wrong alignment on WBP_GM_SkillElementShort_C_BPI_ShouldShowNotification");
static_assert(sizeof(WBP_GM_SkillElementShort_C_BPI_ShouldShowNotification) == 0x000018, "Wrong size on WBP_GM_SkillElementShort_C_BPI_ShouldShowNotification");
static_assert(offsetof(WBP_GM_SkillElementShort_C_BPI_ShouldShowNotification, bShouldShow) == 0x000000, "Member 'WBP_GM_SkillElementShort_C_BPI_ShouldShowNotification::bShouldShow' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillElementShort_C_BPI_ShouldShowNotification, CallFunc_GetCustomGI_ReturnValue) == 0x000008, "Member 'WBP_GM_SkillElementShort_C_BPI_ShouldShowNotification::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillElementShort_C_BPI_ShouldShowNotification, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_GM_SkillElementShort_C_BPI_ShouldShowNotification::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillElementShort_C_BPI_ShouldShowNotification, CallFunc_ShouldObjectBeNotified_IsNotified) == 0x000011, "Member 'WBP_GM_SkillElementShort_C_BPI_ShouldShowNotification::CallFunc_ShouldObjectBeNotified_IsNotified' has a wrong offset!");

// Function WBP_GM_SkillElementShort.WBP_GM_SkillElementShort_C.LoadNotificationData
// 0x0028 (0x0028 - 0x0000)
struct WBP_GM_SkillElementShort_C_LoadNotificationData final
{
public:
	TDelegate<void(const struct FGameplayTag& PoolTag, class FName ObjectName, class UUserWidget* Mark_Caller)> K2Node_CreateDelegate_OutputDelegate; // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_UINotifiedObject_C> CallFunc_LoadNotificationData_NotifiedObject_CastInput; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_SkillElementShort_C_LoadNotificationData) == 0x000008, "Wrong alignment on WBP_GM_SkillElementShort_C_LoadNotificationData");
static_assert(sizeof(WBP_GM_SkillElementShort_C_LoadNotificationData) == 0x000028, "Wrong size on WBP_GM_SkillElementShort_C_LoadNotificationData");
static_assert(offsetof(WBP_GM_SkillElementShort_C_LoadNotificationData, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_GM_SkillElementShort_C_LoadNotificationData::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillElementShort_C_LoadNotificationData, CallFunc_GetCustomGI_ReturnValue) == 0x000010, "Member 'WBP_GM_SkillElementShort_C_LoadNotificationData::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillElementShort_C_LoadNotificationData, CallFunc_LoadNotificationData_NotifiedObject_CastInput) == 0x000018, "Member 'WBP_GM_SkillElementShort_C_LoadNotificationData::CallFunc_LoadNotificationData_NotifiedObject_CastInput' has a wrong offset!");

// Function WBP_GM_SkillElementShort.WBP_GM_SkillElementShort_C.GetSlotIndex
// 0x0004 (0x0004 - 0x0000)
struct WBP_GM_SkillElementShort_C_GetSlotIndex final
{
public:
	int32                                         SlotIndex_0;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_SkillElementShort_C_GetSlotIndex) == 0x000004, "Wrong alignment on WBP_GM_SkillElementShort_C_GetSlotIndex");
static_assert(sizeof(WBP_GM_SkillElementShort_C_GetSlotIndex) == 0x000004, "Wrong size on WBP_GM_SkillElementShort_C_GetSlotIndex");
static_assert(offsetof(WBP_GM_SkillElementShort_C_GetSlotIndex, SlotIndex_0) == 0x000000, "Member 'WBP_GM_SkillElementShort_C_GetSlotIndex::SlotIndex_0' has a wrong offset!");

// Function WBP_GM_SkillElementShort.WBP_GM_SkillElementShort_C.GetSkillData
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_SkillElementShort_C_GetSkillData final
{
public:
	class UBP_DataAsset_Skill_C*                  SkillData_0;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_SkillElementShort_C_GetSkillData) == 0x000008, "Wrong alignment on WBP_GM_SkillElementShort_C_GetSkillData");
static_assert(sizeof(WBP_GM_SkillElementShort_C_GetSkillData) == 0x000008, "Wrong size on WBP_GM_SkillElementShort_C_GetSkillData");
static_assert(offsetof(WBP_GM_SkillElementShort_C_GetSkillData, SkillData_0) == 0x000000, "Member 'WBP_GM_SkillElementShort_C_GetSkillData::SkillData_0' has a wrong offset!");

// Function WBP_GM_SkillElementShort.WBP_GM_SkillElementShort_C.Load Skill Data
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_GM_SkillElementShort_C_Load_Skill_Data final
{
public:
	class UBP_DataAsset_Skill_C*                  SkillData_0;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsIconRowFound;                                    // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSkillBaseCost_ReturnValue;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x0030(0x0010)()
	struct FGeometry                              CallFunc_GetTickSpaceGeometry_ReturnValue;         // 0x0040(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasFocusedDescendants_ReturnValue;        // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_LocalToAbsolute_ReturnValue;              // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_SkillIconsDataRow                   CallFunc_GetDataTableRowFromName_OutRow;           // 0x0098(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_SkillElementShort_C_Load_Skill_Data) == 0x000008, "Wrong alignment on WBP_GM_SkillElementShort_C_Load_Skill_Data");
static_assert(sizeof(WBP_GM_SkillElementShort_C_Load_Skill_Data) == 0x0000C8, "Wrong size on WBP_GM_SkillElementShort_C_Load_Skill_Data");
static_assert(offsetof(WBP_GM_SkillElementShort_C_Load_Skill_Data, SkillData_0) == 0x000000, "Member 'WBP_GM_SkillElementShort_C_Load_Skill_Data::SkillData_0' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillElementShort_C_Load_Skill_Data, IsIconRowFound) == 0x000008, "Member 'WBP_GM_SkillElementShort_C_Load_Skill_Data::IsIconRowFound' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillElementShort_C_Load_Skill_Data, Temp_bool_Variable) == 0x000009, "Member 'WBP_GM_SkillElementShort_C_Load_Skill_Data::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillElementShort_C_Load_Skill_Data, CallFunc_IsValid_ReturnValue) == 0x00000A, "Member 'WBP_GM_SkillElementShort_C_Load_Skill_Data::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillElementShort_C_Load_Skill_Data, CallFunc_GetSkillBaseCost_ReturnValue) == 0x00000C, "Member 'WBP_GM_SkillElementShort_C_Load_Skill_Data::CallFunc_GetSkillBaseCost_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillElementShort_C_Load_Skill_Data, Temp_byte_Variable) == 0x000010, "Member 'WBP_GM_SkillElementShort_C_Load_Skill_Data::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillElementShort_C_Load_Skill_Data, Temp_byte_Variable_1) == 0x000011, "Member 'WBP_GM_SkillElementShort_C_Load_Skill_Data::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillElementShort_C_Load_Skill_Data, Temp_bool_Variable_1) == 0x000012, "Member 'WBP_GM_SkillElementShort_C_Load_Skill_Data::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillElementShort_C_Load_Skill_Data, K2Node_Select_Default) == 0x000013, "Member 'WBP_GM_SkillElementShort_C_Load_Skill_Data::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillElementShort_C_Load_Skill_Data, Temp_text_Variable) == 0x000018, "Member 'WBP_GM_SkillElementShort_C_Load_Skill_Data::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillElementShort_C_Load_Skill_Data, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'WBP_GM_SkillElementShort_C_Load_Skill_Data::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillElementShort_C_Load_Skill_Data, K2Node_Select_Default_1) == 0x000030, "Member 'WBP_GM_SkillElementShort_C_Load_Skill_Data::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillElementShort_C_Load_Skill_Data, CallFunc_GetTickSpaceGeometry_ReturnValue) == 0x000040, "Member 'WBP_GM_SkillElementShort_C_Load_Skill_Data::CallFunc_GetTickSpaceGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillElementShort_C_Load_Skill_Data, CallFunc_HasFocusedDescendants_ReturnValue) == 0x000078, "Member 'WBP_GM_SkillElementShort_C_Load_Skill_Data::CallFunc_HasFocusedDescendants_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillElementShort_C_Load_Skill_Data, CallFunc_LocalToAbsolute_ReturnValue) == 0x000080, "Member 'WBP_GM_SkillElementShort_C_Load_Skill_Data::CallFunc_LocalToAbsolute_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillElementShort_C_Load_Skill_Data, Temp_byte_Variable_2) == 0x000090, "Member 'WBP_GM_SkillElementShort_C_Load_Skill_Data::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillElementShort_C_Load_Skill_Data, Temp_byte_Variable_3) == 0x000091, "Member 'WBP_GM_SkillElementShort_C_Load_Skill_Data::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillElementShort_C_Load_Skill_Data, CallFunc_BooleanAND_ReturnValue) == 0x000092, "Member 'WBP_GM_SkillElementShort_C_Load_Skill_Data::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillElementShort_C_Load_Skill_Data, Temp_bool_Variable_2) == 0x000093, "Member 'WBP_GM_SkillElementShort_C_Load_Skill_Data::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillElementShort_C_Load_Skill_Data, K2Node_Select_Default_2) == 0x000094, "Member 'WBP_GM_SkillElementShort_C_Load_Skill_Data::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillElementShort_C_Load_Skill_Data, CallFunc_GetDataTableRowFromName_OutRow) == 0x000098, "Member 'WBP_GM_SkillElementShort_C_Load_Skill_Data::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillElementShort_C_Load_Skill_Data, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000C0, "Member 'WBP_GM_SkillElementShort_C_Load_Skill_Data::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function WBP_GM_SkillElementShort.WBP_GM_SkillElementShort_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_GM_SkillElementShort_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_SkillElementShort_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on WBP_GM_SkillElementShort_C_BP_OnItemExpansionChanged");
static_assert(sizeof(WBP_GM_SkillElementShort_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on WBP_GM_SkillElementShort_C_BP_OnItemExpansionChanged");
static_assert(offsetof(WBP_GM_SkillElementShort_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'WBP_GM_SkillElementShort_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function WBP_GM_SkillElementShort.WBP_GM_SkillElementShort_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_GM_SkillElementShort_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_SkillElementShort_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on WBP_GM_SkillElementShort_C_BP_OnItemSelectionChanged");
static_assert(sizeof(WBP_GM_SkillElementShort_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on WBP_GM_SkillElementShort_C_BP_OnItemSelectionChanged");
static_assert(offsetof(WBP_GM_SkillElementShort_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'WBP_GM_SkillElementShort_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function WBP_GM_SkillElementShort.WBP_GM_SkillElementShort_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_SkillElementShort_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_SkillElementShort_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on WBP_GM_SkillElementShort_C_OnListItemObjectSet");
static_assert(sizeof(WBP_GM_SkillElementShort_C_OnListItemObjectSet) == 0x000008, "Wrong size on WBP_GM_SkillElementShort_C_OnListItemObjectSet");
static_assert(offsetof(WBP_GM_SkillElementShort_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'WBP_GM_SkillElementShort_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function WBP_GM_SkillElementShort.WBP_GM_SkillElementShort_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_SkillElementShort_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_GM_SkillElementShort_C_OnAddedToFocusPath) == 0x000004, "Wrong alignment on WBP_GM_SkillElementShort_C_OnAddedToFocusPath");
static_assert(sizeof(WBP_GM_SkillElementShort_C_OnAddedToFocusPath) == 0x000008, "Wrong size on WBP_GM_SkillElementShort_C_OnAddedToFocusPath");
static_assert(offsetof(WBP_GM_SkillElementShort_C_OnAddedToFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_GM_SkillElementShort_C_OnAddedToFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_GM_SkillElementShort.WBP_GM_SkillElementShort_C.BndEvt__WBP_GM_SkillElementShort_BaseButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_SkillElementShort_C_BndEvt__WBP_GM_SkillElementShort_BaseButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_SkillElementShort_C_BndEvt__WBP_GM_SkillElementShort_BaseButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GM_SkillElementShort_C_BndEvt__WBP_GM_SkillElementShort_BaseButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_GM_SkillElementShort_C_BndEvt__WBP_GM_SkillElementShort_BaseButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_GM_SkillElementShort_C_BndEvt__WBP_GM_SkillElementShort_BaseButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_GM_SkillElementShort_C_BndEvt__WBP_GM_SkillElementShort_BaseButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_GM_SkillElementShort_C_BndEvt__WBP_GM_SkillElementShort_BaseButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_GM_SkillElementShort.WBP_GM_SkillElementShort_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_SkillElementShort_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_GM_SkillElementShort_C_OnRemovedFromFocusPath) == 0x000004, "Wrong alignment on WBP_GM_SkillElementShort_C_OnRemovedFromFocusPath");
static_assert(sizeof(WBP_GM_SkillElementShort_C_OnRemovedFromFocusPath) == 0x000008, "Wrong size on WBP_GM_SkillElementShort_C_OnRemovedFromFocusPath");
static_assert(offsetof(WBP_GM_SkillElementShort_C_OnRemovedFromFocusPath, InFocusEvent) == 0x000000, "Member 'WBP_GM_SkillElementShort_C_OnRemovedFromFocusPath::InFocusEvent' has a wrong offset!");

// Function WBP_GM_SkillElementShort.WBP_GM_SkillElementShort_C.BPI_OnMarkNotificationAsRead
// 0x0008 (0x0008 - 0x0000)
struct WBP_GM_SkillElementShort_C_BPI_OnMarkNotificationAsRead final
{
public:
	class UUserWidget*                            MarkCaller;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_SkillElementShort_C_BPI_OnMarkNotificationAsRead) == 0x000008, "Wrong alignment on WBP_GM_SkillElementShort_C_BPI_OnMarkNotificationAsRead");
static_assert(sizeof(WBP_GM_SkillElementShort_C_BPI_OnMarkNotificationAsRead) == 0x000008, "Wrong size on WBP_GM_SkillElementShort_C_BPI_OnMarkNotificationAsRead");
static_assert(offsetof(WBP_GM_SkillElementShort_C_BPI_OnMarkNotificationAsRead, MarkCaller) == 0x000000, "Member 'WBP_GM_SkillElementShort_C_BPI_OnMarkNotificationAsRead::MarkCaller' has a wrong offset!");

// Function WBP_GM_SkillElementShort.WBP_GM_SkillElementShort_C.OnSkillMarkedAsRead
// 0x0018 (0x0018 - 0x0000)
struct WBP_GM_SkillElementShort_C_OnSkillMarkedAsRead final
{
public:
	struct FGameplayTag                           PoolTag;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class FName                                   ObjectName;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Mark_Caller;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_SkillElementShort_C_OnSkillMarkedAsRead) == 0x000008, "Wrong alignment on WBP_GM_SkillElementShort_C_OnSkillMarkedAsRead");
static_assert(sizeof(WBP_GM_SkillElementShort_C_OnSkillMarkedAsRead) == 0x000018, "Wrong size on WBP_GM_SkillElementShort_C_OnSkillMarkedAsRead");
static_assert(offsetof(WBP_GM_SkillElementShort_C_OnSkillMarkedAsRead, PoolTag) == 0x000000, "Member 'WBP_GM_SkillElementShort_C_OnSkillMarkedAsRead::PoolTag' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillElementShort_C_OnSkillMarkedAsRead, ObjectName) == 0x000008, "Member 'WBP_GM_SkillElementShort_C_OnSkillMarkedAsRead::ObjectName' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillElementShort_C_OnSkillMarkedAsRead, Mark_Caller) == 0x000010, "Member 'WBP_GM_SkillElementShort_C_OnSkillMarkedAsRead::Mark_Caller' has a wrong offset!");

// Function WBP_GM_SkillElementShort.WBP_GM_SkillElementShort_C.BndEvt__WBP_GM_SkillElementShort_BaseButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_GM_SkillElementShort_C_BndEvt__WBP_GM_SkillElementShort_BaseButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Selected;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_SkillElementShort_C_BndEvt__WBP_GM_SkillElementShort_BaseButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GM_SkillElementShort_C_BndEvt__WBP_GM_SkillElementShort_BaseButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature");
static_assert(sizeof(WBP_GM_SkillElementShort_C_BndEvt__WBP_GM_SkillElementShort_BaseButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature) == 0x000010, "Wrong size on WBP_GM_SkillElementShort_C_BndEvt__WBP_GM_SkillElementShort_BaseButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature");
static_assert(offsetof(WBP_GM_SkillElementShort_C_BndEvt__WBP_GM_SkillElementShort_BaseButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature, Button) == 0x000000, "Member 'WBP_GM_SkillElementShort_C_BndEvt__WBP_GM_SkillElementShort_BaseButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillElementShort_C_BndEvt__WBP_GM_SkillElementShort_BaseButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature, Selected) == 0x000008, "Member 'WBP_GM_SkillElementShort_C_BndEvt__WBP_GM_SkillElementShort_BaseButton_K2Node_ComponentBoundEvent_1_CommonSelectedStateChangedBase__DelegateSignature::Selected' has a wrong offset!");

// Function WBP_GM_SkillElementShort.WBP_GM_SkillElementShort_C.ExecuteUbergraph_WBP_GM_SkillElementShort
// 0x0130 (0x0130 - 0x0000)
struct WBP_GM_SkillElementShort_C_ExecuteUbergraph_WBP_GM_SkillElementShort final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetListItemObject_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable;                               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable_1;                             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_DataAsset_Skill_C*                  K2Node_DynamicCast_AsBP_Data_Asset_Skill;          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0044(0x0008)(NoDestructor)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetTickSpaceGeometry_ReturnValue;         // 0x0058(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0090(0x0008)(NoDestructor)
	struct FVector2D                              CallFunc_LocalToAbsolute_ReturnValue;              // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_2;                             // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_Event_MarkCaller;                           // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_3;                             // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C3[0x1];                                       // 0x00C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_PoolTag;                        // 0x00C4(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_ObjectName;                     // 0x00CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_CustomEvent_Mark_Caller;                    // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_4;                             // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Selected;               // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default;                             // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_5;                             // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default_1;                           // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_Select_Default_2;                           // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GM_SkillElementShort_C_ExecuteUbergraph_WBP_GM_SkillElementShort) == 0x000008, "Wrong alignment on WBP_GM_SkillElementShort_C_ExecuteUbergraph_WBP_GM_SkillElementShort");
static_assert(sizeof(WBP_GM_SkillElementShort_C_ExecuteUbergraph_WBP_GM_SkillElementShort) == 0x000130, "Wrong size on WBP_GM_SkillElementShort_C_ExecuteUbergraph_WBP_GM_SkillElementShort");
static_assert(offsetof(WBP_GM_SkillElementShort_C_ExecuteUbergraph_WBP_GM_SkillElementShort, EntryPoint) == 0x000000, "Member 'WBP_GM_SkillElementShort_C_ExecuteUbergraph_WBP_GM_SkillElementShort::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GM_SkillElementShort_C_ExecuteUbergraph_WBP_GM_SkillElementShort, CallFunc_GetListItemObject_ReturnValue) == 0x000008, "Member 'WBP_GM_SkillElementShort_C_ExecuteUbergraph_WBP_GM_SkillElementShort::CallFunc_GetListItemObject_ReturnValue' has a wrong offset!");
