#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_QTEContainer

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_QTEContainer.WBP_QTEContainer_C.ExecuteUbergraph_WBP_QTEContainer
// 0x0020 (0x0020 - 0x0000)
struct WBP_QTEContainer_C_ExecuteUbergraph_WBP_QTEContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_BattleManager_C*               CallFunc_GetBattleManager_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ABP_jRPG_Character_Battle_Base_C* Character)> K2Node_CreateDelegate_OutputDelegate; // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_QTEContainer_C_ExecuteUbergraph_WBP_QTEContainer) == 0x000008, "Wrong alignment on WBP_QTEContainer_C_ExecuteUbergraph_WBP_QTEContainer");
static_assert(sizeof(WBP_QTEContainer_C_ExecuteUbergraph_WBP_QTEContainer) == 0x000020, "Wrong size on WBP_QTEContainer_C_ExecuteUbergraph_WBP_QTEContainer");
static_assert(offsetof(WBP_QTEContainer_C_ExecuteUbergraph_WBP_QTEContainer, EntryPoint) == 0x000000, "Member 'WBP_QTEContainer_C_ExecuteUbergraph_WBP_QTEContainer::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_QTEContainer_C_ExecuteUbergraph_WBP_QTEContainer, CallFunc_GetBattleManager_ReturnValue) == 0x000008, "Member 'WBP_QTEContainer_C_ExecuteUbergraph_WBP_QTEContainer::CallFunc_GetBattleManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_QTEContainer_C_ExecuteUbergraph_WBP_QTEContainer, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_QTEContainer_C_ExecuteUbergraph_WBP_QTEContainer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_QTEContainer.WBP_QTEContainer_C.GetQTEWidgets
// 0x0020 (0x0020 - 0x0000)
struct WBP_QTEContainer_C_GetQTEWidgets final
{
public:
	TArray<class UWBP_HUD_QTE_C*>                 QTEWidgets;                                        // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UWBP_HUD_QTE_C*>                 K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_QTEContainer_C_GetQTEWidgets) == 0x000008, "Wrong alignment on WBP_QTEContainer_C_GetQTEWidgets");
static_assert(sizeof(WBP_QTEContainer_C_GetQTEWidgets) == 0x000020, "Wrong size on WBP_QTEContainer_C_GetQTEWidgets");
static_assert(offsetof(WBP_QTEContainer_C_GetQTEWidgets, QTEWidgets) == 0x000000, "Member 'WBP_QTEContainer_C_GetQTEWidgets::QTEWidgets' has a wrong offset!");
static_assert(offsetof(WBP_QTEContainer_C_GetQTEWidgets, K2Node_MakeArray_Array) == 0x000010, "Member 'WBP_QTEContainer_C_GetQTEWidgets::K2Node_MakeArray_Array' has a wrong offset!");

// Function WBP_QTEContainer.WBP_QTEContainer_C.OnTurnStart
// 0x0010 (0x0010 - 0x0000)
struct WBP_QTEContainer_C_OnTurnStart final
{
public:
	class ABP_jRPG_Character_Battle_Base_C*       Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_QTEContainer_C_OnTurnStart) == 0x000008, "Wrong alignment on WBP_QTEContainer_C_OnTurnStart");
static_assert(sizeof(WBP_QTEContainer_C_OnTurnStart) == 0x000010, "Wrong size on WBP_QTEContainer_C_OnTurnStart");
static_assert(offsetof(WBP_QTEContainer_C_OnTurnStart, Character) == 0x000000, "Member 'WBP_QTEContainer_C_OnTurnStart::Character' has a wrong offset!");
static_assert(offsetof(WBP_QTEContainer_C_OnTurnStart, CallFunc_IsActivated_ReturnValue) == 0x000008, "Member 'WBP_QTEContainer_C_OnTurnStart::CallFunc_IsActivated_ReturnValue' has a wrong offset!");

}

