#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ModalPopup

#include "Basic.hpp"

#include "EModalUIResponse_structs.hpp"
#include "SlateCore_structs.hpp"
#include "S_LoadGameRequest_structs.hpp"
#include "E_jRPG_YesNoQuestions_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "S_SaveSlotData_structs.hpp"
#include "E_ModalStandardButton_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function WBP_ModalPopup.WBP_ModalPopup_C.BndEvt__WBP_ModalPopup_CancelButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_CancelButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_CancelButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_CancelButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_CancelButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_CancelButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_CancelButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_CancelButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ModalPopup.WBP_ModalPopup_C.BndEvt__WBP_ModalPopup_CancelButton_K2Node_ComponentBoundEvent_7_OnButtonBaseActionProgress__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_CancelButton_K2Node_ComponentBoundEvent_7_OnButtonBaseActionProgress__DelegateSignature final
{
public:
	double                                        Progress;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_CancelButton_K2Node_ComponentBoundEvent_7_OnButtonBaseActionProgress__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_CancelButton_K2Node_ComponentBoundEvent_7_OnButtonBaseActionProgress__DelegateSignature");
static_assert(sizeof(WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_CancelButton_K2Node_ComponentBoundEvent_7_OnButtonBaseActionProgress__DelegateSignature) == 0x000008, "Wrong size on WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_CancelButton_K2Node_ComponentBoundEvent_7_OnButtonBaseActionProgress__DelegateSignature");
static_assert(offsetof(WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_CancelButton_K2Node_ComponentBoundEvent_7_OnButtonBaseActionProgress__DelegateSignature, Progress) == 0x000000, "Member 'WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_CancelButton_K2Node_ComponentBoundEvent_7_OnButtonBaseActionProgress__DelegateSignature::Progress' has a wrong offset!");

// Function WBP_ModalPopup.WBP_ModalPopup_C.BndEvt__WBP_ModalPopup_ConfirmButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_ConfirmButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_ConfirmButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_ConfirmButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_ConfirmButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_ConfirmButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_ConfirmButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_ConfirmButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ModalPopup.WBP_ModalPopup_C.BndEvt__WBP_ModalPopup_ConfirmButton_K2Node_ComponentBoundEvent_5_OnButtonBaseActionProgress__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_ConfirmButton_K2Node_ComponentBoundEvent_5_OnButtonBaseActionProgress__DelegateSignature final
{
public:
	double                                        Progress;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_ConfirmButton_K2Node_ComponentBoundEvent_5_OnButtonBaseActionProgress__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_ConfirmButton_K2Node_ComponentBoundEvent_5_OnButtonBaseActionProgress__DelegateSignature");
static_assert(sizeof(WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_ConfirmButton_K2Node_ComponentBoundEvent_5_OnButtonBaseActionProgress__DelegateSignature) == 0x000008, "Wrong size on WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_ConfirmButton_K2Node_ComponentBoundEvent_5_OnButtonBaseActionProgress__DelegateSignature");
static_assert(offsetof(WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_ConfirmButton_K2Node_ComponentBoundEvent_5_OnButtonBaseActionProgress__DelegateSignature, Progress) == 0x000000, "Member 'WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_ConfirmButton_K2Node_ComponentBoundEvent_5_OnButtonBaseActionProgress__DelegateSignature::Progress' has a wrong offset!");

// Function WBP_ModalPopup.WBP_ModalPopup_C.BndEvt__WBP_ModalPopup_HoldConfirmButton_K2Node_ComponentBoundEvent_1_OnButtonBaseActionProgress__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_HoldConfirmButton_K2Node_ComponentBoundEvent_1_OnButtonBaseActionProgress__DelegateSignature final
{
public:
	double                                        Progress;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_HoldConfirmButton_K2Node_ComponentBoundEvent_1_OnButtonBaseActionProgress__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_HoldConfirmButton_K2Node_ComponentBoundEvent_1_OnButtonBaseActionProgress__DelegateSignature");
static_assert(sizeof(WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_HoldConfirmButton_K2Node_ComponentBoundEvent_1_OnButtonBaseActionProgress__DelegateSignature) == 0x000008, "Wrong size on WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_HoldConfirmButton_K2Node_ComponentBoundEvent_1_OnButtonBaseActionProgress__DelegateSignature");
static_assert(offsetof(WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_HoldConfirmButton_K2Node_ComponentBoundEvent_1_OnButtonBaseActionProgress__DelegateSignature, Progress) == 0x000000, "Member 'WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_HoldConfirmButton_K2Node_ComponentBoundEvent_1_OnButtonBaseActionProgress__DelegateSignature::Progress' has a wrong offset!");

// Function WBP_ModalPopup.WBP_ModalPopup_C.BndEvt__WBP_ModalPopup_HoldConfirmButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_HoldConfirmButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_HoldConfirmButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_HoldConfirmButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_HoldConfirmButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_HoldConfirmButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_HoldConfirmButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_HoldConfirmButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ModalPopup.WBP_ModalPopup_C.BndEvt__WBP_ModalPopup_SwapButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_SwapButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_SwapButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_SwapButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_SwapButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_SwapButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_SwapButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_SwapButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ModalPopup.WBP_ModalPopup_C.BndEvt__WBP_ModalPopup_SwapButton_K2Node_ComponentBoundEvent_6_OnButtonBaseActionProgress__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_SwapButton_K2Node_ComponentBoundEvent_6_OnButtonBaseActionProgress__DelegateSignature final
{
public:
	double                                        Progress;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_SwapButton_K2Node_ComponentBoundEvent_6_OnButtonBaseActionProgress__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_SwapButton_K2Node_ComponentBoundEvent_6_OnButtonBaseActionProgress__DelegateSignature");
static_assert(sizeof(WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_SwapButton_K2Node_ComponentBoundEvent_6_OnButtonBaseActionProgress__DelegateSignature) == 0x000008, "Wrong size on WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_SwapButton_K2Node_ComponentBoundEvent_6_OnButtonBaseActionProgress__DelegateSignature");
static_assert(offsetof(WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_SwapButton_K2Node_ComponentBoundEvent_6_OnButtonBaseActionProgress__DelegateSignature, Progress) == 0x000000, "Member 'WBP_ModalPopup_C_BndEvt__WBP_ModalPopup_SwapButton_K2Node_ComponentBoundEvent_6_OnButtonBaseActionProgress__DelegateSignature::Progress' has a wrong offset!");

// Function WBP_ModalPopup.WBP_ModalPopup_C.DoCustomNavigationCancelButton
// 0x0020 (0x0020 - 0x0000)
struct WBP_ModalPopup_C_DoCustomNavigationCancelButton final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModalPopup_C_DoCustomNavigationCancelButton) == 0x000008, "Wrong alignment on WBP_ModalPopup_C_DoCustomNavigationCancelButton");
static_assert(sizeof(WBP_ModalPopup_C_DoCustomNavigationCancelButton) == 0x000020, "Wrong size on WBP_ModalPopup_C_DoCustomNavigationCancelButton");
static_assert(offsetof(WBP_ModalPopup_C_DoCustomNavigationCancelButton, Navigation_0) == 0x000000, "Member 'WBP_ModalPopup_C_DoCustomNavigationCancelButton::Navigation_0' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_DoCustomNavigationCancelButton, ReturnValue) == 0x000008, "Member 'WBP_ModalPopup_C_DoCustomNavigationCancelButton::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_DoCustomNavigationCancelButton, Temp_bool_Variable) == 0x000010, "Member 'WBP_ModalPopup_C_DoCustomNavigationCancelButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_DoCustomNavigationCancelButton, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'WBP_ModalPopup_C_DoCustomNavigationCancelButton::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_DoCustomNavigationCancelButton, CallFunc_IsVisible_ReturnValue) == 0x000012, "Member 'WBP_ModalPopup_C_DoCustomNavigationCancelButton::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_DoCustomNavigationCancelButton, K2Node_Select_Default) == 0x000018, "Member 'WBP_ModalPopup_C_DoCustomNavigationCancelButton::K2Node_Select_Default' has a wrong offset!");

// Function WBP_ModalPopup.WBP_ModalPopup_C.ExecuteUbergraph_WBP_ModalPopup
// 0x01D8 (0x01D8 - 0x0000)
struct WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_3;                     // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_3;               // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_4;                     // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_4;               // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue_1;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_3;               // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x0060(0x0020)(NoDestructor)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue_1;        // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue_2;        // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              Temp_byte_Variable_2;                              // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B3[0x5];                                       // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_ComponentBoundEvent_Progress_3;             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_Progress_2;             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_5;               // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D3[0x5];                                       // 0x00D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_ComponentBoundEvent_Progress_1;             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_1;    // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_3;    // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;            // 0x00F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue_3;        // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_Select_Default;                             // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_103[0x5];                                      // 0x0103(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_ComponentBoundEvent_Progress;               // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_1;                           // 0x0110(0x0010)()
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_2;    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_123[0x5];                                      // 0x0123(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              K2Node_Select_Default_3;                           // 0x0128(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0150(0x0048)(HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01A0(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_4;                           // 0x01C0(0x0010)()
	bool                                          Temp_bool_IsClosed_Variable_5;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup) == 0x000008, "Wrong alignment on WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup");
static_assert(sizeof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup) == 0x0001D8, "Wrong size on WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, EntryPoint) == 0x000000, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, CallFunc_GetDesiredSize_ReturnValue) == 0x000010, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, CallFunc_GetCurrentInputType_ReturnValue) == 0x000020, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, CallFunc_BreakVector2D_X) == 0x000028, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, CallFunc_BreakVector2D_Y) == 0x000030, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000038, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000039, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, Temp_bool_Has_Been_Initd_Variable) == 0x00003A, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, Temp_byte_Variable) == 0x00003B, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, Temp_bool_IsClosed_Variable) == 0x00003C, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, Temp_bool_IsClosed_Variable_1) == 0x00003D, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, Temp_bool_Has_Been_Initd_Variable_1) == 0x00003E, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, Temp_bool_IsClosed_Variable_2) == 0x00003F, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::Temp_bool_IsClosed_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, Temp_bool_Has_Been_Initd_Variable_2) == 0x000040, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::Temp_bool_Has_Been_Initd_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, Temp_byte_Variable_1) == 0x000041, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, Temp_bool_IsClosed_Variable_3) == 0x000042, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::Temp_bool_IsClosed_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, Temp_bool_Has_Been_Initd_Variable_3) == 0x000043, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::Temp_bool_Has_Been_Initd_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, Temp_bool_Variable) == 0x000044, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, Temp_bool_IsClosed_Variable_4) == 0x000045, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::Temp_bool_IsClosed_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, Temp_bool_Has_Been_Initd_Variable_4) == 0x000046, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::Temp_bool_Has_Been_Initd_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, K2Node_Event_IsDesignTime) == 0x000047, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, CallFunc_NotEqual_NameName_ReturnValue) == 0x000048, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, CallFunc_NotEqual_NameName_ReturnValue_1) == 0x000049, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::CallFunc_NotEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, K2Node_ComponentBoundEvent_Button_3) == 0x000050, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, K2Node_ComponentBoundEvent_Button_2) == 0x000058, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, K2Node_MakeStruct_Anchors) == 0x000060, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::K2Node_MakeStruct_Anchors' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, K2Node_CustomEvent_bNewInputType) == 0x000080, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, K2Node_ComponentBoundEvent_Button_1) == 0x000088, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000090, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x000091, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000098, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, CallFunc_GetCurrentInputType_ReturnValue_1) == 0x0000A0, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::CallFunc_GetCurrentInputType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000A1, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, CallFunc_GetLocalPlayerSubsystem_ReturnValue_2) == 0x0000A8, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::CallFunc_GetLocalPlayerSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, CallFunc_GetCurrentInputType_ReturnValue_2) == 0x0000B0, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::CallFunc_GetCurrentInputType_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0000B1, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, Temp_byte_Variable_2) == 0x0000B2, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, K2Node_ComponentBoundEvent_Progress_3) == 0x0000B8, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::K2Node_ComponentBoundEvent_Progress_3' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, K2Node_ComponentBoundEvent_Button) == 0x0000C0, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, K2Node_ComponentBoundEvent_Progress_2) == 0x0000C8, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::K2Node_ComponentBoundEvent_Progress_2' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x0000D0, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, Temp_bool_Variable_1) == 0x0000D1, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, Temp_bool_Has_Been_Initd_Variable_5) == 0x0000D2, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::Temp_bool_Has_Been_Initd_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, K2Node_ComponentBoundEvent_Progress_1) == 0x0000D8, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::K2Node_ComponentBoundEvent_Progress_1' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, Temp_bool_Variable_2) == 0x0000E0, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, CallFunc_EqualEqual_DoubleDouble_ReturnValue_1) == 0x0000E1, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::CallFunc_EqualEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, CallFunc_GetLocalPlayerSubsystem_ReturnValue_3) == 0x0000E8, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::CallFunc_GetLocalPlayerSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, K2Node_CreateDelegate_OutputDelegate) == 0x0000F0, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, CallFunc_GetCurrentInputType_ReturnValue_3) == 0x000100, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::CallFunc_GetCurrentInputType_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, K2Node_Select_Default) == 0x000101, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, Temp_bool_Variable_3) == 0x000102, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, K2Node_ComponentBoundEvent_Progress) == 0x000108, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::K2Node_ComponentBoundEvent_Progress' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, K2Node_Select_Default_1) == 0x000110, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, CallFunc_EqualEqual_DoubleDouble_ReturnValue_2) == 0x000120, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::CallFunc_EqualEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, CallFunc_TextIsEmpty_ReturnValue) == 0x000121, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, K2Node_Select_Default_2) == 0x000122, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, K2Node_Select_Default_3) == 0x000128, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, K2Node_MakeStruct_FormatArgumentData) == 0x000150, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, Temp_bool_Variable_4) == 0x000198, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, K2Node_MakeArray_Array) == 0x0001A0, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, CallFunc_Format_ReturnValue) == 0x0001B0, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, K2Node_Select_Default_4) == 0x0001C0, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup, Temp_bool_IsClosed_Variable_5) == 0x0001D0, "Member 'WBP_ModalPopup_C_ExecuteUbergraph_WBP_ModalPopup::Temp_bool_IsClosed_Variable_5' has a wrong offset!");

// Function WBP_ModalPopup.WBP_ModalPopup_C.GetLoadGameLatentAction
// 0x0008 (0x0008 - 0x0000)
struct WBP_ModalPopup_C_GetLoadGameLatentAction final
{
public:
	class UBP_LatentAction_LoadGame_C*            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModalPopup_C_GetLoadGameLatentAction) == 0x000008, "Wrong alignment on WBP_ModalPopup_C_GetLoadGameLatentAction");
static_assert(sizeof(WBP_ModalPopup_C_GetLoadGameLatentAction) == 0x000008, "Wrong size on WBP_ModalPopup_C_GetLoadGameLatentAction");
static_assert(offsetof(WBP_ModalPopup_C_GetLoadGameLatentAction, ReturnValue) == 0x000000, "Member 'WBP_ModalPopup_C_GetLoadGameLatentAction::ReturnValue' has a wrong offset!");

// Function WBP_ModalPopup.WBP_ModalPopup_C.NotifyUserResponse
// 0x0090 (0x0090 - 0x0000)
struct WBP_ModalPopup_C_NotifyUserResponse final
{
public:
	EModalUIResponse                              InUserResponse;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Format_ReturnValue;                       // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModalPopup_C_NotifyUserResponse) == 0x000008, "Wrong alignment on WBP_ModalPopup_C_NotifyUserResponse");
static_assert(sizeof(WBP_ModalPopup_C_NotifyUserResponse) == 0x000090, "Wrong size on WBP_ModalPopup_C_NotifyUserResponse");
static_assert(offsetof(WBP_ModalPopup_C_NotifyUserResponse, InUserResponse) == 0x000000, "Member 'WBP_ModalPopup_C_NotifyUserResponse::InUserResponse' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_NotifyUserResponse, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000008, "Member 'WBP_ModalPopup_C_NotifyUserResponse::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_NotifyUserResponse, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'WBP_ModalPopup_C_NotifyUserResponse::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_NotifyUserResponse, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'WBP_ModalPopup_C_NotifyUserResponse::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_NotifyUserResponse, K2Node_MakeArray_Array) == 0x000070, "Member 'WBP_ModalPopup_C_NotifyUserResponse::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_NotifyUserResponse, CallFunc_Format_ReturnValue) == 0x000080, "Member 'WBP_ModalPopup_C_NotifyUserResponse::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_ModalPopup.WBP_ModalPopup_C.OnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModalPopup_C_OnInputMethodChanged final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModalPopup_C_OnInputMethodChanged) == 0x000001, "Wrong alignment on WBP_ModalPopup_C_OnInputMethodChanged");
static_assert(sizeof(WBP_ModalPopup_C_OnInputMethodChanged) == 0x000001, "Wrong size on WBP_ModalPopup_C_OnInputMethodChanged");
static_assert(offsetof(WBP_ModalPopup_C_OnInputMethodChanged, bNewInputType) == 0x000000, "Member 'WBP_ModalPopup_C_OnInputMethodChanged::bNewInputType' has a wrong offset!");

// Function WBP_ModalPopup.WBP_ModalPopup_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ModalPopup_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModalPopup_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ModalPopup_C_PreConstruct");
static_assert(sizeof(WBP_ModalPopup_C_PreConstruct) == 0x000001, "Wrong size on WBP_ModalPopup_C_PreConstruct");
static_assert(offsetof(WBP_ModalPopup_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ModalPopup_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ModalPopup.WBP_ModalPopup_C.SaveGame
// 0x0100 (0x0100 - 0x0000)
struct WBP_ModalPopup_C_SaveGame final
{
public:
	E_jRPG_YesNoQuestions                         InDecision;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlatformsSubsystem*                    CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlatformsSubsystem*                    CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlatformsSubsystem*                    CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlatformsSubsystem*                    CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetLatestGameSaveLoaded_ReturnValue;      // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UBP_SaveManager_C*                      CallFunc_GetSaveManager_SaveManager;               // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetPlatformNameAsTag_ReturnValue;         // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_SaveSlotData>                CallFunc_GetSlots_SaveSlots;                       // 0x0048(0x0010)(ReferenceParm)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_SaveSlotData                        CallFunc_Array_Get_Item;                           // 0x0060(0x0050)(HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetPlatformNameAsTag_ReturnValue_1;       // 0x00B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue_1;                 // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_LatentAction_LoadGame_C*            CallFunc_SpawnObject_ReturnValue;                  // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_SaveManager_C*                      CallFunc_GetSaveManager_SaveManager_1;             // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_SaveManager_C*                      CallFunc_GetSaveManager_SaveManager_2;             // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_SaveManager_C*                      CallFunc_GetSaveManager_SaveManager_3;             // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_LoadGameRequest                     K2Node_MakeStruct_S_LoadGameRequest;               // 0x00E0(0x0020)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ModalPopup_C_SaveGame) == 0x000008, "Wrong alignment on WBP_ModalPopup_C_SaveGame");
static_assert(sizeof(WBP_ModalPopup_C_SaveGame) == 0x000100, "Wrong size on WBP_ModalPopup_C_SaveGame");
static_assert(offsetof(WBP_ModalPopup_C_SaveGame, InDecision) == 0x000000, "Member 'WBP_ModalPopup_C_SaveGame::InDecision' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_SaveGame, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'WBP_ModalPopup_C_SaveGame::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_SaveGame, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_ModalPopup_C_SaveGame::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_SaveGame, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000010, "Member 'WBP_ModalPopup_C_SaveGame::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_SaveGame, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000018, "Member 'WBP_ModalPopup_C_SaveGame::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_SaveGame, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000020, "Member 'WBP_ModalPopup_C_SaveGame::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_SaveGame, CallFunc_GetLatestGameSaveLoaded_ReturnValue) == 0x000028, "Member 'WBP_ModalPopup_C_SaveGame::CallFunc_GetLatestGameSaveLoaded_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_SaveGame, CallFunc_GetSaveManager_SaveManager) == 0x000038, "Member 'WBP_ModalPopup_C_SaveGame::CallFunc_GetSaveManager_SaveManager' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_SaveGame, CallFunc_GetPlatformNameAsTag_ReturnValue) == 0x000040, "Member 'WBP_ModalPopup_C_SaveGame::CallFunc_GetPlatformNameAsTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_SaveGame, CallFunc_GetSlots_SaveSlots) == 0x000048, "Member 'WBP_ModalPopup_C_SaveGame::CallFunc_GetSlots_SaveSlots' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_SaveGame, CallFunc_MatchesTag_ReturnValue) == 0x000058, "Member 'WBP_ModalPopup_C_SaveGame::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_SaveGame, CallFunc_Array_Get_Item) == 0x000060, "Member 'WBP_ModalPopup_C_SaveGame::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_SaveGame, CallFunc_GetPlatformNameAsTag_ReturnValue_1) == 0x0000B0, "Member 'WBP_ModalPopup_C_SaveGame::CallFunc_GetPlatformNameAsTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_SaveGame, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x0000B8, "Member 'WBP_ModalPopup_C_SaveGame::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_SaveGame, CallFunc_MatchesTag_ReturnValue_1) == 0x0000B9, "Member 'WBP_ModalPopup_C_SaveGame::CallFunc_MatchesTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_SaveGame, CallFunc_SpawnObject_ReturnValue) == 0x0000C0, "Member 'WBP_ModalPopup_C_SaveGame::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_SaveGame, CallFunc_GetSaveManager_SaveManager_1) == 0x0000C8, "Member 'WBP_ModalPopup_C_SaveGame::CallFunc_GetSaveManager_SaveManager_1' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_SaveGame, CallFunc_GetSaveManager_SaveManager_2) == 0x0000D0, "Member 'WBP_ModalPopup_C_SaveGame::CallFunc_GetSaveManager_SaveManager_2' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_SaveGame, CallFunc_GetSaveManager_SaveManager_3) == 0x0000D8, "Member 'WBP_ModalPopup_C_SaveGame::CallFunc_GetSaveManager_SaveManager_3' has a wrong offset!");
static_assert(offsetof(WBP_ModalPopup_C_SaveGame, K2Node_MakeStruct_S_LoadGameRequest) == 0x0000E0, "Member 'WBP_ModalPopup_C_SaveGame::K2Node_MakeStruct_S_LoadGameRequest' has a wrong offset!");

// Function WBP_ModalPopup.WBP_ModalPopup_C.SetCustomConfirmText
// 0x0010 (0x0010 - 0x0000)
struct WBP_ModalPopup_C_SetCustomConfirmText final
{
public:
	class FText                                   InConfirmText;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ModalPopup_C_SetCustomConfirmText) == 0x000008, "Wrong alignment on WBP_ModalPopup_C_SetCustomConfirmText");
static_assert(sizeof(WBP_ModalPopup_C_SetCustomConfirmText) == 0x000010, "Wrong size on WBP_ModalPopup_C_SetCustomConfirmText");
static_assert(offsetof(WBP_ModalPopup_C_SetCustomConfirmText, InConfirmText) == 0x000000, "Member 'WBP_ModalPopup_C_SetCustomConfirmText::InConfirmText' has a wrong offset!");

// Function WBP_ModalPopup.WBP_ModalPopup_C.SetSaveSlot
// 0x0020 (0x0020 - 0x0000)
struct WBP_ModalPopup_C_SetSaveSlot final
{
public:
	E_jRPG_YesNoQuestions                         Decision_0;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SelectedGameSaveSlot_0;                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
