#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BattleTransition

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BattleTransition.WBP_BattleTransition_C
// 0x0048 (0x0328 - 0x02E0)
class UWBP_BattleTransition_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_FadeIN;                                       // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_FadeOUT;                                      // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   NiagaraSystemWidget;                               // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        Opacity;                                           // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	double                                        ScreenScaling;                                     // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	double                                        FishEyeRadius;                                     // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	double                                        DesaturationScreen;                                // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_BattleTransition(int32 EntryPoint);
	void Fade_In();
	void Fade_Out();
	void OnFadeOutAnimationFinished();
	void OnInitialized();
	void SetDesaturationScreen(double NewValue);
	void SetFishEyeRadius(double NewValue);
	void SetOpacity(double NewValue);
	void SetScreenScaling(double NewValue);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BattleTransition_C">();
	}
	static class UWBP_BattleTransition_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BattleTransition_C>();
	}
};
static_assert(alignof(UWBP_BattleTransition_C) == 0x000008, "Wrong alignment on UWBP_BattleTransition_C");
static_assert(sizeof(UWBP_BattleTransition_C) == 0x000328, "Wrong size on UWBP_BattleTransition_C");
static_assert(offsetof(UWBP_BattleTransition_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_BattleTransition_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_BattleTransition_C, Anim_FadeIN) == 0x0002E8, "Member 'UWBP_BattleTransition_C::Anim_FadeIN' has a wrong offset!");
static_assert(offsetof(UWBP_BattleTransition_C, Anim_FadeOUT) == 0x0002F0, "Member 'UWBP_BattleTransition_C::Anim_FadeOUT' has a wrong offset!");
static_assert(offsetof(UWBP_BattleTransition_C, Image) == 0x0002F8, "Member 'UWBP_BattleTransition_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_BattleTransition_C, NiagaraSystemWidget) == 0x000300, "Member 'UWBP_BattleTransition_C::NiagaraSystemWidget' has a wrong offset!");
static_assert(offsetof(UWBP_BattleTransition_C, Opacity) == 0x000308, "Member 'UWBP_BattleTransition_C::Opacity' has a wrong offset!");
static_assert(offsetof(UWBP_BattleTransition_C, ScreenScaling) == 0x000310, "Member 'UWBP_BattleTransition_C::ScreenScaling' has a wrong offset!");
static_assert(offsetof(UWBP_BattleTransition_C, FishEyeRadius) == 0x000318, "Member 'UWBP_BattleTransition_C::FishEyeRadius' has a wrong offset!");
static_assert(offsetof(UWBP_BattleTransition_C, DesaturationScreen) == 0x000320, "Member 'UWBP_BattleTransition_C::DesaturationScreen' has a wrong offset!");

}

