#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HintOverlay

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_HintOverlay.WBP_HintOverlay_C.ExecuteUbergraph_WBP_HintOverlay
// 0x0040 (0x0040 - 0x0000)
struct WBP_HintOverlay_C_ExecuteUbergraph_WBP_HintOverlay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_InputManager_C*                     CallFunc_GetInputManager_InputManager;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_ProcessTextForInlineInputTag_Output;      // 0x0028(0x0010)()
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HintOverlay_C_ExecuteUbergraph_WBP_HintOverlay) == 0x000008, "Wrong alignment on WBP_HintOverlay_C_ExecuteUbergraph_WBP_HintOverlay");
static_assert(sizeof(WBP_HintOverlay_C_ExecuteUbergraph_WBP_HintOverlay) == 0x000040, "Wrong size on WBP_HintOverlay_C_ExecuteUbergraph_WBP_HintOverlay");
static_assert(offsetof(WBP_HintOverlay_C_ExecuteUbergraph_WBP_HintOverlay, EntryPoint) == 0x000000, "Member 'WBP_HintOverlay_C_ExecuteUbergraph_WBP_HintOverlay::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HintOverlay_C_ExecuteUbergraph_WBP_HintOverlay, CallFunc_GetInputManager_InputManager) == 0x000008, "Member 'WBP_HintOverlay_C_ExecuteUbergraph_WBP_HintOverlay::CallFunc_GetInputManager_InputManager' has a wrong offset!");
static_assert(offsetof(WBP_HintOverlay_C_ExecuteUbergraph_WBP_HintOverlay, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_HintOverlay_C_ExecuteUbergraph_WBP_HintOverlay::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintOverlay_C_ExecuteUbergraph_WBP_HintOverlay, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'WBP_HintOverlay_C_ExecuteUbergraph_WBP_HintOverlay::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HintOverlay_C_ExecuteUbergraph_WBP_HintOverlay, CallFunc_PlayAnimation_ReturnValue_1) == 0x000020, "Member 'WBP_HintOverlay_C_ExecuteUbergraph_WBP_HintOverlay::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HintOverlay_C_ExecuteUbergraph_WBP_HintOverlay, CallFunc_ProcessTextForInlineInputTag_Output) == 0x000028, "Member 'WBP_HintOverlay_C_ExecuteUbergraph_WBP_HintOverlay::CallFunc_ProcessTextForInlineInputTag_Output' has a wrong offset!");
static_assert(offsetof(WBP_HintOverlay_C_ExecuteUbergraph_WBP_HintOverlay, CallFunc_Delay_Duration_ImplicitCast) == 0x000038, "Member 'WBP_HintOverlay_C_ExecuteUbergraph_WBP_HintOverlay::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

}

