#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_Battle_TargetingControls

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_HUD_Battle_TargetingControls.WBP_HUD_Battle_TargetingControls_C.BndEvt__WBP_HUD_Battle_TargetingControls_WBP_GM_PromptGeneric_Back_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_HUD_Battle_TargetingControls_C_BndEvt__WBP_HUD_Battle_TargetingControls_WBP_GM_PromptGeneric_Back_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_Battle_TargetingControls_C_BndEvt__WBP_HUD_Battle_TargetingControls_WBP_GM_PromptGeneric_Back_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_HUD_Battle_TargetingControls_C_BndEvt__WBP_HUD_Battle_TargetingControls_WBP_GM_PromptGeneric_Back_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_HUD_Battle_TargetingControls_C_BndEvt__WBP_HUD_Battle_TargetingControls_WBP_GM_PromptGeneric_Back_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_HUD_Battle_TargetingControls_C_BndEvt__WBP_HUD_Battle_TargetingControls_WBP_GM_PromptGeneric_Back_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_HUD_Battle_TargetingControls_C_BndEvt__WBP_HUD_Battle_TargetingControls_WBP_GM_PromptGeneric_Back_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_HUD_Battle_TargetingControls_C_BndEvt__WBP_HUD_Battle_TargetingControls_WBP_GM_PromptGeneric_Back_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_HUD_Battle_TargetingControls.WBP_HUD_Battle_TargetingControls_C.BndEvt__WBP_HUD_CancelButton_WBP_GM_PromptGeneric_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_HUD_Battle_TargetingControls_C_BndEvt__WBP_HUD_CancelButton_WBP_GM_PromptGeneric_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_Battle_TargetingControls_C_BndEvt__WBP_HUD_CancelButton_WBP_GM_PromptGeneric_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_HUD_Battle_TargetingControls_C_BndEvt__WBP_HUD_CancelButton_WBP_GM_PromptGeneric_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_HUD_Battle_TargetingControls_C_BndEvt__WBP_HUD_CancelButton_WBP_GM_PromptGeneric_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_HUD_Battle_TargetingControls_C_BndEvt__WBP_HUD_CancelButton_WBP_GM_PromptGeneric_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_HUD_Battle_TargetingControls_C_BndEvt__WBP_HUD_CancelButton_WBP_GM_PromptGeneric_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_HUD_Battle_TargetingControls_C_BndEvt__WBP_HUD_CancelButton_WBP_GM_PromptGeneric_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_HUD_Battle_TargetingControls.WBP_HUD_Battle_TargetingControls_C.ExecuteUbergraph_WBP_HUD_Battle_TargetingControls
// 0x0030 (0x0030 - 0x0000)
struct WBP_HUD_Battle_TargetingControls_C_ExecuteUbergraph_WBP_HUD_Battle_TargetingControls final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UBP_UINavigationFocusEvent_C*     K2Node_Event_FocusEventBP;                         // 0x0010(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_Battle_TargetingControls_C_ExecuteUbergraph_WBP_HUD_Battle_TargetingControls) == 0x000008, "Wrong alignment on WBP_HUD_Battle_TargetingControls_C_ExecuteUbergraph_WBP_HUD_Battle_TargetingControls");
static_assert(sizeof(WBP_HUD_Battle_TargetingControls_C_ExecuteUbergraph_WBP_HUD_Battle_TargetingControls) == 0x000030, "Wrong size on WBP_HUD_Battle_TargetingControls_C_ExecuteUbergraph_WBP_HUD_Battle_TargetingControls");
static_assert(offsetof(WBP_HUD_Battle_TargetingControls_C_ExecuteUbergraph_WBP_HUD_Battle_TargetingControls, EntryPoint) == 0x000000, "Member 'WBP_HUD_Battle_TargetingControls_C_ExecuteUbergraph_WBP_HUD_Battle_TargetingControls::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_TargetingControls_C_ExecuteUbergraph_WBP_HUD_Battle_TargetingControls, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'WBP_HUD_Battle_TargetingControls_C_ExecuteUbergraph_WBP_HUD_Battle_TargetingControls::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_TargetingControls_C_ExecuteUbergraph_WBP_HUD_Battle_TargetingControls, K2Node_Event_FocusEventBP) == 0x000010, "Member 'WBP_HUD_Battle_TargetingControls_C_ExecuteUbergraph_WBP_HUD_Battle_TargetingControls::K2Node_Event_FocusEventBP' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_TargetingControls_C_ExecuteUbergraph_WBP_HUD_Battle_TargetingControls, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'WBP_HUD_Battle_TargetingControls_C_ExecuteUbergraph_WBP_HUD_Battle_TargetingControls::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_TargetingControls_C_ExecuteUbergraph_WBP_HUD_Battle_TargetingControls, CallFunc_PlayAnimation_ReturnValue_1) == 0x000020, "Member 'WBP_HUD_Battle_TargetingControls_C_ExecuteUbergraph_WBP_HUD_Battle_TargetingControls::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_Battle_TargetingControls_C_ExecuteUbergraph_WBP_HUD_Battle_TargetingControls, K2Node_ComponentBoundEvent_Button_1) == 0x000028, "Member 'WBP_HUD_Battle_TargetingControls_C_ExecuteUbergraph_WBP_HUD_Battle_TargetingControls::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");

// Function WBP_HUD_Battle_TargetingControls.WBP_HUD_Battle_TargetingControls_C.GetTiedObject
// 0x0008 (0x0008 - 0x0000)
struct WBP_HUD_Battle_TargetingControls_C_GetTiedObject final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_Battle_TargetingControls_C_GetTiedObject) == 0x000008, "Wrong alignment on WBP_HUD_Battle_TargetingControls_C_GetTiedObject");
static_assert(sizeof(WBP_HUD_Battle_TargetingControls_C_GetTiedObject) == 0x000008, "Wrong size on WBP_HUD_Battle_TargetingControls_C_GetTiedObject");
static_assert(offsetof(WBP_HUD_Battle_TargetingControls_C_GetTiedObject, Object) == 0x000000, "Member 'WBP_HUD_Battle_TargetingControls_C_GetTiedObject::Object' has a wrong offset!");

// Function WBP_HUD_Battle_TargetingControls.WBP_HUD_Battle_TargetingControls_C.OnUINavigationFocus
// 0x0008 (0x0008 - 0x0000)
struct WBP_HUD_Battle_TargetingControls_C_OnUINavigationFocus final
{
public:
	const class UBP_UINavigationFocusEvent_C*     FocusEventBP;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_Battle_TargetingControls_C_OnUINavigationFocus) == 0x000008, "Wrong alignment on WBP_HUD_Battle_TargetingControls_C_OnUINavigationFocus");
static_assert(sizeof(WBP_HUD_Battle_TargetingControls_C_OnUINavigationFocus) == 0x000008, "Wrong size on WBP_HUD_Battle_TargetingControls_C_OnUINavigationFocus");
static_assert(offsetof(WBP_HUD_Battle_TargetingControls_C_OnUINavigationFocus, FocusEventBP) == 0x000000, "Member 'WBP_HUD_Battle_TargetingControls_C_OnUINavigationFocus::FocusEventBP' has a wrong offset!");

}

