#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GM_COV_LuminaElement

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GM_COV_LuminaElement.WBP_GM_COV_LuminaElement_C
// 0x0048 (0x0350 - 0x0308)
class UWBP_GM_COV_LuminaElement_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_BaseButton_C*                      BaseButton;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       LuminaCost;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScalingText_C*                     LuminaName;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NotificationBullet_C*              NotificationBullet;                                // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PictoIcon_C*                       PictoOwnerIcon;                                    // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PassiveEffectInstance_C*            PassiveEffectInstance;                             // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class FName PassiveEffectID)> OnLuminaElementShortClicked;         // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_GM_COV_LuminaElement_BaseButton_K2Node_ComponentBoundEvent_0_OnButtonBaseFocusedHold__DelegateSignature();
	void BndEvt__WBP_GM_LuminaElementShort_WBP_BaseButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void ExecuteUbergraph_WBP_GM_COV_LuminaElement(int32 EntryPoint);
	void OnHighlightedStateChanged(bool InIsHighlighted);
	void OnListItemObjectSet(class UObject* ListItemObject);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GM_COV_LuminaElement_C">();
	}
	static class UWBP_GM_COV_LuminaElement_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GM_COV_LuminaElement_C>();
	}
};
static_assert(alignof(UWBP_GM_COV_LuminaElement_C) == 0x000008, "Wrong alignment on UWBP_GM_COV_LuminaElement_C");
static_assert(sizeof(UWBP_GM_COV_LuminaElement_C) == 0x000350, "Wrong size on UWBP_GM_COV_LuminaElement_C");
static_assert(offsetof(UWBP_GM_COV_LuminaElement_C, UberGraphFrame) == 0x000308, "Member 'UWBP_GM_COV_LuminaElement_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GM_COV_LuminaElement_C, BaseButton) == 0x000310, "Member 'UWBP_GM_COV_LuminaElement_C::BaseButton' has a wrong offset!");
static_assert(offsetof(UWBP_GM_COV_LuminaElement_C, LuminaCost) == 0x000318, "Member 'UWBP_GM_COV_LuminaElement_C::LuminaCost' has a wrong offset!");
static_assert(offsetof(UWBP_GM_COV_LuminaElement_C, LuminaName) == 0x000320, "Member 'UWBP_GM_COV_LuminaElement_C::LuminaName' has a wrong offset!");
static_assert(offsetof(UWBP_GM_COV_LuminaElement_C, NotificationBullet) == 0x000328, "Member 'UWBP_GM_COV_LuminaElement_C::NotificationBullet' has a wrong offset!");
static_assert(offsetof(UWBP_GM_COV_LuminaElement_C, PictoOwnerIcon) == 0x000330, "Member 'UWBP_GM_COV_LuminaElement_C::PictoOwnerIcon' has a wrong offset!");
static_assert(offsetof(UWBP_GM_COV_LuminaElement_C, PassiveEffectInstance) == 0x000338, "Member 'UWBP_GM_COV_LuminaElement_C::PassiveEffectInstance' has a wrong offset!");
static_assert(offsetof(UWBP_GM_COV_LuminaElement_C, OnLuminaElementShortClicked) == 0x000340, "Member 'UWBP_GM_COV_LuminaElement_C::OnLuminaElementShortClicked' has a wrong offset!");

}

