#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SavePointMenu

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "FLevelDataEntry_structs.hpp"
#include "S_LevelSpawnPointData_structs.hpp"
#include "ELevelType_structs.hpp"
#include "UMG_structs.hpp"
#include "SandFall_structs.hpp"
#include "EModalUIResponse_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_SavePointSubMenu_structs.hpp"
#include "S_GameMenuParameters_structs.hpp"


namespace SDK::Params
{

// Function WBP_SavePointMenu.WBP_SavePointMenu_C.BndEvt__WBP_SavePointMenu_BackToWorldMapButton_K2Node_ComponentBoundEvent_16_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_BackToWorldMapButton_K2Node_ComponentBoundEvent_16_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_BackToWorldMapButton_K2Node_ComponentBoundEvent_16_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_BackToWorldMapButton_K2Node_ComponentBoundEvent_16_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_BackToWorldMapButton_K2Node_ComponentBoundEvent_16_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_BackToWorldMapButton_K2Node_ComponentBoundEvent_16_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_BackToWorldMapButton_K2Node_ComponentBoundEvent_16_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_BackToWorldMapButton_K2Node_ComponentBoundEvent_16_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SavePointMenu.WBP_SavePointMenu_C.BndEvt__WBP_SavePointMenu_BackToWorldMapButton_K2Node_ComponentBoundEvent_25_OnButtonBaseFocused__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_BackToWorldMapButton_K2Node_ComponentBoundEvent_25_OnButtonBaseFocused__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_BackToWorldMapButton_K2Node_ComponentBoundEvent_25_OnButtonBaseFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_BackToWorldMapButton_K2Node_ComponentBoundEvent_25_OnButtonBaseFocused__DelegateSignature");
static_assert(sizeof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_BackToWorldMapButton_K2Node_ComponentBoundEvent_25_OnButtonBaseFocused__DelegateSignature) == 0x000008, "Wrong size on WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_BackToWorldMapButton_K2Node_ComponentBoundEvent_25_OnButtonBaseFocused__DelegateSignature");
static_assert(offsetof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_BackToWorldMapButton_K2Node_ComponentBoundEvent_25_OnButtonBaseFocused__DelegateSignature, Button) == 0x000000, "Member 'WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_BackToWorldMapButton_K2Node_ComponentBoundEvent_25_OnButtonBaseFocused__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SavePointMenu.WBP_SavePointMenu_C.BndEvt__WBP_SavePointMenu_FastTravelButton_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_FastTravelButton_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_FastTravelButton_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_FastTravelButton_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_FastTravelButton_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_FastTravelButton_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_FastTravelButton_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_FastTravelButton_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SavePointMenu.WBP_SavePointMenu_C.BndEvt__WBP_SavePointMenu_FastTravelButton_K2Node_ComponentBoundEvent_19_OnButtonBaseFocused__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_FastTravelButton_K2Node_ComponentBoundEvent_19_OnButtonBaseFocused__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_FastTravelButton_K2Node_ComponentBoundEvent_19_OnButtonBaseFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_FastTravelButton_K2Node_ComponentBoundEvent_19_OnButtonBaseFocused__DelegateSignature");
static_assert(sizeof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_FastTravelButton_K2Node_ComponentBoundEvent_19_OnButtonBaseFocused__DelegateSignature) == 0x000008, "Wrong size on WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_FastTravelButton_K2Node_ComponentBoundEvent_19_OnButtonBaseFocused__DelegateSignature");
static_assert(offsetof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_FastTravelButton_K2Node_ComponentBoundEvent_19_OnButtonBaseFocused__DelegateSignature, Button) == 0x000000, "Member 'WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_FastTravelButton_K2Node_ComponentBoundEvent_19_OnButtonBaseFocused__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SavePointMenu.WBP_SavePointMenu_C.BndEvt__WBP_SavePointMenu_LearnSkillsButton_K2Node_ComponentBoundEvent_3_OnLearnSkillsButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_LearnSkillsButton_K2Node_ComponentBoundEvent_3_OnLearnSkillsButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_LearnSkillsButton_K2Node_ComponentBoundEvent_3_OnLearnSkillsButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_LearnSkillsButton_K2Node_ComponentBoundEvent_3_OnLearnSkillsButtonClicked__DelegateSignature");
static_assert(sizeof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_LearnSkillsButton_K2Node_ComponentBoundEvent_3_OnLearnSkillsButtonClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_LearnSkillsButton_K2Node_ComponentBoundEvent_3_OnLearnSkillsButtonClicked__DelegateSignature");
static_assert(offsetof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_LearnSkillsButton_K2Node_ComponentBoundEvent_3_OnLearnSkillsButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_LearnSkillsButton_K2Node_ComponentBoundEvent_3_OnLearnSkillsButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SavePointMenu.WBP_SavePointMenu_C.BndEvt__WBP_SavePointMenu_LearnSkillsButton_K2Node_ComponentBoundEvent_4_OnLearnSkillsButtonFocused__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_LearnSkillsButton_K2Node_ComponentBoundEvent_4_OnLearnSkillsButtonFocused__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_LearnSkillsButton_K2Node_ComponentBoundEvent_4_OnLearnSkillsButtonFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_LearnSkillsButton_K2Node_ComponentBoundEvent_4_OnLearnSkillsButtonFocused__DelegateSignature");
static_assert(sizeof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_LearnSkillsButton_K2Node_ComponentBoundEvent_4_OnLearnSkillsButtonFocused__DelegateSignature) == 0x000008, "Wrong size on WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_LearnSkillsButton_K2Node_ComponentBoundEvent_4_OnLearnSkillsButtonFocused__DelegateSignature");
static_assert(offsetof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_LearnSkillsButton_K2Node_ComponentBoundEvent_4_OnLearnSkillsButtonFocused__DelegateSignature, Button) == 0x000000, "Member 'WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_LearnSkillsButton_K2Node_ComponentBoundEvent_4_OnLearnSkillsButtonFocused__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SavePointMenu.WBP_SavePointMenu_C.BndEvt__WBP_SavePointMenu_NGPButton_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_NGPButton_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_NGPButton_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_NGPButton_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_NGPButton_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_NGPButton_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_NGPButton_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_NGPButton_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SavePointMenu.WBP_SavePointMenu_C.BndEvt__WBP_SavePointMenu_NGPButton_K2Node_ComponentBoundEvent_24_OnButtonBaseFocused__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_NGPButton_K2Node_ComponentBoundEvent_24_OnButtonBaseFocused__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_NGPButton_K2Node_ComponentBoundEvent_24_OnButtonBaseFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_NGPButton_K2Node_ComponentBoundEvent_24_OnButtonBaseFocused__DelegateSignature");
static_assert(sizeof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_NGPButton_K2Node_ComponentBoundEvent_24_OnButtonBaseFocused__DelegateSignature) == 0x000008, "Wrong size on WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_NGPButton_K2Node_ComponentBoundEvent_24_OnButtonBaseFocused__DelegateSignature");
static_assert(offsetof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_NGPButton_K2Node_ComponentBoundEvent_24_OnButtonBaseFocused__DelegateSignature, Button) == 0x000000, "Member 'WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_NGPButton_K2Node_ComponentBoundEvent_24_OnButtonBaseFocused__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SavePointMenu.WBP_SavePointMenu_C.BndEvt__WBP_SavePointMenu_RestButton_K2Node_ComponentBoundEvent_18_OnButtonBaseFocused__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_RestButton_K2Node_ComponentBoundEvent_18_OnButtonBaseFocused__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_RestButton_K2Node_ComponentBoundEvent_18_OnButtonBaseFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_RestButton_K2Node_ComponentBoundEvent_18_OnButtonBaseFocused__DelegateSignature");
static_assert(sizeof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_RestButton_K2Node_ComponentBoundEvent_18_OnButtonBaseFocused__DelegateSignature) == 0x000008, "Wrong size on WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_RestButton_K2Node_ComponentBoundEvent_18_OnButtonBaseFocused__DelegateSignature");
static_assert(offsetof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_RestButton_K2Node_ComponentBoundEvent_18_OnButtonBaseFocused__DelegateSignature, Button) == 0x000000, "Member 'WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_RestButton_K2Node_ComponentBoundEvent_18_OnButtonBaseFocused__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SavePointMenu.WBP_SavePointMenu_C.BndEvt__WBP_SavePointMenu_RestButton_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_RestButton_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_RestButton_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_RestButton_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_RestButton_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_RestButton_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_RestButton_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_RestButton_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SavePointMenu.WBP_SavePointMenu_C.BndEvt__WBP_SavePointMenu_UpgradeAttributesButton_K2Node_ComponentBoundEvent_1_OnUpgradeAttributesButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeAttributesButton_K2Node_ComponentBoundEvent_1_OnUpgradeAttributesButtonClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeAttributesButton_K2Node_ComponentBoundEvent_1_OnUpgradeAttributesButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeAttributesButton_K2Node_ComponentBoundEvent_1_OnUpgradeAttributesButtonClicked__DelegateSignature");
static_assert(sizeof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeAttributesButton_K2Node_ComponentBoundEvent_1_OnUpgradeAttributesButtonClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeAttributesButton_K2Node_ComponentBoundEvent_1_OnUpgradeAttributesButtonClicked__DelegateSignature");
static_assert(offsetof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeAttributesButton_K2Node_ComponentBoundEvent_1_OnUpgradeAttributesButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeAttributesButton_K2Node_ComponentBoundEvent_1_OnUpgradeAttributesButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SavePointMenu.WBP_SavePointMenu_C.BndEvt__WBP_SavePointMenu_UpgradeAttributesButton_K2Node_ComponentBoundEvent_2_OnUpgradeAttributesButtonFocused__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeAttributesButton_K2Node_ComponentBoundEvent_2_OnUpgradeAttributesButtonFocused__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeAttributesButton_K2Node_ComponentBoundEvent_2_OnUpgradeAttributesButtonFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeAttributesButton_K2Node_ComponentBoundEvent_2_OnUpgradeAttributesButtonFocused__DelegateSignature");
static_assert(sizeof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeAttributesButton_K2Node_ComponentBoundEvent_2_OnUpgradeAttributesButtonFocused__DelegateSignature) == 0x000008, "Wrong size on WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeAttributesButton_K2Node_ComponentBoundEvent_2_OnUpgradeAttributesButtonFocused__DelegateSignature");
static_assert(offsetof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeAttributesButton_K2Node_ComponentBoundEvent_2_OnUpgradeAttributesButtonFocused__DelegateSignature, Button) == 0x000000, "Member 'WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeAttributesButton_K2Node_ComponentBoundEvent_2_OnUpgradeAttributesButtonFocused__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SavePointMenu.WBP_SavePointMenu_C.BndEvt__WBP_SavePointMenu_UpgradeTeamButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeTeamButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeTeamButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeTeamButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeTeamButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeTeamButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeTeamButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeTeamButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SavePointMenu.WBP_SavePointMenu_C.BndEvt__WBP_SavePointMenu_UpgradeTeamButton_K2Node_ComponentBoundEvent_23_OnButtonBaseFocused__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeTeamButton_K2Node_ComponentBoundEvent_23_OnButtonBaseFocused__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeTeamButton_K2Node_ComponentBoundEvent_23_OnButtonBaseFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeTeamButton_K2Node_ComponentBoundEvent_23_OnButtonBaseFocused__DelegateSignature");
static_assert(sizeof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeTeamButton_K2Node_ComponentBoundEvent_23_OnButtonBaseFocused__DelegateSignature) == 0x000008, "Wrong size on WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeTeamButton_K2Node_ComponentBoundEvent_23_OnButtonBaseFocused__DelegateSignature");
static_assert(offsetof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeTeamButton_K2Node_ComponentBoundEvent_23_OnButtonBaseFocused__DelegateSignature, Button) == 0x000000, "Member 'WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeTeamButton_K2Node_ComponentBoundEvent_23_OnButtonBaseFocused__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SavePointMenu.WBP_SavePointMenu_C.BndEvt__WBP_SavePointMenu_UpgradeWeaponsButton_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeWeaponsButton_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeWeaponsButton_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeWeaponsButton_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeWeaponsButton_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeWeaponsButton_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeWeaponsButton_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeWeaponsButton_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SavePointMenu.WBP_SavePointMenu_C.BndEvt__WBP_SavePointMenu_UpgradeWeaponsButton_K2Node_ComponentBoundEvent_22_OnButtonBaseFocused__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeWeaponsButton_K2Node_ComponentBoundEvent_22_OnButtonBaseFocused__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeWeaponsButton_K2Node_ComponentBoundEvent_22_OnButtonBaseFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeWeaponsButton_K2Node_ComponentBoundEvent_22_OnButtonBaseFocused__DelegateSignature");
static_assert(sizeof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeWeaponsButton_K2Node_ComponentBoundEvent_22_OnButtonBaseFocused__DelegateSignature) == 0x000008, "Wrong size on WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeWeaponsButton_K2Node_ComponentBoundEvent_22_OnButtonBaseFocused__DelegateSignature");
static_assert(offsetof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeWeaponsButton_K2Node_ComponentBoundEvent_22_OnButtonBaseFocused__DelegateSignature, Button) == 0x000000, "Member 'WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_UpgradeWeaponsButton_K2Node_ComponentBoundEvent_22_OnButtonBaseFocused__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SavePointMenu.WBP_SavePointMenu_C.BndEvt__WBP_SavePointMenu_WBP_CommonBoundActionButton_Back_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_WBP_CommonBoundActionButton_Back_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_WBP_CommonBoundActionButton_Back_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_WBP_CommonBoundActionButton_Back_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_WBP_CommonBoundActionButton_Back_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_WBP_CommonBoundActionButton_Back_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_WBP_CommonBoundActionButton_Back_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_SavePointMenu_C_BndEvt__WBP_SavePointMenu_WBP_CommonBoundActionButton_Back_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SavePointMenu.WBP_SavePointMenu_C.ConfirmStartNewGamePlus
// 0x0018 (0x0018 - 0x0000)
struct WBP_SavePointMenu_C_ConfirmStartNewGamePlus final
{
public:
	TDelegate<void(EModalUIResponse InUserResponse)> K2Node_CreateDelegate_OutputDelegate;           // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_ModalPopup_C*                      CallFunc_CreateModalWindow_OutputPin;              // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavePointMenu_C_ConfirmStartNewGamePlus) == 0x000008, "Wrong alignment on WBP_SavePointMenu_C_ConfirmStartNewGamePlus");
static_assert(sizeof(WBP_SavePointMenu_C_ConfirmStartNewGamePlus) == 0x000018, "Wrong size on WBP_SavePointMenu_C_ConfirmStartNewGamePlus");
static_assert(offsetof(WBP_SavePointMenu_C_ConfirmStartNewGamePlus, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_SavePointMenu_C_ConfirmStartNewGamePlus::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_SavePointMenu_C_ConfirmStartNewGamePlus, CallFunc_CreateModalWindow_OutputPin) == 0x000010, "Member 'WBP_SavePointMenu_C_ConfirmStartNewGamePlus::CallFunc_CreateModalWindow_OutputPin' has a wrong offset!");

// Function WBP_SavePointMenu.WBP_SavePointMenu_C.ExecuteUbergraph_WBP_SavePointMenu
// 0x0520 (0x0520 - 0x0000)
struct WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Panel_Blacksmith_Consumables_C*    CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Panel_Blacksmith_C*                CallFunc_Create_ReturnValue_1;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_SavePointSubMenu                            Temp_byte_Variable;                                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0084(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0094(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_jRPG_InventoryManager_C*            CallFunc_GetInventoryManager_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	E_SavePointSubMenu                            K2Node_CustomEvent_SubMenu;                        // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_jRPG_GI_Custom_C*                   CallFunc_GetCustomGI_ReturnValue;                  // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_16;              // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_15;              // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_14;              // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_13;              // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_12;              // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_11;              // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LoadState_HasContent;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_10;              // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LoadState_HasContent_1;                   // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindCurrentLevelData_Found;               // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFLevelDataEntry                       CallFunc_FindCurrentLevelData_LevelData;           // 0x0128(0x01B0)(HasGetValueTypeHash)
	class FName                                   CallFunc_FindCurrentLevelData_RowName;             // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x3];                                      // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x02F4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_1;  // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_1; // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x3];                                      // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x031C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Controller_World_C*            K2Node_DynamicCast_AsBP_J_RPG_Controller_World;    // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_2;  // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_2; // 0x0350(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_3;  // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_3; // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x0380(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_4;  // 0x0398(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_4; // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x03AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlayingForward_ReturnValue;    // 0x03AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AE[0x2];                                      // 0x03AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result; // 0x03B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue; // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_SavePointSubMenu                            K2Node_CustomEvent_InSubMenu;                      // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x03C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CA[0x2];                                      // 0x03CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default_1;                           // 0x03CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x03D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D5[0x3];                                      // 0x03D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x03D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x03E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FS_GameMenuParameters                  K2Node_MakeStruct_S_GameMenuParameters;            // 0x03F8(0x0018)(HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0410(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Controller_World_C*            K2Node_DynamicCast_AsBP_J_RPG_Controller_World_1;  // 0x0418(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_421[0x3];                                      // 0x0421(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x0424(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_5;  // 0x0438(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_5; // 0x0440(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_449[0x7];                                      // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_6;  // 0x0450(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_6; // 0x0458(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_13;           // 0x0460(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_471[0x7];                                      // 0x0471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0478(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Controller_World_C*            K2Node_DynamicCast_AsBP_J_RPG_Controller_World_2;  // 0x0480(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0490(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_jRPG_Controller_World_C*            K2Node_DynamicCast_AsBP_J_RPG_Controller_World_3;  // 0x0498(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result_7;  // 0x04A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue_7; // 0x04B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B9[0x3];                                      // 0x04B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_14;           // 0x04BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CC[0x4];                                      // 0x04CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_9;               // 0x04D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_8;               // 0x04D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_7;               // 0x04E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_6;               // 0x04E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_5;               // 0x04F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_4;               // 0x04F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_3;               // 0x0500(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0508(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0510(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0518(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu) == 0x000008, "Wrong alignment on WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu");
static_assert(sizeof(WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu) == 0x000520, "Wrong size on WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu");
static_assert(offsetof(WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu, EntryPoint) == 0x000000, "Member 'WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu, CallFunc_SpawnSound2D_ReturnValue) == 0x000008, "Member 'WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu, CallFunc_Create_ReturnValue) == 0x000020, "Member 'WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu, CallFunc_Create_ReturnValue_1) == 0x000028, "Member 'WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu, K2Node_CreateDelegate_OutputDelegate_2) == 0x000040, "Member 'WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu, Temp_byte_Variable) == 0x000050, "Member 'WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu, K2Node_CreateDelegate_OutputDelegate_3) == 0x000054, "Member 'WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu, Temp_name_Variable) == 0x000064, "Member 'WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu, Temp_name_Variable_1) == 0x00006C, "Member 'WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu, Temp_name_Variable_2) == 0x000074, "Member 'WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu, Temp_name_Variable_3) == 0x00007C, "Member 'WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu, K2Node_CreateDelegate_OutputDelegate_4) == 0x000084, "Member 'WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu, K2Node_CreateDelegate_OutputDelegate_5) == 0x000094, "Member 'WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu, Temp_bool_Variable) == 0x0000A4, "Member 'WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu, Temp_real_Variable) == 0x0000A8, "Member 'WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000AC, "Member 'WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu, CallFunc_GetInventoryManager_ReturnValue) == 0x0000C0, "Member 'WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu::CallFunc_GetInventoryManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu, K2Node_CustomEvent_SubMenu) == 0x0000C8, "Member 'WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu::K2Node_CustomEvent_SubMenu' has a wrong offset!");
static_assert(offsetof(WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu, CallFunc_GetCustomGI_ReturnValue) == 0x0000D0, "Member 'WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu::CallFunc_GetCustomGI_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu, K2Node_ComponentBoundEvent_Button_16) == 0x0000D8, "Member 'WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu::K2Node_ComponentBoundEvent_Button_16' has a wrong offset!");
static_assert(offsetof(WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu, K2Node_ComponentBoundEvent_Button_15) == 0x0000E0, "Member 'WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu::K2Node_ComponentBoundEvent_Button_15' has a wrong offset!");
static_assert(offsetof(WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu, K2Node_ComponentBoundEvent_Button_14) == 0x0000E8, "Member 'WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu::K2Node_ComponentBoundEvent_Button_14' has a wrong offset!");
static_assert(offsetof(WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu, K2Node_ComponentBoundEvent_Button_13) == 0x0000F0, "Member 'WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu::K2Node_ComponentBoundEvent_Button_13' has a wrong offset!");
static_assert(offsetof(WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu, K2Node_ComponentBoundEvent_Button_12) == 0x0000F8, "Member 'WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu::K2Node_ComponentBoundEvent_Button_12' has a wrong offset!");
static_assert(offsetof(WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu, K2Node_ComponentBoundEvent_Button_11) == 0x000100, "Member 'WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu::K2Node_ComponentBoundEvent_Button_11' has a wrong offset!");
static_assert(offsetof(WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu, CallFunc_LoadState_HasContent) == 0x000108, "Member 'WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu::CallFunc_LoadState_HasContent' has a wrong offset!");
static_assert(offsetof(WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x00010C, "Member 'WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000110, "Member 'WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu, K2Node_ComponentBoundEvent_Button_10) == 0x000118, "Member 'WBP_SavePointMenu_C_ExecuteUbergraph_WBP_SavePointMenu::K2Node_ComponentBoundEvent_Button_10' has a wrong offset!");
