#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PortraitUniqueMechanic_Stances

#include "Basic.hpp"

#include "E_StanceType_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_PortraitUniqueMechanic_Stances.WBP_PortraitUniqueMechanic_Stances_C.ExecuteUbergraph_WBP_PortraitUniqueMechanic_Stances
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_PortraitUniqueMechanic_Stances_C_ExecuteUbergraph_WBP_PortraitUniqueMechanic_Stances final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetStanceIcon_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_StanceType                                  Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0024(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0038(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x004C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0060(0x0014)()
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetStanceDisplayName_ReturnValue;         // 0x0078(0x0010)()
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0088(0x0014)()
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PortraitUniqueMechanic_Stances_C_ExecuteUbergraph_WBP_PortraitUniqueMechanic_Stances) == 0x000008, "Wrong alignment on WBP_PortraitUniqueMechanic_Stances_C_ExecuteUbergraph_WBP_PortraitUniqueMechanic_Stances");
static_assert(sizeof(WBP_PortraitUniqueMechanic_Stances_C_ExecuteUbergraph_WBP_PortraitUniqueMechanic_Stances) == 0x0000A8, "Wrong size on WBP_PortraitUniqueMechanic_Stances_C_ExecuteUbergraph_WBP_PortraitUniqueMechanic_Stances");
static_assert(offsetof(WBP_PortraitUniqueMechanic_Stances_C_ExecuteUbergraph_WBP_PortraitUniqueMechanic_Stances, EntryPoint) == 0x000000, "Member 'WBP_PortraitUniqueMechanic_Stances_C_ExecuteUbergraph_WBP_PortraitUniqueMechanic_Stances::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PortraitUniqueMechanic_Stances_C_ExecuteUbergraph_WBP_PortraitUniqueMechanic_Stances, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_PortraitUniqueMechanic_Stances_C_ExecuteUbergraph_WBP_PortraitUniqueMechanic_Stances::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PortraitUniqueMechanic_Stances_C_ExecuteUbergraph_WBP_PortraitUniqueMechanic_Stances, CallFunc_GetStanceIcon_ReturnValue) == 0x000018, "Member 'WBP_PortraitUniqueMechanic_Stances_C_ExecuteUbergraph_WBP_PortraitUniqueMechanic_Stances::CallFunc_GetStanceIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PortraitUniqueMechanic_Stances_C_ExecuteUbergraph_WBP_PortraitUniqueMechanic_Stances, Temp_byte_Variable) == 0x000020, "Member 'WBP_PortraitUniqueMechanic_Stances_C_ExecuteUbergraph_WBP_PortraitUniqueMechanic_Stances::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PortraitUniqueMechanic_Stances_C_ExecuteUbergraph_WBP_PortraitUniqueMechanic_Stances, K2Node_MakeStruct_SlateColor) == 0x000024, "Member 'WBP_PortraitUniqueMechanic_Stances_C_ExecuteUbergraph_WBP_PortraitUniqueMechanic_Stances::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_PortraitUniqueMechanic_Stances_C_ExecuteUbergraph_WBP_PortraitUniqueMechanic_Stances, K2Node_MakeStruct_SlateColor_1) == 0x000038, "Member 'WBP_PortraitUniqueMechanic_Stances_C_ExecuteUbergraph_WBP_PortraitUniqueMechanic_Stances::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_PortraitUniqueMechanic_Stances_C_ExecuteUbergraph_WBP_PortraitUniqueMechanic_Stances, K2Node_MakeStruct_SlateColor_2) == 0x00004C, "Member 'WBP_PortraitUniqueMechanic_Stances_C_ExecuteUbergraph_WBP_PortraitUniqueMechanic_Stances::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(WBP_PortraitUniqueMechanic_Stances_C_ExecuteUbergraph_WBP_PortraitUniqueMechanic_Stances, K2Node_MakeStruct_SlateColor_3) == 0x000060, "Member 'WBP_PortraitUniqueMechanic_Stances_C_ExecuteUbergraph_WBP_PortraitUniqueMechanic_Stances::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(WBP_PortraitUniqueMechanic_Stances_C_ExecuteUbergraph_WBP_PortraitUniqueMechanic_Stances, CallFunc_GetStanceDisplayName_ReturnValue) == 0x000078, "Member 'WBP_PortraitUniqueMechanic_Stances_C_ExecuteUbergraph_WBP_PortraitUniqueMechanic_Stances::CallFunc_GetStanceDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PortraitUniqueMechanic_Stances_C_ExecuteUbergraph_WBP_PortraitUniqueMechanic_Stances, K2Node_Select_Default) == 0x000088, "Member 'WBP_PortraitUniqueMechanic_Stances_C_ExecuteUbergraph_WBP_PortraitUniqueMechanic_Stances::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_PortraitUniqueMechanic_Stances_C_ExecuteUbergraph_WBP_PortraitUniqueMechanic_Stances, CallFunc_PlayAnimation_ReturnValue) == 0x0000A0, "Member 'WBP_PortraitUniqueMechanic_Stances_C_ExecuteUbergraph_WBP_PortraitUniqueMechanic_Stances::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

