#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ButtonBinding

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "S_InputBindingParameters_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ButtonBinding.WBP_ButtonBinding_C.SetInputBindingParamters
// 0x0030 (0x0030 - 0x0000)
struct WBP_ButtonBinding_C_SetInputBindingParamters final
{
public:
	struct FS_InputBindingParameters              InputBindingParameters;                            // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDataRowHandleSet_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ButtonBinding_C_SetInputBindingParamters) == 0x000008, "Wrong alignment on WBP_ButtonBinding_C_SetInputBindingParamters");
static_assert(sizeof(WBP_ButtonBinding_C_SetInputBindingParamters) == 0x000030, "Wrong size on WBP_ButtonBinding_C_SetInputBindingParamters");
static_assert(offsetof(WBP_ButtonBinding_C_SetInputBindingParamters, InputBindingParameters) == 0x000000, "Member 'WBP_ButtonBinding_C_SetInputBindingParamters::InputBindingParameters' has a wrong offset!");
static_assert(offsetof(WBP_ButtonBinding_C_SetInputBindingParamters, CallFunc_IsDataRowHandleSet_ReturnValue) == 0x000028, "Member 'WBP_ButtonBinding_C_SetInputBindingParamters::CallFunc_IsDataRowHandleSet_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ButtonBinding_C_SetInputBindingParamters, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'WBP_ButtonBinding_C_SetInputBindingParamters::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_ButtonBinding.WBP_ButtonBinding_C.ActivateTriggeringInputAction
// 0x0010 (0x0010 - 0x0000)
struct WBP_ButtonBinding_C_ActivateTriggeringInputAction final
{
public:
	struct FDataTableRowHandle                    InputActionRow;                                    // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(WBP_ButtonBinding_C_ActivateTriggeringInputAction) == 0x000008, "Wrong alignment on WBP_ButtonBinding_C_ActivateTriggeringInputAction");
static_assert(sizeof(WBP_ButtonBinding_C_ActivateTriggeringInputAction) == 0x000010, "Wrong size on WBP_ButtonBinding_C_ActivateTriggeringInputAction");
static_assert(offsetof(WBP_ButtonBinding_C_ActivateTriggeringInputAction, InputActionRow) == 0x000000, "Member 'WBP_ButtonBinding_C_ActivateTriggeringInputAction::InputActionRow' has a wrong offset!");

// Function WBP_ButtonBinding.WBP_ButtonBinding_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_ButtonBinding_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ButtonBinding_C_Tick) == 0x000004, "Wrong alignment on WBP_ButtonBinding_C_Tick");
static_assert(sizeof(WBP_ButtonBinding_C_Tick) == 0x00003C, "Wrong size on WBP_ButtonBinding_C_Tick");
static_assert(offsetof(WBP_ButtonBinding_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_ButtonBinding_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ButtonBinding_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_ButtonBinding_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_ButtonBinding.WBP_ButtonBinding_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ButtonBinding_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ButtonBinding_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ButtonBinding_C_PreConstruct");
static_assert(sizeof(WBP_ButtonBinding_C_PreConstruct) == 0x000001, "Wrong size on WBP_ButtonBinding_C_PreConstruct");
static_assert(offsetof(WBP_ButtonBinding_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ButtonBinding_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ButtonBinding.WBP_ButtonBinding_C.ExecuteUbergraph_WBP_ButtonBinding
// 0x0160 (0x0160 - 0x0000)
struct WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_4;                            // 0x004C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_5;                            // 0x005C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F[0x1];                                       // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_CustomEvent_InputActionRow;                 // 0x0070(0x0010)(ConstParm, NoDestructor)
	struct FS_InputBindingParameters              K2Node_MakeStruct_S_InputBindingParameters;        // 0x0080(0x0028)(NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00A8(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInteractionEnabled_ReturnValue;         // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_2;                           // 0x010C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue_1;  // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11E[0x2];                                      // 0x011E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_InputBindingParameters              K2Node_MakeStruct_S_InputBindingParameters_1;      // 0x0130(0x0028)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetUserSpecifiedScale_InUserSpecifiedScale_ImplicitCast; // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding) == 0x000008, "Wrong alignment on WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding");
static_assert(sizeof(WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding) == 0x000160, "Wrong size on WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding");
static_assert(offsetof(WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding, EntryPoint) == 0x000000, "Member 'WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding, Temp_struct_Variable) == 0x000004, "Member 'WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding, Temp_struct_Variable_1) == 0x000014, "Member 'WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding, Temp_bool_Variable) == 0x000024, "Member 'WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding, Temp_struct_Variable_2) == 0x000028, "Member 'WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding, Temp_struct_Variable_3) == 0x000038, "Member 'WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding, Temp_bool_Variable_1) == 0x000048, "Member 'WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding, Temp_struct_Variable_4) == 0x00004C, "Member 'WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding, Temp_struct_Variable_5) == 0x00005C, "Member 'WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding, Temp_bool_Variable_2) == 0x00006C, "Member 'WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x00006D, "Member 'WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding, CallFunc_Not_PreBool_ReturnValue) == 0x00006E, "Member 'WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding, K2Node_CustomEvent_InputActionRow) == 0x000070, "Member 'WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding::K2Node_CustomEvent_InputActionRow' has a wrong offset!");
static_assert(offsetof(WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding, K2Node_MakeStruct_S_InputBindingParameters) == 0x000080, "Member 'WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding::K2Node_MakeStruct_S_InputBindingParameters' has a wrong offset!");
static_assert(offsetof(WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding, K2Node_Event_MyGeometry) == 0x0000A8, "Member 'WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding, K2Node_Event_InDeltaTime) == 0x0000E0, "Member 'WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding, CallFunc_GetIsEnabled_ReturnValue) == 0x0000E4, "Member 'WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding, K2Node_Select_Default) == 0x0000E8, "Member 'WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding, K2Node_Select_Default_1) == 0x0000F8, "Member 'WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding, CallFunc_IsInteractionEnabled_ReturnValue) == 0x000108, "Member 'WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding::CallFunc_IsInteractionEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding, K2Node_Select_Default_2) == 0x00010C, "Member 'WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding, CallFunc_IsPackagedForDistribution_ReturnValue_1) == 0x00011C, "Member 'WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding::CallFunc_IsPackagedForDistribution_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding, CallFunc_Not_PreBool_ReturnValue_1) == 0x00011D, "Member 'WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding, CallFunc_PlayAnimation_ReturnValue) == 0x000120, "Member 'WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding, K2Node_Event_IsDesignTime) == 0x000128, "Member 'WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding, K2Node_MakeStruct_S_InputBindingParameters_1) == 0x000130, "Member 'WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding::K2Node_MakeStruct_S_InputBindingParameters_1' has a wrong offset!");
static_assert(offsetof(WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding, CallFunc_SetUserSpecifiedScale_InUserSpecifiedScale_ImplicitCast) == 0x000158, "Member 'WBP_ButtonBinding_C_ExecuteUbergraph_WBP_ButtonBinding::CallFunc_SetUserSpecifiedScale_InUserSpecifiedScale_ImplicitCast' has a wrong offset!");

}

