#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BattleLoot_Item

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "S_jRPG_Item_DynamicData_structs.hpp"


namespace SDK::Params
{

// Function WBP_BattleLoot_Item.WBP_BattleLoot_Item_C.LoadItem
// 0x01C0 (0x01C0 - 0x0000)
struct WBP_BattleLoot_Item_C_LoadItem final
{
public:
	struct FS_jRPG_Item_DynamicData               ItemData;                                          // 0x0000(0x0138)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0150(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0198(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01A8(0x0010)()
	bool                                          Temp_bool_Variable;                                // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleLoot_Item_C_LoadItem) == 0x000008, "Wrong alignment on WBP_BattleLoot_Item_C_LoadItem");
static_assert(sizeof(WBP_BattleLoot_Item_C_LoadItem) == 0x0001C0, "Wrong size on WBP_BattleLoot_Item_C_LoadItem");
static_assert(offsetof(WBP_BattleLoot_Item_C_LoadItem, ItemData) == 0x000000, "Member 'WBP_BattleLoot_Item_C_LoadItem::ItemData' has a wrong offset!");
static_assert(offsetof(WBP_BattleLoot_Item_C_LoadItem, Temp_byte_Variable) == 0x000138, "Member 'WBP_BattleLoot_Item_C_LoadItem::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BattleLoot_Item_C_LoadItem, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000139, "Member 'WBP_BattleLoot_Item_C_LoadItem::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleLoot_Item_C_LoadItem, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000140, "Member 'WBP_BattleLoot_Item_C_LoadItem::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleLoot_Item_C_LoadItem, Temp_byte_Variable_1) == 0x000148, "Member 'WBP_BattleLoot_Item_C_LoadItem::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_BattleLoot_Item_C_LoadItem, K2Node_MakeStruct_FormatArgumentData) == 0x000150, "Member 'WBP_BattleLoot_Item_C_LoadItem::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_BattleLoot_Item_C_LoadItem, K2Node_MakeArray_Array) == 0x000198, "Member 'WBP_BattleLoot_Item_C_LoadItem::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_BattleLoot_Item_C_LoadItem, CallFunc_Format_ReturnValue) == 0x0001A8, "Member 'WBP_BattleLoot_Item_C_LoadItem::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_BattleLoot_Item_C_LoadItem, Temp_bool_Variable) == 0x0001B8, "Member 'WBP_BattleLoot_Item_C_LoadItem::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_BattleLoot_Item_C_LoadItem, K2Node_Select_Default) == 0x0001B9, "Member 'WBP_BattleLoot_Item_C_LoadItem::K2Node_Select_Default' has a wrong offset!");

}

