#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CombatStatsPanel

#include "Basic.hpp"

#include "E_jRPG_StatType_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CombatStatsPanel.WBP_CombatStatsPanel_C
// 0x0080 (0x0388 - 0x0308)
class UWBP_CombatStatsPanel_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_CombatStat_C*                      AttackPowerStat;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CombatStat_C*                      CriticalRateStat;                                  // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CombatStat_C*                      DefenseStat;                                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CombatStat_C*                      HealthStat;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CombatStat_C*                      SpeedStat;                                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<E_jRPG_StatType, class UWBP_CombatStat_C*> StatWidgetsMap;                                  // 0x0338(0x0050)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ExecuteUbergraph_WBP_CombatStatsPanel(int32 EntryPoint);
	void LoadCharacterData(class UBP_CharacterData_C* InCharacterData);
	void LoadPreviewCharacterData(class UBP_CharacterData_C* InCharacterData);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CombatStatsPanel_C">();
	}
	static class UWBP_CombatStatsPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CombatStatsPanel_C>();
	}
};
static_assert(alignof(UWBP_CombatStatsPanel_C) == 0x000008, "Wrong alignment on UWBP_CombatStatsPanel_C");
static_assert(sizeof(UWBP_CombatStatsPanel_C) == 0x000388, "Wrong size on UWBP_CombatStatsPanel_C");
static_assert(offsetof(UWBP_CombatStatsPanel_C, UberGraphFrame) == 0x000308, "Member 'UWBP_CombatStatsPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CombatStatsPanel_C, AttackPowerStat) == 0x000310, "Member 'UWBP_CombatStatsPanel_C::AttackPowerStat' has a wrong offset!");
static_assert(offsetof(UWBP_CombatStatsPanel_C, CriticalRateStat) == 0x000318, "Member 'UWBP_CombatStatsPanel_C::CriticalRateStat' has a wrong offset!");
static_assert(offsetof(UWBP_CombatStatsPanel_C, DefenseStat) == 0x000320, "Member 'UWBP_CombatStatsPanel_C::DefenseStat' has a wrong offset!");
static_assert(offsetof(UWBP_CombatStatsPanel_C, HealthStat) == 0x000328, "Member 'UWBP_CombatStatsPanel_C::HealthStat' has a wrong offset!");
static_assert(offsetof(UWBP_CombatStatsPanel_C, SpeedStat) == 0x000330, "Member 'UWBP_CombatStatsPanel_C::SpeedStat' has a wrong offset!");
static_assert(offsetof(UWBP_CombatStatsPanel_C, StatWidgetsMap) == 0x000338, "Member 'UWBP_CombatStatsPanel_C::StatWidgetsMap' has a wrong offset!");

}

