#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WatermarkOverlay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_WatermarkOverlay.WBP_WatermarkOverlay_C
// 0x0070 (0x0350 - 0x02E0)
class UWBP_WatermarkOverlay_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_BuildVersion;                            // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Disclaimer;                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WatermarkElement_C*                currentWidget;                                     // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          isElement2Next;                                    // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Duration;                                          // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   BuildID;                                           // 0x0318(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   UserId;                                            // 0x0328(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	TArray<class UWBP_WatermarkElement_C*>        ActiveElements;                                    // 0x0338(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         SimulatenousElementsCount;                         // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ChangeLocation();
	void Construct();
	class UWBP_WatermarkElement_C* CreateWidgetAtRandomLocation();
	void ExecuteUbergraph_WBP_WatermarkOverlay(int32 EntryPoint);
	class FText GetBuildText();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_WatermarkOverlay_C">();
	}
	static class UWBP_WatermarkOverlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_WatermarkOverlay_C>();
	}
};
static_assert(alignof(UWBP_WatermarkOverlay_C) == 0x000008, "Wrong alignment on UWBP_WatermarkOverlay_C");
static_assert(sizeof(UWBP_WatermarkOverlay_C) == 0x000350, "Wrong size on UWBP_WatermarkOverlay_C");
static_assert(offsetof(UWBP_WatermarkOverlay_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_WatermarkOverlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_WatermarkOverlay_C, CanvasPanel_0) == 0x0002E8, "Member 'UWBP_WatermarkOverlay_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UWBP_WatermarkOverlay_C, TextBlock_BuildVersion) == 0x0002F0, "Member 'UWBP_WatermarkOverlay_C::TextBlock_BuildVersion' has a wrong offset!");
static_assert(offsetof(UWBP_WatermarkOverlay_C, TextBlock_Disclaimer) == 0x0002F8, "Member 'UWBP_WatermarkOverlay_C::TextBlock_Disclaimer' has a wrong offset!");
static_assert(offsetof(UWBP_WatermarkOverlay_C, currentWidget) == 0x000300, "Member 'UWBP_WatermarkOverlay_C::currentWidget' has a wrong offset!");
static_assert(offsetof(UWBP_WatermarkOverlay_C, isElement2Next) == 0x000308, "Member 'UWBP_WatermarkOverlay_C::isElement2Next' has a wrong offset!");
static_assert(offsetof(UWBP_WatermarkOverlay_C, Duration) == 0x000310, "Member 'UWBP_WatermarkOverlay_C::Duration' has a wrong offset!");
static_assert(offsetof(UWBP_WatermarkOverlay_C, BuildID) == 0x000318, "Member 'UWBP_WatermarkOverlay_C::BuildID' has a wrong offset!");
static_assert(offsetof(UWBP_WatermarkOverlay_C, UserId) == 0x000328, "Member 'UWBP_WatermarkOverlay_C::UserId' has a wrong offset!");
static_assert(offsetof(UWBP_WatermarkOverlay_C, ActiveElements) == 0x000338, "Member 'UWBP_WatermarkOverlay_C::ActiveElements' has a wrong offset!");
static_assert(offsetof(UWBP_WatermarkOverlay_C, SimulatenousElementsCount) == 0x000348, "Member 'UWBP_WatermarkOverlay_C::SimulatenousElementsCount' has a wrong offset!");

}

