#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PassivePopupContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PassivePopupContainer.WBP_PassivePopupContainer_C
// 0x0078 (0x0358 - 0x02E0)
class UWBP_PassivePopupContainer_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           VerticalBox_PopupList;                             // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PassiveEffectNotification_C*       WBP_PassiveEffectNotification;                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PassiveEffectNotification_C*       WBP_PassiveEffectNotification_1;                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PassiveEffectNotification_C*       WBP_PassiveEffectNotification_2;                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<class FName, class UWBP_PassiveEffectNotification_C*> ExistingPassivePopups;                // 0x0308(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void OnNotificationExpired(class UWBP_PassiveEffectNotification_C* Widget);
	void AddPassiveEffectNotification(class FName PassiveID, class UBP_ItemInstance_Gear_Weapon_C* RelatedWeapon);
	void AddBuffNotification(class UBP_BattleBuffInstance_C* BuffInstance);
	void Construct();
	void ExecuteUbergraph_WBP_PassivePopupContainer(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PassivePopupContainer_C">();
	}
	static class UWBP_PassivePopupContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PassivePopupContainer_C>();
	}
};
static_assert(alignof(UWBP_PassivePopupContainer_C) == 0x000008, "Wrong alignment on UWBP_PassivePopupContainer_C");
static_assert(sizeof(UWBP_PassivePopupContainer_C) == 0x000358, "Wrong size on UWBP_PassivePopupContainer_C");
static_assert(offsetof(UWBP_PassivePopupContainer_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_PassivePopupContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PassivePopupContainer_C, VerticalBox_PopupList) == 0x0002E8, "Member 'UWBP_PassivePopupContainer_C::VerticalBox_PopupList' has a wrong offset!");
static_assert(offsetof(UWBP_PassivePopupContainer_C, WBP_PassiveEffectNotification) == 0x0002F0, "Member 'UWBP_PassivePopupContainer_C::WBP_PassiveEffectNotification' has a wrong offset!");
static_assert(offsetof(UWBP_PassivePopupContainer_C, WBP_PassiveEffectNotification_1) == 0x0002F8, "Member 'UWBP_PassivePopupContainer_C::WBP_PassiveEffectNotification_1' has a wrong offset!");
static_assert(offsetof(UWBP_PassivePopupContainer_C, WBP_PassiveEffectNotification_2) == 0x000300, "Member 'UWBP_PassivePopupContainer_C::WBP_PassiveEffectNotification_2' has a wrong offset!");
static_assert(offsetof(UWBP_PassivePopupContainer_C, ExistingPassivePopups) == 0x000308, "Member 'UWBP_PassivePopupContainer_C::ExistingPassivePopups' has a wrong offset!");

}

