#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Battle_CharacterOverheadState_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Battle_CharacterOverheadState_Base.WBP_Battle_CharacterOverheadState_Base_C
// 0x0018 (0x02F8 - 0x02E0)
class UWBP_Battle_CharacterOverheadState_Base_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAC_jRPG_CharacterBattleStats_C*        CharacterBattleStats;                              // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlayingDamageAnim;                               // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          _IsHovered;                                        // 0x02F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CurrentVisibility;                                 // 0x02F2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Appear();
	void ComputeDesiredVisibility(bool* DesiredVisibility);
	void GetBattleBuffContainer(class UWBP_BattleEffectsBox_C** BattleEffectBox);
	void GetCharacterHealthBar(class UWBP_CharacterHealthBar_C** HealthBar);
	void GetExtraIconsContainer(class UPanelWidget** Panel);
	void GetStatusEffectContainer(class UWBP_BattleEffectsBox_C** BattleEffectBox);
	void OnHoverEnd();
	void OnHoverStart();
	void ExecuteUbergraph_WBP_Battle_CharacterOverheadState_Base(int32 EntryPoint);
	class UPanelSlot* AddExtraIconElement(class UWidget* Content);
	void UpdateVisibility();
	bool CanHide();
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void OnDamageReceived();
	void Disappear();
	void SetCharacterBattleStats(class UAC_jRPG_CharacterBattleStats_C* BattleStats);
	void DEBUG_OnCvarChanged_HideUI(bool NewValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Battle_CharacterOverheadState_Base_C">();
	}
	static class UWBP_Battle_CharacterOverheadState_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Battle_CharacterOverheadState_Base_C>();
	}
};
static_assert(alignof(UWBP_Battle_CharacterOverheadState_Base_C) == 0x000008, "Wrong alignment on UWBP_Battle_CharacterOverheadState_Base_C");
static_assert(sizeof(UWBP_Battle_CharacterOverheadState_Base_C) == 0x0002F8, "Wrong size on UWBP_Battle_CharacterOverheadState_Base_C");
static_assert(offsetof(UWBP_Battle_CharacterOverheadState_Base_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_Battle_CharacterOverheadState_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Battle_CharacterOverheadState_Base_C, CharacterBattleStats) == 0x0002E8, "Member 'UWBP_Battle_CharacterOverheadState_Base_C::CharacterBattleStats' has a wrong offset!");
static_assert(offsetof(UWBP_Battle_CharacterOverheadState_Base_C, IsPlayingDamageAnim) == 0x0002F0, "Member 'UWBP_Battle_CharacterOverheadState_Base_C::IsPlayingDamageAnim' has a wrong offset!");
static_assert(offsetof(UWBP_Battle_CharacterOverheadState_Base_C, _IsHovered) == 0x0002F1, "Member 'UWBP_Battle_CharacterOverheadState_Base_C::_IsHovered' has a wrong offset!");
static_assert(offsetof(UWBP_Battle_CharacterOverheadState_Base_C, CurrentVisibility) == 0x0002F2, "Member 'UWBP_Battle_CharacterOverheadState_Base_C::CurrentVisibility' has a wrong offset!");

}

