#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MedialPlayerWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MedialPlayerWidget.WBP_MedialPlayerWidget_C
// 0x0038 (0x0318 - 0x02E0)
class UWBP_MedialPlayerWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonVideoPlayer*                     CommonVideoPlayer;                                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_31;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMediaSource*                           MediaSource;                                       // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInPause;                                         // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnMediaSourceOpened;                               // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void CloseMediaSource();
	void Construct();
	void ExecuteUbergraph_WBP_MedialPlayerWidget(int32 EntryPoint);
	void OnMediaOpened(const class FString& OpenedUrl);
	void OpenMediaSource(class UMediaSource* MediaSource_0);
	void PauseMediaSource();
	void PlayMediaSource();
	void SetIsMuted(bool bInIsMuted);
	void SetPauseMediaSource(bool Pause);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MedialPlayerWidget_C">();
	}
	static class UWBP_MedialPlayerWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MedialPlayerWidget_C>();
	}
};
static_assert(alignof(UWBP_MedialPlayerWidget_C) == 0x000008, "Wrong alignment on UWBP_MedialPlayerWidget_C");
static_assert(sizeof(UWBP_MedialPlayerWidget_C) == 0x000318, "Wrong size on UWBP_MedialPlayerWidget_C");
static_assert(offsetof(UWBP_MedialPlayerWidget_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_MedialPlayerWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MedialPlayerWidget_C, CommonVideoPlayer) == 0x0002E8, "Member 'UWBP_MedialPlayerWidget_C::CommonVideoPlayer' has a wrong offset!");
static_assert(offsetof(UWBP_MedialPlayerWidget_C, Image_31) == 0x0002F0, "Member 'UWBP_MedialPlayerWidget_C::Image_31' has a wrong offset!");
static_assert(offsetof(UWBP_MedialPlayerWidget_C, MediaSource) == 0x0002F8, "Member 'UWBP_MedialPlayerWidget_C::MediaSource' has a wrong offset!");
static_assert(offsetof(UWBP_MedialPlayerWidget_C, IsInPause) == 0x000300, "Member 'UWBP_MedialPlayerWidget_C::IsInPause' has a wrong offset!");
static_assert(offsetof(UWBP_MedialPlayerWidget_C, OnMediaSourceOpened) == 0x000308, "Member 'UWBP_MedialPlayerWidget_C::OnMediaSourceOpened' has a wrong offset!");

}

