#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_ArrowTargetSelection

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_HUD_ArrowTargetSelection.WBP_HUD_ArrowTargetSelection_C.ExecuteUbergraph_WBP_HUD_ArrowTargetSelection
// 0x0048 (0x0048 - 0x0000)
struct WBP_HUD_ArrowTargetSelection_C_ExecuteUbergraph_WBP_HUD_ArrowTargetSelection final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_LeftEnabled;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_RightEnabled;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_HighlightLeft;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_HighlightRight;                 // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_ArrowTargetSelection_C_ExecuteUbergraph_WBP_HUD_ArrowTargetSelection) == 0x000008, "Wrong alignment on WBP_HUD_ArrowTargetSelection_C_ExecuteUbergraph_WBP_HUD_ArrowTargetSelection");
static_assert(sizeof(WBP_HUD_ArrowTargetSelection_C_ExecuteUbergraph_WBP_HUD_ArrowTargetSelection) == 0x000048, "Wrong size on WBP_HUD_ArrowTargetSelection_C_ExecuteUbergraph_WBP_HUD_ArrowTargetSelection");
static_assert(offsetof(WBP_HUD_ArrowTargetSelection_C_ExecuteUbergraph_WBP_HUD_ArrowTargetSelection, EntryPoint) == 0x000000, "Member 'WBP_HUD_ArrowTargetSelection_C_ExecuteUbergraph_WBP_HUD_ArrowTargetSelection::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HUD_ArrowTargetSelection_C_ExecuteUbergraph_WBP_HUD_ArrowTargetSelection, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_HUD_ArrowTargetSelection_C_ExecuteUbergraph_WBP_HUD_ArrowTargetSelection::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_ArrowTargetSelection_C_ExecuteUbergraph_WBP_HUD_ArrowTargetSelection, K2Node_CustomEvent_LeftEnabled) == 0x000010, "Member 'WBP_HUD_ArrowTargetSelection_C_ExecuteUbergraph_WBP_HUD_ArrowTargetSelection::K2Node_CustomEvent_LeftEnabled' has a wrong offset!");
static_assert(offsetof(WBP_HUD_ArrowTargetSelection_C_ExecuteUbergraph_WBP_HUD_ArrowTargetSelection, K2Node_CustomEvent_RightEnabled) == 0x000011, "Member 'WBP_HUD_ArrowTargetSelection_C_ExecuteUbergraph_WBP_HUD_ArrowTargetSelection::K2Node_CustomEvent_RightEnabled' has a wrong offset!");
static_assert(offsetof(WBP_HUD_ArrowTargetSelection_C_ExecuteUbergraph_WBP_HUD_ArrowTargetSelection, K2Node_CustomEvent_HighlightLeft) == 0x000012, "Member 'WBP_HUD_ArrowTargetSelection_C_ExecuteUbergraph_WBP_HUD_ArrowTargetSelection::K2Node_CustomEvent_HighlightLeft' has a wrong offset!");
static_assert(offsetof(WBP_HUD_ArrowTargetSelection_C_ExecuteUbergraph_WBP_HUD_ArrowTargetSelection, K2Node_CustomEvent_HighlightRight) == 0x000013, "Member 'WBP_HUD_ArrowTargetSelection_C_ExecuteUbergraph_WBP_HUD_ArrowTargetSelection::K2Node_CustomEvent_HighlightRight' has a wrong offset!");
static_assert(offsetof(WBP_HUD_ArrowTargetSelection_C_ExecuteUbergraph_WBP_HUD_ArrowTargetSelection, CallFunc_Not_PreBool_ReturnValue) == 0x000014, "Member 'WBP_HUD_ArrowTargetSelection_C_ExecuteUbergraph_WBP_HUD_ArrowTargetSelection::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_ArrowTargetSelection_C_ExecuteUbergraph_WBP_HUD_ArrowTargetSelection, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_HUD_ArrowTargetSelection_C_ExecuteUbergraph_WBP_HUD_ArrowTargetSelection::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_HUD_ArrowTargetSelection_C_ExecuteUbergraph_WBP_HUD_ArrowTargetSelection, CallFunc_BooleanOR_ReturnValue) == 0x000028, "Member 'WBP_HUD_ArrowTargetSelection_C_ExecuteUbergraph_WBP_HUD_ArrowTargetSelection::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_ArrowTargetSelection_C_ExecuteUbergraph_WBP_HUD_ArrowTargetSelection, CallFunc_Not_PreBool_ReturnValue_1) == 0x000029, "Member 'WBP_HUD_ArrowTargetSelection_C_ExecuteUbergraph_WBP_HUD_ArrowTargetSelection::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_ArrowTargetSelection_C_ExecuteUbergraph_WBP_HUD_ArrowTargetSelection, CallFunc_PlayAnimation_ReturnValue_1) == 0x000030, "Member 'WBP_HUD_ArrowTargetSelection_C_ExecuteUbergraph_WBP_HUD_ArrowTargetSelection::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_ArrowTargetSelection_C_ExecuteUbergraph_WBP_HUD_ArrowTargetSelection, Temp_bool_Variable) == 0x000038, "Member 'WBP_HUD_ArrowTargetSelection_C_ExecuteUbergraph_WBP_HUD_ArrowTargetSelection::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_ArrowTargetSelection_C_ExecuteUbergraph_WBP_HUD_ArrowTargetSelection, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'WBP_HUD_ArrowTargetSelection_C_ExecuteUbergraph_WBP_HUD_ArrowTargetSelection::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_ArrowTargetSelection_C_ExecuteUbergraph_WBP_HUD_ArrowTargetSelection, K2Node_Select_Default) == 0x000040, "Member 'WBP_HUD_ArrowTargetSelection_C_ExecuteUbergraph_WBP_HUD_ArrowTargetSelection::K2Node_Select_Default' has a wrong offset!");

// Function WBP_HUD_ArrowTargetSelection.WBP_HUD_ArrowTargetSelection_C.SetArrowState
// 0x0004 (0x0004 - 0x0000)
struct WBP_HUD_ArrowTargetSelection_C_SetArrowState final
{
public:
	bool                                          LeftEnabled;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RightEnabled;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HighlightLeft;                                     // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HighlightRight;                                    // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_ArrowTargetSelection_C_SetArrowState) == 0x000001, "Wrong alignment on WBP_HUD_ArrowTargetSelection_C_SetArrowState");
static_assert(sizeof(WBP_HUD_ArrowTargetSelection_C_SetArrowState) == 0x000004, "Wrong size on WBP_HUD_ArrowTargetSelection_C_SetArrowState");
static_assert(offsetof(WBP_HUD_ArrowTargetSelection_C_SetArrowState, LeftEnabled) == 0x000000, "Member 'WBP_HUD_ArrowTargetSelection_C_SetArrowState::LeftEnabled' has a wrong offset!");
static_assert(offsetof(WBP_HUD_ArrowTargetSelection_C_SetArrowState, RightEnabled) == 0x000001, "Member 'WBP_HUD_ArrowTargetSelection_C_SetArrowState::RightEnabled' has a wrong offset!");
static_assert(offsetof(WBP_HUD_ArrowTargetSelection_C_SetArrowState, HighlightLeft) == 0x000002, "Member 'WBP_HUD_ArrowTargetSelection_C_SetArrowState::HighlightLeft' has a wrong offset!");
static_assert(offsetof(WBP_HUD_ArrowTargetSelection_C_SetArrowState, HighlightRight) == 0x000003, "Member 'WBP_HUD_ArrowTargetSelection_C_SetArrowState::HighlightRight' has a wrong offset!");

// Function WBP_HUD_ArrowTargetSelection.WBP_HUD_ArrowTargetSelection_C.SetLeftArrowVisible
// 0x0005 (0x0005 - 0x0000)
struct WBP_HUD_ArrowTargetSelection_C_SetLeftArrowVisible final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_ArrowTargetSelection_C_SetLeftArrowVisible) == 0x000001, "Wrong alignment on WBP_HUD_ArrowTargetSelection_C_SetLeftArrowVisible");
static_assert(sizeof(WBP_HUD_ArrowTargetSelection_C_SetLeftArrowVisible) == 0x000005, "Wrong size on WBP_HUD_ArrowTargetSelection_C_SetLeftArrowVisible");
static_assert(offsetof(WBP_HUD_ArrowTargetSelection_C_SetLeftArrowVisible, Visible) == 0x000000, "Member 'WBP_HUD_ArrowTargetSelection_C_SetLeftArrowVisible::Visible' has a wrong offset!");
static_assert(offsetof(WBP_HUD_ArrowTargetSelection_C_SetLeftArrowVisible, Temp_bool_Variable) == 0x000001, "Member 'WBP_HUD_ArrowTargetSelection_C_SetLeftArrowVisible::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_ArrowTargetSelection_C_SetLeftArrowVisible, Temp_byte_Variable) == 0x000002, "Member 'WBP_HUD_ArrowTargetSelection_C_SetLeftArrowVisible::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_ArrowTargetSelection_C_SetLeftArrowVisible, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_HUD_ArrowTargetSelection_C_SetLeftArrowVisible::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_ArrowTargetSelection_C_SetLeftArrowVisible, K2Node_Select_Default) == 0x000004, "Member 'WBP_HUD_ArrowTargetSelection_C_SetLeftArrowVisible::K2Node_Select_Default' has a wrong offset!");

// Function WBP_HUD_ArrowTargetSelection.WBP_HUD_ArrowTargetSelection_C.SetRightArrowVisible
// 0x0005 (0x0005 - 0x0000)
struct WBP_HUD_ArrowTargetSelection_C_SetRightArrowVisible final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_ArrowTargetSelection_C_SetRightArrowVisible) == 0x000001, "Wrong alignment on WBP_HUD_ArrowTargetSelection_C_SetRightArrowVisible");
static_assert(sizeof(WBP_HUD_ArrowTargetSelection_C_SetRightArrowVisible) == 0x000005, "Wrong size on WBP_HUD_ArrowTargetSelection_C_SetRightArrowVisible");
static_assert(offsetof(WBP_HUD_ArrowTargetSelection_C_SetRightArrowVisible, Visible) == 0x000000, "Member 'WBP_HUD_ArrowTargetSelection_C_SetRightArrowVisible::Visible' has a wrong offset!");
static_assert(offsetof(WBP_HUD_ArrowTargetSelection_C_SetRightArrowVisible, Temp_bool_Variable) == 0x000001, "Member 'WBP_HUD_ArrowTargetSelection_C_SetRightArrowVisible::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_ArrowTargetSelection_C_SetRightArrowVisible, Temp_byte_Variable) == 0x000002, "Member 'WBP_HUD_ArrowTargetSelection_C_SetRightArrowVisible::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_ArrowTargetSelection_C_SetRightArrowVisible, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_HUD_ArrowTargetSelection_C_SetRightArrowVisible::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_ArrowTargetSelection_C_SetRightArrowVisible, K2Node_Select_Default) == 0x000004, "Member 'WBP_HUD_ArrowTargetSelection_C_SetRightArrowVisible::K2Node_Select_Default' has a wrong offset!");

}

