#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FirstLetter_TitleText

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_FirstLetter_TitleText.WBP_FirstLetter_TitleText_C.ExecuteUbergraph_WBP_FirstLetter_TitleText
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue_1;               // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0060(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue_1;                        // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Text;                           // 0x0090(0x0010)()
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_SetFieldsInStruct_Size_ImplicitCast;        // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_SetFieldsInStruct_Size_ImplicitCast_1;      // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText) == 0x000008, "Wrong alignment on WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText");
static_assert(sizeof(WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText) == 0x0000C0, "Wrong size on WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText");
static_assert(offsetof(WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText, EntryPoint) == 0x000000, "Member 'WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText, Temp_bool_Variable) == 0x000004, "Member 'WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText, K2Node_Event_IsDesignTime) == 0x000005, "Member 'WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText, CallFunc_Conv_TextToString_ReturnValue) == 0x000008, "Member 'WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText, CallFunc_Len_ReturnValue) == 0x000018, "Member 'WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText, CallFunc_GetSubstring_ReturnValue) == 0x000020, "Member 'WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText::CallFunc_GetSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000040, "Member 'WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText, CallFunc_GetSubstring_ReturnValue_1) == 0x000050, "Member 'WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText::CallFunc_GetSubstring_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000060, "Member 'WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText, CallFunc_Conv_TextToString_ReturnValue_2) == 0x000070, "Member 'WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText, CallFunc_Len_ReturnValue_1) == 0x000080, "Member 'WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText::CallFunc_Len_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000084, "Member 'WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000088, "Member 'WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText, K2Node_CustomEvent_Text) == 0x000090, "Member 'WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText::K2Node_CustomEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText, CallFunc_FTrunc_ReturnValue) == 0x0000A0, "Member 'WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText, K2Node_Select_Default) == 0x0000A4, "Member 'WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText, CallFunc_Conv_IntToDouble_ReturnValue) == 0x0000A8, "Member 'WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x0000B0, "Member 'WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText, K2Node_SetFieldsInStruct_Size_ImplicitCast) == 0x0000B8, "Member 'WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText::K2Node_SetFieldsInStruct_Size_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText, K2Node_SetFieldsInStruct_Size_ImplicitCast_1) == 0x0000BC, "Member 'WBP_FirstLetter_TitleText_C_ExecuteUbergraph_WBP_FirstLetter_TitleText::K2Node_SetFieldsInStruct_Size_ImplicitCast_1' has a wrong offset!");

// Function WBP_FirstLetter_TitleText.WBP_FirstLetter_TitleText_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_FirstLetter_TitleText_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FirstLetter_TitleText_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_FirstLetter_TitleText_C_PreConstruct");
static_assert(sizeof(WBP_FirstLetter_TitleText_C_PreConstruct) == 0x000001, "Wrong size on WBP_FirstLetter_TitleText_C_PreConstruct");
static_assert(offsetof(WBP_FirstLetter_TitleText_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_FirstLetter_TitleText_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_FirstLetter_TitleText.WBP_FirstLetter_TitleText_C.SetText
// 0x0010 (0x0010 - 0x0000)
struct WBP_FirstLetter_TitleText_C_SetText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_FirstLetter_TitleText_C_SetText) == 0x000008, "Wrong alignment on WBP_FirstLetter_TitleText_C_SetText");
static_assert(sizeof(WBP_FirstLetter_TitleText_C_SetText) == 0x000010, "Wrong size on WBP_FirstLetter_TitleText_C_SetText");
static_assert(offsetof(WBP_FirstLetter_TitleText_C_SetText, Text) == 0x000000, "Member 'WBP_FirstLetter_TitleText_C_SetText::Text' has a wrong offset!");

}

