#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Merchant_Panel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SandFall_structs.hpp"
#include "S_MerchantItemSellData_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Merchant_Panel.WBP_Merchant_Panel_C
// 0x0148 (0x0578 - 0x0430)
class UWBP_Merchant_Panel_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Appear;                                       // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_TextualInputActionBinding_C*       BuyItemBinding;                                    // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BaseButton_C*                      BuyItemButton;                                     // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDynamicEntryBox*                       DynamicEntryBox_Items;                             // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TextualInputActionBinding_C*       FightMerchantBinding;                              // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BaseButton_C*                      FightMerchantButton;                               // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   FX_LightMerchant;                                  // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TextualInputActionBinding_C*       LeaveBinding;                                      // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BaseButton_C*                      LeaveButton;                                       // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       PlaceholderBackground;                             // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       PlaceholderMerchant;                               // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       PlaceholderMerchant_1;                             // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GoldAmount_C*                      WBP_GoldAmount;                                    // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemDetailsPanel_C*                WBP_ItemDetailsPanel;                              // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<class FName, struct FS_MerchantItemSellData> AvailableItems;                                // 0x04B0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMulticastInlineDelegate<void()>              OnCloseMerchantPanel;                              // 0x0500(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UWBP_Merchant_Item_Row_C*               FocusedMerchantItem;                               // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_MerchantComponent_C*                MerchantComponent;                                 // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnFightMerchantRequested;                          // 0x0520(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UWBP_CharacterSelectorPanel_C*          CharacterSelectorPanel;                            // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSoundEventDataTableRowHandle          SD_OpenMerchant;                                   // 0x0538(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FSoundEventDataTableRowHandle          SD_CloseMerchant;                                  // 0x0548(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FSoundEventDataTableRowHandle          SD_BuyItemConfirm;                                 // 0x0558(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FSoundEventDataTableRowHandle          SD_FightMerchantConfirm;                           // 0x0568(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void BndEvt__WBP_Merchant_Panel_BuyItemButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Merchant_Panel_BuyItemButton_K2Node_ComponentBoundEvent_6_OnButtonBaseActionProgress__DelegateSignature(double Progress);
	void BndEvt__WBP_Merchant_Panel_FightMerchantButton_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Merchant_Panel_FightMerchantButton_K2Node_ComponentBoundEvent_7_OnButtonBaseActionProgress__DelegateSignature(double Progress);
	void BndEvt__WBP_Merchant_Panel_LeaveButton_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_Merchant_Panel_LeaveButton_K2Node_ComponentBoundEvent_8_OnButtonBaseActionProgress__DelegateSignature(double Progress);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void CreateCharacterSelectorWidget();
	void CreateMerchantItem(const struct FS_MerchantItemSellData& Item);
	void DestroyCharacterSelectorWidget();
	void ExecuteUbergraph_WBP_Merchant_Panel(int32 EntryPoint);
	void LoadMerchant(class UBP_MerchantComponent_C* Merchant);
	void OnCharacterSelectionCanceled();
	void OnCharacterSelectionDoneToFightMerchant(TArray<class UBP_CharacterData_C*>& CharacterDatas);
	void OnMerchantItemFocused(class UWBP_Merchant_Item_Row_C* Widget);
	void PreConstruct(bool IsDesignTime);
	void TryGetCharacterDataForItem(const struct FS_MerchantItemSellData& MerchantItem, class UBP_CharacterData_C** CharacterData);
	void UpdateFightMerchantButtonState();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Merchant_Panel_C">();
	}
	static class UWBP_Merchant_Panel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Merchant_Panel_C>();
	}
};
static_assert(alignof(UWBP_Merchant_Panel_C) == 0x000008, "Wrong alignment on UWBP_Merchant_Panel_C");
static_assert(sizeof(UWBP_Merchant_Panel_C) == 0x000578, "Wrong size on UWBP_Merchant_Panel_C");
static_assert(offsetof(UWBP_Merchant_Panel_C, UberGraphFrame) == 0x000430, "Member 'UWBP_Merchant_Panel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Panel_C, Anim_Appear) == 0x000438, "Member 'UWBP_Merchant_Panel_C::Anim_Appear' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Panel_C, BuyItemBinding) == 0x000440, "Member 'UWBP_Merchant_Panel_C::BuyItemBinding' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Panel_C, BuyItemButton) == 0x000448, "Member 'UWBP_Merchant_Panel_C::BuyItemButton' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Panel_C, DynamicEntryBox_Items) == 0x000450, "Member 'UWBP_Merchant_Panel_C::DynamicEntryBox_Items' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Panel_C, FightMerchantBinding) == 0x000458, "Member 'UWBP_Merchant_Panel_C::FightMerchantBinding' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Panel_C, FightMerchantButton) == 0x000460, "Member 'UWBP_Merchant_Panel_C::FightMerchantButton' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Panel_C, FX_LightMerchant) == 0x000468, "Member 'UWBP_Merchant_Panel_C::FX_LightMerchant' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Panel_C, LeaveBinding) == 0x000470, "Member 'UWBP_Merchant_Panel_C::LeaveBinding' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Panel_C, LeaveButton) == 0x000478, "Member 'UWBP_Merchant_Panel_C::LeaveButton' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Panel_C, PlaceholderBackground) == 0x000480, "Member 'UWBP_Merchant_Panel_C::PlaceholderBackground' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Panel_C, PlaceholderMerchant) == 0x000488, "Member 'UWBP_Merchant_Panel_C::PlaceholderMerchant' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Panel_C, PlaceholderMerchant_1) == 0x000490, "Member 'UWBP_Merchant_Panel_C::PlaceholderMerchant_1' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Panel_C, SafeZone_0) == 0x000498, "Member 'UWBP_Merchant_Panel_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Panel_C, WBP_GoldAmount) == 0x0004A0, "Member 'UWBP_Merchant_Panel_C::WBP_GoldAmount' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Panel_C, WBP_ItemDetailsPanel) == 0x0004A8, "Member 'UWBP_Merchant_Panel_C::WBP_ItemDetailsPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Panel_C, AvailableItems) == 0x0004B0, "Member 'UWBP_Merchant_Panel_C::AvailableItems' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Panel_C, OnCloseMerchantPanel) == 0x000500, "Member 'UWBP_Merchant_Panel_C::OnCloseMerchantPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Panel_C, FocusedMerchantItem) == 0x000510, "Member 'UWBP_Merchant_Panel_C::FocusedMerchantItem' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Panel_C, MerchantComponent) == 0x000518, "Member 'UWBP_Merchant_Panel_C::MerchantComponent' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Panel_C, OnFightMerchantRequested) == 0x000520, "Member 'UWBP_Merchant_Panel_C::OnFightMerchantRequested' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Panel_C, CharacterSelectorPanel) == 0x000530, "Member 'UWBP_Merchant_Panel_C::CharacterSelectorPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Panel_C, SD_OpenMerchant) == 0x000538, "Member 'UWBP_Merchant_Panel_C::SD_OpenMerchant' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Panel_C, SD_CloseMerchant) == 0x000548, "Member 'UWBP_Merchant_Panel_C::SD_CloseMerchant' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Panel_C, SD_BuyItemConfirm) == 0x000558, "Member 'UWBP_Merchant_Panel_C::SD_BuyItemConfirm' has a wrong offset!");
static_assert(offsetof(UWBP_Merchant_Panel_C, SD_FightMerchantConfirm) == 0x000568, "Member 'UWBP_Merchant_Panel_C::SD_FightMerchantConfirm' has a wrong offset!");

}

