#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Tutorial_SquareMask

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_Tutorial_SquareMask.WBP_Tutorial_SquareMask_C.Appear
// 0x0008 (0x0008 - 0x0000)
struct WBP_Tutorial_SquareMask_C_Appear final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Tutorial_SquareMask_C_Appear) == 0x000008, "Wrong alignment on WBP_Tutorial_SquareMask_C_Appear");
static_assert(sizeof(WBP_Tutorial_SquareMask_C_Appear) == 0x000008, "Wrong size on WBP_Tutorial_SquareMask_C_Appear");
static_assert(offsetof(WBP_Tutorial_SquareMask_C_Appear, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_Tutorial_SquareMask_C_Appear::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_Tutorial_SquareMask.WBP_Tutorial_SquareMask_C.ExecuteUbergraph_WBP_Tutorial_SquareMask
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_Tutorial_SquareMask_C_ExecuteUbergraph_WBP_Tutorial_SquareMask final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        K2Node_CustomEvent_TargetWidget;                   // 0x0008(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class FText                                   CallFunc_ConcatenateDisplayNames_Result;           // 0x0018(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0080(0x0010)()
	const class UBP_UINavigationFocusEvent_C*     K2Node_Event_FocusEventBP;                         // 0x0090(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        K2Node_MakeArray_Array_1;                          // 0x00A0(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Tutorial_SquareMask_C_ExecuteUbergraph_WBP_Tutorial_SquareMask) == 0x000008, "Wrong alignment on WBP_Tutorial_SquareMask_C_ExecuteUbergraph_WBP_Tutorial_SquareMask");
static_assert(sizeof(WBP_Tutorial_SquareMask_C_ExecuteUbergraph_WBP_Tutorial_SquareMask) == 0x0000B8, "Wrong size on WBP_Tutorial_SquareMask_C_ExecuteUbergraph_WBP_Tutorial_SquareMask");
static_assert(offsetof(WBP_Tutorial_SquareMask_C_ExecuteUbergraph_WBP_Tutorial_SquareMask, EntryPoint) == 0x000000, "Member 'WBP_Tutorial_SquareMask_C_ExecuteUbergraph_WBP_Tutorial_SquareMask::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_SquareMask_C_ExecuteUbergraph_WBP_Tutorial_SquareMask, K2Node_CustomEvent_TargetWidget) == 0x000008, "Member 'WBP_Tutorial_SquareMask_C_ExecuteUbergraph_WBP_Tutorial_SquareMask::K2Node_CustomEvent_TargetWidget' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_SquareMask_C_ExecuteUbergraph_WBP_Tutorial_SquareMask, CallFunc_ConcatenateDisplayNames_Result) == 0x000018, "Member 'WBP_Tutorial_SquareMask_C_ExecuteUbergraph_WBP_Tutorial_SquareMask::CallFunc_ConcatenateDisplayNames_Result' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_SquareMask_C_ExecuteUbergraph_WBP_Tutorial_SquareMask, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'WBP_Tutorial_SquareMask_C_ExecuteUbergraph_WBP_Tutorial_SquareMask::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_SquareMask_C_ExecuteUbergraph_WBP_Tutorial_SquareMask, K2Node_MakeArray_Array) == 0x000070, "Member 'WBP_Tutorial_SquareMask_C_ExecuteUbergraph_WBP_Tutorial_SquareMask::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_SquareMask_C_ExecuteUbergraph_WBP_Tutorial_SquareMask, CallFunc_Format_ReturnValue) == 0x000080, "Member 'WBP_Tutorial_SquareMask_C_ExecuteUbergraph_WBP_Tutorial_SquareMask::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_SquareMask_C_ExecuteUbergraph_WBP_Tutorial_SquareMask, K2Node_Event_FocusEventBP) == 0x000090, "Member 'WBP_Tutorial_SquareMask_C_ExecuteUbergraph_WBP_Tutorial_SquareMask::K2Node_Event_FocusEventBP' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_SquareMask_C_ExecuteUbergraph_WBP_Tutorial_SquareMask, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000098, "Member 'WBP_Tutorial_SquareMask_C_ExecuteUbergraph_WBP_Tutorial_SquareMask::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_SquareMask_C_ExecuteUbergraph_WBP_Tutorial_SquareMask, K2Node_MakeArray_Array_1) == 0x0000A0, "Member 'WBP_Tutorial_SquareMask_C_ExecuteUbergraph_WBP_Tutorial_SquareMask::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_SquareMask_C_ExecuteUbergraph_WBP_Tutorial_SquareMask, CallFunc_Not_PreBool_ReturnValue) == 0x0000B0, "Member 'WBP_Tutorial_SquareMask_C_ExecuteUbergraph_WBP_Tutorial_SquareMask::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_Tutorial_SquareMask.WBP_Tutorial_SquareMask_C.GetTiedObject
// 0x0008 (0x0008 - 0x0000)
struct WBP_Tutorial_SquareMask_C_GetTiedObject final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Tutorial_SquareMask_C_GetTiedObject) == 0x000008, "Wrong alignment on WBP_Tutorial_SquareMask_C_GetTiedObject");
static_assert(sizeof(WBP_Tutorial_SquareMask_C_GetTiedObject) == 0x000008, "Wrong size on WBP_Tutorial_SquareMask_C_GetTiedObject");
static_assert(offsetof(WBP_Tutorial_SquareMask_C_GetTiedObject, Object) == 0x000000, "Member 'WBP_Tutorial_SquareMask_C_GetTiedObject::Object' has a wrong offset!");

// Function WBP_Tutorial_SquareMask.WBP_Tutorial_SquareMask_C.OnUINavigationFocus
// 0x0008 (0x0008 - 0x0000)
struct WBP_Tutorial_SquareMask_C_OnUINavigationFocus final
{
public:
	const class UBP_UINavigationFocusEvent_C*     FocusEventBP;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Tutorial_SquareMask_C_OnUINavigationFocus) == 0x000008, "Wrong alignment on WBP_Tutorial_SquareMask_C_OnUINavigationFocus");
static_assert(sizeof(WBP_Tutorial_SquareMask_C_OnUINavigationFocus) == 0x000008, "Wrong size on WBP_Tutorial_SquareMask_C_OnUINavigationFocus");
static_assert(offsetof(WBP_Tutorial_SquareMask_C_OnUINavigationFocus, FocusEventBP) == 0x000000, "Member 'WBP_Tutorial_SquareMask_C_OnUINavigationFocus::FocusEventBP' has a wrong offset!");

// Function WBP_Tutorial_SquareMask.WBP_Tutorial_SquareMask_C.SetHighlightedWidgets
// 0x0010 (0x0010 - 0x0000)
struct WBP_Tutorial_SquareMask_C_SetHighlightedWidgets final
{
public:
	TArray<class UWidget*>                        TargetWidget_0;                                    // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_Tutorial_SquareMask_C_SetHighlightedWidgets) == 0x000008, "Wrong alignment on WBP_Tutorial_SquareMask_C_SetHighlightedWidgets");
static_assert(sizeof(WBP_Tutorial_SquareMask_C_SetHighlightedWidgets) == 0x000010, "Wrong size on WBP_Tutorial_SquareMask_C_SetHighlightedWidgets");
static_assert(offsetof(WBP_Tutorial_SquareMask_C_SetHighlightedWidgets, TargetWidget_0) == 0x000000, "Member 'WBP_Tutorial_SquareMask_C_SetHighlightedWidgets::TargetWidget_0' has a wrong offset!");

// Function WBP_Tutorial_SquareMask.WBP_Tutorial_SquareMask_C.UpdateMasks
// 0x0140 (0x0140 - 0x0000)
struct WBP_Tutorial_SquareMask_C_UpdateMasks final
{
public:
	class UImage*                                 local_imagewidget;                                 // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x0010(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       K2Node_DynamicCast_AsCanvas_Panel_Slot;            // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue_1;          // 0x007C(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_LocalToAbsolute_ReturnValue;              // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_AbsoluteToLocal_ReturnValue;              // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue;                 // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToAbsolute_ReturnValue_1;            // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_AbsoluteToLocal_ReturnValue_1;            // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CallFunc_SpawnObject_ReturnValue;                  // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Tutorial_SquareMask_C_UpdateMasks) == 0x000008, "Wrong alignment on WBP_Tutorial_SquareMask_C_UpdateMasks");
static_assert(sizeof(WBP_Tutorial_SquareMask_C_UpdateMasks) == 0x000140, "Wrong size on WBP_Tutorial_SquareMask_C_UpdateMasks");
static_assert(offsetof(WBP_Tutorial_SquareMask_C_UpdateMasks, local_imagewidget) == 0x000000, "Member 'WBP_Tutorial_SquareMask_C_UpdateMasks::local_imagewidget' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_SquareMask_C_UpdateMasks, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_Tutorial_SquareMask_C_UpdateMasks::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_SquareMask_C_UpdateMasks, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'WBP_Tutorial_SquareMask_C_UpdateMasks::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_SquareMask_C_UpdateMasks, CallFunc_GetCachedGeometry_ReturnValue) == 0x000010, "Member 'WBP_Tutorial_SquareMask_C_UpdateMasks::CallFunc_GetCachedGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_SquareMask_C_UpdateMasks, CallFunc_Greater_IntInt_ReturnValue) == 0x000048, "Member 'WBP_Tutorial_SquareMask_C_UpdateMasks::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_SquareMask_C_UpdateMasks, CallFunc_MakeLiteralDouble_ReturnValue) == 0x000050, "Member 'WBP_Tutorial_SquareMask_C_UpdateMasks::CallFunc_MakeLiteralDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_SquareMask_C_UpdateMasks, Temp_int_Loop_Counter_Variable) == 0x000058, "Member 'WBP_Tutorial_SquareMask_C_UpdateMasks::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_SquareMask_C_UpdateMasks, K2Node_DynamicCast_AsCanvas_Panel_Slot) == 0x000060, "Member 'WBP_Tutorial_SquareMask_C_UpdateMasks::K2Node_DynamicCast_AsCanvas_Panel_Slot' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_SquareMask_C_UpdateMasks, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'WBP_Tutorial_SquareMask_C_UpdateMasks::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_SquareMask_C_UpdateMasks, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'WBP_Tutorial_SquareMask_C_UpdateMasks::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_SquareMask_C_UpdateMasks, CallFunc_Array_Get_Item) == 0x000070, "Member 'WBP_Tutorial_SquareMask_C_UpdateMasks::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_SquareMask_C_UpdateMasks, CallFunc_Array_Length_ReturnValue_1) == 0x000078, "Member 'WBP_Tutorial_SquareMask_C_UpdateMasks::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_SquareMask_C_UpdateMasks, CallFunc_GetCachedGeometry_ReturnValue_1) == 0x00007C, "Member 'WBP_Tutorial_SquareMask_C_UpdateMasks::CallFunc_GetCachedGeometry_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_SquareMask_C_UpdateMasks, CallFunc_Less_IntInt_ReturnValue) == 0x0000B4, "Member 'WBP_Tutorial_SquareMask_C_UpdateMasks::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_SquareMask_C_UpdateMasks, CallFunc_LocalToAbsolute_ReturnValue) == 0x0000B8, "Member 'WBP_Tutorial_SquareMask_C_UpdateMasks::CallFunc_LocalToAbsolute_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_SquareMask_C_UpdateMasks, CallFunc_AbsoluteToLocal_ReturnValue) == 0x0000C8, "Member 'WBP_Tutorial_SquareMask_C_UpdateMasks::CallFunc_AbsoluteToLocal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_SquareMask_C_UpdateMasks, CallFunc_GetLocalSize_ReturnValue) == 0x0000D8, "Member 'WBP_Tutorial_SquareMask_C_UpdateMasks::CallFunc_GetLocalSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_SquareMask_C_UpdateMasks, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x0000E8, "Member 'WBP_Tutorial_SquareMask_C_UpdateMasks::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_SquareMask_C_UpdateMasks, CallFunc_LocalToAbsolute_ReturnValue_1) == 0x0000F8, "Member 'WBP_Tutorial_SquareMask_C_UpdateMasks::CallFunc_LocalToAbsolute_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_SquareMask_C_UpdateMasks, CallFunc_AbsoluteToLocal_ReturnValue_1) == 0x000108, "Member 'WBP_Tutorial_SquareMask_C_UpdateMasks::CallFunc_AbsoluteToLocal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_SquareMask_C_UpdateMasks, CallFunc_IsValid_ReturnValue) == 0x000118, "Member 'WBP_Tutorial_SquareMask_C_UpdateMasks::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_SquareMask_C_UpdateMasks, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x000120, "Member 'WBP_Tutorial_SquareMask_C_UpdateMasks::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_SquareMask_C_UpdateMasks, CallFunc_SpawnObject_ReturnValue) == 0x000130, "Member 'WBP_Tutorial_SquareMask_C_UpdateMasks::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tutorial_SquareMask_C_UpdateMasks, CallFunc_AddChildToCanvas_ReturnValue) == 0x000138, "Member 'WBP_Tutorial_SquareMask_C_UpdateMasks::CallFunc_AddChildToCanvas_ReturnValue' has a wrong offset!");

}

