#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BattleWheel_AP_Bar

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_BattleWheel_AP_Bar.WBP_BattleWheel_AP_Bar_C.ExecuteUbergraph_WBP_BattleWheel_AP_Bar
// 0x0008 (0x0008 - 0x0000)
struct WBP_BattleWheel_AP_Bar_C_ExecuteUbergraph_WBP_BattleWheel_AP_Bar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Value;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleWheel_AP_Bar_C_ExecuteUbergraph_WBP_BattleWheel_AP_Bar) == 0x000004, "Wrong alignment on WBP_BattleWheel_AP_Bar_C_ExecuteUbergraph_WBP_BattleWheel_AP_Bar");
static_assert(sizeof(WBP_BattleWheel_AP_Bar_C_ExecuteUbergraph_WBP_BattleWheel_AP_Bar) == 0x000008, "Wrong size on WBP_BattleWheel_AP_Bar_C_ExecuteUbergraph_WBP_BattleWheel_AP_Bar");
static_assert(offsetof(WBP_BattleWheel_AP_Bar_C_ExecuteUbergraph_WBP_BattleWheel_AP_Bar, EntryPoint) == 0x000000, "Member 'WBP_BattleWheel_AP_Bar_C_ExecuteUbergraph_WBP_BattleWheel_AP_Bar::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_BattleWheel_AP_Bar_C_ExecuteUbergraph_WBP_BattleWheel_AP_Bar, K2Node_CustomEvent_Value) == 0x000004, "Member 'WBP_BattleWheel_AP_Bar_C_ExecuteUbergraph_WBP_BattleWheel_AP_Bar::K2Node_CustomEvent_Value' has a wrong offset!");

// Function WBP_BattleWheel_AP_Bar.WBP_BattleWheel_AP_Bar_C.SetAPValue
// 0x0004 (0x0004 - 0x0000)
struct WBP_BattleWheel_AP_Bar_C_SetAPValue final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_BattleWheel_AP_Bar_C_SetAPValue) == 0x000004, "Wrong alignment on WBP_BattleWheel_AP_Bar_C_SetAPValue");
static_assert(sizeof(WBP_BattleWheel_AP_Bar_C_SetAPValue) == 0x000004, "Wrong size on WBP_BattleWheel_AP_Bar_C_SetAPValue");
static_assert(offsetof(WBP_BattleWheel_AP_Bar_C_SetAPValue, Value) == 0x000000, "Member 'WBP_BattleWheel_AP_Bar_C_SetAPValue::Value' has a wrong offset!");

}

