#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GM_COV_WeaponPictosPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "E_jRPG_ItemType_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GM_COV_WeaponPictosPanel.WBP_GM_COV_WeaponPictosPanel_C
// 0x0068 (0x0370 - 0x0308)
class UWBP_GM_COV_WeaponPictosPanel_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_COV_PictosElement_C*               PictoElement0;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_COV_PictosElement_C*               PictoElement1;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_COV_PictosElement_C*               PictoElement2;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           PictosBox;                                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NotificationBullet_C*              PictosNotificationBullet;                          // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           WeaponBox;                                         // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_COV_WeaponElement_C*               WeaponElement0;                                    // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NotificationBullet_C*              WeaponNotificationBullet;                          // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UCommonUserWidget* SlotWidget)> OnSlotNavigated;             // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(E_jRPG_ItemType InItemType, int32 InSlotIndex)> OnSlotAction;      // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_GM_COV_WeaponPictosPanel_PictoElement0_K2Node_ComponentBoundEvent_7_OnNavigated__DelegateSignature(class UWBP_COV_PictosElement_C* Widget);
	void BndEvt__WBP_GM_COV_WeaponPictosPanel_PictoElement1_K2Node_ComponentBoundEvent_5_OnNavigated__DelegateSignature(class UWBP_COV_PictosElement_C* Widget);
	void BndEvt__WBP_GM_COV_WeaponPictosPanel_PictoElement2_K2Node_ComponentBoundEvent_6_OnNavigated__DelegateSignature(class UWBP_COV_PictosElement_C* Widget);
	void BndEvt__WBP_GM_COV_WeaponPictosPanel_WeaponElement0_K2Node_ComponentBoundEvent_4_OnNavigated__DelegateSignature(class UWBP_COV_WeaponElement_C* WeaponWidget);
	void BndEvt__WBP_GM_WeaponPictosSlots_PictoElement0_K2Node_ComponentBoundEvent_1_OnAction__DelegateSignature();
	void BndEvt__WBP_GM_WeaponPictosSlots_PictoElement1_K2Node_ComponentBoundEvent_2_OnAction__DelegateSignature();
	void BndEvt__WBP_GM_WeaponPictosSlots_PictoElement2_K2Node_ComponentBoundEvent_3_OnAction__DelegateSignature();
	void BndEvt__WBP_GM_WeaponPictosSlots_WeaponElement0_K2Node_ComponentBoundEvent_0_OnAction__DelegateSignature();
	void ExecuteUbergraph_WBP_GM_COV_WeaponPictosPanel(int32 EntryPoint);
	void GetListEntryFromItemSlot(const struct FFEquipmentSlot& EquipmentSlot, class UCommonUserWidget** ListEntry);
	void GetPictosSlotListEntries(TArray<class UWBP_COV_PictosElement_C*>* Array);
	void LoadCharacter(class UBP_CharacterData_C* CharacterData);
	void SetItemInstanceInSlot(class UBP_ItemInstance_Gear_C* GearInstance, const struct FFEquipmentSlot& EquipmentSlot, class UBP_CharacterData_C*& CharacterData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GM_COV_WeaponPictosPanel_C">();
	}
	static class UWBP_GM_COV_WeaponPictosPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GM_COV_WeaponPictosPanel_C>();
	}
};
static_assert(alignof(UWBP_GM_COV_WeaponPictosPanel_C) == 0x000008, "Wrong alignment on UWBP_GM_COV_WeaponPictosPanel_C");
static_assert(sizeof(UWBP_GM_COV_WeaponPictosPanel_C) == 0x000370, "Wrong size on UWBP_GM_COV_WeaponPictosPanel_C");
static_assert(offsetof(UWBP_GM_COV_WeaponPictosPanel_C, UberGraphFrame) == 0x000308, "Member 'UWBP_GM_COV_WeaponPictosPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GM_COV_WeaponPictosPanel_C, PictoElement0) == 0x000310, "Member 'UWBP_GM_COV_WeaponPictosPanel_C::PictoElement0' has a wrong offset!");
static_assert(offsetof(UWBP_GM_COV_WeaponPictosPanel_C, PictoElement1) == 0x000318, "Member 'UWBP_GM_COV_WeaponPictosPanel_C::PictoElement1' has a wrong offset!");
static_assert(offsetof(UWBP_GM_COV_WeaponPictosPanel_C, PictoElement2) == 0x000320, "Member 'UWBP_GM_COV_WeaponPictosPanel_C::PictoElement2' has a wrong offset!");
static_assert(offsetof(UWBP_GM_COV_WeaponPictosPanel_C, PictosBox) == 0x000328, "Member 'UWBP_GM_COV_WeaponPictosPanel_C::PictosBox' has a wrong offset!");
static_assert(offsetof(UWBP_GM_COV_WeaponPictosPanel_C, PictosNotificationBullet) == 0x000330, "Member 'UWBP_GM_COV_WeaponPictosPanel_C::PictosNotificationBullet' has a wrong offset!");
static_assert(offsetof(UWBP_GM_COV_WeaponPictosPanel_C, WeaponBox) == 0x000338, "Member 'UWBP_GM_COV_WeaponPictosPanel_C::WeaponBox' has a wrong offset!");
static_assert(offsetof(UWBP_GM_COV_WeaponPictosPanel_C, WeaponElement0) == 0x000340, "Member 'UWBP_GM_COV_WeaponPictosPanel_C::WeaponElement0' has a wrong offset!");
static_assert(offsetof(UWBP_GM_COV_WeaponPictosPanel_C, WeaponNotificationBullet) == 0x000348, "Member 'UWBP_GM_COV_WeaponPictosPanel_C::WeaponNotificationBullet' has a wrong offset!");
static_assert(offsetof(UWBP_GM_COV_WeaponPictosPanel_C, OnSlotNavigated) == 0x000350, "Member 'UWBP_GM_COV_WeaponPictosPanel_C::OnSlotNavigated' has a wrong offset!");
static_assert(offsetof(UWBP_GM_COV_WeaponPictosPanel_C, OnSlotAction) == 0x000360, "Member 'UWBP_GM_COV_WeaponPictosPanel_C::OnSlotAction' has a wrong offset!");

}

