#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BuffInfoPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BuffInfoPanel.WBP_BuffInfoPanel_C
// 0x0050 (0x0330 - 0x02E0)
class UWBP_BuffInfoPanel_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HorizontalBox_StatModifiers;                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BuffIcon;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_BuffName;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GM_HorizontalSeparator_C*          WBP_GM_HorizontalSeparator;                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SF_RichTextBlock_C*                WBP_SF_RichTextBlock_BuffDescription;              // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StatModifier_C*                    WBP_StatModifier;                                  // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StatModifier_C*                    WBP_StatModifier_1;                                // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_BattleBuffInstanceWrapper_C*        BattleBuffWrapper;                                 // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsPlaceholder;                                     // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_BuffInfoPanel(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetBattleBuffWrapper(class UBP_BattleBuffInstanceWrapper_C* BattleBuffWrapper_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BuffInfoPanel_C">();
	}
	static class UWBP_BuffInfoPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BuffInfoPanel_C>();
	}
};
static_assert(alignof(UWBP_BuffInfoPanel_C) == 0x000008, "Wrong alignment on UWBP_BuffInfoPanel_C");
static_assert(sizeof(UWBP_BuffInfoPanel_C) == 0x000330, "Wrong size on UWBP_BuffInfoPanel_C");
static_assert(offsetof(UWBP_BuffInfoPanel_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_BuffInfoPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_BuffInfoPanel_C, HorizontalBox_StatModifiers) == 0x0002E8, "Member 'UWBP_BuffInfoPanel_C::HorizontalBox_StatModifiers' has a wrong offset!");
static_assert(offsetof(UWBP_BuffInfoPanel_C, Image_BuffIcon) == 0x0002F0, "Member 'UWBP_BuffInfoPanel_C::Image_BuffIcon' has a wrong offset!");
static_assert(offsetof(UWBP_BuffInfoPanel_C, Text_BuffName) == 0x0002F8, "Member 'UWBP_BuffInfoPanel_C::Text_BuffName' has a wrong offset!");
static_assert(offsetof(UWBP_BuffInfoPanel_C, WBP_GM_HorizontalSeparator) == 0x000300, "Member 'UWBP_BuffInfoPanel_C::WBP_GM_HorizontalSeparator' has a wrong offset!");
static_assert(offsetof(UWBP_BuffInfoPanel_C, WBP_SF_RichTextBlock_BuffDescription) == 0x000308, "Member 'UWBP_BuffInfoPanel_C::WBP_SF_RichTextBlock_BuffDescription' has a wrong offset!");
static_assert(offsetof(UWBP_BuffInfoPanel_C, WBP_StatModifier) == 0x000310, "Member 'UWBP_BuffInfoPanel_C::WBP_StatModifier' has a wrong offset!");
static_assert(offsetof(UWBP_BuffInfoPanel_C, WBP_StatModifier_1) == 0x000318, "Member 'UWBP_BuffInfoPanel_C::WBP_StatModifier_1' has a wrong offset!");
static_assert(offsetof(UWBP_BuffInfoPanel_C, BattleBuffWrapper) == 0x000320, "Member 'UWBP_BuffInfoPanel_C::BattleBuffWrapper' has a wrong offset!");
static_assert(offsetof(UWBP_BuffInfoPanel_C, IsPlaceholder) == 0x000328, "Member 'UWBP_BuffInfoPanel_C::IsPlaceholder' has a wrong offset!");

}

