#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SavePointMenu

#include "Basic.hpp"

#include "SandFall_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FLevelDataEntry_structs.hpp"
#include "CommonUI_classes.hpp"
#include "EModalUIResponse_structs.hpp"
#include "ELevelType_structs.hpp"
#include "UMG_structs.hpp"
#include "E_SavePointSubMenu_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SavePointMenu.WBP_SavePointMenu_C
// 0x0308 (0x0738 - 0x0430)
class UWBP_SavePointMenu_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_MenuFade;                                     // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Rest;                                         // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_FadeIN;                                       // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonLazyImage*                       Background;                                        // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBackgroundBlur*                        BackgroundBlur;                                    // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BaseButton_C*                      BackToWorldMapButton;                              // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonActionBarContainer_C*        CommonActionBarContainer;                          // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GM_ConsumablesOverview_C*          ConsumablesOverview;                               // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BaseButton_C*                      FastTravelButton;                                  // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       FlagNumberImage;                                   // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SavePointLearnSkillsButton_C*      LearnSkillsButton;                                 // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BaseButton_C*                      NGPButton;                                         // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BaseButton_C*                      RestButton;                                        // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SavePointOverlay;                                  // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_TeamStatus_C*                  TeamStatus;                                        // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SavePointUpgradeAttributesButton_C* UpgradeAttributesButton;                          // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BaseButton_C*                      UpgradeTeamButton;                                 // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BaseButton_C*                      UpgradeWeaponsButton;                              // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_MenuContainer;                         // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonBoundActionButton_C*         WBP_CommonBoundActionButton_Back;                  // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WrappingText_C*                    WBP_HeadingText_Subzone;                           // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WrappingText_C*                    WBP_HeadingText_Zone;                              // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SpawnPointListWidget_C*            WBP_SpawnPointListWidget;                          // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_ItemList;                           // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGameplayTag                           SpawnPointTag;                                     // 0x04F8(0x0008)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FFLevelDataEntry                       CurrentLevelData;                                  // 0x0500(0x01B0)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UWBP_SavePointMenu_C* SavePointMenu)> OnLeave;               // 0x06B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FSF_ReferenceCounterHandle             UIModalBlockerReferenceHandle;                     // 0x06C0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ABP_jRPG_SavePointDialog_C*             SavePointDialog;                                   // 0x06E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FDataTableRowHandle                    SDOpenRestMenu;                                    // 0x06E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    SDRestSound;                                       // 0x06F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    SDCloseRestMenu;                                   // 0x0708(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	int32                                         SavePointNumber;                                   // 0x0718(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_71C[0x4];                                      // 0x071C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnFadeOutFinished;                                 // 0x0720(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UCommonButtonBase*                      LastFocusedButton;                                 // 0x0730(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Appear();
	void BndEvt__WBP_SavePointMenu_BackToWorldMapButton_K2Node_ComponentBoundEvent_16_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_SavePointMenu_BackToWorldMapButton_K2Node_ComponentBoundEvent_25_OnButtonBaseFocused__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_SavePointMenu_FastTravelButton_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_SavePointMenu_FastTravelButton_K2Node_ComponentBoundEvent_19_OnButtonBaseFocused__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_SavePointMenu_LearnSkillsButton_K2Node_ComponentBoundEvent_3_OnLearnSkillsButtonClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_SavePointMenu_LearnSkillsButton_K2Node_ComponentBoundEvent_4_OnLearnSkillsButtonFocused__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_SavePointMenu_NGPButton_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_SavePointMenu_NGPButton_K2Node_ComponentBoundEvent_24_OnButtonBaseFocused__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_SavePointMenu_RestButton_K2Node_ComponentBoundEvent_18_OnButtonBaseFocused__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_SavePointMenu_RestButton_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_SavePointMenu_UpgradeAttributesButton_K2Node_ComponentBoundEvent_1_OnUpgradeAttributesButtonClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_SavePointMenu_UpgradeAttributesButton_K2Node_ComponentBoundEvent_2_OnUpgradeAttributesButtonFocused__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_SavePointMenu_UpgradeTeamButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_SavePointMenu_UpgradeTeamButton_K2Node_ComponentBoundEvent_23_OnButtonBaseFocused__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_SavePointMenu_UpgradeWeaponsButton_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_SavePointMenu_UpgradeWeaponsButton_K2Node_ComponentBoundEvent_22_OnButtonBaseFocused__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_SavePointMenu_WBP_CommonBoundActionButton_Back_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void CloseGameMenu();
	void CloseSubMenu();
	void ConfirmStartNewGamePlus();
	void Disappear();
	void ExecuteUbergraph_WBP_SavePointMenu(int32 EntryPoint);
	void Finished_0CF249834A5986B41CAEF797DFBAEB35();
	void Finished_30457AB0481561A6E80F09A88C905211();
	void Finished_35236A0D4F7D416D1D747DB574B8AC86();
	void Finished_5810DFA442C7574BBA77F0873EA0DCF9();
	void Finished_7A6884D8416B21684FADD3BE1DF40AF2();
	void Finished_8944430A47DFAF5955E718A88326AC40();
	void Finished_9A323A9F493DE2EF8F0CD4BE4BF2DE98();
	void Finished_AAF89A6C48E927D2D755C9B3E179B52F();
	void Finished_E7821A9E47096D54CF148095FD056A71();
	void HealCharacters();
	void OnBackSelectedInTeleportMenu();
	void OnBlackScreen();
	void OnFirstNewGamePlusPopupAnswered(EModalUIResponse Selection);
	void OnMainMenuClosed();
	void OnSecondNewGamePlusPopupAnswered(EModalUIResponse Response);
	void OnTeleportPointSelected(const struct FGameplayTag& SpawnPointTag_0);
	void OnUIReady();
	void OpenMenu(E_SavePointSubMenu InSubMenu);
	void SaveGame();
	void SequenceEvent__ENTRYPOINTWBP_SavePointMenu();
	void SetupTeleportPointListWidget();
	void StartOpenMenu(E_SavePointSubMenu SubMenu);
	void TeleportPlayerToWorldMap();
	void UpdateAreaName(const struct FFLevelDataEntry& LevelData);
	void UpdateButtonsVisibility();
	void UpdateFlagNumber();
	void UpdateGoBackToWorldMapButtonVisibility();
	void UpdateNewGamePlusButtonVisibility();
	void UpdateUpgradeWeaponsButtonVisibility();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SavePointMenu_C">();
	}
	static class UWBP_SavePointMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SavePointMenu_C>();
	}
};
static_assert(alignof(UWBP_SavePointMenu_C) == 0x000008, "Wrong alignment on UWBP_SavePointMenu_C");
static_assert(sizeof(UWBP_SavePointMenu_C) == 0x000738, "Wrong size on UWBP_SavePointMenu_C");
static_assert(offsetof(UWBP_SavePointMenu_C, UberGraphFrame) == 0x000430, "Member 'UWBP_SavePointMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SavePointMenu_C, Anim_MenuFade) == 0x000438, "Member 'UWBP_SavePointMenu_C::Anim_MenuFade' has a wrong offset!");
static_assert(offsetof(UWBP_SavePointMenu_C, Anim_Rest) == 0x000440, "Member 'UWBP_SavePointMenu_C::Anim_Rest' has a wrong offset!");
static_assert(offsetof(UWBP_SavePointMenu_C, Anim_FadeIN) == 0x000448, "Member 'UWBP_SavePointMenu_C::Anim_FadeIN' has a wrong offset!");
static_assert(offsetof(UWBP_SavePointMenu_C, Background) == 0x000450, "Member 'UWBP_SavePointMenu_C::Background' has a wrong offset!");
static_assert(offsetof(UWBP_SavePointMenu_C, BackgroundBlur) == 0x000458, "Member 'UWBP_SavePointMenu_C::BackgroundBlur' has a wrong offset!");
static_assert(offsetof(UWBP_SavePointMenu_C, BackToWorldMapButton) == 0x000460, "Member 'UWBP_SavePointMenu_C::BackToWorldMapButton' has a wrong offset!");
static_assert(offsetof(UWBP_SavePointMenu_C, CommonActionBarContainer) == 0x000468, "Member 'UWBP_SavePointMenu_C::CommonActionBarContainer' has a wrong offset!");
static_assert(offsetof(UWBP_SavePointMenu_C, ConsumablesOverview) == 0x000470, "Member 'UWBP_SavePointMenu_C::ConsumablesOverview' has a wrong offset!");
static_assert(offsetof(UWBP_SavePointMenu_C, FastTravelButton) == 0x000478, "Member 'UWBP_SavePointMenu_C::FastTravelButton' has a wrong offset!");
static_assert(offsetof(UWBP_SavePointMenu_C, FlagNumberImage) == 0x000480, "Member 'UWBP_SavePointMenu_C::FlagNumberImage' has a wrong offset!");
static_assert(offsetof(UWBP_SavePointMenu_C, LearnSkillsButton) == 0x000488, "Member 'UWBP_SavePointMenu_C::LearnSkillsButton' has a wrong offset!");
static_assert(offsetof(UWBP_SavePointMenu_C, NGPButton) == 0x000490, "Member 'UWBP_SavePointMenu_C::NGPButton' has a wrong offset!");
static_assert(offsetof(UWBP_SavePointMenu_C, RestButton) == 0x000498, "Member 'UWBP_SavePointMenu_C::RestButton' has a wrong offset!");
static_assert(offsetof(UWBP_SavePointMenu_C, SavePointOverlay) == 0x0004A0, "Member 'UWBP_SavePointMenu_C::SavePointOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_SavePointMenu_C, TeamStatus) == 0x0004A8, "Member 'UWBP_SavePointMenu_C::TeamStatus' has a wrong offset!");
static_assert(offsetof(UWBP_SavePointMenu_C, UpgradeAttributesButton) == 0x0004B0, "Member 'UWBP_SavePointMenu_C::UpgradeAttributesButton' has a wrong offset!");
static_assert(offsetof(UWBP_SavePointMenu_C, UpgradeTeamButton) == 0x0004B8, "Member 'UWBP_SavePointMenu_C::UpgradeTeamButton' has a wrong offset!");
static_assert(offsetof(UWBP_SavePointMenu_C, UpgradeWeaponsButton) == 0x0004C0, "Member 'UWBP_SavePointMenu_C::UpgradeWeaponsButton' has a wrong offset!");
static_assert(offsetof(UWBP_SavePointMenu_C, VerticalBox_MenuContainer) == 0x0004C8, "Member 'UWBP_SavePointMenu_C::VerticalBox_MenuContainer' has a wrong offset!");
static_assert(offsetof(UWBP_SavePointMenu_C, WBP_CommonBoundActionButton_Back) == 0x0004D0, "Member 'UWBP_SavePointMenu_C::WBP_CommonBoundActionButton_Back' has a wrong offset!");
static_assert(offsetof(UWBP_SavePointMenu_C, WBP_HeadingText_Subzone) == 0x0004D8, "Member 'UWBP_SavePointMenu_C::WBP_HeadingText_Subzone' has a wrong offset!");
static_assert(offsetof(UWBP_SavePointMenu_C, WBP_HeadingText_Zone) == 0x0004E0, "Member 'UWBP_SavePointMenu_C::WBP_HeadingText_Zone' has a wrong offset!");
static_assert(offsetof(UWBP_SavePointMenu_C, WBP_SpawnPointListWidget) == 0x0004E8, "Member 'UWBP_SavePointMenu_C::WBP_SpawnPointListWidget' has a wrong offset!");
static_assert(offsetof(UWBP_SavePointMenu_C, WidgetSwitcher_ItemList) == 0x0004F0, "Member 'UWBP_SavePointMenu_C::WidgetSwitcher_ItemList' has a wrong offset!");
static_assert(offsetof(UWBP_SavePointMenu_C, SpawnPointTag) == 0x0004F8, "Member 'UWBP_SavePointMenu_C::SpawnPointTag' has a wrong offset!");
static_assert(offsetof(UWBP_SavePointMenu_C, CurrentLevelData) == 0x000500, "Member 'UWBP_SavePointMenu_C::CurrentLevelData' has a wrong offset!");
static_assert(offsetof(UWBP_SavePointMenu_C, OnLeave) == 0x0006B0, "Member 'UWBP_SavePointMenu_C::OnLeave' has a wrong offset!");
static_assert(offsetof(UWBP_SavePointMenu_C, UIModalBlockerReferenceHandle) == 0x0006C0, "Member 'UWBP_SavePointMenu_C::UIModalBlockerReferenceHandle' has a wrong offset!");
static_assert(offsetof(UWBP_SavePointMenu_C, SavePointDialog) == 0x0006E0, "Member 'UWBP_SavePointMenu_C::SavePointDialog' has a wrong offset!");
static_assert(offsetof(UWBP_SavePointMenu_C, SDOpenRestMenu) == 0x0006E8, "Member 'UWBP_SavePointMenu_C::SDOpenRestMenu' has a wrong offset!");
static_assert(offsetof(UWBP_SavePointMenu_C, SDRestSound) == 0x0006F8, "Member 'UWBP_SavePointMenu_C::SDRestSound' has a wrong offset!");
static_assert(offsetof(UWBP_SavePointMenu_C, SDCloseRestMenu) == 0x000708, "Member 'UWBP_SavePointMenu_C::SDCloseRestMenu' has a wrong offset!");
static_assert(offsetof(UWBP_SavePointMenu_C, SavePointNumber) == 0x000718, "Member 'UWBP_SavePointMenu_C::SavePointNumber' has a wrong offset!");
static_assert(offsetof(UWBP_SavePointMenu_C, OnFadeOutFinished) == 0x000720, "Member 'UWBP_SavePointMenu_C::OnFadeOutFinished' has a wrong offset!");
static_assert(offsetof(UWBP_SavePointMenu_C, LastFocusedButton) == 0x000730, "Member 'UWBP_SavePointMenu_C::LastFocusedButton' has a wrong offset!");

}

