#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MediaPlayerCinematic

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MediaUtils_structs.hpp"


namespace SDK::Params
{

// Function WBP_MediaPlayerCinematic.WBP_MediaPlayerCinematic_C.ExecuteUbergraph_WBP_MediaPlayerCinematic
// 0x02D0 (0x02D0 - 0x0000)
struct WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_wildcard_Variable;                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_MakeTimespan_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0048)(HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetVideoTrackFrameRate_ReturnValue;       // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetTime_ReturnValue;                      // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0080(0x0048)(HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue;              // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00D8(0x0048)(HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0128(0x0010)(ReferenceParm)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0140(0x0010)()
	struct FTimespan                              CallFunc_GetTime_ReturnValue_1;                    // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue_1;            // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_TimespanTimespan_ReturnValue;     // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0160(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01A8(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x01B8(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0200(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0210(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0220(0x0010)()
	bool                                          CallFunc_Pause_ReturnValue;                        // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_232[0x6];                                      // 0x0232(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_MakeTimespan_ReturnValue_1;               // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMediaPlayerOptions                    K2Node_MakeStruct_MediaPlayerOptions;              // 0x0240(0x0080)()
	bool                                          CallFunc_OpenSourceLatent_bSuccess;                // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic) == 0x000008, "Wrong alignment on WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic");
static_assert(sizeof(WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic) == 0x0002D0, "Wrong size on WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic");
static_assert(offsetof(WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic, EntryPoint) == 0x000000, "Member 'WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic, Temp_wildcard_Variable) == 0x000004, "Member 'WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000008, "Member 'WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic, CallFunc_MakeTimespan_ReturnValue) == 0x000010, "Member 'WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic::CallFunc_MakeTimespan_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic, K2Node_CreateDelegate_OutputDelegate) == 0x000060, "Member 'WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic, CallFunc_GetVideoTrackFrameRate_ReturnValue) == 0x000070, "Member 'WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic::CallFunc_GetVideoTrackFrameRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic, CallFunc_GetTime_ReturnValue) == 0x000078, "Member 'WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic::CallFunc_GetTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic, K2Node_MakeStruct_FormatArgumentData_1) == 0x000080, "Member 'WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic, CallFunc_GetTotalSeconds_ReturnValue) == 0x0000C8, "Member 'WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic::CallFunc_GetTotalSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000D0, "Member 'WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000D8, "Member 'WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000120, "Member 'WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic, K2Node_MakeArray_Array) == 0x000128, "Member 'WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic, CallFunc_FCeil_ReturnValue) == 0x000138, "Member 'WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic, CallFunc_Format_ReturnValue) == 0x000140, "Member 'WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic, CallFunc_GetTime_ReturnValue_1) == 0x000150, "Member 'WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic::CallFunc_GetTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic, CallFunc_GetTotalSeconds_ReturnValue_1) == 0x000158, "Member 'WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic::CallFunc_GetTotalSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic, CallFunc_Greater_TimespanTimespan_ReturnValue) == 0x00015C, "Member 'WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic::CallFunc_Greater_TimespanTimespan_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic, K2Node_MakeStruct_FormatArgumentData_3) == 0x000160, "Member 'WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic, K2Node_MakeArray_Array_1) == 0x0001A8, "Member 'WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic, K2Node_MakeStruct_FormatArgumentData_4) == 0x0001B8, "Member 'WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic, CallFunc_Format_ReturnValue_1) == 0x000200, "Member 'WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic, K2Node_MakeArray_Array_2) == 0x000210, "Member 'WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic, CallFunc_Format_ReturnValue_2) == 0x000220, "Member 'WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic, CallFunc_Pause_ReturnValue) == 0x000230, "Member 'WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic::CallFunc_Pause_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic, K2Node_Event_IsDesignTime) == 0x000231, "Member 'WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic, CallFunc_MakeTimespan_ReturnValue_1) == 0x000238, "Member 'WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic::CallFunc_MakeTimespan_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic, K2Node_MakeStruct_MediaPlayerOptions) == 0x000240, "Member 'WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic::K2Node_MakeStruct_MediaPlayerOptions' has a wrong offset!");
static_assert(offsetof(WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic, CallFunc_OpenSourceLatent_bSuccess) == 0x0002C0, "Member 'WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic::CallFunc_OpenSourceLatent_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x0002C8, "Member 'WBP_MediaPlayerCinematic_C_ExecuteUbergraph_WBP_MediaPlayerCinematic::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function WBP_MediaPlayerCinematic.WBP_MediaPlayerCinematic_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_MediaPlayerCinematic_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MediaPlayerCinematic_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_MediaPlayerCinematic_C_PreConstruct");
static_assert(sizeof(WBP_MediaPlayerCinematic_C_PreConstruct) == 0x000001, "Wrong size on WBP_MediaPlayerCinematic_C_PreConstruct");
static_assert(offsetof(WBP_MediaPlayerCinematic_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_MediaPlayerCinematic_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

