#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Debug_GenericParameterListWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Debug_GenericParameterListWidget.WBP_Debug_GenericParameterListWidget_C.SetParameterName
// 0x0020 (0x0020 - 0x0000)
struct WBP_Debug_GenericParameterListWidget_C_SetParameterName final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0010)()
};
static_assert(alignof(WBP_Debug_GenericParameterListWidget_C_SetParameterName) == 0x000008, "Wrong alignment on WBP_Debug_GenericParameterListWidget_C_SetParameterName");
static_assert(sizeof(WBP_Debug_GenericParameterListWidget_C_SetParameterName) == 0x000020, "Wrong size on WBP_Debug_GenericParameterListWidget_C_SetParameterName");
static_assert(offsetof(WBP_Debug_GenericParameterListWidget_C_SetParameterName, Name_0) == 0x000000, "Member 'WBP_Debug_GenericParameterListWidget_C_SetParameterName::Name_0' has a wrong offset!");
static_assert(offsetof(WBP_Debug_GenericParameterListWidget_C_SetParameterName, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'WBP_Debug_GenericParameterListWidget_C_SetParameterName::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_Debug_GenericParameterListWidget.WBP_Debug_GenericParameterListWidget_C.SetParameterValueAsActorArray
// 0x0090 (0x0090 - 0x0000)
struct WBP_Debug_GenericParameterListWidget_C_SetParameterValueAsActorArray final
{
public:
	TArray<class AActor*>                         Value;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 local_Values;                                      // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0080(0x0010)()
};
static_assert(alignof(WBP_Debug_GenericParameterListWidget_C_SetParameterValueAsActorArray) == 0x000008, "Wrong alignment on WBP_Debug_GenericParameterListWidget_C_SetParameterValueAsActorArray");
static_assert(sizeof(WBP_Debug_GenericParameterListWidget_C_SetParameterValueAsActorArray) == 0x000090, "Wrong size on WBP_Debug_GenericParameterListWidget_C_SetParameterValueAsActorArray");
static_assert(offsetof(WBP_Debug_GenericParameterListWidget_C_SetParameterValueAsActorArray, Value) == 0x000000, "Member 'WBP_Debug_GenericParameterListWidget_C_SetParameterValueAsActorArray::Value' has a wrong offset!");
static_assert(offsetof(WBP_Debug_GenericParameterListWidget_C_SetParameterValueAsActorArray, local_Values) == 0x000010, "Member 'WBP_Debug_GenericParameterListWidget_C_SetParameterValueAsActorArray::local_Values' has a wrong offset!");
static_assert(offsetof(WBP_Debug_GenericParameterListWidget_C_SetParameterValueAsActorArray, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_Debug_GenericParameterListWidget_C_SetParameterValueAsActorArray::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_GenericParameterListWidget_C_SetParameterValueAsActorArray, Temp_int_Array_Index_Variable) == 0x000024, "Member 'WBP_Debug_GenericParameterListWidget_C_SetParameterValueAsActorArray::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Debug_GenericParameterListWidget_C_SetParameterValueAsActorArray, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'WBP_Debug_GenericParameterListWidget_C_SetParameterValueAsActorArray::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Debug_GenericParameterListWidget_C_SetParameterValueAsActorArray, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_Debug_GenericParameterListWidget_C_SetParameterValueAsActorArray::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Debug_GenericParameterListWidget_C_SetParameterValueAsActorArray, CallFunc_GetDisplayName_ReturnValue) == 0x000038, "Member 'WBP_Debug_GenericParameterListWidget_C_SetParameterValueAsActorArray::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_GenericParameterListWidget_C_SetParameterValueAsActorArray, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'WBP_Debug_GenericParameterListWidget_C_SetParameterValueAsActorArray::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_GenericParameterListWidget_C_SetParameterValueAsActorArray, CallFunc_Less_IntInt_ReturnValue) == 0x000049, "Member 'WBP_Debug_GenericParameterListWidget_C_SetParameterValueAsActorArray::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_GenericParameterListWidget_C_SetParameterValueAsActorArray, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'WBP_Debug_GenericParameterListWidget_C_SetParameterValueAsActorArray::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_GenericParameterListWidget_C_SetParameterValueAsActorArray, CallFunc_Concat_StrStr_ReturnValue) == 0x000050, "Member 'WBP_Debug_GenericParameterListWidget_C_SetParameterValueAsActorArray::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_GenericParameterListWidget_C_SetParameterValueAsActorArray, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000060, "Member 'WBP_Debug_GenericParameterListWidget_C_SetParameterValueAsActorArray::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_GenericParameterListWidget_C_SetParameterValueAsActorArray, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000070, "Member 'WBP_Debug_GenericParameterListWidget_C_SetParameterValueAsActorArray::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Debug_GenericParameterListWidget_C_SetParameterValueAsActorArray, CallFunc_Conv_StringToText_ReturnValue) == 0x000080, "Member 'WBP_Debug_GenericParameterListWidget_C_SetParameterValueAsActorArray::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

