#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PictoIcon

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "E_PassiveEffectCategory_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PictoIcon.WBP_PictoIcon_C
// 0x0020 (0x0328 - 0x0308)
class UWBP_PictoIcon_C final : public UCommonUserWidget
{
public:
	class UCommonLazyImage*                       Icon;                                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           LearnStateRetainerBox;                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDataTable*                             PictoIconsDT;                                      // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentStep;                                       // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LearntNewLuminaThisBattle;                         // 0x0324(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void GetCurrentStep(int32* CurrentStep_0);
	void GetLearntNewLuminaThisBattle(bool* LearntNewLuminaThisBattle_0);
	void TransitionToNextStep(double Progression);
	void LoadPictoIconColor(const struct FS_PictoIconsDataRow& PictoIconData, const struct FFPassiveEffect& PassiveEffectDefinition);
	void LoadPictoIcon(class FName PictoID);
	void LoadPassiveEffectLearnState(const struct FFPassiveEffectProgression& PassiveEffectProgression);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PictoIcon_C">();
	}
	static class UWBP_PictoIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PictoIcon_C>();
	}
};
static_assert(alignof(UWBP_PictoIcon_C) == 0x000008, "Wrong alignment on UWBP_PictoIcon_C");
static_assert(sizeof(UWBP_PictoIcon_C) == 0x000328, "Wrong size on UWBP_PictoIcon_C");
static_assert(offsetof(UWBP_PictoIcon_C, Icon) == 0x000308, "Member 'UWBP_PictoIcon_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_PictoIcon_C, LearnStateRetainerBox) == 0x000310, "Member 'UWBP_PictoIcon_C::LearnStateRetainerBox' has a wrong offset!");
static_assert(offsetof(UWBP_PictoIcon_C, PictoIconsDT) == 0x000318, "Member 'UWBP_PictoIcon_C::PictoIconsDT' has a wrong offset!");
static_assert(offsetof(UWBP_PictoIcon_C, CurrentStep) == 0x000320, "Member 'UWBP_PictoIcon_C::CurrentStep' has a wrong offset!");
static_assert(offsetof(UWBP_PictoIcon_C, LearntNewLuminaThisBattle) == 0x000324, "Member 'UWBP_PictoIcon_C::LearntNewLuminaThisBattle' has a wrong offset!");

}

