#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_AimTarget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUD_AimTarget.WBP_HUD_AimTarget_C
// 0x0020 (0x0300 - 0x02E0)
class UWBP_HUD_AimTarget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_ShowPrompt;                                   // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_CrossHair_C*                       WBP_CrossHair;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GM_PromptGeneric_C*                WBP_GM_PromptGeneric_BackFromFreeAim;              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_HUD_AimTarget(int32 EntryPoint);
	void InitAmmoCount(int32 AmmoCount, bool UseAP_Ammo);
	void OnHoverEnd();
	void OnHoverStart();
	void ResetAmmo();
	void SetCrossHairVisibility(bool InVisibility);
	void SetRemainingAmmo(int32 AmmoLeftCount);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUD_AimTarget_C">();
	}
	static class UWBP_HUD_AimTarget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_AimTarget_C>();
	}
};
static_assert(alignof(UWBP_HUD_AimTarget_C) == 0x000008, "Wrong alignment on UWBP_HUD_AimTarget_C");
static_assert(sizeof(UWBP_HUD_AimTarget_C) == 0x000300, "Wrong size on UWBP_HUD_AimTarget_C");
static_assert(offsetof(UWBP_HUD_AimTarget_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_HUD_AimTarget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_AimTarget_C, Anim_ShowPrompt) == 0x0002E8, "Member 'UWBP_HUD_AimTarget_C::Anim_ShowPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_AimTarget_C, WBP_CrossHair) == 0x0002F0, "Member 'UWBP_HUD_AimTarget_C::WBP_CrossHair' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_AimTarget_C, WBP_GM_PromptGeneric_BackFromFreeAim) == 0x0002F8, "Member 'UWBP_HUD_AimTarget_C::WBP_GM_PromptGeneric_BackFromFreeAim' has a wrong offset!");

}

