#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DialogueContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DialogueContainer.WBP_DialogueContainer_C
// 0x00B8 (0x04E8 - 0x0430)
class UWBP_DialogueContainer_C final : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_ResponseAppear;                               // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Appear;                                       // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           Canvas_DialogueLines;                              // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LineBotLeft;                                 // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LineTopLeft;                                 // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_0;                                     // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Responses;                               // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SF_RichTextBlock_C*                SF_RichText_DialogueLine;                          // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SF_RichTextBlock_C*                SF_RichText_Name;                                  // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GM_PromptGeneric_C*                WBP_GM_PromptGeneric_Confirm;                      // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GM_PromptGeneric_C*                WBP_GM_PromptGeneric_Leave;                        // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_Dialogue_ChoiceOption_C*>   CurrentChoiceWidgets;                              // 0x0498(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMulticastInlineDelegate<void(int32 ChoiceIndex)> OnChoiceMade;                                  // 0x04A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UWBP_Dialogue_ChoiceOption_C*           Focused_Option_Widget;                             // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLeaveButtonEnabled;                              // 0x04C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    SDDialogLeave;                                     // 0x04C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    SDDialogConfirm;                                   // 0x04D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void AppearAnim();
	void BndEvt__WBP_DialogueContainer_WBP_GM_PromptGeneric_Confirm_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature(class UWBP_GM_PromptGeneric_C* PromptWidget);
	void BndEvt__WBP_DialogueContainer_WBP_GM_PromptGeneric_Leave_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature(class UWBP_GM_PromptGeneric_C* PromptWidget);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void Construct();
	void DisableChoices();
	class UWidget* DoCustomNavigationScrollBoxBoundary(EUINavigation Navigation_0);
	void ExecuteUbergraph_WBP_DialogueContainer(int32 EntryPoint);
	void MakeChoice(const class UWBP_Dialogue_ChoiceOption_C*& ChoiceOption);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void OnChoiceClicked(class UWBP_Dialogue_ChoiceOption_C* ChoiceOptionWidget);
	void OnDialogueChoiceHovered(class UWBP_Dialogue_ChoiceOption_C* ChoiceOptionWidget);
	void OnInputMethodChanged(ECommonInputType bNewInputType);
	void ResponseDesappearAnim();
	void SetChoices(const TArray<class FText>& Choices);
	void SetLeaveButtonEnabled(bool Visible);
	void ShowDialogueLine(const class FText& DialogueLine, const class FText& CharacterName);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DialogueContainer_C">();
	}
	static class UWBP_DialogueContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DialogueContainer_C>();
	}
};
static_assert(alignof(UWBP_DialogueContainer_C) == 0x000008, "Wrong alignment on UWBP_DialogueContainer_C");
static_assert(sizeof(UWBP_DialogueContainer_C) == 0x0004E8, "Wrong size on UWBP_DialogueContainer_C");
static_assert(offsetof(UWBP_DialogueContainer_C, UberGraphFrame) == 0x000430, "Member 'UWBP_DialogueContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueContainer_C, Anim_ResponseAppear) == 0x000438, "Member 'UWBP_DialogueContainer_C::Anim_ResponseAppear' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueContainer_C, Anim_Appear) == 0x000440, "Member 'UWBP_DialogueContainer_C::Anim_Appear' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueContainer_C, Canvas_DialogueLines) == 0x000448, "Member 'UWBP_DialogueContainer_C::Canvas_DialogueLines' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueContainer_C, Image_Background) == 0x000450, "Member 'UWBP_DialogueContainer_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueContainer_C, Image_LineBotLeft) == 0x000458, "Member 'UWBP_DialogueContainer_C::Image_LineBotLeft' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueContainer_C, Image_LineTopLeft) == 0x000460, "Member 'UWBP_DialogueContainer_C::Image_LineTopLeft' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueContainer_C, RetainerBox_0) == 0x000468, "Member 'UWBP_DialogueContainer_C::RetainerBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueContainer_C, ScrollBox_Responses) == 0x000470, "Member 'UWBP_DialogueContainer_C::ScrollBox_Responses' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueContainer_C, SF_RichText_DialogueLine) == 0x000478, "Member 'UWBP_DialogueContainer_C::SF_RichText_DialogueLine' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueContainer_C, SF_RichText_Name) == 0x000480, "Member 'UWBP_DialogueContainer_C::SF_RichText_Name' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueContainer_C, WBP_GM_PromptGeneric_Confirm) == 0x000488, "Member 'UWBP_DialogueContainer_C::WBP_GM_PromptGeneric_Confirm' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueContainer_C, WBP_GM_PromptGeneric_Leave) == 0x000490, "Member 'UWBP_DialogueContainer_C::WBP_GM_PromptGeneric_Leave' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueContainer_C, CurrentChoiceWidgets) == 0x000498, "Member 'UWBP_DialogueContainer_C::CurrentChoiceWidgets' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueContainer_C, OnChoiceMade) == 0x0004A8, "Member 'UWBP_DialogueContainer_C::OnChoiceMade' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueContainer_C, Focused_Option_Widget) == 0x0004B8, "Member 'UWBP_DialogueContainer_C::Focused_Option_Widget' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueContainer_C, IsLeaveButtonEnabled) == 0x0004C0, "Member 'UWBP_DialogueContainer_C::IsLeaveButtonEnabled' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueContainer_C, SDDialogLeave) == 0x0004C8, "Member 'UWBP_DialogueContainer_C::SDDialogLeave' has a wrong offset!");
static_assert(offsetof(UWBP_DialogueContainer_C, SDDialogConfirm) == 0x0004D8, "Member 'UWBP_DialogueContainer_C::SDDialogConfirm' has a wrong offset!");

}

