#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_LootList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUD_LootList.WBP_HUD_LootList_C
// 0x0098 (0x0378 - 0x02E0)
class UWBP_HUD_LootList_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Appear_Regular;                               // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Artdeco_Right;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CenterImage;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CenterImage_1;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ligne_Right;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ligne_Right_1;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_Left;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_Left_1;                                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Point_left;                                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Point_left_1;                                      // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Point_Right;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Point_Right_1;                                     // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           RPG_LootList;                                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HUD_LootEntry_C*                   WBP_HUD_LootEntry;                                 // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_HUD_LootEntry_C*>           LootEntryQueue;                                    // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          HasAppeared;                                       // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddLoot(const TMap<class FName, int32>& ItemTypeAndQuantity);
	void AddLootFromGeneratedItems(const TArray<class UBP_GeneratedItemInfo_Base_C*>& GeneratedItems);
	void Appear();
	void Construct();
	void Disappear();
	void ExecuteUbergraph_WBP_HUD_LootList(int32 EntryPoint);
	void PostBattleLootList(const TMap<class FName, int32>& ItemTypeAndQuantity);
	void ProcessLootNotifQueue();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUD_LootList_C">();
	}
	static class UWBP_HUD_LootList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_LootList_C>();
	}
};
static_assert(alignof(UWBP_HUD_LootList_C) == 0x000008, "Wrong alignment on UWBP_HUD_LootList_C");
static_assert(sizeof(UWBP_HUD_LootList_C) == 0x000378, "Wrong size on UWBP_HUD_LootList_C");
static_assert(offsetof(UWBP_HUD_LootList_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_HUD_LootList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootList_C, Anim_Appear_Regular) == 0x0002E8, "Member 'UWBP_HUD_LootList_C::Anim_Appear_Regular' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootList_C, Artdeco_Right) == 0x0002F0, "Member 'UWBP_HUD_LootList_C::Artdeco_Right' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootList_C, Background) == 0x0002F8, "Member 'UWBP_HUD_LootList_C::Background' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootList_C, CenterImage) == 0x000300, "Member 'UWBP_HUD_LootList_C::CenterImage' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootList_C, CenterImage_1) == 0x000308, "Member 'UWBP_HUD_LootList_C::CenterImage_1' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootList_C, Ligne_Right) == 0x000310, "Member 'UWBP_HUD_LootList_C::Ligne_Right' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootList_C, Ligne_Right_1) == 0x000318, "Member 'UWBP_HUD_LootList_C::Ligne_Right_1' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootList_C, Line_Left) == 0x000320, "Member 'UWBP_HUD_LootList_C::Line_Left' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootList_C, Line_Left_1) == 0x000328, "Member 'UWBP_HUD_LootList_C::Line_Left_1' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootList_C, Point_left) == 0x000330, "Member 'UWBP_HUD_LootList_C::Point_left' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootList_C, Point_left_1) == 0x000338, "Member 'UWBP_HUD_LootList_C::Point_left_1' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootList_C, Point_Right) == 0x000340, "Member 'UWBP_HUD_LootList_C::Point_Right' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootList_C, Point_Right_1) == 0x000348, "Member 'UWBP_HUD_LootList_C::Point_Right_1' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootList_C, RPG_LootList) == 0x000350, "Member 'UWBP_HUD_LootList_C::RPG_LootList' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootList_C, WBP_HUD_LootEntry) == 0x000358, "Member 'UWBP_HUD_LootList_C::WBP_HUD_LootEntry' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootList_C, LootEntryQueue) == 0x000360, "Member 'UWBP_HUD_LootList_C::LootEntryQueue' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_LootList_C, HasAppeared) == 0x000370, "Member 'UWBP_HUD_LootList_C::HasAppeared' has a wrong offset!");

}

