#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ExperienceBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ExperienceBar.WBP_ExperienceBar_C
// 0x0030 (0x0338 - 0x0308)
class UWBP_ExperienceBar_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_CharacterLevel_C*                  CharacterLevel;                                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ExpBar;                                            // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ExperienceBar;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         PreviewMaxValue;                                   // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PreviewCurrentValue;                               // 0x032C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PreviewCurrentLevel;                               // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ExperienceBar(int32 EntryPoint);
	void LoadCharacterData(class UBP_CharacterData_C* InCharacterData);
	void PreConstruct(bool IsDesignTime);
	void SetLevelAndValue(int32 Level, int32 exp, int32 MaxExp);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ExperienceBar_C">();
	}
	static class UWBP_ExperienceBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ExperienceBar_C>();
	}
};
static_assert(alignof(UWBP_ExperienceBar_C) == 0x000008, "Wrong alignment on UWBP_ExperienceBar_C");
static_assert(sizeof(UWBP_ExperienceBar_C) == 0x000338, "Wrong size on UWBP_ExperienceBar_C");
static_assert(offsetof(UWBP_ExperienceBar_C, UberGraphFrame) == 0x000308, "Member 'UWBP_ExperienceBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ExperienceBar_C, CharacterLevel) == 0x000310, "Member 'UWBP_ExperienceBar_C::CharacterLevel' has a wrong offset!");
static_assert(offsetof(UWBP_ExperienceBar_C, ExpBar) == 0x000318, "Member 'UWBP_ExperienceBar_C::ExpBar' has a wrong offset!");
static_assert(offsetof(UWBP_ExperienceBar_C, ExperienceBar) == 0x000320, "Member 'UWBP_ExperienceBar_C::ExperienceBar' has a wrong offset!");
static_assert(offsetof(UWBP_ExperienceBar_C, PreviewMaxValue) == 0x000328, "Member 'UWBP_ExperienceBar_C::PreviewMaxValue' has a wrong offset!");
static_assert(offsetof(UWBP_ExperienceBar_C, PreviewCurrentValue) == 0x00032C, "Member 'UWBP_ExperienceBar_C::PreviewCurrentValue' has a wrong offset!");
static_assert(offsetof(UWBP_ExperienceBar_C, PreviewCurrentLevel) == 0x000330, "Member 'UWBP_ExperienceBar_C::PreviewCurrentLevel' has a wrong offset!");

}

