#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CustomizationIcon

#include "Basic.hpp"

#include "S_jRPG_Item_StaticData_structs.hpp"


namespace SDK::Params
{

// Function WBP_CustomizationIcon.WBP_CustomizationIcon_C.LoadCustomizationIcon
// 0x0160 (0x0160 - 0x0000)
struct WBP_CustomizationIcon_C_LoadCustomizationIcon final
{
public:
	struct FS_jRPG_Item_StaticData                ItemData;                                          // 0x0000(0x0130)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ObjectIsA_ReturnValue_1;                  // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CustomizationIcon_C_LoadCustomizationIcon) == 0x000008, "Wrong alignment on WBP_CustomizationIcon_C_LoadCustomizationIcon");
static_assert(sizeof(WBP_CustomizationIcon_C_LoadCustomizationIcon) == 0x000160, "Wrong size on WBP_CustomizationIcon_C_LoadCustomizationIcon");
static_assert(offsetof(WBP_CustomizationIcon_C_LoadCustomizationIcon, ItemData) == 0x000000, "Member 'WBP_CustomizationIcon_C_LoadCustomizationIcon::ItemData' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationIcon_C_LoadCustomizationIcon, CallFunc_ObjectIsA_ReturnValue) == 0x000130, "Member 'WBP_CustomizationIcon_C_LoadCustomizationIcon::CallFunc_ObjectIsA_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationIcon_C_LoadCustomizationIcon, CallFunc_ObjectIsA_ReturnValue_1) == 0x000131, "Member 'WBP_CustomizationIcon_C_LoadCustomizationIcon::CallFunc_ObjectIsA_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationIcon_C_LoadCustomizationIcon, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000138, "Member 'WBP_CustomizationIcon_C_LoadCustomizationIcon::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationIcon_C_LoadCustomizationIcon, K2Node_DynamicCast_AsTexture_2D) == 0x000140, "Member 'WBP_CustomizationIcon_C_LoadCustomizationIcon::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationIcon_C_LoadCustomizationIcon, K2Node_DynamicCast_bSuccess) == 0x000148, "Member 'WBP_CustomizationIcon_C_LoadCustomizationIcon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationIcon_C_LoadCustomizationIcon, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000150, "Member 'WBP_CustomizationIcon_C_LoadCustomizationIcon::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CustomizationIcon_C_LoadCustomizationIcon, CallFunc_IsValid_ReturnValue) == 0x000158, "Member 'WBP_CustomizationIcon_C_LoadCustomizationIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

