#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BattleLoot_Picto

#include "Basic.hpp"

#include "EWeaponQuality_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BattleLoot_Picto.WBP_BattleLoot_Picto_C
// 0x0048 (0x0350 - 0x0308)
class UWBP_BattleLoot_Picto_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewPictos_Appear;                                  // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewPictos_Looping;                                 // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_WrappingText_C*                    LuminaDescription;                                 // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WrappingText_C*                    PictoName;                                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PictoIcon_C*                       WBP_PictoIcon;                                     // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PictoLevel_C*                      WBP_PictoLevel;                                    // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    Data_Table_Row_Handle;                             // 0x0340(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void Construct();
	void ExecuteUbergraph_WBP_BattleLoot_Picto(int32 EntryPoint);
	void LoadPicto(class UBP_ItemInstance_Gear_C* PictoInstance);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_BattleLoot_Picto_C">();
	}
	static class UWBP_BattleLoot_Picto_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BattleLoot_Picto_C>();
	}
};
static_assert(alignof(UWBP_BattleLoot_Picto_C) == 0x000008, "Wrong alignment on UWBP_BattleLoot_Picto_C");
static_assert(sizeof(UWBP_BattleLoot_Picto_C) == 0x000350, "Wrong size on UWBP_BattleLoot_Picto_C");
static_assert(offsetof(UWBP_BattleLoot_Picto_C, UberGraphFrame) == 0x000308, "Member 'UWBP_BattleLoot_Picto_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_BattleLoot_Picto_C, NewPictos_Appear) == 0x000310, "Member 'UWBP_BattleLoot_Picto_C::NewPictos_Appear' has a wrong offset!");
static_assert(offsetof(UWBP_BattleLoot_Picto_C, NewPictos_Looping) == 0x000318, "Member 'UWBP_BattleLoot_Picto_C::NewPictos_Looping' has a wrong offset!");
static_assert(offsetof(UWBP_BattleLoot_Picto_C, LuminaDescription) == 0x000320, "Member 'UWBP_BattleLoot_Picto_C::LuminaDescription' has a wrong offset!");
static_assert(offsetof(UWBP_BattleLoot_Picto_C, PictoName) == 0x000328, "Member 'UWBP_BattleLoot_Picto_C::PictoName' has a wrong offset!");
static_assert(offsetof(UWBP_BattleLoot_Picto_C, WBP_PictoIcon) == 0x000330, "Member 'UWBP_BattleLoot_Picto_C::WBP_PictoIcon' has a wrong offset!");
static_assert(offsetof(UWBP_BattleLoot_Picto_C, WBP_PictoLevel) == 0x000338, "Member 'UWBP_BattleLoot_Picto_C::WBP_PictoLevel' has a wrong offset!");
static_assert(offsetof(UWBP_BattleLoot_Picto_C, Data_Table_Row_Handle) == 0x000340, "Member 'UWBP_BattleLoot_Picto_C::Data_Table_Row_Handle' has a wrong offset!");

}

