#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Debug_UMG_AnimationDebugger

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Debug_UMG_AnimationDebugger.WBP_Debug_UMG_AnimationDebugger_C.ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger
// 0x0028 (0x0028 - 0x0000)
struct WBP_Debug_UMG_AnimationDebugger_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_CustomEvent_Widget;                         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidgetAnimation*>               K2Node_CustomEvent_Animations;                     // 0x0010(0x0010)(ReferenceParm)
	class UWBP_Debug_UMG_AnimationDebugger_WidgetEntry_C* CallFunc_BP_CreateEntryOfClass_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_UMG_AnimationDebugger_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger) == 0x000008, "Wrong alignment on WBP_Debug_UMG_AnimationDebugger_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger");
static_assert(sizeof(WBP_Debug_UMG_AnimationDebugger_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger) == 0x000028, "Wrong size on WBP_Debug_UMG_AnimationDebugger_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger");
static_assert(offsetof(WBP_Debug_UMG_AnimationDebugger_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger, EntryPoint) == 0x000000, "Member 'WBP_Debug_UMG_AnimationDebugger_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UMG_AnimationDebugger_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger, K2Node_CustomEvent_Widget) == 0x000008, "Member 'WBP_Debug_UMG_AnimationDebugger_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger::K2Node_CustomEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UMG_AnimationDebugger_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger, K2Node_CustomEvent_Animations) == 0x000010, "Member 'WBP_Debug_UMG_AnimationDebugger_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger::K2Node_CustomEvent_Animations' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UMG_AnimationDebugger_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger, CallFunc_BP_CreateEntryOfClass_ReturnValue) == 0x000020, "Member 'WBP_Debug_UMG_AnimationDebugger_C_ExecuteUbergraph_WBP_Debug_UMG_AnimationDebugger::CallFunc_BP_CreateEntryOfClass_ReturnValue' has a wrong offset!");

// Function WBP_Debug_UMG_AnimationDebugger.WBP_Debug_UMG_AnimationDebugger_C.RegisterWidget
// 0x0018 (0x0018 - 0x0000)
struct WBP_Debug_UMG_AnimationDebugger_C_RegisterWidget final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidgetAnimation*>               Animations;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Debug_UMG_AnimationDebugger_C_RegisterWidget) == 0x000008, "Wrong alignment on WBP_Debug_UMG_AnimationDebugger_C_RegisterWidget");
static_assert(sizeof(WBP_Debug_UMG_AnimationDebugger_C_RegisterWidget) == 0x000018, "Wrong size on WBP_Debug_UMG_AnimationDebugger_C_RegisterWidget");
static_assert(offsetof(WBP_Debug_UMG_AnimationDebugger_C_RegisterWidget, Widget) == 0x000000, "Member 'WBP_Debug_UMG_AnimationDebugger_C_RegisterWidget::Widget' has a wrong offset!");
static_assert(offsetof(WBP_Debug_UMG_AnimationDebugger_C_RegisterWidget, Animations) == 0x000008, "Member 'WBP_Debug_UMG_AnimationDebugger_C_RegisterWidget::Animations' has a wrong offset!");

}

