#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBPI_GM_CharacterPage

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBPI_GM_CharacterPage.WBPI_GM_CharacterPage_C.BPI_GetCharacterNotificationState
// 0x0010 (0x0010 - 0x0000)
struct WBPI_GM_CharacterPage_C_BPI_GetCharacterNotificationState final
{
public:
	class UBP_CharacterData_C*                    CharacterData;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          HasNotification;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBPI_GM_CharacterPage_C_BPI_GetCharacterNotificationState) == 0x000008, "Wrong alignment on WBPI_GM_CharacterPage_C_BPI_GetCharacterNotificationState");
static_assert(sizeof(WBPI_GM_CharacterPage_C_BPI_GetCharacterNotificationState) == 0x000010, "Wrong size on WBPI_GM_CharacterPage_C_BPI_GetCharacterNotificationState");
static_assert(offsetof(WBPI_GM_CharacterPage_C_BPI_GetCharacterNotificationState, CharacterData) == 0x000000, "Member 'WBPI_GM_CharacterPage_C_BPI_GetCharacterNotificationState::CharacterData' has a wrong offset!");
static_assert(offsetof(WBPI_GM_CharacterPage_C_BPI_GetCharacterNotificationState, HasNotification) == 0x000008, "Member 'WBPI_GM_CharacterPage_C_BPI_GetCharacterNotificationState::HasNotification' has a wrong offset!");

// Function WBPI_GM_CharacterPage.WBPI_GM_CharacterPage_C.BPI_LoadCharacter
// 0x0008 (0x0008 - 0x0000)
struct WBPI_GM_CharacterPage_C_BPI_LoadCharacter final
{
public:
	class UBP_CharacterData_C*                    CharacterData;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBPI_GM_CharacterPage_C_BPI_LoadCharacter) == 0x000008, "Wrong alignment on WBPI_GM_CharacterPage_C_BPI_LoadCharacter");
static_assert(sizeof(WBPI_GM_CharacterPage_C_BPI_LoadCharacter) == 0x000008, "Wrong size on WBPI_GM_CharacterPage_C_BPI_LoadCharacter");
static_assert(offsetof(WBPI_GM_CharacterPage_C_BPI_LoadCharacter, CharacterData) == 0x000000, "Member 'WBPI_GM_CharacterPage_C_BPI_LoadCharacter::CharacterData' has a wrong offset!");

}

