#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActorRefCountDown

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ActorRefCountDown.ActorRefCountDown_C
// 0x0028 (0x00D8 - 0x00B0)
class UActorRefCountDown_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 Actor;                                             // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class AActor* ActorRef)> CountDownEnded;                           // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         CountDownTime;                                     // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ActorRefCountDown(int32 EntryPoint);
	void CountDownEnd();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActorRefCountDown_C">();
	}
	static class UActorRefCountDown_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorRefCountDown_C>();
	}
};
static_assert(alignof(UActorRefCountDown_C) == 0x000008, "Wrong alignment on UActorRefCountDown_C");
static_assert(sizeof(UActorRefCountDown_C) == 0x0000D8, "Wrong size on UActorRefCountDown_C");
static_assert(offsetof(UActorRefCountDown_C, UberGraphFrame) == 0x0000B0, "Member 'UActorRefCountDown_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActorRefCountDown_C, Actor) == 0x0000B8, "Member 'UActorRefCountDown_C::Actor' has a wrong offset!");
static_assert(offsetof(UActorRefCountDown_C, CountDownEnded) == 0x0000C0, "Member 'UActorRefCountDown_C::CountDownEnded' has a wrong offset!");
static_assert(offsetof(UActorRefCountDown_C, CountDownTime) == 0x0000D0, "Member 'UActorRefCountDown_C::CountDownTime' has a wrong offset!");

}

