#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIFunctions

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AIFunctions.AIFunctions_C.EngageEnemy
// 0x00A8 (0x00A8 - 0x0000)
struct AIFunctions_C_EngageEnemy final
{
public:
	class UObject*                                EnemyObject;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  OwnPawn;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PrioritizeVehicles;                                // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CanAttackArmoredVehicles;                          // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CanAttackPlanes;                                   // 0x0012(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          PrioritizeThis_target_ForceLock_;                  // 0x0013(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Engaging;                                          // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Global_Game_Settings_AI_CommandoDetectRange; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Global_Game_Settings_GravityAmount;       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Global_Game_Settings_Camera_FOV;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Transport_C*                        K2Node_DynamicCast_AsBP_Transport;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlaneBase_C*                        K2Node_DynamicCast_AsBP_Plane_Base;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TankBase_C*                         K2Node_DynamicCast_AsBP_Tank_Base;                 // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Character_C*                        K2Node_DynamicCast_AsBP_Character;                 // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AIFunctions_C_EngageEnemy) == 0x000008, "Wrong alignment on AIFunctions_C_EngageEnemy");
static_assert(sizeof(AIFunctions_C_EngageEnemy) == 0x0000A8, "Wrong size on AIFunctions_C_EngageEnemy");
static_assert(offsetof(AIFunctions_C_EngageEnemy, EnemyObject) == 0x000000, "Member 'AIFunctions_C_EngageEnemy::EnemyObject' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_EngageEnemy, OwnPawn) == 0x000008, "Member 'AIFunctions_C_EngageEnemy::OwnPawn' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_EngageEnemy, PrioritizeVehicles) == 0x000010, "Member 'AIFunctions_C_EngageEnemy::PrioritizeVehicles' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_EngageEnemy, CanAttackArmoredVehicles) == 0x000011, "Member 'AIFunctions_C_EngageEnemy::CanAttackArmoredVehicles' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_EngageEnemy, CanAttackPlanes) == 0x000012, "Member 'AIFunctions_C_EngageEnemy::CanAttackPlanes' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_EngageEnemy, PrioritizeThis_target_ForceLock_) == 0x000013, "Member 'AIFunctions_C_EngageEnemy::PrioritizeThis_target_ForceLock_' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_EngageEnemy, __WorldContext) == 0x000018, "Member 'AIFunctions_C_EngageEnemy::__WorldContext' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_EngageEnemy, Engaging) == 0x000020, "Member 'AIFunctions_C_EngageEnemy::Engaging' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_EngageEnemy, CallFunc_Global_Game_Settings_AI_CommandoDetectRange) == 0x000024, "Member 'AIFunctions_C_EngageEnemy::CallFunc_Global_Game_Settings_AI_CommandoDetectRange' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_EngageEnemy, CallFunc_Global_Game_Settings_GravityAmount) == 0x000028, "Member 'AIFunctions_C_EngageEnemy::CallFunc_Global_Game_Settings_GravityAmount' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_EngageEnemy, CallFunc_Global_Game_Settings_Camera_FOV) == 0x00002C, "Member 'AIFunctions_C_EngageEnemy::CallFunc_Global_Game_Settings_Camera_FOV' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_EngageEnemy, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'AIFunctions_C_EngageEnemy::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_EngageEnemy, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000034, "Member 'AIFunctions_C_EngageEnemy::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_EngageEnemy, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'AIFunctions_C_EngageEnemy::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_EngageEnemy, K2Node_DynamicCast_AsBP_Transport) == 0x000048, "Member 'AIFunctions_C_EngageEnemy::K2Node_DynamicCast_AsBP_Transport' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_EngageEnemy, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'AIFunctions_C_EngageEnemy::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_EngageEnemy, K2Node_DynamicCast_AsPawn) == 0x000058, "Member 'AIFunctions_C_EngageEnemy::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_EngageEnemy, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'AIFunctions_C_EngageEnemy::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_EngageEnemy, K2Node_DynamicCast_AsBP_Plane_Base) == 0x000068, "Member 'AIFunctions_C_EngageEnemy::K2Node_DynamicCast_AsBP_Plane_Base' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_EngageEnemy, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'AIFunctions_C_EngageEnemy::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_EngageEnemy, K2Node_DynamicCast_AsBP_Tank_Base) == 0x000078, "Member 'AIFunctions_C_EngageEnemy::K2Node_DynamicCast_AsBP_Tank_Base' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_EngageEnemy, K2Node_DynamicCast_bSuccess_3) == 0x000080, "Member 'AIFunctions_C_EngageEnemy::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_EngageEnemy, K2Node_DynamicCast_AsBP_Character) == 0x000088, "Member 'AIFunctions_C_EngageEnemy::K2Node_DynamicCast_AsBP_Character' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_EngageEnemy, K2Node_DynamicCast_bSuccess_4) == 0x000090, "Member 'AIFunctions_C_EngageEnemy::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_EngageEnemy, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000094, "Member 'AIFunctions_C_EngageEnemy::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_EngageEnemy, CallFunc_Vector_Distance_ReturnValue) == 0x0000A0, "Member 'AIFunctions_C_EngageEnemy::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_EngageEnemy, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000A4, "Member 'AIFunctions_C_EngageEnemy::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

// Function AIFunctions.AIFunctions_C.LockToEnemy
// 0x00E0 (0x00E0 - 0x0000)
struct AIFunctions_C_LockToEnemy final
{
public:
	class APawn*                                  EnemyPawn;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  OwnPawn;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PrioritizeArmoredVehicles;                         // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ForceLock;                                         // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          CallFunc_GetAIController_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPawnDataComponent_C*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TankBase_C*                         K2Node_DynamicCast_AsBP_Tank_Base;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPawnDataComponent_C*                   CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetValueAsObject_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_TankBase_C*                         K2Node_DynamicCast_AsBP_Tank_Base_1;               // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_2;            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue_1;            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_3;            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_4;            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetValueAsBool_ReturnValue;               // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AIFunctions_C_LockToEnemy) == 0x000008, "Wrong alignment on AIFunctions_C_LockToEnemy");
static_assert(sizeof(AIFunctions_C_LockToEnemy) == 0x0000E0, "Wrong size on AIFunctions_C_LockToEnemy");
static_assert(offsetof(AIFunctions_C_LockToEnemy, EnemyPawn) == 0x000000, "Member 'AIFunctions_C_LockToEnemy::EnemyPawn' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_LockToEnemy, OwnPawn) == 0x000008, "Member 'AIFunctions_C_LockToEnemy::OwnPawn' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_LockToEnemy, PrioritizeArmoredVehicles) == 0x000010, "Member 'AIFunctions_C_LockToEnemy::PrioritizeArmoredVehicles' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_LockToEnemy, ForceLock) == 0x000011, "Member 'AIFunctions_C_LockToEnemy::ForceLock' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_LockToEnemy, __WorldContext) == 0x000018, "Member 'AIFunctions_C_LockToEnemy::__WorldContext' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_LockToEnemy, CallFunc_MakeLiteralName_ReturnValue) == 0x000020, "Member 'AIFunctions_C_LockToEnemy::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_LockToEnemy, CallFunc_GetAIController_ReturnValue) == 0x000028, "Member 'AIFunctions_C_LockToEnemy::CallFunc_GetAIController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_LockToEnemy, CallFunc_GetComponentByClass_ReturnValue) == 0x000030, "Member 'AIFunctions_C_LockToEnemy::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_LockToEnemy, CallFunc_GetBlackboard_ReturnValue) == 0x000038, "Member 'AIFunctions_C_LockToEnemy::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_LockToEnemy, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'AIFunctions_C_LockToEnemy::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_LockToEnemy, K2Node_DynamicCast_AsBP_Tank_Base) == 0x000048, "Member 'AIFunctions_C_LockToEnemy::K2Node_DynamicCast_AsBP_Tank_Base' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_LockToEnemy, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'AIFunctions_C_LockToEnemy::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_LockToEnemy, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000058, "Member 'AIFunctions_C_LockToEnemy::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_LockToEnemy, CallFunc_MakeLiteralName_ReturnValue_1) == 0x000060, "Member 'AIFunctions_C_LockToEnemy::CallFunc_MakeLiteralName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_LockToEnemy, CallFunc_GetValueAsObject_ReturnValue) == 0x000068, "Member 'AIFunctions_C_LockToEnemy::CallFunc_GetValueAsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_LockToEnemy, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000070, "Member 'AIFunctions_C_LockToEnemy::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_LockToEnemy, K2Node_DynamicCast_AsActor) == 0x000078, "Member 'AIFunctions_C_LockToEnemy::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_LockToEnemy, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'AIFunctions_C_LockToEnemy::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_LockToEnemy, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000084, "Member 'AIFunctions_C_LockToEnemy::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_LockToEnemy, K2Node_DynamicCast_AsBP_Tank_Base_1) == 0x000090, "Member 'AIFunctions_C_LockToEnemy::K2Node_DynamicCast_AsBP_Tank_Base_1' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_LockToEnemy, K2Node_DynamicCast_bSuccess_2) == 0x000098, "Member 'AIFunctions_C_LockToEnemy::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_LockToEnemy, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000099, "Member 'AIFunctions_C_LockToEnemy::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_LockToEnemy, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00009C, "Member 'AIFunctions_C_LockToEnemy::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_LockToEnemy, CallFunc_MakeLiteralName_ReturnValue_2) == 0x0000A8, "Member 'AIFunctions_C_LockToEnemy::CallFunc_MakeLiteralName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_LockToEnemy, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0000B0, "Member 'AIFunctions_C_LockToEnemy::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_LockToEnemy, CallFunc_Vector_Distance_ReturnValue) == 0x0000BC, "Member 'AIFunctions_C_LockToEnemy::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_LockToEnemy, CallFunc_Vector_Distance_ReturnValue_1) == 0x0000C0, "Member 'AIFunctions_C_LockToEnemy::CallFunc_Vector_Distance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_LockToEnemy, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000C4, "Member 'AIFunctions_C_LockToEnemy::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_LockToEnemy, CallFunc_MakeLiteralName_ReturnValue_3) == 0x0000C8, "Member 'AIFunctions_C_LockToEnemy::CallFunc_MakeLiteralName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_LockToEnemy, CallFunc_MakeLiteralName_ReturnValue_4) == 0x0000D0, "Member 'AIFunctions_C_LockToEnemy::CallFunc_MakeLiteralName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AIFunctions_C_LockToEnemy, CallFunc_GetValueAsBool_ReturnValue) == 0x0000D8, "Member 'AIFunctions_C_LockToEnemy::CallFunc_GetValueAsBool_ReturnValue' has a wrong offset!");

}

