#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIController_Tank

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AIController_Tank.BP_AIController_Tank_C.ExecuteUbergraph_BP_AIController_Tank
// 0x0010 (0x0010 - 0x0000)
struct BP_AIController_Tank_C_ExecuteUbergraph_BP_AIController_Tank final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RunBehaviorTree_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_PossessedPawn;                        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIController_Tank_C_ExecuteUbergraph_BP_AIController_Tank) == 0x000008, "Wrong alignment on BP_AIController_Tank_C_ExecuteUbergraph_BP_AIController_Tank");
static_assert(sizeof(BP_AIController_Tank_C_ExecuteUbergraph_BP_AIController_Tank) == 0x000010, "Wrong size on BP_AIController_Tank_C_ExecuteUbergraph_BP_AIController_Tank");
static_assert(offsetof(BP_AIController_Tank_C_ExecuteUbergraph_BP_AIController_Tank, EntryPoint) == 0x000000, "Member 'BP_AIController_Tank_C_ExecuteUbergraph_BP_AIController_Tank::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AIController_Tank_C_ExecuteUbergraph_BP_AIController_Tank, CallFunc_RunBehaviorTree_ReturnValue) == 0x000004, "Member 'BP_AIController_Tank_C_ExecuteUbergraph_BP_AIController_Tank::CallFunc_RunBehaviorTree_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIController_Tank_C_ExecuteUbergraph_BP_AIController_Tank, K2Node_Event_PossessedPawn) == 0x000008, "Member 'BP_AIController_Tank_C_ExecuteUbergraph_BP_AIController_Tank::K2Node_Event_PossessedPawn' has a wrong offset!");

// Function BP_AIController_Tank.BP_AIController_Tank_C.ReceivePossess
// 0x0008 (0x0008 - 0x0000)
struct BP_AIController_Tank_C_ReceivePossess final
{
public:
	class APawn*                                  PossessedPawn;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIController_Tank_C_ReceivePossess) == 0x000008, "Wrong alignment on BP_AIController_Tank_C_ReceivePossess");
static_assert(sizeof(BP_AIController_Tank_C_ReceivePossess) == 0x000008, "Wrong size on BP_AIController_Tank_C_ReceivePossess");
static_assert(offsetof(BP_AIController_Tank_C_ReceivePossess, PossessedPawn) == 0x000000, "Member 'BP_AIController_Tank_C_ReceivePossess::PossessedPawn' has a wrong offset!");

}

