#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Bomb

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Bomb.BP_Bomb_C.ExecuteUbergraph_BP_Bomb
// 0x0018 (0x0018 - 0x0000)
struct BP_Bomb_C_ExecuteUbergraph_BP_Bomb final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Bomb_C_ExecuteUbergraph_BP_Bomb) == 0x000008, "Wrong alignment on BP_Bomb_C_ExecuteUbergraph_BP_Bomb");
static_assert(sizeof(BP_Bomb_C_ExecuteUbergraph_BP_Bomb) == 0x000018, "Wrong size on BP_Bomb_C_ExecuteUbergraph_BP_Bomb");
static_assert(offsetof(BP_Bomb_C_ExecuteUbergraph_BP_Bomb, EntryPoint) == 0x000000, "Member 'BP_Bomb_C_ExecuteUbergraph_BP_Bomb::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Bomb_C_ExecuteUbergraph_BP_Bomb, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000008, "Member 'BP_Bomb_C_ExecuteUbergraph_BP_Bomb::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Bomb_C_ExecuteUbergraph_BP_Bomb, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_Bomb_C_ExecuteUbergraph_BP_Bomb::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

