#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BaseController

#include "Basic.hpp"

#include "SteamCore_structs.hpp"
#include "ST_UnitProgress_structs.hpp"
#include "InputCore_structs.hpp"
#include "ST_Unlockable_structs.hpp"
#include "Engine_structs.hpp"
#include "E_ChestTypes_structs.hpp"


namespace SDK::Params
{

// Function BP_BaseController.BP_BaseController_C.ExecuteUbergraph_BP_BaseController
// 0x0310 (0x0310 - 0x0000)
struct BP_BaseController_C_ExecuteUbergraph_BP_BaseController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestCurrentStats_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_LevelableUnitsAPICallsList_Units;         // 0x0008(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0020(0x0018)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSteamItemDef                          K2Node_MakeStruct_SteamItemDef;                    // 0x0060(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FSteamInventoryResult                  CallFunc_TriggerItemDrop_Result;                   // 0x0064(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TriggerItemDrop_ReturnValue;              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESteamResult                                  CallFunc_GetResultStatus_ReturnValue;              // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B[0x1];                                       // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x006C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0080(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamItemDef                          K2Node_MakeStruct_SteamItemDef_1;                  // 0x008C(0x0004)(NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0090(0x0010)(ReferenceParm)
	TArray<struct FSteamItemDef>                  K2Node_MakeArray_Array_1;                          // 0x00A0(0x0010)(ReferenceParm)
	struct FSteamInventoryResult                  CallFunc_GenerateItems_Result;                     // 0x00B0(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GenerateItems_ReturnValue;                // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamInventoryResult                  CallFunc_GetAllItems_Handle;                       // 0x00B8(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAllItems_ReturnValue;                  // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESteamResult                                  CallFunc_GetResultStatus_ReturnValue_1;            // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BE[0x2];                                       // 0x00BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Get_Stacked_Item_ID_Amount_Amount;        // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSteamItemDef                          K2Node_MakeStruct_SteamItemDef_2;                  // 0x00D8(0x0004)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSteamInventoryResult                  CallFunc_TriggerItemDrop_Result_1;                 // 0x00E0(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TriggerItemDrop_ReturnValue_1;            // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStatInt_Data;                          // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetStatInt_ReturnValue;                   // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_UnitProgress                       K2Node_MakeStruct_ST_UnitProgress;                 // 0x0100(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_NewItemPopup_C*                      CallFunc_Create_ReturnValue;                       // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array_2;                          // 0x0128(0x0010)(ReferenceParm)
	struct FSteamID                               CallFunc_GetSteamID_ReturnValue;                   // 0x0138(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BreakSteamID_ReturnValue;                 // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Bundle;                         // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_MaterialID;                     // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_MaterialQuantity;               // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ChestTypes                                  K2Node_CustomEvent_ChestType;                      // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USteamCoreWebAsyncActionConsolidate*    CallFunc_ConsolidateAsync_ReturnValue;             // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_MakeArray_Array_3;                          // 0x0170(0x0010)(ReferenceParm)
	struct FSteamItemInstanceID                   CallFunc_GetItemInstanceID_Instance_ID;            // 0x0180(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FSteamItemDef                          K2Node_MakeStruct_SteamItemDef_3;                  // 0x0188(0x0004)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSteamItemInstanceID>           K2Node_MakeArray_Array_4;                          // 0x0190(0x0010)(ReferenceParm)
	TArray<struct FSteamItemDef>                  K2Node_MakeArray_Array_5;                          // 0x01A0(0x0010)(ReferenceParm)
	int32                                         K2Node_CustomEvent_Generator;                      // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ChestID;                        // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSteamItemInstanceID                   CallFunc_GetItemInstanceID_Instance_ID_1;          // 0x01B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FSteamItemDef                          K2Node_MakeStruct_SteamItemDef_4;                  // 0x01C0(0x0004)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSteamItemInstanceID>           K2Node_MakeArray_Array_6;                          // 0x01C8(0x0010)(ReferenceParm)
	TArray<struct FSteamItemDef>                  K2Node_MakeArray_Array_7;                          // 0x01D8(0x0010)(ReferenceParm)
	TArray<int32>                                 K2Node_MakeArray_Array_8;                          // 0x01E8(0x0010)(ReferenceParm)
	TArray<int32>                                 K2Node_MakeArray_Array_9;                          // 0x01F8(0x0010)(ReferenceParm)
	TArray<int32>                                 K2Node_MakeArray_Array_10;                         // 0x0208(0x0010)(ReferenceParm)
	struct FSteamInventoryResult                  CallFunc_ExchangeItems_Result;                     // 0x0218(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ExchangeItems_ReturnValue;                // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21D[0x3];                                      // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamInventoryResult                  CallFunc_ExchangeItems_Result_1;                   // 0x0220(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ExchangeItems_ReturnValue_1;              // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESteamResult                                  CallFunc_GetResultStatus_ReturnValue_2;            // 0x0225(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESteamResult                                  CallFunc_GetResultStatus_ReturnValue_3;            // 0x0226(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0227(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_242[0x6];                                      // 0x0242(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_2; // 0x0248(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSteamInventoryResult                  K2Node_CustomEvent_Result;                         // 0x0264(0x0004)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSteamItemDetails>              CallFunc_GetResultItems_Items;                     // 0x0270(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetResultItems_ReturnValue;               // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_282[0x6];                                      // 0x0282(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0288(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESteamResult                                  CallFunc_GetResultStatus_ReturnValue_4;            // 0x029A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29B[0x5];                                      // 0x029B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSteamItemDetails>              CallFunc_GetResultItems_Items_1;                   // 0x02A0(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetResultItems_ReturnValue_1;             // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_7;        // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B2[0x6];                                      // 0x02B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_3; // 0x02B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_8;        // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Identical_ReturnValue;              // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CA[0x6];                                      // 0x02CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Data;                           // 0x02D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bWasSuccessful;                 // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1[0x3];                                      // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& Data, bool bWasSuccessful)> K2Node_CreateDelegate_OutputDelegate_1; // 0x02E4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x02F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController) == 0x000008, "Wrong alignment on BP_BaseController_C_ExecuteUbergraph_BP_BaseController");
static_assert(sizeof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController) == 0x000310, "Wrong size on BP_BaseController_C_ExecuteUbergraph_BP_BaseController");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, EntryPoint) == 0x000000, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_RequestCurrentStats_ReturnValue) == 0x000004, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_RequestCurrentStats_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_LevelableUnitsAPICallsList_Units) == 0x000008, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_LevelableUnitsAPICallsList_Units' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, K2Node_InputKeyEvent_Key) == 0x000020, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::K2Node_InputKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_Array_Length_ReturnValue_1) == 0x000038, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_Conv_IntToString_ReturnValue) == 0x000040, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_Concat_StrStr_ReturnValue) == 0x000050, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, K2Node_MakeStruct_SteamItemDef) == 0x000060, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::K2Node_MakeStruct_SteamItemDef' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_TriggerItemDrop_Result) == 0x000064, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_TriggerItemDrop_Result' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_TriggerItemDrop_ReturnValue) == 0x000068, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_TriggerItemDrop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_GetResultStatus_ReturnValue) == 0x000069, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_GetResultStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00006A, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, K2Node_CreateDelegate_OutputDelegate) == 0x00006C, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000080, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x000088, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, K2Node_MakeStruct_SteamItemDef_1) == 0x00008C, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::K2Node_MakeStruct_SteamItemDef_1' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, K2Node_MakeArray_Array) == 0x000090, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, K2Node_MakeArray_Array_1) == 0x0000A0, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_GenerateItems_Result) == 0x0000B0, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_GenerateItems_Result' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_GenerateItems_ReturnValue) == 0x0000B4, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_GenerateItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_GetAllItems_Handle) == 0x0000B8, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_GetAllItems_Handle' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_GetAllItems_ReturnValue) == 0x0000BC, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_GetAllItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_GetResultStatus_ReturnValue_1) == 0x0000BD, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_GetResultStatus_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x0000C0, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000D0, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0000D1, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_Get_Stacked_Item_ID_Amount_Amount) == 0x0000D4, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_Get_Stacked_Item_ID_Amount_Amount' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, K2Node_MakeStruct_SteamItemDef_2) == 0x0000D8, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::K2Node_MakeStruct_SteamItemDef_2' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, Temp_int_Array_Index_Variable) == 0x0000DC, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_TriggerItemDrop_Result_1) == 0x0000E0, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_TriggerItemDrop_Result_1' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_TriggerItemDrop_ReturnValue_1) == 0x0000E4, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_TriggerItemDrop_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_Array_Get_Item) == 0x0000E8, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_GetStatInt_Data) == 0x0000F8, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_GetStatInt_Data' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_GetStatInt_ReturnValue) == 0x0000FC, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_GetStatInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, K2Node_MakeStruct_ST_UnitProgress) == 0x000100, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::K2Node_MakeStruct_ST_UnitProgress' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_Array_Add_ReturnValue) == 0x000118, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_Create_ReturnValue) == 0x000120, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, K2Node_MakeArray_Array_2) == 0x000128, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_GetSteamID_ReturnValue) == 0x000138, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_GetSteamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_BreakSteamID_ReturnValue) == 0x000140, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_BreakSteamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, K2Node_CustomEvent_Bundle) == 0x000150, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::K2Node_CustomEvent_Bundle' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, K2Node_CustomEvent_MaterialID) == 0x000154, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::K2Node_CustomEvent_MaterialID' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, K2Node_CustomEvent_MaterialQuantity) == 0x000158, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::K2Node_CustomEvent_MaterialQuantity' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, K2Node_CustomEvent_ChestType) == 0x00015C, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::K2Node_CustomEvent_ChestType' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_ConsolidateAsync_ReturnValue) == 0x000160, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_ConsolidateAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_IsValid_ReturnValue) == 0x000168, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, K2Node_MakeArray_Array_3) == 0x000170, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_GetItemInstanceID_Instance_ID) == 0x000180, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_GetItemInstanceID_Instance_ID' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, K2Node_MakeStruct_SteamItemDef_3) == 0x000188, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::K2Node_MakeStruct_SteamItemDef_3' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, K2Node_MakeArray_Array_4) == 0x000190, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, K2Node_MakeArray_Array_5) == 0x0001A0, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::K2Node_MakeArray_Array_5' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, K2Node_CustomEvent_Generator) == 0x0001B0, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::K2Node_CustomEvent_Generator' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, K2Node_CustomEvent_ChestID) == 0x0001B4, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::K2Node_CustomEvent_ChestID' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_GetItemInstanceID_Instance_ID_1) == 0x0001B8, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_GetItemInstanceID_Instance_ID_1' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, K2Node_MakeStruct_SteamItemDef_4) == 0x0001C0, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::K2Node_MakeStruct_SteamItemDef_4' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, K2Node_MakeArray_Array_6) == 0x0001C8, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::K2Node_MakeArray_Array_6' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, K2Node_MakeArray_Array_7) == 0x0001D8, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::K2Node_MakeArray_Array_7' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, K2Node_MakeArray_Array_8) == 0x0001E8, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::K2Node_MakeArray_Array_8' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, K2Node_MakeArray_Array_9) == 0x0001F8, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::K2Node_MakeArray_Array_9' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, K2Node_MakeArray_Array_10) == 0x000208, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::K2Node_MakeArray_Array_10' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_ExchangeItems_Result) == 0x000218, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_ExchangeItems_Result' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_ExchangeItems_ReturnValue) == 0x00021C, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_ExchangeItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_ExchangeItems_Result_1) == 0x000220, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_ExchangeItems_Result_1' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_ExchangeItems_ReturnValue_1) == 0x000224, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_ExchangeItems_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_GetResultStatus_ReturnValue_2) == 0x000225, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_GetResultStatus_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_GetResultStatus_ReturnValue_3) == 0x000226, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_GetResultStatus_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000227, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x000228, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1) == 0x000230, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x000240, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_EqualEqual_ByteByte_ReturnValue_6) == 0x000241, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_EqualEqual_ByteByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_2) == 0x000248, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, Temp_int_Loop_Counter_Variable) == 0x000258, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_Less_IntInt_ReturnValue) == 0x00025C, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_Add_IntInt_ReturnValue) == 0x000260, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, K2Node_CustomEvent_Result) == 0x000264, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_Array_Length_ReturnValue_2) == 0x000268, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_GetResultItems_Items) == 0x000270, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_GetResultItems_Items' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_GetResultItems_ReturnValue) == 0x000280, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_GetResultItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_Greater_IntInt_ReturnValue) == 0x000281, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, Temp_string_Variable) == 0x000288, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, Temp_bool_Variable) == 0x000298, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_IsValid_ReturnValue_1) == 0x000299, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_GetResultStatus_ReturnValue_4) == 0x00029A, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_GetResultStatus_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_GetResultItems_Items_1) == 0x0002A0, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_GetResultItems_Items_1' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_GetResultItems_ReturnValue_1) == 0x0002B0, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_GetResultItems_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_EqualEqual_ByteByte_ReturnValue_7) == 0x0002B1, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_EqualEqual_ByteByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_3) == 0x0002B8, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_EqualEqual_ByteByte_ReturnValue_8) == 0x0002C8, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_EqualEqual_ByteByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_Array_Identical_ReturnValue) == 0x0002C9, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_Array_Identical_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, K2Node_CustomEvent_Data) == 0x0002D0, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::K2Node_CustomEvent_Data' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, K2Node_CustomEvent_bWasSuccessful) == 0x0002E0, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::K2Node_CustomEvent_bWasSuccessful' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, K2Node_CreateDelegate_OutputDelegate_1) == 0x0002E4, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_GetCurrentLevelName_ReturnValue) == 0x0002F8, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_ExecuteUbergraph_BP_BaseController, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000308, "Member 'BP_BaseController_C_ExecuteUbergraph_BP_BaseController::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function BP_BaseController.BP_BaseController_C.RefreshInventoryFromResult
// 0x0004 (0x0004 - 0x0000)
struct BP_BaseController_C_RefreshInventoryFromResult final
{
public:
	struct FSteamInventoryResult                  Result;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BaseController_C_RefreshInventoryFromResult) == 0x000004, "Wrong alignment on BP_BaseController_C_RefreshInventoryFromResult");
static_assert(sizeof(BP_BaseController_C_RefreshInventoryFromResult) == 0x000004, "Wrong size on BP_BaseController_C_RefreshInventoryFromResult");
static_assert(offsetof(BP_BaseController_C_RefreshInventoryFromResult, Result) == 0x000000, "Member 'BP_BaseController_C_RefreshInventoryFromResult::Result' has a wrong offset!");

// Function BP_BaseController.BP_BaseController_C.OpenChest
// 0x0008 (0x0008 - 0x0000)
struct BP_BaseController_C_OpenChest final
{
public:
	int32                                         Generator;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ChestID;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BaseController_C_OpenChest) == 0x000004, "Wrong alignment on BP_BaseController_C_OpenChest");
static_assert(sizeof(BP_BaseController_C_OpenChest) == 0x000008, "Wrong size on BP_BaseController_C_OpenChest");
static_assert(offsetof(BP_BaseController_C_OpenChest, Generator) == 0x000000, "Member 'BP_BaseController_C_OpenChest::Generator' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_OpenChest, ChestID) == 0x000004, "Member 'BP_BaseController_C_OpenChest::ChestID' has a wrong offset!");

// Function BP_BaseController.BP_BaseController_C.CraftChest
// 0x0010 (0x0010 - 0x0000)
struct BP_BaseController_C_CraftChest final
{
public:
	int32                                         Bundle;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaterialID;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaterialQuantity;                                  // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ChestTypes                                  ChestType;                                         // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BaseController_C_CraftChest) == 0x000004, "Wrong alignment on BP_BaseController_C_CraftChest");
static_assert(sizeof(BP_BaseController_C_CraftChest) == 0x000010, "Wrong size on BP_BaseController_C_CraftChest");
static_assert(offsetof(BP_BaseController_C_CraftChest, Bundle) == 0x000000, "Member 'BP_BaseController_C_CraftChest::Bundle' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_CraftChest, MaterialID) == 0x000004, "Member 'BP_BaseController_C_CraftChest::MaterialID' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_CraftChest, MaterialQuantity) == 0x000008, "Member 'BP_BaseController_C_CraftChest::MaterialQuantity' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_CraftChest, ChestType) == 0x00000C, "Member 'BP_BaseController_C_CraftChest::ChestType' has a wrong offset!");

// Function BP_BaseController.BP_BaseController_C.OnCallback_207D6D57481796AD36860BBA2C36B494
// 0x0018 (0x0018 - 0x0000)
struct BP_BaseController_C_OnCallback_207D6D57481796AD36860BBA2C36B494 final
{
public:
	class FString                                 Data;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          bWasSuccessful;                                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BaseController_C_OnCallback_207D6D57481796AD36860BBA2C36B494) == 0x000008, "Wrong alignment on BP_BaseController_C_OnCallback_207D6D57481796AD36860BBA2C36B494");
static_assert(sizeof(BP_BaseController_C_OnCallback_207D6D57481796AD36860BBA2C36B494) == 0x000018, "Wrong size on BP_BaseController_C_OnCallback_207D6D57481796AD36860BBA2C36B494");
static_assert(offsetof(BP_BaseController_C_OnCallback_207D6D57481796AD36860BBA2C36B494, Data) == 0x000000, "Member 'BP_BaseController_C_OnCallback_207D6D57481796AD36860BBA2C36B494::Data' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_OnCallback_207D6D57481796AD36860BBA2C36B494, bWasSuccessful) == 0x000010, "Member 'BP_BaseController_C_OnCallback_207D6D57481796AD36860BBA2C36B494::bWasSuccessful' has a wrong offset!");

// Function BP_BaseController.BP_BaseController_C.InpActEvt_I_K2Node_InputKeyEvent_0
// 0x0018 (0x0018 - 0x0000)
struct BP_BaseController_C_InpActEvt_I_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_BaseController_C_InpActEvt_I_K2Node_InputKeyEvent_0) == 0x000008, "Wrong alignment on BP_BaseController_C_InpActEvt_I_K2Node_InputKeyEvent_0");
static_assert(sizeof(BP_BaseController_C_InpActEvt_I_K2Node_InputKeyEvent_0) == 0x000018, "Wrong size on BP_BaseController_C_InpActEvt_I_K2Node_InputKeyEvent_0");
static_assert(offsetof(BP_BaseController_C_InpActEvt_I_K2Node_InputKeyEvent_0, Key) == 0x000000, "Member 'BP_BaseController_C_InpActEvt_I_K2Node_InputKeyEvent_0::Key' has a wrong offset!");

// Function BP_BaseController.BP_BaseController_C.Get Stacked Item ID Amount
// 0x0068 (0x0068 - 0x0000)
struct BP_BaseController_C_Get_Stacked_Item_ID_Amount final
{
public:
	int32                                         ItemId;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Amount;                                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSteamItemDetails                      CallFunc_Array_Get_Item;                           // 0x0028(0x0020)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetItemDefinitionProperty_Value;          // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetItemDefinitionProperty_ReturnValue;    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BaseController_C_Get_Stacked_Item_ID_Amount) == 0x000008, "Wrong alignment on BP_BaseController_C_Get_Stacked_Item_ID_Amount");
static_assert(sizeof(BP_BaseController_C_Get_Stacked_Item_ID_Amount) == 0x000068, "Wrong size on BP_BaseController_C_Get_Stacked_Item_ID_Amount");
static_assert(offsetof(BP_BaseController_C_Get_Stacked_Item_ID_Amount, ItemId) == 0x000000, "Member 'BP_BaseController_C_Get_Stacked_Item_ID_Amount::ItemId' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_Get_Stacked_Item_ID_Amount, Amount) == 0x000004, "Member 'BP_BaseController_C_Get_Stacked_Item_ID_Amount::Amount' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_Get_Stacked_Item_ID_Amount, CallFunc_Conv_IntToString_ReturnValue) == 0x000008, "Member 'BP_BaseController_C_Get_Stacked_Item_ID_Amount::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_Get_Stacked_Item_ID_Amount, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_BaseController_C_Get_Stacked_Item_ID_Amount::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_Get_Stacked_Item_ID_Amount, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BP_BaseController_C_Get_Stacked_Item_ID_Amount::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_Get_Stacked_Item_ID_Amount, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_BaseController_C_Get_Stacked_Item_ID_Amount::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_Get_Stacked_Item_ID_Amount, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'BP_BaseController_C_Get_Stacked_Item_ID_Amount::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_Get_Stacked_Item_ID_Amount, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_BaseController_C_Get_Stacked_Item_ID_Amount::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_Get_Stacked_Item_ID_Amount, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'BP_BaseController_C_Get_Stacked_Item_ID_Amount::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_Get_Stacked_Item_ID_Amount, CallFunc_GetItemDefinitionProperty_Value) == 0x000050, "Member 'BP_BaseController_C_Get_Stacked_Item_ID_Amount::CallFunc_GetItemDefinitionProperty_Value' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_Get_Stacked_Item_ID_Amount, CallFunc_GetItemDefinitionProperty_ReturnValue) == 0x000060, "Member 'BP_BaseController_C_Get_Stacked_Item_ID_Amount::CallFunc_GetItemDefinitionProperty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_Get_Stacked_Item_ID_Amount, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000061, "Member 'BP_BaseController_C_Get_Stacked_Item_ID_Amount::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function BP_BaseController.BP_BaseController_C.GetItemInstanceID
// 0x0080 (0x0080 - 0x0000)
struct BP_BaseController_C_GetItemInstanceID final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamItemInstanceID                   Instance_ID;                                       // 0x0008(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSteamItemDetails                      CallFunc_Array_Get_Item;                           // 0x0040(0x0020)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetItemDefinitionProperty_Value;          // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetItemDefinitionProperty_ReturnValue;    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BaseController_C_GetItemInstanceID) == 0x000008, "Wrong alignment on BP_BaseController_C_GetItemInstanceID");
static_assert(sizeof(BP_BaseController_C_GetItemInstanceID) == 0x000080, "Wrong size on BP_BaseController_C_GetItemInstanceID");
static_assert(offsetof(BP_BaseController_C_GetItemInstanceID, ID) == 0x000000, "Member 'BP_BaseController_C_GetItemInstanceID::ID' has a wrong offset!");
static_assert(offsetof(BP_BaseController_C_GetItemInstanceID, Instance_ID) == 0x000008, "Member 'BP_BaseController_C_GetItemInstanceID::Instance_ID' has a wrong offset!");
