#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BuffDebuffBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_BuffDebuffBase.BP_BuffDebuffBase_C.ExecuteUbergraph_BP_BuffDebuffBase
// 0x0058 (0x0058 - 0x0000)
struct BP_BuffDebuffBase_C_ExecuteUbergraph_BP_BuffDebuffBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BuffDebuffBase_C*                   CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_1;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BuffDebuffBase_C_ExecuteUbergraph_BP_BuffDebuffBase) == 0x000008, "Wrong alignment on BP_BuffDebuffBase_C_ExecuteUbergraph_BP_BuffDebuffBase");
static_assert(sizeof(BP_BuffDebuffBase_C_ExecuteUbergraph_BP_BuffDebuffBase) == 0x000058, "Wrong size on BP_BuffDebuffBase_C_ExecuteUbergraph_BP_BuffDebuffBase");
static_assert(offsetof(BP_BuffDebuffBase_C_ExecuteUbergraph_BP_BuffDebuffBase, EntryPoint) == 0x000000, "Member 'BP_BuffDebuffBase_C_ExecuteUbergraph_BP_BuffDebuffBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BuffDebuffBase_C_ExecuteUbergraph_BP_BuffDebuffBase, Temp_bool_True_if_break_was_hit_Variable) == 0x000004, "Member 'BP_BuffDebuffBase_C_ExecuteUbergraph_BP_BuffDebuffBase::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_BuffDebuffBase_C_ExecuteUbergraph_BP_BuffDebuffBase, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_BuffDebuffBase_C_ExecuteUbergraph_BP_BuffDebuffBase::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BuffDebuffBase_C_ExecuteUbergraph_BP_BuffDebuffBase, CallFunc_Not_PreBool_ReturnValue) == 0x00000C, "Member 'BP_BuffDebuffBase_C_ExecuteUbergraph_BP_BuffDebuffBase::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuffDebuffBase_C_ExecuteUbergraph_BP_BuffDebuffBase, K2Node_Event_DeltaSeconds) == 0x000010, "Member 'BP_BuffDebuffBase_C_ExecuteUbergraph_BP_BuffDebuffBase::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_BuffDebuffBase_C_ExecuteUbergraph_BP_BuffDebuffBase, CallFunc_GetObjectClass_ReturnValue) == 0x000018, "Member 'BP_BuffDebuffBase_C_ExecuteUbergraph_BP_BuffDebuffBase::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuffDebuffBase_C_ExecuteUbergraph_BP_BuffDebuffBase, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_BuffDebuffBase_C_ExecuteUbergraph_BP_BuffDebuffBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuffDebuffBase_C_ExecuteUbergraph_BP_BuffDebuffBase, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_BuffDebuffBase_C_ExecuteUbergraph_BP_BuffDebuffBase::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BuffDebuffBase_C_ExecuteUbergraph_BP_BuffDebuffBase, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_BuffDebuffBase_C_ExecuteUbergraph_BP_BuffDebuffBase::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuffDebuffBase_C_ExecuteUbergraph_BP_BuffDebuffBase, CallFunc_GetObjectClass_ReturnValue_1) == 0x000038, "Member 'BP_BuffDebuffBase_C_ExecuteUbergraph_BP_BuffDebuffBase::CallFunc_GetObjectClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BuffDebuffBase_C_ExecuteUbergraph_BP_BuffDebuffBase, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000040, "Member 'BP_BuffDebuffBase_C_ExecuteUbergraph_BP_BuffDebuffBase::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuffDebuffBase_C_ExecuteUbergraph_BP_BuffDebuffBase, CallFunc_Array_RemoveItem_ReturnValue) == 0x000041, "Member 'BP_BuffDebuffBase_C_ExecuteUbergraph_BP_BuffDebuffBase::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuffDebuffBase_C_ExecuteUbergraph_BP_BuffDebuffBase, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'BP_BuffDebuffBase_C_ExecuteUbergraph_BP_BuffDebuffBase::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BuffDebuffBase_C_ExecuteUbergraph_BP_BuffDebuffBase, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'BP_BuffDebuffBase_C_ExecuteUbergraph_BP_BuffDebuffBase::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuffDebuffBase_C_ExecuteUbergraph_BP_BuffDebuffBase, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'BP_BuffDebuffBase_C_ExecuteUbergraph_BP_BuffDebuffBase::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BuffDebuffBase_C_ExecuteUbergraph_BP_BuffDebuffBase, CallFunc_BooleanAND_ReturnValue) == 0x000050, "Member 'BP_BuffDebuffBase_C_ExecuteUbergraph_BP_BuffDebuffBase::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_BuffDebuffBase.BP_BuffDebuffBase_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_BuffDebuffBase_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BuffDebuffBase_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_BuffDebuffBase_C_ReceiveTick");
static_assert(sizeof(BP_BuffDebuffBase_C_ReceiveTick) == 0x000004, "Wrong size on BP_BuffDebuffBase_C_ReceiveTick");
static_assert(offsetof(BP_BuffDebuffBase_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_BuffDebuffBase_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

