#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DecalManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DecalManager.BP_DecalManager_C
// 0x0020 (0x0240 - 0x0220)
class ABP_DecalManager_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_ImpactDecal_C*>              Decals;                                            // 0x0230(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_DecalManager(int32 EntryPoint);
	void CreateDecal(class UClass* Class_0, const struct FTransform& Transform);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DecalManager_C">();
	}
	static class ABP_DecalManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DecalManager_C>();
	}
};
static_assert(alignof(ABP_DecalManager_C) == 0x000008, "Wrong alignment on ABP_DecalManager_C");
static_assert(sizeof(ABP_DecalManager_C) == 0x000240, "Wrong size on ABP_DecalManager_C");
static_assert(offsetof(ABP_DecalManager_C, UberGraphFrame) == 0x000220, "Member 'ABP_DecalManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DecalManager_C, DefaultSceneRoot) == 0x000228, "Member 'ABP_DecalManager_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_DecalManager_C, Decals) == 0x000230, "Member 'ABP_DecalManager_C::Decals' has a wrong offset!");

}

