#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DecalManager

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_DecalManager.BP_DecalManager_C.ExecuteUbergraph_BP_DecalManager
// 0x00E0 (0x00E0 - 0x0000)
struct BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GameStateBase_C*                    K2Node_DynamicCast_AsBP_Game_State_Base;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_CustomEvent_Class;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_CustomEvent_Transform;                      // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ImpactDecal_C*                      CallFunc_FinishSpawningActor_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ImpactDecal_C*                      CallFunc_Array_Get_Item;                           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager) == 0x000010, "Wrong alignment on BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager");
static_assert(sizeof(BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager) == 0x0000E0, "Wrong size on BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager");
static_assert(offsetof(BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager, EntryPoint) == 0x000000, "Member 'BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager, K2Node_DynamicCast_AsBP_Game_State_Base) == 0x000010, "Member 'BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager::K2Node_DynamicCast_AsBP_Game_State_Base' has a wrong offset!");
static_assert(offsetof(BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager, K2Node_CustomEvent_Class) == 0x000020, "Member 'BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager::K2Node_CustomEvent_Class' has a wrong offset!");
static_assert(offsetof(BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager, K2Node_CustomEvent_Transform) == 0x000030, "Member 'BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager::K2Node_CustomEvent_Transform' has a wrong offset!");
static_assert(offsetof(BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000060, "Member 'BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager, CallFunc_FinishSpawningActor_ReturnValue) == 0x000068, "Member 'BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager, CallFunc_BreakTransform_Location) == 0x000070, "Member 'BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager, CallFunc_BreakTransform_Rotation) == 0x00007C, "Member 'BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager, CallFunc_BreakTransform_Scale) == 0x000088, "Member 'BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager, CallFunc_BreakVector_X) == 0x000094, "Member 'BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager, CallFunc_BreakVector_Y) == 0x000098, "Member 'BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager, CallFunc_BreakVector_Z) == 0x00009C, "Member 'BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager, CallFunc_Array_Length_ReturnValue) == 0x0000A0, "Member 'BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager, CallFunc_MapRangeClamped_ReturnValue) == 0x0000A4, "Member 'BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000A8, "Member 'BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager, CallFunc_Array_Add_ReturnValue) == 0x0000AC, "Member 'BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x0000B8, "Member 'BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager, CallFunc_IsValid_ReturnValue) == 0x0000C0, "Member 'BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager, CallFunc_IsValid_ReturnValue_1) == 0x0000C1, "Member 'BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager, CallFunc_GetCameraLocation_ReturnValue) == 0x0000C4, "Member 'BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager, CallFunc_Vector_Distance_ReturnValue) == 0x0000D0, "Member 'BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000D4, "Member 'BP_DecalManager_C_ExecuteUbergraph_BP_DecalManager::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_DecalManager.BP_DecalManager_C.CreateDecal
// 0x0040 (0x0040 - 0x0000)
struct BP_DecalManager_C_CreateDecal final
{
public:
	class UClass*                                 Class_0;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0010(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DecalManager_C_CreateDecal) == 0x000010, "Wrong alignment on BP_DecalManager_C_CreateDecal");
static_assert(sizeof(BP_DecalManager_C_CreateDecal) == 0x000040, "Wrong size on BP_DecalManager_C_CreateDecal");
static_assert(offsetof(BP_DecalManager_C_CreateDecal, Class_0) == 0x000000, "Member 'BP_DecalManager_C_CreateDecal::Class_0' has a wrong offset!");
static_assert(offsetof(BP_DecalManager_C_CreateDecal, Transform) == 0x000010, "Member 'BP_DecalManager_C_CreateDecal::Transform' has a wrong offset!");

}

