#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EquipableBase

#include "Basic.hpp"

#include "ST_Unlockable_structs.hpp"


namespace SDK::Params
{

// Function BP_EquipableBase.BP_EquipableBase_C.ExecuteUbergraph_BP_EquipableBase
// 0x00C0 (0x00C0 - 0x0000)
struct BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_3;                     // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_3;               // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Character_C*                        K2Node_DynamicCast_AsBP_Character;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_4;               // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue_1;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Character_C*                        K2Node_DynamicCast_AsBP_Character_1;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_4;                     // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Equiped;                        // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73[0x1];                                       // 0x0073(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_SkinIndex;                      // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_GameInstance_C*                     K2Node_DynamicCast_AsBP_Game_Instance;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Character_C*                        K2Node_DynamicCast_AsBP_Character_2;               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerState_C*                      K2Node_DynamicCast_AsBP_Player_State;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetClassAndTeamUnitIndex_Index;           // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCurrentlyEquiped__Equiped;              // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase) == 0x000008, "Wrong alignment on BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase");
static_assert(sizeof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase) == 0x0000C0, "Wrong size on BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, EntryPoint) == 0x000000, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, Temp_bool_Has_Been_Initd_Variable) == 0x000005, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, Temp_bool_IsClosed_Variable_1) == 0x000006, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, Temp_bool_Has_Been_Initd_Variable_1) == 0x000007, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, Temp_bool_IsClosed_Variable_2) == 0x00000C, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::Temp_bool_IsClosed_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, Temp_bool_Has_Been_Initd_Variable_2) == 0x00000D, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::Temp_bool_Has_Been_Initd_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, Temp_bool_IsClosed_Variable_3) == 0x00000E, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::Temp_bool_IsClosed_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, Temp_bool_Has_Been_Initd_Variable_3) == 0x00000F, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::Temp_bool_Has_Been_Initd_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, CallFunc_GetAttachParentActor_ReturnValue) == 0x000020, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, K2Node_DynamicCast_AsBP_Character) == 0x000028, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::K2Node_DynamicCast_AsBP_Character' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, Temp_bool_Has_Been_Initd_Variable_4) == 0x000032, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::Temp_bool_Has_Been_Initd_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000038, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, CallFunc_GetAttachParentActor_ReturnValue_1) == 0x000048, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::CallFunc_GetAttachParentActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, K2Node_DynamicCast_AsBP_Character_1) == 0x000060, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::K2Node_DynamicCast_AsBP_Character_1' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, CallFunc_Array_Length_ReturnValue) == 0x00006C, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, Temp_bool_IsClosed_Variable_4) == 0x000071, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::Temp_bool_IsClosed_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, K2Node_CustomEvent_Equiped) == 0x000072, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::K2Node_CustomEvent_Equiped' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, K2Node_CustomEvent_SkinIndex) == 0x000074, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::K2Node_CustomEvent_SkinIndex' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, CallFunc_GetGameInstance_ReturnValue) == 0x000078, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, K2Node_DynamicCast_AsBP_Game_Instance) == 0x000080, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::K2Node_DynamicCast_AsBP_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, K2Node_DynamicCast_bSuccess_2) == 0x000088, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, CallFunc_GetOwner_ReturnValue) == 0x000090, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, K2Node_DynamicCast_AsBP_Character_2) == 0x000098, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::K2Node_DynamicCast_AsBP_Character_2' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, K2Node_DynamicCast_bSuccess_3) == 0x0000A0, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, CallFunc_IsValid_ReturnValue_2) == 0x0000A1, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, CallFunc_IsValid_ReturnValue_3) == 0x0000A2, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, K2Node_DynamicCast_AsBP_Player_State) == 0x0000A8, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::K2Node_DynamicCast_AsBP_Player_State' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, K2Node_DynamicCast_bSuccess_4) == 0x0000B0, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, CallFunc_GetClassAndTeamUnitIndex_Index) == 0x0000B4, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::CallFunc_GetClassAndTeamUnitIndex_Index' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, CallFunc_Array_Get_Item_1) == 0x0000B8, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, CallFunc_K2_AttachToComponent_ReturnValue) == 0x0000BC, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase, CallFunc_IsCurrentlyEquiped__Equiped) == 0x0000BD, "Member 'BP_EquipableBase_C_ExecuteUbergraph_BP_EquipableBase::CallFunc_IsCurrentlyEquiped__Equiped' has a wrong offset!");

// Function BP_EquipableBase.BP_EquipableBase_C.S_LoadSkin
// 0x0004 (0x0004 - 0x0000)
struct BP_EquipableBase_C_S_LoadSkin final
{
public:
	int32                                         SkinIndex_0;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EquipableBase_C_S_LoadSkin) == 0x000004, "Wrong alignment on BP_EquipableBase_C_S_LoadSkin");
static_assert(sizeof(BP_EquipableBase_C_S_LoadSkin) == 0x000004, "Wrong size on BP_EquipableBase_C_S_LoadSkin");
static_assert(offsetof(BP_EquipableBase_C_S_LoadSkin, SkinIndex_0) == 0x000000, "Member 'BP_EquipableBase_C_S_LoadSkin::SkinIndex_0' has a wrong offset!");

// Function BP_EquipableBase.BP_EquipableBase_C.EquipedStateChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_EquipableBase_C_EquipedStateChanged final
{
public:
	bool                                          Equiped;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EquipableBase_C_EquipedStateChanged) == 0x000001, "Wrong alignment on BP_EquipableBase_C_EquipedStateChanged");
static_assert(sizeof(BP_EquipableBase_C_EquipedStateChanged) == 0x000001, "Wrong size on BP_EquipableBase_C_EquipedStateChanged");
static_assert(offsetof(BP_EquipableBase_C_EquipedStateChanged, Equiped) == 0x000000, "Member 'BP_EquipableBase_C_EquipedStateChanged::Equiped' has a wrong offset!");

// Function BP_EquipableBase.BP_EquipableBase_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_EquipableBase_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EquipableBase_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_EquipableBase_C_ReceiveTick");
static_assert(sizeof(BP_EquipableBase_C_ReceiveTick) == 0x000004, "Wrong size on BP_EquipableBase_C_ReceiveTick");
static_assert(offsetof(BP_EquipableBase_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_EquipableBase_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_EquipableBase.BP_EquipableBase_C.OnRep_SkinIndex
// 0x0150 (0x0150 - 0x0000)
struct BP_EquipableBase_C_OnRep_SkinIndex final
{
public:
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_Unlockable                         CallFunc_GetCosmeticItemStruct_Item;               // 0x0008(0x0148)(HasGetValueTypeHash)
};
static_assert(alignof(BP_EquipableBase_C_OnRep_SkinIndex) == 0x000008, "Wrong alignment on BP_EquipableBase_C_OnRep_SkinIndex");
static_assert(sizeof(BP_EquipableBase_C_OnRep_SkinIndex) == 0x000150, "Wrong size on BP_EquipableBase_C_OnRep_SkinIndex");
static_assert(offsetof(BP_EquipableBase_C_OnRep_SkinIndex, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000000, "Member 'BP_EquipableBase_C_OnRep_SkinIndex::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_OnRep_SkinIndex, CallFunc_GetCosmeticItemStruct_Item) == 0x000008, "Member 'BP_EquipableBase_C_OnRep_SkinIndex::CallFunc_GetCosmeticItemStruct_Item' has a wrong offset!");

// Function BP_EquipableBase.BP_EquipableBase_C.CheckIfOwnerOfThisWeapon
// 0x0020 (0x0020 - 0x0000)
struct BP_EquipableBase_C_CheckIfOwnerOfThisWeapon final
{
public:
	bool                                          IsOwner;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Character_C*                        K2Node_DynamicCast_AsBP_Character;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EquipableBase_C_CheckIfOwnerOfThisWeapon) == 0x000008, "Wrong alignment on BP_EquipableBase_C_CheckIfOwnerOfThisWeapon");
static_assert(sizeof(BP_EquipableBase_C_CheckIfOwnerOfThisWeapon) == 0x000020, "Wrong size on BP_EquipableBase_C_CheckIfOwnerOfThisWeapon");
static_assert(offsetof(BP_EquipableBase_C_CheckIfOwnerOfThisWeapon, IsOwner) == 0x000000, "Member 'BP_EquipableBase_C_CheckIfOwnerOfThisWeapon::IsOwner' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_CheckIfOwnerOfThisWeapon, CallFunc_HasAuthority_ReturnValue) == 0x000001, "Member 'BP_EquipableBase_C_CheckIfOwnerOfThisWeapon::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_CheckIfOwnerOfThisWeapon, CallFunc_GetAttachParentActor_ReturnValue) == 0x000008, "Member 'BP_EquipableBase_C_CheckIfOwnerOfThisWeapon::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_CheckIfOwnerOfThisWeapon, K2Node_DynamicCast_AsBP_Character) == 0x000010, "Member 'BP_EquipableBase_C_CheckIfOwnerOfThisWeapon::K2Node_DynamicCast_AsBP_Character' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_CheckIfOwnerOfThisWeapon, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_EquipableBase_C_CheckIfOwnerOfThisWeapon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_CheckIfOwnerOfThisWeapon, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'BP_EquipableBase_C_CheckIfOwnerOfThisWeapon::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_EquipableBase.BP_EquipableBase_C.IsCurrentlyEquiped?
// 0x0003 (0x0003 - 0x0000)
struct BP_EquipableBase_C_IsCurrentlyEquiped_ final
{
public:
	bool                                          Equiped;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EquipableBase_C_IsCurrentlyEquiped_) == 0x000001, "Wrong alignment on BP_EquipableBase_C_IsCurrentlyEquiped_");
static_assert(sizeof(BP_EquipableBase_C_IsCurrentlyEquiped_) == 0x000003, "Wrong size on BP_EquipableBase_C_IsCurrentlyEquiped_");
static_assert(offsetof(BP_EquipableBase_C_IsCurrentlyEquiped_, Equiped) == 0x000000, "Member 'BP_EquipableBase_C_IsCurrentlyEquiped_::Equiped' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_IsCurrentlyEquiped_, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_EquipableBase_C_IsCurrentlyEquiped_::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EquipableBase_C_IsCurrentlyEquiped_, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000002, "Member 'BP_EquipableBase_C_IsCurrentlyEquiped_::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BP_EquipableBase.BP_EquipableBase_C.GetSkinIndex
// 0x0004 (0x0004 - 0x0000)
struct BP_EquipableBase_C_GetSkinIndex final
{
public:
	int32                                         SkinIndex_0;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EquipableBase_C_GetSkinIndex) == 0x000004, "Wrong alignment on BP_EquipableBase_C_GetSkinIndex");
static_assert(sizeof(BP_EquipableBase_C_GetSkinIndex) == 0x000004, "Wrong size on BP_EquipableBase_C_GetSkinIndex");
static_assert(offsetof(BP_EquipableBase_C_GetSkinIndex, SkinIndex_0) == 0x000000, "Member 'BP_EquipableBase_C_GetSkinIndex::SkinIndex_0' has a wrong offset!");

}

