#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FockeWulf

#include "Basic.hpp"

#include "E_VehicleSkinThemes_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_FockeWulf.BP_FockeWulf_C.ExecuteUbergraph_BP_FockeWulf
// 0x0100 (0x0100 - 0x0000)
struct BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_VehicleSkinThemes                           Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_3;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_VehicleSkinThemes                           Temp_byte_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable_4;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_5;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_6;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_7;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult;       // 0x0068(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default_1;                           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf) == 0x000008, "Wrong alignment on BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf");
static_assert(sizeof(BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf) == 0x000100, "Wrong size on BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf");
static_assert(offsetof(BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf, EntryPoint) == 0x000000, "Member 'BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf, Temp_byte_Variable) == 0x000004, "Member 'BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf, Temp_object_Variable) == 0x000008, "Member 'BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf, Temp_object_Variable_1) == 0x000010, "Member 'BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf, Temp_object_Variable_2) == 0x000018, "Member 'BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf, Temp_object_Variable_3) == 0x000020, "Member 'BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf, Temp_byte_Variable_1) == 0x000028, "Member 'BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf, Temp_object_Variable_4) == 0x000030, "Member 'BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf, Temp_object_Variable_5) == 0x000038, "Member 'BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf, Temp_object_Variable_6) == 0x000040, "Member 'BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf, Temp_object_Variable_7) == 0x000048, "Member 'BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf, K2Node_Event_DeltaSeconds) == 0x000050, "Member 'BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf, CallFunc_MapRangeClamped_ReturnValue) == 0x000054, "Member 'BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000058, "Member 'BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf, CallFunc_MakeRotator_ReturnValue) == 0x00005C, "Member 'BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf, CallFunc_K2_AddLocalRotation_SweepHitResult) == 0x000068, "Member 'BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf::CallFunc_K2_AddLocalRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf, K2Node_Select_Default) == 0x0000F0, "Member 'BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf, K2Node_Select_Default_1) == 0x0000F8, "Member 'BP_FockeWulf_C_ExecuteUbergraph_BP_FockeWulf::K2Node_Select_Default_1' has a wrong offset!");

// Function BP_FockeWulf.BP_FockeWulf_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_FockeWulf_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds_0;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FockeWulf_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_FockeWulf_C_ReceiveTick");
static_assert(sizeof(BP_FockeWulf_C_ReceiveTick) == 0x000004, "Wrong size on BP_FockeWulf_C_ReceiveTick");
static_assert(offsetof(BP_FockeWulf_C_ReceiveTick, DeltaSeconds_0) == 0x000000, "Member 'BP_FockeWulf_C_ReceiveTick::DeltaSeconds_0' has a wrong offset!");

}

