#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Gamestate_DualRocket

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_GameStateBase_classes.hpp"
#include "E_Teams_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Gamestate_DualRocket.BP_Gamestate_DualRocket_C
// 0x0038 (0x0460 - 0x0428)
class ABP_Gamestate_DualRocket_C final : public ABP_GameStateBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Gamestate_DualRocket_C;          // 0x0428(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class BP_Rocket_0::ABP_Rocket_C*              RocketRef;                                         // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AxisTimer;                                         // 0x0438(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AlliedTimer;                                       // 0x043C(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxTeamTimerAmount;                                // 0x0440(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_444[0x4];                                      // 0x0444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class BP_Rocket_0::ABP_Rocket_C*>      Rockets;                                           // 0x0448(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         AlliedTimeDepletionAmount;                         // 0x0458(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AxisTimeDepletionAmount;                           // 0x045C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Gamestate_DualRocket(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void ReduceTickets(E_Teams Team, int32 Amount);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Gamestate_DualRocket_C">();
	}
	static class ABP_Gamestate_DualRocket_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Gamestate_DualRocket_C>();
	}
};
static_assert(alignof(ABP_Gamestate_DualRocket_C) == 0x000008, "Wrong alignment on ABP_Gamestate_DualRocket_C");
static_assert(sizeof(ABP_Gamestate_DualRocket_C) == 0x000460, "Wrong size on ABP_Gamestate_DualRocket_C");
static_assert(offsetof(ABP_Gamestate_DualRocket_C, UberGraphFrame_BP_Gamestate_DualRocket_C) == 0x000428, "Member 'ABP_Gamestate_DualRocket_C::UberGraphFrame_BP_Gamestate_DualRocket_C' has a wrong offset!");
static_assert(offsetof(ABP_Gamestate_DualRocket_C, RocketRef) == 0x000430, "Member 'ABP_Gamestate_DualRocket_C::RocketRef' has a wrong offset!");
static_assert(offsetof(ABP_Gamestate_DualRocket_C, AxisTimer) == 0x000438, "Member 'ABP_Gamestate_DualRocket_C::AxisTimer' has a wrong offset!");
static_assert(offsetof(ABP_Gamestate_DualRocket_C, AlliedTimer) == 0x00043C, "Member 'ABP_Gamestate_DualRocket_C::AlliedTimer' has a wrong offset!");
static_assert(offsetof(ABP_Gamestate_DualRocket_C, MaxTeamTimerAmount) == 0x000440, "Member 'ABP_Gamestate_DualRocket_C::MaxTeamTimerAmount' has a wrong offset!");
static_assert(offsetof(ABP_Gamestate_DualRocket_C, Rockets) == 0x000448, "Member 'ABP_Gamestate_DualRocket_C::Rockets' has a wrong offset!");
static_assert(offsetof(ABP_Gamestate_DualRocket_C, AlliedTimeDepletionAmount) == 0x000458, "Member 'ABP_Gamestate_DualRocket_C::AlliedTimeDepletionAmount' has a wrong offset!");
static_assert(offsetof(ABP_Gamestate_DualRocket_C, AxisTimeDepletionAmount) == 0x00045C, "Member 'ABP_Gamestate_DualRocket_C::AxisTimeDepletionAmount' has a wrong offset!");

}

