#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Gamestate_Rocket

#include "Basic.hpp"

#include "E_Teams_structs.hpp"


namespace SDK::Params
{

// Function BP_Gamestate_Rocket.BP_Gamestate_Rocket_C.ExecuteUbergraph_BP_Gamestate_Rocket
// 0x0038 (0x0038 - 0x0000)
struct BP_Gamestate_Rocket_C_ExecuteUbergraph_BP_Gamestate_Rocket final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class BP_Rocket_0::ABP_Rocket_C*>      CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	class BP_Rocket_0::ABP_Rocket_C*              CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Gamestate_Rocket_C_ExecuteUbergraph_BP_Gamestate_Rocket) == 0x000008, "Wrong alignment on BP_Gamestate_Rocket_C_ExecuteUbergraph_BP_Gamestate_Rocket");
static_assert(sizeof(BP_Gamestate_Rocket_C_ExecuteUbergraph_BP_Gamestate_Rocket) == 0x000038, "Wrong size on BP_Gamestate_Rocket_C_ExecuteUbergraph_BP_Gamestate_Rocket");
static_assert(offsetof(BP_Gamestate_Rocket_C_ExecuteUbergraph_BP_Gamestate_Rocket, EntryPoint) == 0x000000, "Member 'BP_Gamestate_Rocket_C_ExecuteUbergraph_BP_Gamestate_Rocket::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Gamestate_Rocket_C_ExecuteUbergraph_BP_Gamestate_Rocket, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_Gamestate_Rocket_C_ExecuteUbergraph_BP_Gamestate_Rocket::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Gamestate_Rocket_C_ExecuteUbergraph_BP_Gamestate_Rocket, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000005, "Member 'BP_Gamestate_Rocket_C_ExecuteUbergraph_BP_Gamestate_Rocket::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Gamestate_Rocket_C_ExecuteUbergraph_BP_Gamestate_Rocket, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_Gamestate_Rocket_C_ExecuteUbergraph_BP_Gamestate_Rocket::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Gamestate_Rocket_C_ExecuteUbergraph_BP_Gamestate_Rocket, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'BP_Gamestate_Rocket_C_ExecuteUbergraph_BP_Gamestate_Rocket::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_Gamestate_Rocket_C_ExecuteUbergraph_BP_Gamestate_Rocket, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_Gamestate_Rocket_C_ExecuteUbergraph_BP_Gamestate_Rocket::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Gamestate_Rocket_C_ExecuteUbergraph_BP_Gamestate_Rocket, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000028, "Member 'BP_Gamestate_Rocket_C_ExecuteUbergraph_BP_Gamestate_Rocket::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Gamestate_Rocket_C_ExecuteUbergraph_BP_Gamestate_Rocket, K2Node_SwitchEnum_CmpSuccess) == 0x000029, "Member 'BP_Gamestate_Rocket_C_ExecuteUbergraph_BP_Gamestate_Rocket::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Gamestate_Rocket_C_ExecuteUbergraph_BP_Gamestate_Rocket, CallFunc_Subtract_IntInt_ReturnValue) == 0x00002C, "Member 'BP_Gamestate_Rocket_C_ExecuteUbergraph_BP_Gamestate_Rocket::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Gamestate_Rocket_C_ExecuteUbergraph_BP_Gamestate_Rocket, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000030, "Member 'BP_Gamestate_Rocket_C_ExecuteUbergraph_BP_Gamestate_Rocket::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_Gamestate_Rocket.BP_Gamestate_Rocket_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Gamestate_Rocket_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Gamestate_Rocket_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Gamestate_Rocket_C_ReceiveTick");
static_assert(sizeof(BP_Gamestate_Rocket_C_ReceiveTick) == 0x000004, "Wrong size on BP_Gamestate_Rocket_C_ReceiveTick");
static_assert(offsetof(BP_Gamestate_Rocket_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Gamestate_Rocket_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Gamestate_Rocket.BP_Gamestate_Rocket_C.ReduceTickets
// 0x000C (0x000C - 0x0000)
struct BP_Gamestate_Rocket_C_ReduceTickets final
{
public:
	E_Teams                                       Team;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Amount;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Gamestate_Rocket_C_ReduceTickets) == 0x000004, "Wrong alignment on BP_Gamestate_Rocket_C_ReduceTickets");
static_assert(sizeof(BP_Gamestate_Rocket_C_ReduceTickets) == 0x00000C, "Wrong size on BP_Gamestate_Rocket_C_ReduceTickets");
static_assert(offsetof(BP_Gamestate_Rocket_C_ReduceTickets, Team) == 0x000000, "Member 'BP_Gamestate_Rocket_C_ReduceTickets::Team' has a wrong offset!");
static_assert(offsetof(BP_Gamestate_Rocket_C_ReduceTickets, Amount) == 0x000004, "Member 'BP_Gamestate_Rocket_C_ReduceTickets::Amount' has a wrong offset!");
static_assert(offsetof(BP_Gamestate_Rocket_C_ReduceTickets, K2Node_SwitchEnum_CmpSuccess) == 0x000008, "Member 'BP_Gamestate_Rocket_C_ReduceTickets::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

