#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractableBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_InteractableBase.BP_InteractableBase_C.ExecuteUbergraph_BP_InteractableBase
// 0x0010 (0x0010 - 0x0000)
struct BP_InteractableBase_C_ExecuteUbergraph_BP_InteractableBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Character_C*                        K2Node_CustomEvent_InteractingCharacter;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractableBase_C_ExecuteUbergraph_BP_InteractableBase) == 0x000008, "Wrong alignment on BP_InteractableBase_C_ExecuteUbergraph_BP_InteractableBase");
static_assert(sizeof(BP_InteractableBase_C_ExecuteUbergraph_BP_InteractableBase) == 0x000010, "Wrong size on BP_InteractableBase_C_ExecuteUbergraph_BP_InteractableBase");
static_assert(offsetof(BP_InteractableBase_C_ExecuteUbergraph_BP_InteractableBase, EntryPoint) == 0x000000, "Member 'BP_InteractableBase_C_ExecuteUbergraph_BP_InteractableBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_InteractableBase_C_ExecuteUbergraph_BP_InteractableBase, K2Node_CustomEvent_InteractingCharacter) == 0x000008, "Member 'BP_InteractableBase_C_ExecuteUbergraph_BP_InteractableBase::K2Node_CustomEvent_InteractingCharacter' has a wrong offset!");

// Function BP_InteractableBase.BP_InteractableBase_C.Interact(Client)
// 0x0008 (0x0008 - 0x0000)
struct BP_InteractableBase_C_Interact_Client_ final
{
public:
	class ABP_Character_C*                        InteractingCharacter;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractableBase_C_Interact_Client_) == 0x000008, "Wrong alignment on BP_InteractableBase_C_Interact_Client_");
static_assert(sizeof(BP_InteractableBase_C_Interact_Client_) == 0x000008, "Wrong size on BP_InteractableBase_C_Interact_Client_");
static_assert(offsetof(BP_InteractableBase_C_Interact_Client_, InteractingCharacter) == 0x000000, "Member 'BP_InteractableBase_C_Interact_Client_::InteractingCharacter' has a wrong offset!");

}

