#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ImpactDecal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ImpactDecal.BP_ImpactDecal_C
// 0x0028 (0x0248 - 0x0220)
class ABP_ImpactDecal_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDecalComponent*                        Decal;                                             // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstance*>              DecalMaterials;                                    // 0x0238(0x0010)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BP_ImpactDecal(int32 EntryPoint);
	void RemoveDecal();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ImpactDecal_C">();
	}
	static class ABP_ImpactDecal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ImpactDecal_C>();
	}
};
static_assert(alignof(ABP_ImpactDecal_C) == 0x000008, "Wrong alignment on ABP_ImpactDecal_C");
static_assert(sizeof(ABP_ImpactDecal_C) == 0x000248, "Wrong size on ABP_ImpactDecal_C");
static_assert(offsetof(ABP_ImpactDecal_C, UberGraphFrame) == 0x000220, "Member 'ABP_ImpactDecal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ImpactDecal_C, Decal) == 0x000228, "Member 'ABP_ImpactDecal_C::Decal' has a wrong offset!");
static_assert(offsetof(ABP_ImpactDecal_C, DefaultSceneRoot) == 0x000230, "Member 'ABP_ImpactDecal_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ImpactDecal_C, DecalMaterials) == 0x000238, "Member 'ABP_ImpactDecal_C::DecalMaterials' has a wrong offset!");

}

