#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mannequin

#include "Basic.hpp"

#include "E_Units_structs.hpp"
#include "E_Teams_structs.hpp"
#include "ST_Unlockable_structs.hpp"
#include "ST_CharacterCustomization_structs.hpp"


namespace SDK::Params
{

// Function BP_Mannequin.BP_Mannequin_C.ExecuteUbergraph_BP_Mannequin
// 0x0338 (0x0338 - 0x0000)
struct BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AActor>                     Temp_class_Variable;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacter_Idle_Skeleton_AnimBlueprint_New_C* K2Node_DynamicCast_AsCharacter_Idle_Skeleton_Anim_Blueprint_New; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AActor>                     Temp_class_Variable_1;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class AActor>                     Temp_class_Variable_2;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class AActor>                     Temp_class_Variable_3;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class AActor>                     Temp_class_Variable_4;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	E_Teams                                       Temp_byte_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AActor>                     Temp_class_Variable_5;                             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	E_Units                                       Temp_byte_Variable_1;                              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AActor>                     Temp_class_Variable_6;                             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class AActor>                     Temp_class_Variable_7;                             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class AActor>                     Temp_class_Variable_8;                             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class AActor>                     Temp_class_Variable_9;                             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class AActor>                     Temp_class_Variable_10;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class AActor>                     Temp_class_Variable_11;                            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AActor>                     Temp_class_Variable_12;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	E_Units                                       Temp_byte_Variable_2;                              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Units                                       K2Node_CustomEvent_Class;                          // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EquipableBase_C*                    K2Node_DynamicCast_AsBP_Equipable_Base;            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GameInstance_C*                     K2Node_DynamicCast_AsBP_Game_Instance;             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_GameInstance_C*                     K2Node_DynamicCast_AsBP_Game_Instance_1;           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetClassAndTeamUnitIndex_Index;           // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_Unlockable                         CallFunc_GetCosmeticItemStruct_Item;               // 0x00F0(0x0148)(HasGetValueTypeHash)
	int32                                         CallFunc_GetClassAndTeamUnitIndex_Index_1;         // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_CharacterCustomization             CallFunc_Get_Unit_Character_Customization_CharacterCustomization; // 0x023C(0x003C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x027A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x027B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_Teams                                       K2Node_CustomEvent_Team;                           // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x027D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27E[0x2];                                      // 0x027E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0288(0x0010)(ReferenceParm)
	class UCharacter_Idle_Skeleton_AnimBlueprint_New_C* K2Node_DynamicCast_AsCharacter_Idle_Skeleton_Anim_Blueprint_New_1; // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_2;            // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_3;            // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacter_Idle_Skeleton_AnimBlueprint_New_C* K2Node_DynamicCast_AsCharacter_Idle_Skeleton_Anim_Blueprint_New_2; // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacter_Idle_Skeleton_AnimBlueprint_New_C* K2Node_DynamicCast_AsCharacter_Idle_Skeleton_Anim_Blueprint_New_3; // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D2[0x6];                                      // 0x02D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E5[0x3];                                      // 0x02E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2ED[0x3];                                      // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AActor>                     K2Node_Select_Default;                             // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class AActor>                     K2Node_Select_Default_1;                           // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class AActor>                     K2Node_Select_Default_2;                           // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_ApplyCharacterCustomization_LegsMID;      // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_ApplyCharacterCustomization_CharacterMID; // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       CallFunc_ApplyCharacterCustomization_HatItemMIDs;  // 0x0318(0x0010)(ReferenceParm)
	TArray<class UMaterialInstanceDynamic*>       CallFunc_ApplyCharacterCustomization_TorsoMIDs;    // 0x0328(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin) == 0x000008, "Wrong alignment on BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin");
static_assert(sizeof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin) == 0x000338, "Wrong size on BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, EntryPoint) == 0x000000, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, Temp_class_Variable) == 0x000008, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, CallFunc_GetAnimInstance_ReturnValue) == 0x000010, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, K2Node_DynamicCast_AsCharacter_Idle_Skeleton_Anim_Blueprint_New) == 0x000018, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::K2Node_DynamicCast_AsCharacter_Idle_Skeleton_Anim_Blueprint_New' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, Temp_class_Variable_1) == 0x000028, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, Temp_class_Variable_2) == 0x000030, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::Temp_class_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, Temp_class_Variable_3) == 0x000038, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::Temp_class_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, Temp_class_Variable_4) == 0x000040, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::Temp_class_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, Temp_byte_Variable) == 0x000048, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, Temp_class_Variable_5) == 0x000050, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::Temp_class_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, Temp_byte_Variable_1) == 0x000058, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, Temp_class_Variable_6) == 0x000060, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::Temp_class_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, Temp_class_Variable_7) == 0x000068, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::Temp_class_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, Temp_class_Variable_8) == 0x000070, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::Temp_class_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, Temp_class_Variable_9) == 0x000078, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::Temp_class_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, Temp_class_Variable_10) == 0x000080, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::Temp_class_Variable_10' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, Temp_class_Variable_11) == 0x000088, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::Temp_class_Variable_11' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, Temp_int_Array_Index_Variable) == 0x000090, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, Temp_class_Variable_12) == 0x000098, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::Temp_class_Variable_12' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, Temp_byte_Variable_2) == 0x0000A0, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, K2Node_CustomEvent_Class) == 0x0000A1, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::K2Node_CustomEvent_Class' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, CallFunc_GetGameInstance_ReturnValue) == 0x0000A8, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, K2Node_DynamicCast_AsBP_Equipable_Base) == 0x0000B0, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::K2Node_DynamicCast_AsBP_Equipable_Base' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, K2Node_DynamicCast_bSuccess_1) == 0x0000B8, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, K2Node_DynamicCast_AsBP_Game_Instance) == 0x0000C0, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::K2Node_DynamicCast_AsBP_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, K2Node_DynamicCast_bSuccess_2) == 0x0000C8, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, CallFunc_GetGameInstance_ReturnValue_1) == 0x0000D0, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, K2Node_DynamicCast_AsBP_Game_Instance_1) == 0x0000D8, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::K2Node_DynamicCast_AsBP_Game_Instance_1' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, K2Node_DynamicCast_bSuccess_3) == 0x0000E0, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, CallFunc_GetClassAndTeamUnitIndex_Index) == 0x0000E4, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::CallFunc_GetClassAndTeamUnitIndex_Index' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, CallFunc_Array_Get_Item) == 0x0000E8, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, CallFunc_GetCosmeticItemStruct_Item) == 0x0000F0, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::CallFunc_GetCosmeticItemStruct_Item' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, CallFunc_GetClassAndTeamUnitIndex_Index_1) == 0x000238, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::CallFunc_GetClassAndTeamUnitIndex_Index_1' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, CallFunc_Get_Unit_Character_Customization_CharacterCustomization) == 0x00023C, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::CallFunc_Get_Unit_Character_Customization_CharacterCustomization' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000278, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000279, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, CallFunc_BooleanOR_ReturnValue) == 0x00027A, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, CallFunc_IsValid_ReturnValue) == 0x00027B, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, K2Node_CustomEvent_Team) == 0x00027C, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::K2Node_CustomEvent_Team' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, CallFunc_SetStaticMesh_ReturnValue) == 0x00027D, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000280, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, CallFunc_GetMaterials_ReturnValue) == 0x000288, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, K2Node_DynamicCast_AsCharacter_Idle_Skeleton_Anim_Blueprint_New_1) == 0x000298, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::K2Node_DynamicCast_AsCharacter_Idle_Skeleton_Anim_Blueprint_New_1' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, K2Node_DynamicCast_bSuccess_4) == 0x0002A0, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, CallFunc_Array_Length_ReturnValue) == 0x0002A4, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, CallFunc_GetAnimInstance_ReturnValue_2) == 0x0002A8, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::CallFunc_GetAnimInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, CallFunc_GetAnimInstance_ReturnValue_3) == 0x0002B0, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::CallFunc_GetAnimInstance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, K2Node_DynamicCast_AsCharacter_Idle_Skeleton_Anim_Blueprint_New_2) == 0x0002B8, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::K2Node_DynamicCast_AsCharacter_Idle_Skeleton_Anim_Blueprint_New_2' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, K2Node_DynamicCast_bSuccess_5) == 0x0002C0, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, K2Node_DynamicCast_AsCharacter_Idle_Skeleton_Anim_Blueprint_New_3) == 0x0002C8, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::K2Node_DynamicCast_AsCharacter_Idle_Skeleton_Anim_Blueprint_New_3' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, K2Node_DynamicCast_bSuccess_6) == 0x0002D0, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, CallFunc_IsValid_ReturnValue_1) == 0x0002D1, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0002D8, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, Temp_int_Loop_Counter_Variable) == 0x0002E0, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, CallFunc_Less_IntInt_ReturnValue) == 0x0002E4, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, CallFunc_Add_IntInt_ReturnValue) == 0x0002E8, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, CallFunc_IsValid_ReturnValue_2) == 0x0002EC, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, K2Node_Select_Default) == 0x0002F0, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, K2Node_Select_Default_1) == 0x0002F8, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, K2Node_Select_Default_2) == 0x000300, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, CallFunc_ApplyCharacterCustomization_LegsMID) == 0x000308, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::CallFunc_ApplyCharacterCustomization_LegsMID' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, CallFunc_ApplyCharacterCustomization_CharacterMID) == 0x000310, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::CallFunc_ApplyCharacterCustomization_CharacterMID' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, CallFunc_ApplyCharacterCustomization_HatItemMIDs) == 0x000318, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::CallFunc_ApplyCharacterCustomization_HatItemMIDs' has a wrong offset!");
static_assert(offsetof(BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin, CallFunc_ApplyCharacterCustomization_TorsoMIDs) == 0x000328, "Member 'BP_Mannequin_C_ExecuteUbergraph_BP_Mannequin::CallFunc_ApplyCharacterCustomization_TorsoMIDs' has a wrong offset!");

// Function BP_Mannequin.BP_Mannequin_C.SetTeam
// 0x0001 (0x0001 - 0x0000)
struct BP_Mannequin_C_SetTeam final
{
public:
	E_Teams                                       Team_0;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mannequin_C_SetTeam) == 0x000001, "Wrong alignment on BP_Mannequin_C_SetTeam");
static_assert(sizeof(BP_Mannequin_C_SetTeam) == 0x000001, "Wrong size on BP_Mannequin_C_SetTeam");
static_assert(offsetof(BP_Mannequin_C_SetTeam, Team_0) == 0x000000, "Member 'BP_Mannequin_C_SetTeam::Team_0' has a wrong offset!");

// Function BP_Mannequin.BP_Mannequin_C.SetClass
// 0x0001 (0x0001 - 0x0000)
struct BP_Mannequin_C_SetClass final
{
public:
	E_Units                                       Param_Class_0;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mannequin_C_SetClass) == 0x000001, "Wrong alignment on BP_Mannequin_C_SetClass");
static_assert(sizeof(BP_Mannequin_C_SetClass) == 0x000001, "Wrong size on BP_Mannequin_C_SetClass");
static_assert(offsetof(BP_Mannequin_C_SetClass, Param_Class_0) == 0x000000, "Member 'BP_Mannequin_C_SetClass::Param_Class_0' has a wrong offset!");

}

