#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MainMenuController

#include "Basic.hpp"

#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function BP_MainMenuController.BP_MainMenuController_C.ExecuteUbergraph_BP_MainMenuController
// 0x0200 (0x0200 - 0x0000)
struct BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_WrittenAchievementName;         // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_WrittenProgress;                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_WrittenUserTag;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName WrittenAchievementName, float WrittenProgress, int32 WrittenUserTag)> K2Node_CreateDelegate_OutputDelegate; // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_6;                        // 0x0058(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_5;                        // 0x0070(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_4;                        // 0x0088(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable;                              // 0x00A0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_3;                        // 0x00B8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_2;                        // 0x00D0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_1;                            // 0x00E8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key_1;                        // 0x0100(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0118(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable_2;                            // 0x0130(0x0018)(HasGetValueTypeHash)
	class UW_CheatMenu_C*                         CallFunc_Create_ReturnValue;                       // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_MainMenuCam_C*>              CallFunc_GetAllActorsOfClass_OutActors;            // 0x0158(0x0010)(ReferenceParm)
	TArray<class ABP_Flag_C*>                     CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x0168(0x0010)(ReferenceParm)
	class ABP_MainMenuCam_C*                      CallFunc_Array_Get_Item;                           // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Flag_C*                             CallFunc_Array_Get_Item_1;                         // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAchievementWriteCallbackProxy*         CallFunc_WriteAchievementProgress_ReturnValue;     // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName WrittenAchievementName, float WrittenProgress, int32 WrittenUserTag)> K2Node_CreateDelegate_OutputDelegate_3; // 0x0198(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAchievementQueryCallbackProxy*         CallFunc_CacheAchievements_ReturnValue;            // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAllActorsWithTag_OutActors;            // 0x01C0(0x0010)(ReferenceParm)
	class FName                                   K2Node_CustomEvent_WrittenAchievementName_1;       // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_WrittenProgress_1;              // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_WrittenUserTag_1;               // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_2;                         // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IncreaseStat_Success;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StoreStats_ReturnValue;                   // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EB[0x1];                                      // 0x01EB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x3];                                      // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController) == 0x000008, "Wrong alignment on BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController");
static_assert(sizeof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController) == 0x000200, "Wrong size on BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, EntryPoint) == 0x000000, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, K2Node_CustomEvent_WrittenAchievementName) == 0x000004, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::K2Node_CustomEvent_WrittenAchievementName' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, K2Node_CustomEvent_WrittenProgress) == 0x00000C, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::K2Node_CustomEvent_WrittenProgress' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, K2Node_CustomEvent_WrittenUserTag) == 0x000010, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::K2Node_CustomEvent_WrittenUserTag' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, Temp_int_Variable) == 0x000024, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, Temp_float_Variable) == 0x000028, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, Temp_name_Variable) == 0x00002C, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, K2Node_CreateDelegate_OutputDelegate_1) == 0x000034, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, K2Node_CreateDelegate_OutputDelegate_2) == 0x000044, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, K2Node_InputKeyEvent_Key_6) == 0x000058, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::K2Node_InputKeyEvent_Key_6' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, K2Node_InputKeyEvent_Key_5) == 0x000070, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::K2Node_InputKeyEvent_Key_5' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, K2Node_InputKeyEvent_Key_4) == 0x000088, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::K2Node_InputKeyEvent_Key_4' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, Temp_struct_Variable) == 0x0000A0, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, K2Node_InputKeyEvent_Key_3) == 0x0000B8, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::K2Node_InputKeyEvent_Key_3' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, K2Node_InputKeyEvent_Key_2) == 0x0000D0, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::K2Node_InputKeyEvent_Key_2' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, Temp_struct_Variable_1) == 0x0000E8, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, K2Node_InputKeyEvent_Key_1) == 0x000100, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::K2Node_InputKeyEvent_Key_1' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, K2Node_InputKeyEvent_Key) == 0x000118, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::K2Node_InputKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, Temp_struct_Variable_2) == 0x000130, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, CallFunc_Create_ReturnValue) == 0x000148, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, Temp_int_Array_Index_Variable) == 0x000150, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, CallFunc_GetAllActorsOfClass_OutActors) == 0x000158, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x000168, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, CallFunc_Array_Get_Item) == 0x000178, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, CallFunc_Array_Get_Item_1) == 0x000180, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, CallFunc_Array_Length_ReturnValue) == 0x000188, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, CallFunc_WriteAchievementProgress_ReturnValue) == 0x000190, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::CallFunc_WriteAchievementProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, K2Node_CreateDelegate_OutputDelegate_3) == 0x000198, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, CallFunc_IsValid_ReturnValue) == 0x0001A8, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, CallFunc_CacheAchievements_ReturnValue) == 0x0001B0, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::CallFunc_CacheAchievements_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, CallFunc_IsValid_ReturnValue_1) == 0x0001B8, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, CallFunc_GetAllActorsWithTag_OutActors) == 0x0001C0, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::CallFunc_GetAllActorsWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, K2Node_CustomEvent_WrittenAchievementName_1) == 0x0001D0, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::K2Node_CustomEvent_WrittenAchievementName_1' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, K2Node_CustomEvent_WrittenProgress_1) == 0x0001D8, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::K2Node_CustomEvent_WrittenProgress_1' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, K2Node_CustomEvent_WrittenUserTag_1) == 0x0001DC, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::K2Node_CustomEvent_WrittenUserTag_1' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, CallFunc_Array_Get_Item_2) == 0x0001E0, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, CallFunc_IncreaseStat_Success) == 0x0001E8, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::CallFunc_IncreaseStat_Success' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, CallFunc_StoreStats_ReturnValue) == 0x0001E9, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::CallFunc_StoreStats_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x0001EA, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, Temp_int_Loop_Counter_Variable) == 0x0001EC, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, CallFunc_Less_IntInt_ReturnValue) == 0x0001F0, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, CallFunc_Add_IntInt_ReturnValue) == 0x0001F4, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController, CallFunc_BooleanAND_ReturnValue) == 0x0001F8, "Member 'BP_MainMenuController_C_ExecuteUbergraph_BP_MainMenuController::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_MainMenuController.BP_MainMenuController_C.InpActEvt_Comma_K2Node_InputKeyEvent_0
// 0x0018 (0x0018 - 0x0000)
struct BP_MainMenuController_C_InpActEvt_Comma_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainMenuController_C_InpActEvt_Comma_K2Node_InputKeyEvent_0) == 0x000008, "Wrong alignment on BP_MainMenuController_C_InpActEvt_Comma_K2Node_InputKeyEvent_0");
static_assert(sizeof(BP_MainMenuController_C_InpActEvt_Comma_K2Node_InputKeyEvent_0) == 0x000018, "Wrong size on BP_MainMenuController_C_InpActEvt_Comma_K2Node_InputKeyEvent_0");
static_assert(offsetof(BP_MainMenuController_C_InpActEvt_Comma_K2Node_InputKeyEvent_0, Key) == 0x000000, "Member 'BP_MainMenuController_C_InpActEvt_Comma_K2Node_InputKeyEvent_0::Key' has a wrong offset!");

// Function BP_MainMenuController.BP_MainMenuController_C.InpActEvt_Comma_K2Node_InputKeyEvent_1
// 0x0018 (0x0018 - 0x0000)
struct BP_MainMenuController_C_InpActEvt_Comma_K2Node_InputKeyEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainMenuController_C_InpActEvt_Comma_K2Node_InputKeyEvent_1) == 0x000008, "Wrong alignment on BP_MainMenuController_C_InpActEvt_Comma_K2Node_InputKeyEvent_1");
static_assert(sizeof(BP_MainMenuController_C_InpActEvt_Comma_K2Node_InputKeyEvent_1) == 0x000018, "Wrong size on BP_MainMenuController_C_InpActEvt_Comma_K2Node_InputKeyEvent_1");
static_assert(offsetof(BP_MainMenuController_C_InpActEvt_Comma_K2Node_InputKeyEvent_1, Key) == 0x000000, "Member 'BP_MainMenuController_C_InpActEvt_Comma_K2Node_InputKeyEvent_1::Key' has a wrong offset!");

// Function BP_MainMenuController.BP_MainMenuController_C.InpActEvt_LeftShift_K2Node_InputKeyEvent_2
// 0x0018 (0x0018 - 0x0000)
struct BP_MainMenuController_C_InpActEvt_LeftShift_K2Node_InputKeyEvent_2 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainMenuController_C_InpActEvt_LeftShift_K2Node_InputKeyEvent_2) == 0x000008, "Wrong alignment on BP_MainMenuController_C_InpActEvt_LeftShift_K2Node_InputKeyEvent_2");
static_assert(sizeof(BP_MainMenuController_C_InpActEvt_LeftShift_K2Node_InputKeyEvent_2) == 0x000018, "Wrong size on BP_MainMenuController_C_InpActEvt_LeftShift_K2Node_InputKeyEvent_2");
static_assert(offsetof(BP_MainMenuController_C_InpActEvt_LeftShift_K2Node_InputKeyEvent_2, Key) == 0x000000, "Member 'BP_MainMenuController_C_InpActEvt_LeftShift_K2Node_InputKeyEvent_2::Key' has a wrong offset!");

// Function BP_MainMenuController.BP_MainMenuController_C.InpActEvt_LeftShift_K2Node_InputKeyEvent_3
// 0x0018 (0x0018 - 0x0000)
struct BP_MainMenuController_C_InpActEvt_LeftShift_K2Node_InputKeyEvent_3 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainMenuController_C_InpActEvt_LeftShift_K2Node_InputKeyEvent_3) == 0x000008, "Wrong alignment on BP_MainMenuController_C_InpActEvt_LeftShift_K2Node_InputKeyEvent_3");
static_assert(sizeof(BP_MainMenuController_C_InpActEvt_LeftShift_K2Node_InputKeyEvent_3) == 0x000018, "Wrong size on BP_MainMenuController_C_InpActEvt_LeftShift_K2Node_InputKeyEvent_3");
static_assert(offsetof(BP_MainMenuController_C_InpActEvt_LeftShift_K2Node_InputKeyEvent_3, Key) == 0x000000, "Member 'BP_MainMenuController_C_InpActEvt_LeftShift_K2Node_InputKeyEvent_3::Key' has a wrong offset!");

// Function BP_MainMenuController.BP_MainMenuController_C.InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_4
// 0x0018 (0x0018 - 0x0000)
struct BP_MainMenuController_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_4 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainMenuController_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_4) == 0x000008, "Wrong alignment on BP_MainMenuController_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_4");
static_assert(sizeof(BP_MainMenuController_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_4) == 0x000018, "Wrong size on BP_MainMenuController_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_4");
static_assert(offsetof(BP_MainMenuController_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_4, Key) == 0x000000, "Member 'BP_MainMenuController_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_4::Key' has a wrong offset!");

// Function BP_MainMenuController.BP_MainMenuController_C.InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_5
// 0x0018 (0x0018 - 0x0000)
struct BP_MainMenuController_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_5 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainMenuController_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_5) == 0x000008, "Wrong alignment on BP_MainMenuController_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_5");
static_assert(sizeof(BP_MainMenuController_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_5) == 0x000018, "Wrong size on BP_MainMenuController_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_5");
static_assert(offsetof(BP_MainMenuController_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_5, Key) == 0x000000, "Member 'BP_MainMenuController_C_InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_5::Key' has a wrong offset!");

// Function BP_MainMenuController.BP_MainMenuController_C.InpActEvt_L_K2Node_InputKeyEvent_6
// 0x0018 (0x0018 - 0x0000)
struct BP_MainMenuController_C_InpActEvt_L_K2Node_InputKeyEvent_6 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainMenuController_C_InpActEvt_L_K2Node_InputKeyEvent_6) == 0x000008, "Wrong alignment on BP_MainMenuController_C_InpActEvt_L_K2Node_InputKeyEvent_6");
static_assert(sizeof(BP_MainMenuController_C_InpActEvt_L_K2Node_InputKeyEvent_6) == 0x000018, "Wrong size on BP_MainMenuController_C_InpActEvt_L_K2Node_InputKeyEvent_6");
static_assert(offsetof(BP_MainMenuController_C_InpActEvt_L_K2Node_InputKeyEvent_6, Key) == 0x000000, "Member 'BP_MainMenuController_C_InpActEvt_L_K2Node_InputKeyEvent_6::Key' has a wrong offset!");

// Function BP_MainMenuController.BP_MainMenuController_C.OnSuccess_C6DDCB704E896B9CA722A78103137307
// 0x0010 (0x0010 - 0x0000)
struct BP_MainMenuController_C_OnSuccess_C6DDCB704E896B9CA722A78103137307 final
{
public:
	class FName                                   WrittenAchievementName;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WrittenProgress;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WrittenUserTag;                                    // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainMenuController_C_OnSuccess_C6DDCB704E896B9CA722A78103137307) == 0x000004, "Wrong alignment on BP_MainMenuController_C_OnSuccess_C6DDCB704E896B9CA722A78103137307");
static_assert(sizeof(BP_MainMenuController_C_OnSuccess_C6DDCB704E896B9CA722A78103137307) == 0x000010, "Wrong size on BP_MainMenuController_C_OnSuccess_C6DDCB704E896B9CA722A78103137307");
static_assert(offsetof(BP_MainMenuController_C_OnSuccess_C6DDCB704E896B9CA722A78103137307, WrittenAchievementName) == 0x000000, "Member 'BP_MainMenuController_C_OnSuccess_C6DDCB704E896B9CA722A78103137307::WrittenAchievementName' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_OnSuccess_C6DDCB704E896B9CA722A78103137307, WrittenProgress) == 0x000008, "Member 'BP_MainMenuController_C_OnSuccess_C6DDCB704E896B9CA722A78103137307::WrittenProgress' has a wrong offset!");
static_assert(offsetof(BP_MainMenuController_C_OnSuccess_C6DDCB704E896B9CA722A78103137307, WrittenUserTag) == 0x00000C, "Member 'BP_MainMenuController_C_OnSuccess_C6DDCB704E896B9CA722A78103137307::WrittenUserTag' has a wrong offset!");

// Function BP_MainMenuController.BP_MainMenuController_C.OnFailure_C6DDCB704E896B9CA722A78103137307
// 0x0010 (0x0010 - 0x0000)
struct BP_MainMenuController_C_OnFailure_C6DDCB704E896B9CA722A78103137307 final
{
public:
	class FName                                   WrittenAchievementName;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WrittenProgress;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WrittenUserTag;                                    // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MainMenuController_C_OnFailure_C6DDCB704E896B9CA722A78103137307) == 0x000004, "Wrong alignment on BP_MainMenuController_C_OnFailure_C6DDCB704E896B9CA722A78103137307");
static_assert(sizeof(BP_MainMenuController_C_OnFailure_C6DDCB704E896B9CA722A78103137307) == 0x000010, "Wrong size on BP_MainMenuController_C_OnFailure_C6DDCB704E896B9CA722A78103137307");
static_assert(offsetof(BP_MainMenuController_C_OnFailure_C6DDCB704E896B9CA722A78103137307, WrittenAchievementName) == 0x000000, "Member 'BP_MainMenuController_C_OnFailure_C6DDCB704E896B9CA722A78103137307::WrittenAchievementName' has a wrong offset!");
