#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MapCam

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_MapCam.BP_MapCam_C.ExecuteUbergraph_BP_MapCam
// 0x0068 (0x0068 - 0x0000)
struct BP_MapCam_C_ExecuteUbergraph_BP_MapCam final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAllActorsWithTag_OutActors;            // 0x0008(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APostProcessVolume*                     K2Node_DynamicCast_AsPost_Process_Volume;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAllActorsWithTag_OutActors_1;          // 0x0040(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MapCam_C_ExecuteUbergraph_BP_MapCam) == 0x000008, "Wrong alignment on BP_MapCam_C_ExecuteUbergraph_BP_MapCam");
static_assert(sizeof(BP_MapCam_C_ExecuteUbergraph_BP_MapCam) == 0x000068, "Wrong size on BP_MapCam_C_ExecuteUbergraph_BP_MapCam");
static_assert(offsetof(BP_MapCam_C_ExecuteUbergraph_BP_MapCam, EntryPoint) == 0x000000, "Member 'BP_MapCam_C_ExecuteUbergraph_BP_MapCam::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MapCam_C_ExecuteUbergraph_BP_MapCam, CallFunc_GetAllActorsWithTag_OutActors) == 0x000008, "Member 'BP_MapCam_C_ExecuteUbergraph_BP_MapCam::CallFunc_GetAllActorsWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(BP_MapCam_C_ExecuteUbergraph_BP_MapCam, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_MapCam_C_ExecuteUbergraph_BP_MapCam::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_MapCam_C_ExecuteUbergraph_BP_MapCam, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_MapCam_C_ExecuteUbergraph_BP_MapCam::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_MapCam_C_ExecuteUbergraph_BP_MapCam, K2Node_DynamicCast_AsPost_Process_Volume) == 0x000028, "Member 'BP_MapCam_C_ExecuteUbergraph_BP_MapCam::K2Node_DynamicCast_AsPost_Process_Volume' has a wrong offset!");
static_assert(offsetof(BP_MapCam_C_ExecuteUbergraph_BP_MapCam, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_MapCam_C_ExecuteUbergraph_BP_MapCam::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MapCam_C_ExecuteUbergraph_BP_MapCam, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'BP_MapCam_C_ExecuteUbergraph_BP_MapCam::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_MapCam_C_ExecuteUbergraph_BP_MapCam, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'BP_MapCam_C_ExecuteUbergraph_BP_MapCam::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCam_C_ExecuteUbergraph_BP_MapCam, CallFunc_GetAllActorsWithTag_OutActors_1) == 0x000040, "Member 'BP_MapCam_C_ExecuteUbergraph_BP_MapCam::CallFunc_GetAllActorsWithTag_OutActors_1' has a wrong offset!");
static_assert(offsetof(BP_MapCam_C_ExecuteUbergraph_BP_MapCam, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'BP_MapCam_C_ExecuteUbergraph_BP_MapCam::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MapCam_C_ExecuteUbergraph_BP_MapCam, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'BP_MapCam_C_ExecuteUbergraph_BP_MapCam::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_MapCam_C_ExecuteUbergraph_BP_MapCam, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'BP_MapCam_C_ExecuteUbergraph_BP_MapCam::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

