#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MainMenuController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_BaseController_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MainMenuController.BP_MainMenuController_C
// 0x0028 (0x0638 - 0x0610)
class ABP_MainMenuController_C final : public ABP_BaseController_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_MainMenuController_C;            // 0x0610(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_Character_C*                        CharacterRef;                                      // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Level;                                             // 0x0620(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LMBPressed;                                        // 0x0624(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_625[0x3];                                      // 0x0625(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_MainMenu_C*                          MainMenuWidget;                                    // 0x0628(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShiftPressed;                                      // 0x0630(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CommaPressed;                                      // 0x0631(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_MainMenuController(int32 EntryPoint);
	void InpActEvt_Comma_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void InpActEvt_Comma_K2Node_InputKeyEvent_1(const struct FKey& Key);
	void InpActEvt_LeftShift_K2Node_InputKeyEvent_2(const struct FKey& Key);
	void InpActEvt_LeftShift_K2Node_InputKeyEvent_3(const struct FKey& Key);
	void InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_4(const struct FKey& Key);
	void InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_5(const struct FKey& Key);
	void InpActEvt_L_K2Node_InputKeyEvent_6(const struct FKey& Key);
	void OnSuccess_4901A0494D7003E1CEBC7598DA123A88();
	void OnFailure_4901A0494D7003E1CEBC7598DA123A88();
	void OnSuccess_C6DDCB704E896B9CA722A78103137307(class FName WrittenAchievementName, float WrittenProgress, int32 WrittenUserTag);
	void OnFailure_C6DDCB704E896B9CA722A78103137307(class FName WrittenAchievementName, float WrittenProgress, int32 WrittenUserTag);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MainMenuController_C">();
	}
	static class ABP_MainMenuController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MainMenuController_C>();
	}
};
static_assert(alignof(ABP_MainMenuController_C) == 0x000008, "Wrong alignment on ABP_MainMenuController_C");
static_assert(sizeof(ABP_MainMenuController_C) == 0x000638, "Wrong size on ABP_MainMenuController_C");
static_assert(offsetof(ABP_MainMenuController_C, UberGraphFrame_BP_MainMenuController_C) == 0x000610, "Member 'ABP_MainMenuController_C::UberGraphFrame_BP_MainMenuController_C' has a wrong offset!");
static_assert(offsetof(ABP_MainMenuController_C, CharacterRef) == 0x000618, "Member 'ABP_MainMenuController_C::CharacterRef' has a wrong offset!");
static_assert(offsetof(ABP_MainMenuController_C, Level) == 0x000620, "Member 'ABP_MainMenuController_C::Level' has a wrong offset!");
static_assert(offsetof(ABP_MainMenuController_C, LMBPressed) == 0x000624, "Member 'ABP_MainMenuController_C::LMBPressed' has a wrong offset!");
static_assert(offsetof(ABP_MainMenuController_C, MainMenuWidget) == 0x000628, "Member 'ABP_MainMenuController_C::MainMenuWidget' has a wrong offset!");
static_assert(offsetof(ABP_MainMenuController_C, ShiftPressed) == 0x000630, "Member 'ABP_MainMenuController_C::ShiftPressed' has a wrong offset!");
static_assert(offsetof(ABP_MainMenuController_C, CommaPressed) == 0x000631, "Member 'ABP_MainMenuController_C::CommaPressed' has a wrong offset!");

}

