#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mannequin

#include "Basic.hpp"

#include "ST_CharacterCustomization_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "E_Teams_structs.hpp"
#include "E_Units_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Mannequin.BP_Mannequin_C
// 0x00C8 (0x02E8 - 0x0220)
class ABP_Mannequin_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 Feet;                                              // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Back;                                              // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Torso;                                             // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 FacialHair;                                        // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Legs;                                              // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LowerFace;                                         // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HatExtras;                                         // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   UpperFace;                                         // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Weapon;                                            // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Hat;                                               // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CharacterMesh;                                     // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	E_Teams                                       Team;                                              // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Units                                       Class_0;                                           // 0x0289(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28A[0x2];                                      // 0x028A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_CharacterCustomization             CharCustomization;                                 // 0x028C(0x003C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            ShowCaseHatItem;                                   // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          ShowCaseTorsoItem;                                 // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          ShowCaseBackItem;                                  // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableCustomization;                               // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Mannequin(int32 EntryPoint);
	void SetTeam(E_Teams Team_0);
	void RefreshShowcaseCosmetics();
	void ApplyCharCustomization();
	void SetActiveWeaponSkin();
	void SetClass(E_Units Param_Class_0);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Mannequin_C">();
	}
	static class ABP_Mannequin_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Mannequin_C>();
	}
};
static_assert(alignof(ABP_Mannequin_C) == 0x000008, "Wrong alignment on ABP_Mannequin_C");
static_assert(sizeof(ABP_Mannequin_C) == 0x0002E8, "Wrong size on ABP_Mannequin_C");
static_assert(offsetof(ABP_Mannequin_C, UberGraphFrame) == 0x000220, "Member 'ABP_Mannequin_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Mannequin_C, Feet) == 0x000228, "Member 'ABP_Mannequin_C::Feet' has a wrong offset!");
static_assert(offsetof(ABP_Mannequin_C, Back) == 0x000230, "Member 'ABP_Mannequin_C::Back' has a wrong offset!");
static_assert(offsetof(ABP_Mannequin_C, Torso) == 0x000238, "Member 'ABP_Mannequin_C::Torso' has a wrong offset!");
static_assert(offsetof(ABP_Mannequin_C, FacialHair) == 0x000240, "Member 'ABP_Mannequin_C::FacialHair' has a wrong offset!");
static_assert(offsetof(ABP_Mannequin_C, Legs) == 0x000248, "Member 'ABP_Mannequin_C::Legs' has a wrong offset!");
static_assert(offsetof(ABP_Mannequin_C, LowerFace) == 0x000250, "Member 'ABP_Mannequin_C::LowerFace' has a wrong offset!");
static_assert(offsetof(ABP_Mannequin_C, HatExtras) == 0x000258, "Member 'ABP_Mannequin_C::HatExtras' has a wrong offset!");
static_assert(offsetof(ABP_Mannequin_C, UpperFace) == 0x000260, "Member 'ABP_Mannequin_C::UpperFace' has a wrong offset!");
static_assert(offsetof(ABP_Mannequin_C, Weapon) == 0x000268, "Member 'ABP_Mannequin_C::Weapon' has a wrong offset!");
static_assert(offsetof(ABP_Mannequin_C, Hat) == 0x000270, "Member 'ABP_Mannequin_C::Hat' has a wrong offset!");
static_assert(offsetof(ABP_Mannequin_C, CharacterMesh) == 0x000278, "Member 'ABP_Mannequin_C::CharacterMesh' has a wrong offset!");
static_assert(offsetof(ABP_Mannequin_C, DefaultSceneRoot) == 0x000280, "Member 'ABP_Mannequin_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Mannequin_C, Team) == 0x000288, "Member 'ABP_Mannequin_C::Team' has a wrong offset!");
static_assert(offsetof(ABP_Mannequin_C, Class_0) == 0x000289, "Member 'ABP_Mannequin_C::Class_0' has a wrong offset!");
static_assert(offsetof(ABP_Mannequin_C, CharCustomization) == 0x00028C, "Member 'ABP_Mannequin_C::CharCustomization' has a wrong offset!");
static_assert(offsetof(ABP_Mannequin_C, ShowCaseHatItem) == 0x0002C8, "Member 'ABP_Mannequin_C::ShowCaseHatItem' has a wrong offset!");
static_assert(offsetof(ABP_Mannequin_C, ShowCaseTorsoItem) == 0x0002D0, "Member 'ABP_Mannequin_C::ShowCaseTorsoItem' has a wrong offset!");
static_assert(offsetof(ABP_Mannequin_C, ShowCaseBackItem) == 0x0002D8, "Member 'ABP_Mannequin_C::ShowCaseBackItem' has a wrong offset!");
static_assert(offsetof(ABP_Mannequin_C, EnableCustomization) == 0x0002E0, "Member 'ABP_Mannequin_C::EnableCustomization' has a wrong offset!");

}

