#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NewSky

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_NewSky.BP_NewSky_C.ExecuteUbergraph_BP_NewSky
// 0x00B0 (0x00B0 - 0x0000)
struct BP_NewSky_C_ExecuteUbergraph_BP_NewSky final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0010(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0038(0x0028)()
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_1;           // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetLightColor_ReturnValue;                // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShadowQuality_ReturnValue;             // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NewSky_C_ExecuteUbergraph_BP_NewSky) == 0x000008, "Wrong alignment on BP_NewSky_C_ExecuteUbergraph_BP_NewSky");
static_assert(sizeof(BP_NewSky_C_ExecuteUbergraph_BP_NewSky) == 0x0000B0, "Wrong size on BP_NewSky_C_ExecuteUbergraph_BP_NewSky");
static_assert(offsetof(BP_NewSky_C_ExecuteUbergraph_BP_NewSky, EntryPoint) == 0x000000, "Member 'BP_NewSky_C_ExecuteUbergraph_BP_NewSky::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_NewSky_C_ExecuteUbergraph_BP_NewSky, CallFunc_RandomFloatInRange_ReturnValue) == 0x000004, "Member 'BP_NewSky_C_ExecuteUbergraph_BP_NewSky::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NewSky_C_ExecuteUbergraph_BP_NewSky, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000008, "Member 'BP_NewSky_C_ExecuteUbergraph_BP_NewSky::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NewSky_C_ExecuteUbergraph_BP_NewSky, K2Node_MakeStruct_SlateColor) == 0x000010, "Member 'BP_NewSky_C_ExecuteUbergraph_BP_NewSky::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(BP_NewSky_C_ExecuteUbergraph_BP_NewSky, K2Node_MakeStruct_SlateColor_1) == 0x000038, "Member 'BP_NewSky_C_ExecuteUbergraph_BP_NewSky::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(BP_NewSky_C_ExecuteUbergraph_BP_NewSky, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000060, "Member 'BP_NewSky_C_ExecuteUbergraph_BP_NewSky::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NewSky_C_ExecuteUbergraph_BP_NewSky, CallFunc_Conv_BoolToFloat_ReturnValue_1) == 0x000064, "Member 'BP_NewSky_C_ExecuteUbergraph_BP_NewSky::CallFunc_Conv_BoolToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_NewSky_C_ExecuteUbergraph_BP_NewSky, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000068, "Member 'BP_NewSky_C_ExecuteUbergraph_BP_NewSky::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NewSky_C_ExecuteUbergraph_BP_NewSky, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x000074, "Member 'BP_NewSky_C_ExecuteUbergraph_BP_NewSky::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NewSky_C_ExecuteUbergraph_BP_NewSky, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000080, "Member 'BP_NewSky_C_ExecuteUbergraph_BP_NewSky::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NewSky_C_ExecuteUbergraph_BP_NewSky, CallFunc_GetLightColor_ReturnValue) == 0x000090, "Member 'BP_NewSky_C_ExecuteUbergraph_BP_NewSky::CallFunc_GetLightColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NewSky_C_ExecuteUbergraph_BP_NewSky, CallFunc_GetGameUserSettings_ReturnValue) == 0x0000A0, "Member 'BP_NewSky_C_ExecuteUbergraph_BP_NewSky::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NewSky_C_ExecuteUbergraph_BP_NewSky, CallFunc_GetShadowQuality_ReturnValue) == 0x0000A8, "Member 'BP_NewSky_C_ExecuteUbergraph_BP_NewSky::CallFunc_GetShadowQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NewSky_C_ExecuteUbergraph_BP_NewSky, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000AC, "Member 'BP_NewSky_C_ExecuteUbergraph_BP_NewSky::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_NewSky.BP_NewSky_C.UserConstructionScript
// 0x0094 (0x0094 - 0x0000)
struct BP_NewSky_C_UserConstructionScript final
{
public:
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0000(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NewSky_C_UserConstructionScript) == 0x000004, "Wrong alignment on BP_NewSky_C_UserConstructionScript");
static_assert(sizeof(BP_NewSky_C_UserConstructionScript) == 0x000094, "Wrong size on BP_NewSky_C_UserConstructionScript");
static_assert(offsetof(BP_NewSky_C_UserConstructionScript, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000000, "Member 'BP_NewSky_C_UserConstructionScript::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_NewSky_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000088, "Member 'BP_NewSky_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

}

