#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ObjectiveBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ObjectiveBase.BP_ObjectiveBase_C.ExecuteUbergraph_BP_ObjectiveBase
// 0x0030 (0x0030 - 0x0000)
struct BP_ObjectiveBase_C_ExecuteUbergraph_BP_ObjectiveBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class ABP_ObjectiveBase_C*              Temp_object_Variable;                              // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GameStateBase_C*                    K2Node_DynamicCast_AsBP_Game_State_Base;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ObjectiveBase_C_ExecuteUbergraph_BP_ObjectiveBase) == 0x000008, "Wrong alignment on BP_ObjectiveBase_C_ExecuteUbergraph_BP_ObjectiveBase");
static_assert(sizeof(BP_ObjectiveBase_C_ExecuteUbergraph_BP_ObjectiveBase) == 0x000030, "Wrong size on BP_ObjectiveBase_C_ExecuteUbergraph_BP_ObjectiveBase");
static_assert(offsetof(BP_ObjectiveBase_C_ExecuteUbergraph_BP_ObjectiveBase, EntryPoint) == 0x000000, "Member 'BP_ObjectiveBase_C_ExecuteUbergraph_BP_ObjectiveBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveBase_C_ExecuteUbergraph_BP_ObjectiveBase, Temp_object_Variable) == 0x000008, "Member 'BP_ObjectiveBase_C_ExecuteUbergraph_BP_ObjectiveBase::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveBase_C_ExecuteUbergraph_BP_ObjectiveBase, CallFunc_HasAuthority_ReturnValue) == 0x000010, "Member 'BP_ObjectiveBase_C_ExecuteUbergraph_BP_ObjectiveBase::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveBase_C_ExecuteUbergraph_BP_ObjectiveBase, CallFunc_GetGameState_ReturnValue) == 0x000018, "Member 'BP_ObjectiveBase_C_ExecuteUbergraph_BP_ObjectiveBase::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveBase_C_ExecuteUbergraph_BP_ObjectiveBase, K2Node_DynamicCast_AsBP_Game_State_Base) == 0x000020, "Member 'BP_ObjectiveBase_C_ExecuteUbergraph_BP_ObjectiveBase::K2Node_DynamicCast_AsBP_Game_State_Base' has a wrong offset!");
static_assert(offsetof(BP_ObjectiveBase_C_ExecuteUbergraph_BP_ObjectiveBase, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_ObjectiveBase_C_ExecuteUbergraph_BP_ObjectiveBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

