#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Poison

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_BuffDebuffBase_classes.hpp"
#include "E_Teams_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Poison.BP_Poison_C
// 0x0018 (0x0280 - 0x0268)
class ABP_Poison_C final : public ABP_BuffDebuffBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Poison_C;                        // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Audio;                                             // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Poison(int32 EntryPoint);
	void EndBuff();
	void Refresh();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Poison_C">();
	}
	static class ABP_Poison_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Poison_C>();
	}
};
static_assert(alignof(ABP_Poison_C) == 0x000008, "Wrong alignment on ABP_Poison_C");
static_assert(sizeof(ABP_Poison_C) == 0x000280, "Wrong size on ABP_Poison_C");
static_assert(offsetof(ABP_Poison_C, UberGraphFrame_BP_Poison_C) == 0x000268, "Member 'ABP_Poison_C::UberGraphFrame_BP_Poison_C' has a wrong offset!");
static_assert(offsetof(ABP_Poison_C, Audio) == 0x000270, "Member 'ABP_Poison_C::Audio' has a wrong offset!");
static_assert(offsetof(ABP_Poison_C, ParticleSystem) == 0x000278, "Member 'ABP_Poison_C::ParticleSystem' has a wrong offset!");

}

