#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Poison

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "E_Teams_structs.hpp"
#include "ST_PlayerStats_structs.hpp"


namespace SDK::Params
{

// Function BP_Poison.BP_Poison_C.ExecuteUbergraph_BP_Poison
// 0x00C0 (0x00C0 - 0x0000)
struct BP_Poison_C_ExecuteUbergraph_BP_Poison final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Teams                                       CallFunc_GetPawnData_Team;                         // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPawnData_PlayerIndex;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_PlayerStats                        CallFunc_GetPawnData_PlayerStats;                  // 0x0048(0x0068)(HasGetValueTypeHash)
	class UPawnDataComponent_C*                   CallFunc_GetPawnData_PawnDataComponent;            // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Poison_C_ExecuteUbergraph_BP_Poison) == 0x000008, "Wrong alignment on BP_Poison_C_ExecuteUbergraph_BP_Poison");
static_assert(sizeof(BP_Poison_C_ExecuteUbergraph_BP_Poison) == 0x0000C0, "Wrong size on BP_Poison_C_ExecuteUbergraph_BP_Poison");
static_assert(offsetof(BP_Poison_C_ExecuteUbergraph_BP_Poison, EntryPoint) == 0x000000, "Member 'BP_Poison_C_ExecuteUbergraph_BP_Poison::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Poison_C_ExecuteUbergraph_BP_Poison, K2Node_MakeArray_Array) == 0x000008, "Member 'BP_Poison_C_ExecuteUbergraph_BP_Poison::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Poison_C_ExecuteUbergraph_BP_Poison, CallFunc_HasAuthority_ReturnValue) == 0x000018, "Member 'BP_Poison_C_ExecuteUbergraph_BP_Poison::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Poison_C_ExecuteUbergraph_BP_Poison, Temp_bool_Has_Been_Initd_Variable) == 0x000019, "Member 'BP_Poison_C_ExecuteUbergraph_BP_Poison::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Poison_C_ExecuteUbergraph_BP_Poison, K2Node_Event_DeltaSeconds) == 0x00001C, "Member 'BP_Poison_C_ExecuteUbergraph_BP_Poison::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Poison_C_ExecuteUbergraph_BP_Poison, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_Poison_C_ExecuteUbergraph_BP_Poison::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Poison_C_ExecuteUbergraph_BP_Poison, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'BP_Poison_C_ExecuteUbergraph_BP_Poison::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Poison_C_ExecuteUbergraph_BP_Poison, CallFunc_GetActorUpVector_ReturnValue) == 0x000024, "Member 'BP_Poison_C_ExecuteUbergraph_BP_Poison::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Poison_C_ExecuteUbergraph_BP_Poison, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'BP_Poison_C_ExecuteUbergraph_BP_Poison::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Poison_C_ExecuteUbergraph_BP_Poison, CallFunc_GetPawnData_Team) == 0x00003C, "Member 'BP_Poison_C_ExecuteUbergraph_BP_Poison::CallFunc_GetPawnData_Team' has a wrong offset!");
static_assert(offsetof(BP_Poison_C_ExecuteUbergraph_BP_Poison, CallFunc_GetPawnData_PlayerIndex) == 0x000040, "Member 'BP_Poison_C_ExecuteUbergraph_BP_Poison::CallFunc_GetPawnData_PlayerIndex' has a wrong offset!");
static_assert(offsetof(BP_Poison_C_ExecuteUbergraph_BP_Poison, CallFunc_GetPawnData_PlayerStats) == 0x000048, "Member 'BP_Poison_C_ExecuteUbergraph_BP_Poison::CallFunc_GetPawnData_PlayerStats' has a wrong offset!");
static_assert(offsetof(BP_Poison_C_ExecuteUbergraph_BP_Poison, CallFunc_GetPawnData_PawnDataComponent) == 0x0000B0, "Member 'BP_Poison_C_ExecuteUbergraph_BP_Poison::CallFunc_GetPawnData_PawnDataComponent' has a wrong offset!");
static_assert(offsetof(BP_Poison_C_ExecuteUbergraph_BP_Poison, Temp_bool_IsClosed_Variable) == 0x0000B8, "Member 'BP_Poison_C_ExecuteUbergraph_BP_Poison::Temp_bool_IsClosed_Variable' has a wrong offset!");

// Function BP_Poison.BP_Poison_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Poison_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Poison_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Poison_C_ReceiveTick");
static_assert(sizeof(BP_Poison_C_ReceiveTick) == 0x000004, "Wrong size on BP_Poison_C_ReceiveTick");
static_assert(offsetof(BP_Poison_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Poison_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

