#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Panzer3

#include "Basic.hpp"

#include "E_VehicleSkinThemes_structs.hpp"


namespace SDK::Params
{

// Function BP_Panzer3.BP_Panzer3_C.ExecuteUbergraph_BP_Panzer3
// 0x0088 (0x0088 - 0x0000)
struct BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_VehicleSkinThemes                           Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_3;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_VehicleSkinThemes                           Temp_byte_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable_4;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_5;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_6;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_7;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_67[0x1];                                       // 0x0067(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default_1;                           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3) == 0x000008, "Wrong alignment on BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3");
static_assert(sizeof(BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3) == 0x000088, "Wrong size on BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3");
static_assert(offsetof(BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3, EntryPoint) == 0x000000, "Member 'BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3, Temp_byte_Variable) == 0x000004, "Member 'BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3, Temp_object_Variable) == 0x000008, "Member 'BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3, Temp_object_Variable_1) == 0x000010, "Member 'BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3, Temp_object_Variable_2) == 0x000018, "Member 'BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3, Temp_object_Variable_3) == 0x000020, "Member 'BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3, Temp_byte_Variable_1) == 0x000028, "Member 'BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3, Temp_object_Variable_4) == 0x000030, "Member 'BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3, Temp_object_Variable_5) == 0x000038, "Member 'BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3, Temp_object_Variable_6) == 0x000040, "Member 'BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3, Temp_object_Variable_7) == 0x000048, "Member 'BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3, Temp_int_Array_Index_Variable) == 0x000050, "Member 'BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3, Temp_int_Loop_Counter_Variable) == 0x000054, "Member 'BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3, CallFunc_Array_Length_ReturnValue) == 0x00005C, "Member 'BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3, CallFunc_Array_Length_ReturnValue_1) == 0x000060, "Member 'BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3, CallFunc_Greater_IntInt_ReturnValue) == 0x000064, "Member 'BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000065, "Member 'BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3, CallFunc_BooleanAND_ReturnValue) == 0x000066, "Member 'BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3, CallFunc_Array_Get_Item) == 0x000068, "Member 'BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3, CallFunc_Array_Length_ReturnValue_2) == 0x000070, "Member 'BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3, K2Node_Select_Default) == 0x000078, "Member 'BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3, K2Node_Select_Default_1) == 0x000080, "Member 'BP_Panzer3_C_ExecuteUbergraph_BP_Panzer3::K2Node_Select_Default_1' has a wrong offset!");

}

