#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Skill_PowerShot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_SkillBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Skill_PowerShot.BP_Skill_PowerShot_C
// 0x0020 (0x0270 - 0x0250)
class ABP_Skill_PowerShot_C final : public ABP_SkillBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Skill_PowerShot_C;               // 0x0250(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          CanEnd;                                            // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UM_PiercingShotScreenEffect_C*          HUDEffect;                                         // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Skill_PowerShot(int32 EntryPoint);
	void ReceiveDestroyed();
	void CharacterSet();
	void EndSkill();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Skill_PowerShot_C">();
	}
	static class ABP_Skill_PowerShot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Skill_PowerShot_C>();
	}
};
static_assert(alignof(ABP_Skill_PowerShot_C) == 0x000008, "Wrong alignment on ABP_Skill_PowerShot_C");
static_assert(sizeof(ABP_Skill_PowerShot_C) == 0x000270, "Wrong size on ABP_Skill_PowerShot_C");
static_assert(offsetof(ABP_Skill_PowerShot_C, UberGraphFrame_BP_Skill_PowerShot_C) == 0x000250, "Member 'ABP_Skill_PowerShot_C::UberGraphFrame_BP_Skill_PowerShot_C' has a wrong offset!");
static_assert(offsetof(ABP_Skill_PowerShot_C, ParticleSystem) == 0x000258, "Member 'ABP_Skill_PowerShot_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(ABP_Skill_PowerShot_C, CanEnd) == 0x000260, "Member 'ABP_Skill_PowerShot_C::CanEnd' has a wrong offset!");
static_assert(offsetof(ABP_Skill_PowerShot_C, HUDEffect) == 0x000268, "Member 'ABP_Skill_PowerShot_C::HUDEffect' has a wrong offset!");

}

