#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkillBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_SkillBase.BP_SkillBase_C.ExecuteUbergraph_BP_SkillBase
// 0x0028 (0x0028 - 0x0000)
struct BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPawnControlled_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Amount;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase) == 0x000004, "Wrong alignment on BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase");
static_assert(sizeof(BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase) == 0x000028, "Wrong size on BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase");
static_assert(offsetof(BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase, EntryPoint) == 0x000000, "Member 'BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase, CallFunc_HasAuthority_ReturnValue_1) == 0x000005, "Member 'BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase, CallFunc_HasAuthority_ReturnValue_2) == 0x000006, "Member 'BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase, CallFunc_IsValid_ReturnValue_1) == 0x00000D, "Member 'BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase, K2Node_SwitchEnum_CmpSuccess) == 0x00000E, "Member 'BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase, CallFunc_IsValid_ReturnValue_2) == 0x00000F, "Member 'BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase, CallFunc_IsPawnControlled_ReturnValue) == 0x000010, "Member 'BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase::CallFunc_IsPawnControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase, Temp_bool_Has_Been_Initd_Variable) == 0x000011, "Member 'BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase, CallFunc_Add_FloatFloat_ReturnValue) == 0x000014, "Member 'BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase, Temp_bool_IsClosed_Variable) == 0x000018, "Member 'BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000019, "Member 'BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase, K2Node_CustomEvent_Amount) == 0x00001C, "Member 'BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase::K2Node_CustomEvent_Amount' has a wrong offset!");
static_assert(offsetof(BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000020, "Member 'BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase, CallFunc_FClamp_ReturnValue) == 0x000024, "Member 'BP_SkillBase_C_ExecuteUbergraph_BP_SkillBase::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function BP_SkillBase.BP_SkillBase_C.ReduceSkillDuration
// 0x0004 (0x0004 - 0x0000)
struct BP_SkillBase_C_ReduceSkillDuration final
{
public:
	float                                         Amount;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillBase_C_ReduceSkillDuration) == 0x000004, "Wrong alignment on BP_SkillBase_C_ReduceSkillDuration");
static_assert(sizeof(BP_SkillBase_C_ReduceSkillDuration) == 0x000004, "Wrong size on BP_SkillBase_C_ReduceSkillDuration");
static_assert(offsetof(BP_SkillBase_C_ReduceSkillDuration, Amount) == 0x000000, "Member 'BP_SkillBase_C_ReduceSkillDuration::Amount' has a wrong offset!");

// Function BP_SkillBase.BP_SkillBase_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_SkillBase_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillBase_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_SkillBase_C_ReceiveTick");
static_assert(sizeof(BP_SkillBase_C_ReceiveTick) == 0x000004, "Wrong size on BP_SkillBase_C_ReceiveTick");
static_assert(offsetof(BP_SkillBase_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_SkillBase_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

