#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SpectatorCam

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SpectatorCam.BP_SpectatorCam_C
// 0x0020 (0x02A0 - 0x0280)
class ABP_SpectatorCam_C final : public APawn
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCameraComponent*                       Camera;                                            // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    SpringArm;                                         // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SpectatorCam(int32 EntryPoint);
	void InpAxisKeyEvt_MouseY_K2Node_InputAxisKeyEvent_1(float AxisValue);
	void InpAxisKeyEvt_MouseX_K2Node_InputAxisKeyEvent_0(float AxisValue);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SpectatorCam_C">();
	}
	static class ABP_SpectatorCam_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SpectatorCam_C>();
	}
};
static_assert(alignof(ABP_SpectatorCam_C) == 0x000008, "Wrong alignment on ABP_SpectatorCam_C");
static_assert(sizeof(ABP_SpectatorCam_C) == 0x0002A0, "Wrong size on ABP_SpectatorCam_C");
static_assert(offsetof(ABP_SpectatorCam_C, UberGraphFrame) == 0x000280, "Member 'ABP_SpectatorCam_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_SpectatorCam_C, Camera) == 0x000288, "Member 'ABP_SpectatorCam_C::Camera' has a wrong offset!");
static_assert(offsetof(ABP_SpectatorCam_C, SpringArm) == 0x000290, "Member 'ABP_SpectatorCam_C::SpringArm' has a wrong offset!");
static_assert(offsetof(ABP_SpectatorCam_C, DefaultSceneRoot) == 0x000298, "Member 'ABP_SpectatorCam_C::DefaultSceneRoot' has a wrong offset!");

}

