#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SpotLight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SpotLight.BP_SpotLight_C
// 0x0028 (0x0248 - 0x0220)
class ABP_SpotLight_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USpotLightComponent*                    SpotLight;                                         // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Enabled;                                           // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_SpotLight(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SpotLight_C">();
	}
	static class ABP_SpotLight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SpotLight_C>();
	}
};
static_assert(alignof(ABP_SpotLight_C) == 0x000008, "Wrong alignment on ABP_SpotLight_C");
static_assert(sizeof(ABP_SpotLight_C) == 0x000248, "Wrong size on ABP_SpotLight_C");
static_assert(offsetof(ABP_SpotLight_C, UberGraphFrame) == 0x000220, "Member 'ABP_SpotLight_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_SpotLight_C, SpotLight) == 0x000228, "Member 'ABP_SpotLight_C::SpotLight' has a wrong offset!");
static_assert(offsetof(ABP_SpotLight_C, StaticMesh) == 0x000230, "Member 'ABP_SpotLight_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_SpotLight_C, DefaultSceneRoot) == 0x000238, "Member 'ABP_SpotLight_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_SpotLight_C, Enabled) == 0x000240, "Member 'ABP_SpotLight_C::Enabled' has a wrong offset!");

}

