#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SniperSpot

#include "Basic.hpp"

#include "E_Teams_structs.hpp"


namespace SDK::Params
{

// Function BP_SniperSpot.BP_SniperSpot_C.UserConstructionScript
// 0x0028 (0x0028 - 0x0000)
struct BP_SniperSpot_C_UserConstructionScript final
{
public:
	E_Teams                                       Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SniperSpot_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_SniperSpot_C_UserConstructionScript");
static_assert(sizeof(BP_SniperSpot_C_UserConstructionScript) == 0x000028, "Wrong size on BP_SniperSpot_C_UserConstructionScript");
static_assert(offsetof(BP_SniperSpot_C_UserConstructionScript, Temp_byte_Variable) == 0x000000, "Member 'BP_SniperSpot_C_UserConstructionScript::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_SniperSpot_C_UserConstructionScript, Temp_object_Variable) == 0x000008, "Member 'BP_SniperSpot_C_UserConstructionScript::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_SniperSpot_C_UserConstructionScript, Temp_object_Variable_1) == 0x000010, "Member 'BP_SniperSpot_C_UserConstructionScript::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SniperSpot_C_UserConstructionScript, Temp_object_Variable_2) == 0x000018, "Member 'BP_SniperSpot_C_UserConstructionScript::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_SniperSpot_C_UserConstructionScript, K2Node_Select_Default) == 0x000020, "Member 'BP_SniperSpot_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");

}

