#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SimpleProjectilebase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "E_Teams_structs.hpp"
#include "ST_PlayerStats_structs.hpp"
#include "ST_Unlockable_structs.hpp"


namespace SDK::Params
{

// Function BP_SimpleProjectilebase.BP_SimpleProjectilebase_C.ExecuteUbergraph_BP_SimpleProjectilebase
// 0x0968 (0x0968 - 0x0000)
struct BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Character_C*                        K2Node_DynamicCast_AsBP_Character;                 // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0094(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingle_OutHit;                 // 0x0144(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingle_ReturnValue;            // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CD[0x3];                                      // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x01E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F5[0x3];                                      // 0x01F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x01F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0208(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0218(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0224(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_2;      // 0x0230(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_1;     // 0x023C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_1;        // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C5[0x3];                                      // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x02C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x02D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SkinIndex;                      // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x02E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_Unlockable                         CallFunc_GetCosmeticItemStruct_Item;               // 0x02F0(0x0148)(HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0438(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x04C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x04C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C3[0x1];                                      // 0x04C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x04C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x04CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x04D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x04E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x04F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FC[0x4];                                      // 0x04FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0510(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0520(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x0524(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0528(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x052C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0538(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_2;     // 0x0544(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_2;        // 0x05CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5CD[0x3];                                      // 0x05CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Character_C*                        K2Node_CustomEvent_Character;                      // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x05D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x05E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x05E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x05EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x05F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x05FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Teams                                       CallFunc_GetPawnData_Team;                         // 0x0608(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_609[0x3];                                      // 0x0609(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPawnData_PlayerIndex;                  // 0x060C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_PlayerStats                        CallFunc_GetPawnData_PlayerStats;                  // 0x0610(0x0068)(HasGetValueTypeHash)
	class UPawnDataComponent_C*                   CallFunc_GetPawnData_PawnDataComponent;            // 0x0678(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0680(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_3;     // 0x068C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_3;        // 0x0714(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_2;            // 0x0715(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_2;         // 0x0716(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_717[0x1];                                      // 0x0717(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_2;                    // 0x0718(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_2;                // 0x071C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_2;                // 0x0720(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_2;             // 0x072C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_2;                  // 0x0738(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_2;            // 0x0744(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_2;                 // 0x0750(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_2;                // 0x0758(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_2;            // 0x0760(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_2;             // 0x0768(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_2;                 // 0x0770(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_2;            // 0x0774(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_2;               // 0x0778(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_2;              // 0x077C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_2;                // 0x0788(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_3;            // 0x0794(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_3;         // 0x0795(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_796[0x2];                                      // 0x0796(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_3;                    // 0x0798(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_3;                // 0x079C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_3;                // 0x07A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_3;             // 0x07AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_3;                  // 0x07B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_3;            // 0x07C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_3;                 // 0x07D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_3;                // 0x07D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_3;            // 0x07E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_3;             // 0x07E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_3;                 // 0x07F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_3;            // 0x07F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_3;               // 0x07F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_3;              // 0x07FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_3;                // 0x0808(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_814[0x4];                                      // 0x0814(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Character_C*                        K2Node_DynamicCast_AsBP_Character_1;               // 0x0818(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0820(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_821[0x7];                                      // 0x0821(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0828(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0830(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_Teams                                       CallFunc_GetPawnData_Team_1;                       // 0x0831(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_832[0x2];                                      // 0x0832(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPawnData_PlayerIndex_1;                // 0x0834(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_PlayerStats                        CallFunc_GetPawnData_PlayerStats_1;                // 0x0838(0x0068)(HasGetValueTypeHash)
	class UPawnDataComponent_C*                   CallFunc_GetPawnData_PawnDataComponent_1;          // 0x08A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x08A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_4;            // 0x08A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_4;         // 0x08AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8AB[0x1];                                      // 0x08AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_4;                    // 0x08AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_4;                // 0x08B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_4;                // 0x08B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_4;             // 0x08C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_4;                  // 0x08CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_4;            // 0x08D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E4[0x4];                                      // 0x08E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_4;                 // 0x08E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_4;                // 0x08F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_4;            // 0x08F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_4;             // 0x0900(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_4;                 // 0x0908(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_4;            // 0x090C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_4;               // 0x0910(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_4;              // 0x0914(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_4;                // 0x0920(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92C[0x4];                                      // 0x092C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0930(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Character_C*                        K2Node_DynamicCast_AsBP_Character_2;               // 0x0938(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0940(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_941[0x3];                                      // 0x0941(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0944(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0948(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x094C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0950(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0951(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_952[0x2];                                      // 0x0952(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0954(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_Select_Default_1;                           // 0x0958(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0960(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase) == 0x000008, "Wrong alignment on BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase");
static_assert(sizeof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase) == 0x000968, "Wrong size on BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, EntryPoint) == 0x000000, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_bBlockingHit) == 0x000004, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_bInitialOverlap) == 0x000005, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_Time) == 0x000008, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_Distance) == 0x00000C, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_Location) == 0x000010, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_ImpactPoint) == 0x00001C, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_Normal) == 0x000028, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_ImpactNormal) == 0x000034, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_PhysMat) == 0x000040, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_HitActor) == 0x000048, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_HitComponent) == 0x000050, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_HitBoneName) == 0x000058, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_HitItem) == 0x000060, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_ElementIndex) == 0x000064, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_FaceIndex) == 0x000068, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_TraceStart) == 0x00006C, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_TraceEnd) == 0x000078, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, K2Node_DynamicCast_AsBP_Character) == 0x000088, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::K2Node_DynamicCast_AsBP_Character' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000094, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_K2_SetActorLocation_ReturnValue) == 0x00011C, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000120, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00012C, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000138, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_SphereTraceSingle_OutHit) == 0x000144, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_SphereTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_SphereTraceSingle_ReturnValue) == 0x0001CC, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_SphereTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0001D0, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0001DC, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0001E8, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_K2_SetActorRotation_ReturnValue) == 0x0001F4, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x0001F8, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, K2Node_MakeArray_Array) == 0x000208, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_MakeVector_ReturnValue) == 0x000218, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000224, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_Subtract_VectorVector_ReturnValue_2) == 0x000230, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_Subtract_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_K2_SetActorLocation_SweepHitResult_1) == 0x00023C, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_K2_SetActorLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_K2_SetActorLocation_ReturnValue_1) == 0x0002C4, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_K2_SetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_Normal_ReturnValue) == 0x0002C8, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0002D4, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, K2Node_CustomEvent_SkinIndex) == 0x0002E0, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::K2Node_CustomEvent_SkinIndex' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_Add_VectorVector_ReturnValue) == 0x0002E4, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_GetCosmeticItemStruct_Item) == 0x0002F0, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_GetCosmeticItemStruct_Item' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000438, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x0004C0, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_bBlockingHit_1) == 0x0004C1, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x0004C2, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_Time_1) == 0x0004C4, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_Distance_1) == 0x0004C8, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_Location_1) == 0x0004CC, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_ImpactPoint_1) == 0x0004D8, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_Normal_1) == 0x0004E4, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_ImpactNormal_1) == 0x0004F0, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_PhysMat_1) == 0x000500, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_HitActor_1) == 0x000508, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_HitComponent_1) == 0x000510, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_HitBoneName_1) == 0x000518, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_HitItem_1) == 0x000520, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_ElementIndex_1) == 0x000524, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_FaceIndex_1) == 0x000528, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_TraceStart_1) == 0x00052C, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_TraceEnd_1) == 0x000538, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_K2_SetActorLocation_SweepHitResult_2) == 0x000544, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_K2_SetActorLocation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_K2_SetActorLocation_ReturnValue_2) == 0x0005CC, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_K2_SetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, K2Node_CustomEvent_Character) == 0x0005D0, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, K2Node_CustomEvent_HitLocation) == 0x0005D8, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0005E4, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0005E8, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0005EC, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_Add_FloatFloat_ReturnValue) == 0x0005F8, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_K2_GetActorLocation_ReturnValue_5) == 0x0005FC, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_K2_GetActorLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_GetPawnData_Team) == 0x000608, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_GetPawnData_Team' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_GetPawnData_PlayerIndex) == 0x00060C, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_GetPawnData_PlayerIndex' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_GetPawnData_PlayerStats) == 0x000610, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_GetPawnData_PlayerStats' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_GetPawnData_PawnDataComponent) == 0x000678, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_GetPawnData_PawnDataComponent' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000680, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_K2_SetActorLocation_SweepHitResult_3) == 0x00068C, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_K2_SetActorLocation_SweepHitResult_3' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_K2_SetActorLocation_ReturnValue_3) == 0x000714, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_K2_SetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_bBlockingHit_2) == 0x000715, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_bBlockingHit_2' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_bInitialOverlap_2) == 0x000716, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_bInitialOverlap_2' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_Time_2) == 0x000718, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_Time_2' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_Distance_2) == 0x00071C, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_Distance_2' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_Location_2) == 0x000720, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_Location_2' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_ImpactPoint_2) == 0x00072C, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_ImpactPoint_2' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_Normal_2) == 0x000738, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_Normal_2' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_ImpactNormal_2) == 0x000744, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_ImpactNormal_2' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_PhysMat_2) == 0x000750, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_PhysMat_2' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_HitActor_2) == 0x000758, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_HitActor_2' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_HitComponent_2) == 0x000760, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_HitComponent_2' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_HitBoneName_2) == 0x000768, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_HitBoneName_2' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_HitItem_2) == 0x000770, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_HitItem_2' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_ElementIndex_2) == 0x000774, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_ElementIndex_2' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_FaceIndex_2) == 0x000778, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_FaceIndex_2' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_TraceStart_2) == 0x00077C, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_TraceStart_2' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_TraceEnd_2) == 0x000788, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_TraceEnd_2' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_bBlockingHit_3) == 0x000794, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_bBlockingHit_3' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_bInitialOverlap_3) == 0x000795, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_bInitialOverlap_3' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_Time_3) == 0x000798, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_Time_3' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_Distance_3) == 0x00079C, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_Distance_3' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_Location_3) == 0x0007A0, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_Location_3' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_ImpactPoint_3) == 0x0007AC, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_ImpactPoint_3' has a wrong offset!");
static_assert(offsetof(BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase, CallFunc_BreakHitResult_Normal_3) == 0x0007B8, "Member 'BP_SimpleProjectilebase_C_ExecuteUbergraph_BP_SimpleProjectilebase::CallFunc_BreakHitResult_Normal_3' has a wrong offset!");
