#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Skill_BurningBullets

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Skill_BurningBullets.BP_Skill_BurningBullets_C.ExecuteUbergraph_BP_Skill_BurningBullets
// 0x0018 (0x0018 - 0x0000)
struct BP_Skill_BurningBullets_C_ExecuteUbergraph_BP_Skill_BurningBullets final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Skill_BurningBullets_C_ExecuteUbergraph_BP_Skill_BurningBullets) == 0x000008, "Wrong alignment on BP_Skill_BurningBullets_C_ExecuteUbergraph_BP_Skill_BurningBullets");
static_assert(sizeof(BP_Skill_BurningBullets_C_ExecuteUbergraph_BP_Skill_BurningBullets) == 0x000018, "Wrong size on BP_Skill_BurningBullets_C_ExecuteUbergraph_BP_Skill_BurningBullets");
static_assert(offsetof(BP_Skill_BurningBullets_C_ExecuteUbergraph_BP_Skill_BurningBullets, EntryPoint) == 0x000000, "Member 'BP_Skill_BurningBullets_C_ExecuteUbergraph_BP_Skill_BurningBullets::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Skill_BurningBullets_C_ExecuteUbergraph_BP_Skill_BurningBullets, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000008, "Member 'BP_Skill_BurningBullets_C_ExecuteUbergraph_BP_Skill_BurningBullets::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_BurningBullets_C_ExecuteUbergraph_BP_Skill_BurningBullets, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_Skill_BurningBullets_C_ExecuteUbergraph_BP_Skill_BurningBullets::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_BurningBullets_C_ExecuteUbergraph_BP_Skill_BurningBullets, CallFunc_HasAuthority_ReturnValue) == 0x000011, "Member 'BP_Skill_BurningBullets_C_ExecuteUbergraph_BP_Skill_BurningBullets::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

}

