#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Skill_Shield

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_SkillBase_classes.hpp"
#include "E_Units_structs.hpp"
#include "E_Teams_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Skill_Shield.BP_Skill_Shield_C
// 0x0028 (0x0278 - 0x0250)
class ABP_Skill_Shield_C final : public ABP_SkillBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Skill_Shield_C;                  // 0x0250(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class AActor*>                         ShieldedCharacters;                                // 0x0258(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class ABP_BuffDebuffBase_C*>           Shields;                                           // 0x0268(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_Skill_Shield(int32 EntryPoint);
	void OwnShieldDestroyed();
	void CheckIfPlayerIsAlreadyShielded(class ABP_Character_C* Character_0, bool* AlreadyShielded, class ABP_Shield_C** AsBP_Shield);
	void EndSkill();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Skill_Shield_C">();
	}
	static class ABP_Skill_Shield_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Skill_Shield_C>();
	}
};
static_assert(alignof(ABP_Skill_Shield_C) == 0x000008, "Wrong alignment on ABP_Skill_Shield_C");
static_assert(sizeof(ABP_Skill_Shield_C) == 0x000278, "Wrong size on ABP_Skill_Shield_C");
static_assert(offsetof(ABP_Skill_Shield_C, UberGraphFrame_BP_Skill_Shield_C) == 0x000250, "Member 'ABP_Skill_Shield_C::UberGraphFrame_BP_Skill_Shield_C' has a wrong offset!");
static_assert(offsetof(ABP_Skill_Shield_C, ShieldedCharacters) == 0x000258, "Member 'ABP_Skill_Shield_C::ShieldedCharacters' has a wrong offset!");
static_assert(offsetof(ABP_Skill_Shield_C, Shields) == 0x000268, "Member 'ABP_Skill_Shield_C::Shields' has a wrong offset!");

}

