#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Sherman

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_TankBase_classes.hpp"
#include "E_VehicleSkinThemes_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Sherman.BP_Sherman_C
// 0x00B0 (0x0740 - 0x0690)
class ABP_Sherman_C final : public ABP_TankBase_C
{
public:
	uint8                                         Pad_684[0x4];                                      // 0x0684(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Sherman_C;                       // 0x0688(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh21;                                      // 0x0690(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh20;                                      // 0x0698(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh19;                                      // 0x06A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh18;                                      // 0x06A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh17;                                      // 0x06B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh16;                                      // 0x06B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh15;                                      // 0x06C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh14;                                      // 0x06C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh13;                                      // 0x06D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh12;                                      // 0x06D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh11;                                      // 0x06E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh10;                                      // 0x06E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh9;                                       // 0x06F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh8;                                       // 0x06F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh7;                                       // 0x0700(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh6;                                       // 0x0708(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh5;                                       // 0x0710(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh4;                                       // 0x0718(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh3;                                       // 0x0720(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x0728(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0730(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh_0;                                      // 0x0738(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Sherman(int32 EntryPoint);
	void InitVehicleThemeSkin();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Sherman_C">();
	}
	static class ABP_Sherman_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Sherman_C>();
	}
};
static_assert(alignof(ABP_Sherman_C) == 0x000010, "Wrong alignment on ABP_Sherman_C");
static_assert(sizeof(ABP_Sherman_C) == 0x000740, "Wrong size on ABP_Sherman_C");
static_assert(offsetof(ABP_Sherman_C, UberGraphFrame_BP_Sherman_C) == 0x000688, "Member 'ABP_Sherman_C::UberGraphFrame_BP_Sherman_C' has a wrong offset!");
static_assert(offsetof(ABP_Sherman_C, StaticMesh21) == 0x000690, "Member 'ABP_Sherman_C::StaticMesh21' has a wrong offset!");
static_assert(offsetof(ABP_Sherman_C, StaticMesh20) == 0x000698, "Member 'ABP_Sherman_C::StaticMesh20' has a wrong offset!");
static_assert(offsetof(ABP_Sherman_C, StaticMesh19) == 0x0006A0, "Member 'ABP_Sherman_C::StaticMesh19' has a wrong offset!");
static_assert(offsetof(ABP_Sherman_C, StaticMesh18) == 0x0006A8, "Member 'ABP_Sherman_C::StaticMesh18' has a wrong offset!");
static_assert(offsetof(ABP_Sherman_C, StaticMesh17) == 0x0006B0, "Member 'ABP_Sherman_C::StaticMesh17' has a wrong offset!");
static_assert(offsetof(ABP_Sherman_C, StaticMesh16) == 0x0006B8, "Member 'ABP_Sherman_C::StaticMesh16' has a wrong offset!");
static_assert(offsetof(ABP_Sherman_C, StaticMesh15) == 0x0006C0, "Member 'ABP_Sherman_C::StaticMesh15' has a wrong offset!");
static_assert(offsetof(ABP_Sherman_C, StaticMesh14) == 0x0006C8, "Member 'ABP_Sherman_C::StaticMesh14' has a wrong offset!");
static_assert(offsetof(ABP_Sherman_C, StaticMesh13) == 0x0006D0, "Member 'ABP_Sherman_C::StaticMesh13' has a wrong offset!");
static_assert(offsetof(ABP_Sherman_C, StaticMesh12) == 0x0006D8, "Member 'ABP_Sherman_C::StaticMesh12' has a wrong offset!");
static_assert(offsetof(ABP_Sherman_C, StaticMesh11) == 0x0006E0, "Member 'ABP_Sherman_C::StaticMesh11' has a wrong offset!");
static_assert(offsetof(ABP_Sherman_C, StaticMesh10) == 0x0006E8, "Member 'ABP_Sherman_C::StaticMesh10' has a wrong offset!");
static_assert(offsetof(ABP_Sherman_C, StaticMesh9) == 0x0006F0, "Member 'ABP_Sherman_C::StaticMesh9' has a wrong offset!");
static_assert(offsetof(ABP_Sherman_C, StaticMesh8) == 0x0006F8, "Member 'ABP_Sherman_C::StaticMesh8' has a wrong offset!");
static_assert(offsetof(ABP_Sherman_C, StaticMesh7) == 0x000700, "Member 'ABP_Sherman_C::StaticMesh7' has a wrong offset!");
static_assert(offsetof(ABP_Sherman_C, StaticMesh6) == 0x000708, "Member 'ABP_Sherman_C::StaticMesh6' has a wrong offset!");
static_assert(offsetof(ABP_Sherman_C, StaticMesh5) == 0x000710, "Member 'ABP_Sherman_C::StaticMesh5' has a wrong offset!");
static_assert(offsetof(ABP_Sherman_C, StaticMesh4) == 0x000718, "Member 'ABP_Sherman_C::StaticMesh4' has a wrong offset!");
static_assert(offsetof(ABP_Sherman_C, StaticMesh3) == 0x000720, "Member 'ABP_Sherman_C::StaticMesh3' has a wrong offset!");
static_assert(offsetof(ABP_Sherman_C, StaticMesh2) == 0x000728, "Member 'ABP_Sherman_C::StaticMesh2' has a wrong offset!");
static_assert(offsetof(ABP_Sherman_C, StaticMesh1) == 0x000730, "Member 'ABP_Sherman_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(ABP_Sherman_C, StaticMesh_0) == 0x000738, "Member 'ABP_Sherman_C::StaticMesh_0' has a wrong offset!");

}

