#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Skill_Heal

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Skill_Heal.BP_Skill_Heal_C.ExecuteUbergraph_BP_Skill_Heal
// 0x0200 (0x0200 - 0x0000)
struct BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0018(0x0010)(ConstParm, ReferenceParm)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHitResult>                     CallFunc_SphereTraceMulti_OutHits;                 // 0x0058(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceMulti_ReturnValue;             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x006C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x2];                                       // 0x00FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Character_C*                        K2Node_DynamicCast_AsBP_Character;                 // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Character_C*                        K2Node_DynamicCast_AsBP_Character_1;               // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BB[0x1];                                      // 0x01BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C2[0x2];                                      // 0x01C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x01DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F5[0x3];                                      // 0x01F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal) == 0x000008, "Wrong alignment on BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal");
static_assert(sizeof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal) == 0x000200, "Wrong size on BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, EntryPoint) == 0x000000, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, Temp_object_Variable) == 0x000018, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, K2Node_Event_OtherActor) == 0x000028, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000040, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_Add_VectorVector_ReturnValue) == 0x000048, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_SphereTraceMulti_OutHits) == 0x000058, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_SphereTraceMulti_OutHits' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_SphereTraceMulti_ReturnValue) == 0x000068, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_SphereTraceMulti_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_Array_Get_Item) == 0x00006C, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_Array_Length_ReturnValue) == 0x0000F4, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_BreakHitResult_bBlockingHit) == 0x0000F8, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000F9, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_BreakHitResult_Time) == 0x0000FC, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_BreakHitResult_Distance) == 0x000100, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_BreakHitResult_Location) == 0x000104, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_BreakHitResult_ImpactPoint) == 0x000110, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_BreakHitResult_Normal) == 0x00011C, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_BreakHitResult_ImpactNormal) == 0x000128, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_BreakHitResult_PhysMat) == 0x000138, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_BreakHitResult_HitActor) == 0x000140, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_BreakHitResult_HitComponent) == 0x000148, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_BreakHitResult_HitBoneName) == 0x000150, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_BreakHitResult_HitItem) == 0x000158, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_BreakHitResult_ElementIndex) == 0x00015C, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_BreakHitResult_FaceIndex) == 0x000160, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_BreakHitResult_TraceStart) == 0x000164, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_BreakHitResult_TraceEnd) == 0x000170, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, K2Node_DynamicCast_AsBP_Character) == 0x000180, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::K2Node_DynamicCast_AsBP_Character' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, K2Node_DynamicCast_bSuccess) == 0x000188, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_Array_AddUnique_ReturnValue) == 0x00018C, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_Array_Contains_ReturnValue) == 0x000190, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000194, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0001A0, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_Array_Get_Item_1) == 0x0001A8, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, K2Node_DynamicCast_AsBP_Character_1) == 0x0001B0, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::K2Node_DynamicCast_AsBP_Character_1' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, K2Node_DynamicCast_bSuccess_1) == 0x0001B8, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001B9, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0001BA, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_Array_Length_ReturnValue_1) == 0x0001BC, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_Less_IntInt_ReturnValue) == 0x0001C0, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001C1, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_Array_Length_ReturnValue_2) == 0x0001C4, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_HasAuthority_ReturnValue_1) == 0x0001C8, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0001CC, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_MapRangeClamped_ReturnValue) == 0x0001D0, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_FTrunc_ReturnValue) == 0x0001D4, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_SelectInt_ReturnValue) == 0x0001D8, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0001DC, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0001E8, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, Temp_int_Loop_Counter_Variable_1) == 0x0001F0, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_Less_IntInt_ReturnValue_2) == 0x0001F4, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001F8, "Member 'BP_Skill_Heal_C_ExecuteUbergraph_BP_Skill_Heal::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_Skill_Heal.BP_Skill_Heal_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_Skill_Heal_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Skill_Heal_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on BP_Skill_Heal_C_ReceiveActorBeginOverlap");
static_assert(sizeof(BP_Skill_Heal_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on BP_Skill_Heal_C_ReceiveActorBeginOverlap");
static_assert(offsetof(BP_Skill_Heal_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'BP_Skill_Heal_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

}

