#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ThrowableProjectileBase

#include "Basic.hpp"

#include "E_Teams_structs.hpp"
#include "ST_PlayerStats_structs.hpp"


namespace SDK::Params
{

// Function BP_ThrowableProjectileBase.BP_ThrowableProjectileBase_C.ExecuteUbergraph_BP_ThrowableProjectileBase
// 0x0088 (0x0088 - 0x0000)
struct BP_ThrowableProjectileBase_C_ExecuteUbergraph_BP_ThrowableProjectileBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Teams                                       CallFunc_GetPawnData_Team;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPawnData_PlayerIndex;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_PlayerStats                        CallFunc_GetPawnData_PlayerStats;                  // 0x0010(0x0068)(HasGetValueTypeHash)
	class UPawnDataComponent_C*                   CallFunc_GetPawnData_PawnDataComponent;            // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ThrowableProjectileBase_C_ExecuteUbergraph_BP_ThrowableProjectileBase) == 0x000008, "Wrong alignment on BP_ThrowableProjectileBase_C_ExecuteUbergraph_BP_ThrowableProjectileBase");
static_assert(sizeof(BP_ThrowableProjectileBase_C_ExecuteUbergraph_BP_ThrowableProjectileBase) == 0x000088, "Wrong size on BP_ThrowableProjectileBase_C_ExecuteUbergraph_BP_ThrowableProjectileBase");
static_assert(offsetof(BP_ThrowableProjectileBase_C_ExecuteUbergraph_BP_ThrowableProjectileBase, EntryPoint) == 0x000000, "Member 'BP_ThrowableProjectileBase_C_ExecuteUbergraph_BP_ThrowableProjectileBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ThrowableProjectileBase_C_ExecuteUbergraph_BP_ThrowableProjectileBase, CallFunc_GetPawnData_Team) == 0x000004, "Member 'BP_ThrowableProjectileBase_C_ExecuteUbergraph_BP_ThrowableProjectileBase::CallFunc_GetPawnData_Team' has a wrong offset!");
static_assert(offsetof(BP_ThrowableProjectileBase_C_ExecuteUbergraph_BP_ThrowableProjectileBase, CallFunc_GetPawnData_PlayerIndex) == 0x000008, "Member 'BP_ThrowableProjectileBase_C_ExecuteUbergraph_BP_ThrowableProjectileBase::CallFunc_GetPawnData_PlayerIndex' has a wrong offset!");
static_assert(offsetof(BP_ThrowableProjectileBase_C_ExecuteUbergraph_BP_ThrowableProjectileBase, CallFunc_GetPawnData_PlayerStats) == 0x000010, "Member 'BP_ThrowableProjectileBase_C_ExecuteUbergraph_BP_ThrowableProjectileBase::CallFunc_GetPawnData_PlayerStats' has a wrong offset!");
static_assert(offsetof(BP_ThrowableProjectileBase_C_ExecuteUbergraph_BP_ThrowableProjectileBase, CallFunc_GetPawnData_PawnDataComponent) == 0x000078, "Member 'BP_ThrowableProjectileBase_C_ExecuteUbergraph_BP_ThrowableProjectileBase::CallFunc_GetPawnData_PawnDataComponent' has a wrong offset!");
static_assert(offsetof(BP_ThrowableProjectileBase_C_ExecuteUbergraph_BP_ThrowableProjectileBase, CallFunc_HasAuthority_ReturnValue) == 0x000080, "Member 'BP_ThrowableProjectileBase_C_ExecuteUbergraph_BP_ThrowableProjectileBase::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowableProjectileBase_C_ExecuteUbergraph_BP_ThrowableProjectileBase, K2Node_Event_DeltaSeconds) == 0x000084, "Member 'BP_ThrowableProjectileBase_C_ExecuteUbergraph_BP_ThrowableProjectileBase::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_ThrowableProjectileBase.BP_ThrowableProjectileBase_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ThrowableProjectileBase_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds_0;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ThrowableProjectileBase_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ThrowableProjectileBase_C_ReceiveTick");
static_assert(sizeof(BP_ThrowableProjectileBase_C_ReceiveTick) == 0x000004, "Wrong size on BP_ThrowableProjectileBase_C_ReceiveTick");
static_assert(offsetof(BP_ThrowableProjectileBase_C_ReceiveTick, DeltaSeconds_0) == 0x000000, "Member 'BP_ThrowableProjectileBase_C_ReceiveTick::DeltaSeconds_0' has a wrong offset!");

// Function BP_ThrowableProjectileBase.BP_ThrowableProjectileBase_C.OnRep_ThrowableTeam
// 0x0018 (0x0018 - 0x0000)
struct BP_ThrowableProjectileBase_C_OnRep_ThrowableTeam final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Controller_C*                       K2Node_DynamicCast_AsBP_Controller;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocalPlayerController_ReturnValue;      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ThrowableProjectileBase_C_OnRep_ThrowableTeam) == 0x000008, "Wrong alignment on BP_ThrowableProjectileBase_C_OnRep_ThrowableTeam");
static_assert(sizeof(BP_ThrowableProjectileBase_C_OnRep_ThrowableTeam) == 0x000018, "Wrong size on BP_ThrowableProjectileBase_C_OnRep_ThrowableTeam");
static_assert(offsetof(BP_ThrowableProjectileBase_C_OnRep_ThrowableTeam, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'BP_ThrowableProjectileBase_C_OnRep_ThrowableTeam::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowableProjectileBase_C_OnRep_ThrowableTeam, K2Node_DynamicCast_AsBP_Controller) == 0x000008, "Member 'BP_ThrowableProjectileBase_C_OnRep_ThrowableTeam::K2Node_DynamicCast_AsBP_Controller' has a wrong offset!");
static_assert(offsetof(BP_ThrowableProjectileBase_C_OnRep_ThrowableTeam, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_ThrowableProjectileBase_C_OnRep_ThrowableTeam::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ThrowableProjectileBase_C_OnRep_ThrowableTeam, CallFunc_IsLocalPlayerController_ReturnValue) == 0x000011, "Member 'BP_ThrowableProjectileBase_C_OnRep_ThrowableTeam::CallFunc_IsLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowableProjectileBase_C_OnRep_ThrowableTeam, CallFunc_IsValid_ReturnValue) == 0x000012, "Member 'BP_ThrowableProjectileBase_C_OnRep_ThrowableTeam::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowableProjectileBase_C_OnRep_ThrowableTeam, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000013, "Member 'BP_ThrowableProjectileBase_C_OnRep_ThrowableTeam::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowableProjectileBase_C_OnRep_ThrowableTeam, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000014, "Member 'BP_ThrowableProjectileBase_C_OnRep_ThrowableTeam::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

}

