#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ThrowableProjectileBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_Teams_structs.hpp"
#include "BP_ProjectileBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ThrowableProjectileBase.BP_ThrowableProjectileBase_C
// 0x0010 (0x0570 - 0x0560)
class ABP_ThrowableProjectileBase_C : public ABP_ProjectileBase_C
{
public:
	uint8                                         Pad_554[0x4];                                      // 0x0554(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_ThrowableProjectileBase_C;       // 0x0558(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_ThrowableIndicatorEffect;                        // 0x0560(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	E_Teams                                       ThrowableTeam;                                     // 0x0568(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ThrowableProjectileBase(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds_0);
	void ReceiveBeginPlay();
	void OnRep_ThrowableTeam();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ThrowableProjectileBase_C">();
	}
	static class ABP_ThrowableProjectileBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ThrowableProjectileBase_C>();
	}
};
static_assert(alignof(ABP_ThrowableProjectileBase_C) == 0x000010, "Wrong alignment on ABP_ThrowableProjectileBase_C");
static_assert(sizeof(ABP_ThrowableProjectileBase_C) == 0x000570, "Wrong size on ABP_ThrowableProjectileBase_C");
static_assert(offsetof(ABP_ThrowableProjectileBase_C, UberGraphFrame_BP_ThrowableProjectileBase_C) == 0x000558, "Member 'ABP_ThrowableProjectileBase_C::UberGraphFrame_BP_ThrowableProjectileBase_C' has a wrong offset!");
static_assert(offsetof(ABP_ThrowableProjectileBase_C, P_ThrowableIndicatorEffect) == 0x000560, "Member 'ABP_ThrowableProjectileBase_C::P_ThrowableIndicatorEffect' has a wrong offset!");
static_assert(offsetof(ABP_ThrowableProjectileBase_C, ThrowableTeam) == 0x000568, "Member 'ABP_ThrowableProjectileBase_C::ThrowableTeam' has a wrong offset!");

}

