#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Username

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "E_Teams_structs.hpp"
#include "ST_PlayerStats_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Username.BP_Username_C.ExecuteUbergraph_BP_Username
// 0x01C0 (0x01C0 - 0x0000)
struct BP_Username_C_ExecuteUbergraph_BP_Username final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocalPlayerController_ReturnValue;      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Controller_C*                       K2Node_DynamicCast_AsBP_Controller;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerState_C*                      K2Node_DynamicCast_AsBP_Player_State;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_Username_C*                          K2Node_DynamicCast_AsW_Username;                   // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue_1;        // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Username_C*                          K2Node_DynamicCast_AsW_Username_1;                 // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_Teams                                       CallFunc_GetPawnData_Team;                         // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPawnData_PlayerIndex;                  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_PlayerStats                        CallFunc_GetPawnData_PlayerStats;                  // 0x0080(0x0068)(HasGetValueTypeHash)
	class UPawnDataComponent_C*                   CallFunc_GetPawnData_PawnDataComponent;            // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Character_C*                        K2Node_DynamicCast_AsBP_Character;                 // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Character_C*                        K2Node_DynamicCast_AsBP_Character_1;               // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_112[0x2];                                      // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetTruePawnLocation_PawnLocation;         // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0128(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B2[0x2];                                      // 0x01B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Username_C_ExecuteUbergraph_BP_Username) == 0x000008, "Wrong alignment on BP_Username_C_ExecuteUbergraph_BP_Username");
static_assert(sizeof(BP_Username_C_ExecuteUbergraph_BP_Username) == 0x0001C0, "Wrong size on BP_Username_C_ExecuteUbergraph_BP_Username");
static_assert(offsetof(BP_Username_C_ExecuteUbergraph_BP_Username, EntryPoint) == 0x000000, "Member 'BP_Username_C_ExecuteUbergraph_BP_Username::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Username_C_ExecuteUbergraph_BP_Username, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_Username_C_ExecuteUbergraph_BP_Username::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Username_C_ExecuteUbergraph_BP_Username, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_Username_C_ExecuteUbergraph_BP_Username::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Username_C_ExecuteUbergraph_BP_Username, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_Username_C_ExecuteUbergraph_BP_Username::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Username_C_ExecuteUbergraph_BP_Username, CallFunc_IsLocalPlayerController_ReturnValue) == 0x000011, "Member 'BP_Username_C_ExecuteUbergraph_BP_Username::CallFunc_IsLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Username_C_ExecuteUbergraph_BP_Username, K2Node_DynamicCast_AsBP_Controller) == 0x000018, "Member 'BP_Username_C_ExecuteUbergraph_BP_Username::K2Node_DynamicCast_AsBP_Controller' has a wrong offset!");
static_assert(offsetof(BP_Username_C_ExecuteUbergraph_BP_Username, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_Username_C_ExecuteUbergraph_BP_Username::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Username_C_ExecuteUbergraph_BP_Username, K2Node_DynamicCast_AsBP_Player_State) == 0x000028, "Member 'BP_Username_C_ExecuteUbergraph_BP_Username::K2Node_DynamicCast_AsBP_Player_State' has a wrong offset!");
static_assert(offsetof(BP_Username_C_ExecuteUbergraph_BP_Username, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BP_Username_C_ExecuteUbergraph_BP_Username::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Username_C_ExecuteUbergraph_BP_Username, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000038, "Member 'BP_Username_C_ExecuteUbergraph_BP_Username::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Username_C_ExecuteUbergraph_BP_Username, K2Node_DynamicCast_AsW_Username) == 0x000040, "Member 'BP_Username_C_ExecuteUbergraph_BP_Username::K2Node_DynamicCast_AsW_Username' has a wrong offset!");
static_assert(offsetof(BP_Username_C_ExecuteUbergraph_BP_Username, K2Node_DynamicCast_bSuccess_2) == 0x000048, "Member 'BP_Username_C_ExecuteUbergraph_BP_Username::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Username_C_ExecuteUbergraph_BP_Username, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000050, "Member 'BP_Username_C_ExecuteUbergraph_BP_Username::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Username_C_ExecuteUbergraph_BP_Username, CallFunc_GetUserWidgetObject_ReturnValue_1) == 0x000058, "Member 'BP_Username_C_ExecuteUbergraph_BP_Username::CallFunc_GetUserWidgetObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Username_C_ExecuteUbergraph_BP_Username, CallFunc_GetCameraLocation_ReturnValue) == 0x000060, "Member 'BP_Username_C_ExecuteUbergraph_BP_Username::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Username_C_ExecuteUbergraph_BP_Username, K2Node_DynamicCast_AsW_Username_1) == 0x000070, "Member 'BP_Username_C_ExecuteUbergraph_BP_Username::K2Node_DynamicCast_AsW_Username_1' has a wrong offset!");
static_assert(offsetof(BP_Username_C_ExecuteUbergraph_BP_Username, K2Node_DynamicCast_bSuccess_3) == 0x000078, "Member 'BP_Username_C_ExecuteUbergraph_BP_Username::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Username_C_ExecuteUbergraph_BP_Username, CallFunc_GetPawnData_Team) == 0x000079, "Member 'BP_Username_C_ExecuteUbergraph_BP_Username::CallFunc_GetPawnData_Team' has a wrong offset!");
static_assert(offsetof(BP_Username_C_ExecuteUbergraph_BP_Username, CallFunc_GetPawnData_PlayerIndex) == 0x00007C, "Member 'BP_Username_C_ExecuteUbergraph_BP_Username::CallFunc_GetPawnData_PlayerIndex' has a wrong offset!");
static_assert(offsetof(BP_Username_C_ExecuteUbergraph_BP_Username, CallFunc_GetPawnData_PlayerStats) == 0x000080, "Member 'BP_Username_C_ExecuteUbergraph_BP_Username::CallFunc_GetPawnData_PlayerStats' has a wrong offset!");
static_assert(offsetof(BP_Username_C_ExecuteUbergraph_BP_Username, CallFunc_GetPawnData_PawnDataComponent) == 0x0000E8, "Member 'BP_Username_C_ExecuteUbergraph_BP_Username::CallFunc_GetPawnData_PawnDataComponent' has a wrong offset!");
static_assert(offsetof(BP_Username_C_ExecuteUbergraph_BP_Username, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000F0, "Member 'BP_Username_C_ExecuteUbergraph_BP_Username::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Username_C_ExecuteUbergraph_BP_Username, K2Node_DynamicCast_AsBP_Character) == 0x0000F8, "Member 'BP_Username_C_ExecuteUbergraph_BP_Username::K2Node_DynamicCast_AsBP_Character' has a wrong offset!");
static_assert(offsetof(BP_Username_C_ExecuteUbergraph_BP_Username, K2Node_DynamicCast_bSuccess_4) == 0x000100, "Member 'BP_Username_C_ExecuteUbergraph_BP_Username::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_Username_C_ExecuteUbergraph_BP_Username, CallFunc_IsValid_ReturnValue_1) == 0x000101, "Member 'BP_Username_C_ExecuteUbergraph_BP_Username::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Username_C_ExecuteUbergraph_BP_Username, K2Node_DynamicCast_AsBP_Character_1) == 0x000108, "Member 'BP_Username_C_ExecuteUbergraph_BP_Username::K2Node_DynamicCast_AsBP_Character_1' has a wrong offset!");
static_assert(offsetof(BP_Username_C_ExecuteUbergraph_BP_Username, K2Node_DynamicCast_bSuccess_5) == 0x000110, "Member 'BP_Username_C_ExecuteUbergraph_BP_Username::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_Username_C_ExecuteUbergraph_BP_Username, CallFunc_IsValid_ReturnValue_2) == 0x000111, "Member 'BP_Username_C_ExecuteUbergraph_BP_Username::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Username_C_ExecuteUbergraph_BP_Username, CallFunc_GetTruePawnLocation_PawnLocation) == 0x000114, "Member 'BP_Username_C_ExecuteUbergraph_BP_Username::CallFunc_GetTruePawnLocation_PawnLocation' has a wrong offset!");
static_assert(offsetof(BP_Username_C_ExecuteUbergraph_BP_Username, CallFunc_Vector_Distance_ReturnValue) == 0x000120, "Member 'BP_Username_C_ExecuteUbergraph_BP_Username::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Username_C_ExecuteUbergraph_BP_Username, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000124, "Member 'BP_Username_C_ExecuteUbergraph_BP_Username::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Username_C_ExecuteUbergraph_BP_Username, CallFunc_LineTraceSingle_OutHit) == 0x000128, "Member 'BP_Username_C_ExecuteUbergraph_BP_Username::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_Username_C_ExecuteUbergraph_BP_Username, CallFunc_LineTraceSingle_ReturnValue) == 0x0001B0, "Member 'BP_Username_C_ExecuteUbergraph_BP_Username::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Username_C_ExecuteUbergraph_BP_Username, CallFunc_Not_PreBool_ReturnValue) == 0x0001B1, "Member 'BP_Username_C_ExecuteUbergraph_BP_Username::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Username_C_ExecuteUbergraph_BP_Username, CallFunc_Array_Add_ReturnValue) == 0x0001B4, "Member 'BP_Username_C_ExecuteUbergraph_BP_Username::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Username_C_ExecuteUbergraph_BP_Username, CallFunc_Array_Add_ReturnValue_1) == 0x0001B8, "Member 'BP_Username_C_ExecuteUbergraph_BP_Username::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function BP_Username.BP_Username_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Username_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Username_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Username_C_ReceiveTick");
static_assert(sizeof(BP_Username_C_ReceiveTick) == 0x000004, "Wrong size on BP_Username_C_ReceiveTick");
static_assert(offsetof(BP_Username_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Username_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

