#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DamageDealerData

#include "Basic.hpp"


namespace SDK::Params
{

// Function DamageDealerData.DamageDealerData_C.ExecuteUbergraph_DamageDealerData
// 0x000C (0x000C - 0x0000)
struct DamageDealerData_C_ExecuteUbergraph_DamageDealerData final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Damage;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DamageDealerData_C_ExecuteUbergraph_DamageDealerData) == 0x000004, "Wrong alignment on DamageDealerData_C_ExecuteUbergraph_DamageDealerData");
static_assert(sizeof(DamageDealerData_C_ExecuteUbergraph_DamageDealerData) == 0x00000C, "Wrong size on DamageDealerData_C_ExecuteUbergraph_DamageDealerData");
static_assert(offsetof(DamageDealerData_C_ExecuteUbergraph_DamageDealerData, EntryPoint) == 0x000000, "Member 'DamageDealerData_C_ExecuteUbergraph_DamageDealerData::EntryPoint' has a wrong offset!");
static_assert(offsetof(DamageDealerData_C_ExecuteUbergraph_DamageDealerData, K2Node_CustomEvent_Damage) == 0x000004, "Member 'DamageDealerData_C_ExecuteUbergraph_DamageDealerData::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(DamageDealerData_C_ExecuteUbergraph_DamageDealerData, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'DamageDealerData_C_ExecuteUbergraph_DamageDealerData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function DamageDealerData.DamageDealerData_C.AddDamage
// 0x0004 (0x0004 - 0x0000)
struct DamageDealerData_C_AddDamage final
{
public:
	int32                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DamageDealerData_C_AddDamage) == 0x000004, "Wrong alignment on DamageDealerData_C_AddDamage");
static_assert(sizeof(DamageDealerData_C_AddDamage) == 0x000004, "Wrong size on DamageDealerData_C_AddDamage");
static_assert(offsetof(DamageDealerData_C_AddDamage, Damage) == 0x000000, "Member 'DamageDealerData_C_AddDamage::Damage' has a wrong offset!");

}

