#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GlobalFunctions

#include "Basic.hpp"

#include "SteamCore_structs.hpp"
#include "ST_CharacterCustomization_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ST_HairColor_structs.hpp"
#include "E_Teams_structs.hpp"
#include "ST_SelectedCosmeticItems_structs.hpp"
#include "Engine_structs.hpp"
#include "E_Units_structs.hpp"
#include "ST_UnitProgress_structs.hpp"
#include "ST_Unlockable_structs.hpp"
#include "ST_CharacterFaceCustomizationItem_structs.hpp"
#include "ST_Options_structs.hpp"
#include "ST_PlayerStats_structs.hpp"
#include "E_UnlockableCategories_structs.hpp"
#include "E_DamageTypes_structs.hpp"


namespace SDK::Params
{

// Function GlobalFunctions.GlobalFunctions_C.Get PlayerUnitType
// 0x00A8 (0x00A8 - 0x0000)
struct GlobalFunctions_C_Get_PlayerUnitType final
{
public:
	class APawn*                                  Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Units                                       UnitType;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Teams                                       CallFunc_GetPawnData_Team;                         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPawnData_PlayerIndex;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_PlayerStats                        CallFunc_GetPawnData_PlayerStats;                  // 0x0018(0x0068)(HasGetValueTypeHash)
	class UPawnDataComponent_C*                   CallFunc_GetPawnData_PawnDataComponent;            // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlaneBase_C*                        K2Node_DynamicCast_AsBP_Plane_Base;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TankBase_C*                         K2Node_DynamicCast_AsBP_Tank_Base;                 // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GlobalFunctions_C_Get_PlayerUnitType) == 0x000008, "Wrong alignment on GlobalFunctions_C_Get_PlayerUnitType");
static_assert(sizeof(GlobalFunctions_C_Get_PlayerUnitType) == 0x0000A8, "Wrong size on GlobalFunctions_C_Get_PlayerUnitType");
static_assert(offsetof(GlobalFunctions_C_Get_PlayerUnitType, Pawn) == 0x000000, "Member 'GlobalFunctions_C_Get_PlayerUnitType::Pawn' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_Get_PlayerUnitType, __WorldContext) == 0x000008, "Member 'GlobalFunctions_C_Get_PlayerUnitType::__WorldContext' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_Get_PlayerUnitType, UnitType) == 0x000010, "Member 'GlobalFunctions_C_Get_PlayerUnitType::UnitType' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_Get_PlayerUnitType, CallFunc_GetPawnData_Team) == 0x000011, "Member 'GlobalFunctions_C_Get_PlayerUnitType::CallFunc_GetPawnData_Team' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_Get_PlayerUnitType, CallFunc_GetPawnData_PlayerIndex) == 0x000014, "Member 'GlobalFunctions_C_Get_PlayerUnitType::CallFunc_GetPawnData_PlayerIndex' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_Get_PlayerUnitType, CallFunc_GetPawnData_PlayerStats) == 0x000018, "Member 'GlobalFunctions_C_Get_PlayerUnitType::CallFunc_GetPawnData_PlayerStats' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_Get_PlayerUnitType, CallFunc_GetPawnData_PawnDataComponent) == 0x000080, "Member 'GlobalFunctions_C_Get_PlayerUnitType::CallFunc_GetPawnData_PawnDataComponent' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_Get_PlayerUnitType, K2Node_DynamicCast_AsBP_Plane_Base) == 0x000088, "Member 'GlobalFunctions_C_Get_PlayerUnitType::K2Node_DynamicCast_AsBP_Plane_Base' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_Get_PlayerUnitType, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'GlobalFunctions_C_Get_PlayerUnitType::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_Get_PlayerUnitType, K2Node_DynamicCast_AsBP_Tank_Base) == 0x000098, "Member 'GlobalFunctions_C_Get_PlayerUnitType::K2Node_DynamicCast_AsBP_Tank_Base' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_Get_PlayerUnitType, K2Node_DynamicCast_bSuccess_1) == 0x0000A0, "Member 'GlobalFunctions_C_Get_PlayerUnitType::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function GlobalFunctions.GlobalFunctions_C.GetRandomSpawnPoint
// 0x0360 (0x0360 - 0x0000)
struct GlobalFunctions_C_GetRandomSpawnPoint final
{
public:
	class ABP_Flag_C*                             Flag;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAI;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpawnLocation;                                     // 0x0018(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               SpawnRotation;                                     // 0x0024(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABP_VehicleBase_C*                      VehicleToEnterAfterSpawn;                          // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_PlayerStart_SpawnPoint_C*>   AvailableSpawnpoints;                              // 0x0038(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class ABP_PlayerStart_SpawnPoint_C*           ChosenSpawnPoint;                                  // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_PlayerStart_SpawnPoint_C*>   TeamSpawns;                                        // 0x0050(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_LandingCraft_C*>             CallFunc_GetAllActorsOfClass_OutActors;            // 0x0068(0x0010)(ReferenceParm)
	class ABP_LandingCraft_C*                     CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCapsuleComponent*>              CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x00A0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UCapsuleComponent*                      CallFunc_Array_Random_OutItem;                     // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorFloat_ReturnValue;         // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GameStateBase_C*                    K2Node_DynamicCast_AsBP_Game_State_Base;           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_PlayerStart_SpawnPoint_C*>   CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x00F8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue_1;      // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue_1;       // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetUnscaledSphereRadius_ReturnValue;      // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0190(0x0010)(ConstParm, ReferenceParm)
	class ABP_PlayerStart_SpawnPoint_C*           CallFunc_Array_Get_Item_1;                         // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x01A8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0234(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_242[0x2];                                      // 0x0242(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x024C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0258(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0264(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0270(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0290(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x02AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x02B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x02D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x02DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x02F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x02FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FD[0x3];                                      // 0x02FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0300(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0310(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_LandingCraft_C*                     CallFunc_SpawnLandingCraft_LandingCraft;           // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerStart_SpawnPoint_C*           CallFunc_Array_Random_OutItem_1;                   // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex_1;                  // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GlobalFunctions_C_GetRandomSpawnPoint) == 0x000010, "Wrong alignment on GlobalFunctions_C_GetRandomSpawnPoint");
static_assert(sizeof(GlobalFunctions_C_GetRandomSpawnPoint) == 0x000360, "Wrong size on GlobalFunctions_C_GetRandomSpawnPoint");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, Flag) == 0x000000, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::Flag' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, IsAI) == 0x000008, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::IsAI' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, __WorldContext) == 0x000010, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::__WorldContext' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, SpawnLocation) == 0x000018, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::SpawnLocation' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, SpawnRotation) == 0x000024, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::SpawnRotation' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, VehicleToEnterAfterSpawn) == 0x000030, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::VehicleToEnterAfterSpawn' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, AvailableSpawnpoints) == 0x000038, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::AvailableSpawnpoints' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, ChosenSpawnPoint) == 0x000048, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::ChosenSpawnPoint' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, TeamSpawns) == 0x000050, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::TeamSpawns' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, Temp_int_Array_Index_Variable) == 0x000060, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_GetAllActorsOfClass_OutActors) == 0x000068, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_Array_Get_Item) == 0x000078, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_GetActorForwardVector_ReturnValue) == 0x000084, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000090, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x0000A0, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_Array_Random_OutItem) == 0x0000B0, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_Array_Random_OutIndex) == 0x0000B8, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_Less_IntInt_ReturnValue) == 0x0000BC, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000C0, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_GetGameState_ReturnValue) == 0x0000D0, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_Subtract_VectorFloat_ReturnValue) == 0x0000D8, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_Subtract_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, K2Node_DynamicCast_AsBP_Game_State_Base) == 0x0000E8, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::K2Node_DynamicCast_AsBP_Game_State_Base' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x0000F8, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_Array_Length_ReturnValue_1) == 0x000108, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_GetActorRightVector_ReturnValue) == 0x00010C, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_GetActorRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_GetActorForwardVector_ReturnValue_1) == 0x000118, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_GetActorForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000124, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_Conv_VectorToRotator_ReturnValue_1) == 0x000130, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_Conv_VectorToRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00013C, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, K2Node_SwitchEnum_CmpSuccess) == 0x000148, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_GetUnscaledSphereRadius_ReturnValue) == 0x00014C, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_GetUnscaledSphereRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000150, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x00015C, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000168, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_Add_VectorVector_ReturnValue) == 0x000174, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, Temp_int_Loop_Counter_Variable) == 0x000180, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_Less_IntInt_ReturnValue_1) == 0x000184, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_Add_IntInt_ReturnValue) == 0x000188, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, Temp_int_Array_Index_Variable_1) == 0x00018C, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, Temp_object_Variable) == 0x000190, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_Array_Get_Item_1) == 0x0001A0, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_LineTraceSingle_OutHit) == 0x0001A8, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_LineTraceSingle_ReturnValue) == 0x000230, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000234, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_BreakHitResult_bBlockingHit) == 0x000240, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_BreakHitResult_bInitialOverlap) == 0x000241, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_BreakHitResult_Time) == 0x000244, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_BreakHitResult_Distance) == 0x000248, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_BreakHitResult_Location) == 0x00024C, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_BreakHitResult_ImpactPoint) == 0x000258, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_BreakHitResult_Normal) == 0x000264, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_BreakHitResult_ImpactNormal) == 0x000270, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_BreakHitResult_PhysMat) == 0x000280, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_BreakHitResult_HitActor) == 0x000288, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_BreakHitResult_HitComponent) == 0x000290, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_BreakHitResult_HitBoneName) == 0x000298, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_BreakHitResult_HitItem) == 0x0002A0, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_BreakHitResult_ElementIndex) == 0x0002A4, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_BreakHitResult_FaceIndex) == 0x0002A8, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_BreakHitResult_TraceStart) == 0x0002AC, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_BreakHitResult_TraceEnd) == 0x0002B8, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_Vector_Distance_ReturnValue) == 0x0002C4, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_Less_FloatFloat_ReturnValue) == 0x0002C8, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_RandomFloatInRange_ReturnValue) == 0x0002CC, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0002D0, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0002DC, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, Temp_int_Loop_Counter_Variable_1) == 0x0002E8, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x0002EC, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0002F0, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_Less_IntInt_ReturnValue_2) == 0x0002FC, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000300, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x000310, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_Add_IntInt_ReturnValue_1) == 0x000340, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_SpawnLandingCraft_LandingCraft) == 0x000348, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_SpawnLandingCraft_LandingCraft' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_Array_Random_OutItem_1) == 0x000350, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_Array_Random_OutItem_1' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_Array_Random_OutIndex_1) == 0x000358, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_Array_Random_OutIndex_1' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetRandomSpawnPoint, CallFunc_Array_Add_ReturnValue) == 0x00035C, "Member 'GlobalFunctions_C_GetRandomSpawnPoint::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function GlobalFunctions.GlobalFunctions_C.GetProjectileFireDirection
// 0x0430 (0x0430 - 0x0000)
struct GlobalFunctions_C_GetProjectileFireDirection final
{
public:
	class UArrowComponent*                        ProjectileStart;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CameraLocation;                                    // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CameraDirection;                                   // 0x0014(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         ActorsToIgnore;                                    // 0x0020(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                ActorLocation;                                     // 0x0030(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseSimpleDirection;                                // 0x003C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FinalDirection;                                    // 0x0048(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Distance;                                          // 0x0054(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInstantHit;                                      // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             InstantHit;                                        // 0x005C(0x0088)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                ProjectileStartLocation;                           // 0x00E4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0138(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0160(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit_1;                 // 0x01EC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue_1;            // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0275(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0276(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_277[0x1];                                      // 0x0277(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0280(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x028C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0298(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x02A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x02DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x02E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x02F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit_2;                 // 0x0300(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue_2;            // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0389(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x038A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38B[0x1];                                      // 0x038B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0394(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x03A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x03AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x03B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C4[0x4];                                      // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x03D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x03F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0400(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x040C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_421[0x3];                                      // 0x0421(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_2;      // 0x0424(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GlobalFunctions_C_GetProjectileFireDirection) == 0x000008, "Wrong alignment on GlobalFunctions_C_GetProjectileFireDirection");
static_assert(sizeof(GlobalFunctions_C_GetProjectileFireDirection) == 0x000430, "Wrong size on GlobalFunctions_C_GetProjectileFireDirection");
static_assert(offsetof(GlobalFunctions_C_GetProjectileFireDirection, ProjectileStart) == 0x000000, "Member 'GlobalFunctions_C_GetProjectileFireDirection::ProjectileStart' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetProjectileFireDirection, CameraLocation) == 0x000008, "Member 'GlobalFunctions_C_GetProjectileFireDirection::CameraLocation' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetProjectileFireDirection, CameraDirection) == 0x000014, "Member 'GlobalFunctions_C_GetProjectileFireDirection::CameraDirection' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetProjectileFireDirection, ActorsToIgnore) == 0x000020, "Member 'GlobalFunctions_C_GetProjectileFireDirection::ActorsToIgnore' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetProjectileFireDirection, ActorLocation) == 0x000030, "Member 'GlobalFunctions_C_GetProjectileFireDirection::ActorLocation' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetProjectileFireDirection, UseSimpleDirection) == 0x00003C, "Member 'GlobalFunctions_C_GetProjectileFireDirection::UseSimpleDirection' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetProjectileFireDirection, __WorldContext) == 0x000040, "Member 'GlobalFunctions_C_GetProjectileFireDirection::__WorldContext' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetProjectileFireDirection, FinalDirection) == 0x000048, "Member 'GlobalFunctions_C_GetProjectileFireDirection::FinalDirection' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetProjectileFireDirection, Distance) == 0x000054, "Member 'GlobalFunctions_C_GetProjectileFireDirection::Distance' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetProjectileFireDirection, IsInstantHit) == 0x000058, "Member 'GlobalFunctions_C_GetProjectileFireDirection::IsInstantHit' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetProjectileFireDirection, InstantHit) == 0x00005C, "Member 'GlobalFunctions_C_GetProjectileFireDirection::InstantHit' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetProjectileFireDirection, ProjectileStartLocation) == 0x0000E4, "Member 'GlobalFunctions_C_GetProjectileFireDirection::ProjectileStartLocation' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetProjectileFireDirection, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000F0, "Member 'GlobalFunctions_C_GetProjectileFireDirection::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetProjectileFireDirection, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000FC, "Member 'GlobalFunctions_C_GetProjectileFireDirection::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetProjectileFireDirection, CallFunc_Add_VectorVector_ReturnValue) == 0x000108, "Member 'GlobalFunctions_C_GetProjectileFireDirection::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetProjectileFireDirection, CallFunc_GetUpVector_ReturnValue) == 0x000114, "Member 'GlobalFunctions_C_GetProjectileFireDirection::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetProjectileFireDirection, CallFunc_BreakVector_X) == 0x000120, "Member 'GlobalFunctions_C_GetProjectileFireDirection::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetProjectileFireDirection, CallFunc_BreakVector_Y) == 0x000124, "Member 'GlobalFunctions_C_GetProjectileFireDirection::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetProjectileFireDirection, CallFunc_BreakVector_Z) == 0x000128, "Member 'GlobalFunctions_C_GetProjectileFireDirection::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetProjectileFireDirection, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x00012C, "Member 'GlobalFunctions_C_GetProjectileFireDirection::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetProjectileFireDirection, Temp_object_Variable) == 0x000138, "Member 'GlobalFunctions_C_GetProjectileFireDirection::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetProjectileFireDirection, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x000148, "Member 'GlobalFunctions_C_GetProjectileFireDirection::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetProjectileFireDirection, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000154, "Member 'GlobalFunctions_C_GetProjectileFireDirection::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetProjectileFireDirection, CallFunc_LineTraceSingle_OutHit) == 0x000160, "Member 'GlobalFunctions_C_GetProjectileFireDirection::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetProjectileFireDirection, CallFunc_LineTraceSingle_ReturnValue) == 0x0001E8, "Member 'GlobalFunctions_C_GetProjectileFireDirection::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GlobalFunctions_C_GetProjectileFireDirection, CallFunc_LineTraceSingle_OutHit_1) == 0x0001EC, "Member 'GlobalFunctions_C_GetProjectileFireDirection::CallFunc_LineTraceSingle_OutHit_1' has a wrong offset!");
