#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_CharacterData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct ST_CharacterData.ST_CharacterData
// 0x0014 (0x0014 - 0x0000)
struct FST_CharacterData final
{
public:
	float                                         MWS_4_2412E7334610008A00BC749B81A063D4;            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         JZV_6_1F6E4DD245564E6ABA5B9D8BC0EDDC8E;            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CD_11_FBCB2A07460E29C0D3B926ADED4D88DA;            // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BD_14_1CDC53D74334ECDE286A65815C9FC186;            // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AHD_20_F979D307409D6F55675DC8AD31306F57;           // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Valid_8_F591744346C708AF7829F9B3399F52DE;          // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FST_CharacterData) == 0x000004, "Wrong alignment on FST_CharacterData");
static_assert(sizeof(FST_CharacterData) == 0x000014, "Wrong size on FST_CharacterData");
static_assert(offsetof(FST_CharacterData, MWS_4_2412E7334610008A00BC749B81A063D4) == 0x000000, "Member 'FST_CharacterData::MWS_4_2412E7334610008A00BC749B81A063D4' has a wrong offset!");
static_assert(offsetof(FST_CharacterData, JZV_6_1F6E4DD245564E6ABA5B9D8BC0EDDC8E) == 0x000004, "Member 'FST_CharacterData::JZV_6_1F6E4DD245564E6ABA5B9D8BC0EDDC8E' has a wrong offset!");
static_assert(offsetof(FST_CharacterData, CD_11_FBCB2A07460E29C0D3B926ADED4D88DA) == 0x000008, "Member 'FST_CharacterData::CD_11_FBCB2A07460E29C0D3B926ADED4D88DA' has a wrong offset!");
static_assert(offsetof(FST_CharacterData, BD_14_1CDC53D74334ECDE286A65815C9FC186) == 0x00000C, "Member 'FST_CharacterData::BD_14_1CDC53D74334ECDE286A65815C9FC186' has a wrong offset!");
static_assert(offsetof(FST_CharacterData, AHD_20_F979D307409D6F55675DC8AD31306F57) == 0x000010, "Member 'FST_CharacterData::AHD_20_F979D307409D6F55675DC8AD31306F57' has a wrong offset!");
static_assert(offsetof(FST_CharacterData, Valid_8_F591744346C708AF7829F9B3399F52DE) == 0x000011, "Member 'FST_CharacterData::Valid_8_F591744346C708AF7829F9B3399F52DE' has a wrong offset!");

}

