#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_DropDownItem

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "ST_Selectable_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_DropDownItem.ST_DropDownItem
// 0x0198 (0x0198 - 0x0000)
struct FST_DropDownItem final
{
public:
	int32                                         Index_5_86F2DE7C40835FAE17710CAB80B78E98;          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            Icon_12_6380223C4895FD4A2D120B96273BF23E;          // 0x0008(0x0088)(Edit, BlueprintVisible)
	class FString                                 ItemName_8_67D62A024DB96B7111E90AA857E3B18A;       // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   Description_11_43FBC27548EAA1F955E881B99A5F6B46;   // 0x00A0(0x0018)(Edit, BlueprintVisible)
	struct FST_Selectable                         Selectable_15_19D6D9BC4596D7AFFF7F0EBB895213E6;    // 0x00B8(0x00E0)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(FST_DropDownItem) == 0x000008, "Wrong alignment on FST_DropDownItem");
static_assert(sizeof(FST_DropDownItem) == 0x000198, "Wrong size on FST_DropDownItem");
static_assert(offsetof(FST_DropDownItem, Index_5_86F2DE7C40835FAE17710CAB80B78E98) == 0x000000, "Member 'FST_DropDownItem::Index_5_86F2DE7C40835FAE17710CAB80B78E98' has a wrong offset!");
static_assert(offsetof(FST_DropDownItem, Icon_12_6380223C4895FD4A2D120B96273BF23E) == 0x000008, "Member 'FST_DropDownItem::Icon_12_6380223C4895FD4A2D120B96273BF23E' has a wrong offset!");
static_assert(offsetof(FST_DropDownItem, ItemName_8_67D62A024DB96B7111E90AA857E3B18A) == 0x000090, "Member 'FST_DropDownItem::ItemName_8_67D62A024DB96B7111E90AA857E3B18A' has a wrong offset!");
static_assert(offsetof(FST_DropDownItem, Description_11_43FBC27548EAA1F955E881B99A5F6B46) == 0x0000A0, "Member 'FST_DropDownItem::Description_11_43FBC27548EAA1F955E881B99A5F6B46' has a wrong offset!");
static_assert(offsetof(FST_DropDownItem, Selectable_15_19D6D9BC4596D7AFFF7F0EBB895213E6) == 0x0000B8, "Member 'FST_DropDownItem::Selectable_15_19D6D9BC4596D7AFFF7F0EBB895213E6' has a wrong offset!");

}

