#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_DamageInformation

#include "Basic.hpp"

#include "E_DamageTypes_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_DamageInformation.ST_DamageInformation
// 0x0018 (0x0018 - 0x0000)
struct FST_DamageInformation final
{
public:
	E_DamageTypes                                 DamageType_14_24A5476544D892D78E480591D5422978;    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DamageAmount_6_91E4428043CDFA47C65F29937A1C6484;   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 HitActor_9_66F4D8A7496E278CC30CFCB3F0251F9F;       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCriticalHit_7_3366509743A2E7E17BFCB59F64CC6784;  // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsLowHP_10_779ADF5C41BCF67BFB105485BDA2E805;       // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FST_DamageInformation) == 0x000008, "Wrong alignment on FST_DamageInformation");
static_assert(sizeof(FST_DamageInformation) == 0x000018, "Wrong size on FST_DamageInformation");
static_assert(offsetof(FST_DamageInformation, DamageType_14_24A5476544D892D78E480591D5422978) == 0x000000, "Member 'FST_DamageInformation::DamageType_14_24A5476544D892D78E480591D5422978' has a wrong offset!");
static_assert(offsetof(FST_DamageInformation, DamageAmount_6_91E4428043CDFA47C65F29937A1C6484) == 0x000004, "Member 'FST_DamageInformation::DamageAmount_6_91E4428043CDFA47C65F29937A1C6484' has a wrong offset!");
static_assert(offsetof(FST_DamageInformation, HitActor_9_66F4D8A7496E278CC30CFCB3F0251F9F) == 0x000008, "Member 'FST_DamageInformation::HitActor_9_66F4D8A7496E278CC30CFCB3F0251F9F' has a wrong offset!");
static_assert(offsetof(FST_DamageInformation, IsCriticalHit_7_3366509743A2E7E17BFCB59F64CC6784) == 0x000010, "Member 'FST_DamageInformation::IsCriticalHit_7_3366509743A2E7E17BFCB59F64CC6784' has a wrong offset!");
static_assert(offsetof(FST_DamageInformation, IsLowHP_10_779ADF5C41BCF67BFB105485BDA2E805) == 0x000011, "Member 'FST_DamageInformation::IsLowHP_10_779ADF5C41BCF67BFB105485BDA2E805' has a wrong offset!");

}

