#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_Loadout

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct ST_Loadout.ST_Loadout
// 0x00AC (0x00AC - 0x0000)
struct FST_Loadout final
{
public:
	int32                                         AxisSoldierWeapon1_37_2813D96344FCDCD3D03614A18A3A1139; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AxisSoldierWeapon2_38_0EB8D320433C3CD64EE2D7A65A4C8C8C; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AlliedSoldierWeapon1_39_6D20F9974EB6A8772C86DE89B057A1BA; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AlliedSoldierWeapon2_40_A8113DE747522074CFF8938F3AEFAE1C; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AxisGunnerWeapon1_41_1118BC5E43059BABE2CA4286B3667BEC; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AxisGunnerWeapon2_42_B778B24748D21A039A5AFC885DC6F02A; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AlliedGunnerWeapon1_43_BBD4FAF04F4697A354C72DB2649E6540; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AlliedGunnerWeapon2_44_6D55489D4D97B9CF56F76C856EC13059; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AxisCommandoWeapon1_45_DD3453D6478F777AA32EE3B1EB7ED4C3; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AxisCommandoWeapon2_46_EB7C05704A51CA637120D4BEE3A21C65; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AlliedCommandoWeapon1_47_D4E2C302407747F2F2839CBC76D08AC7; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AlliedCommandoWeapon2_48_04F55DB645D341FDDDC2A4B945EF4B50; // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AlliedSoldierSkill1_55_0898AD434B82F8163E96748B6BF23A92; // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AlliedSoldierSkill2_56_1647DB67413EDF214477F899C3C2DB80; // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AxisSoldierSkill1_57_CD5684234B546DACBB3F648C5F8831BD; // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AxisSoldierSkill2_58_25D80A6B4124D2AA7A8DA69B77AAA7C6; // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AlliedGunnerSkill1_59_B7ABF7CE4060C024D6DEBE8B884C1DCB; // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AlliedGunnerSkill2_60_BB776FB94FFB91F9012015999EDC45BC; // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AxisGunnerSkill1_61_8556F54C492D8E4B0B38B98B2FA4E739; // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AxisGunnerSkill2_62_F744CF8A4103B0934759F88A1B8322AA; // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AlliedCommandoSkill1_63_D610E9CD456F63865A4EF0B769230979; // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AlliedCommandoSkill2_64_FA0E6FD5451FE780731D538BF659A727; // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AxisCommandoSkill1_65_776F280A423E3A61F443AEB0809ED35A; // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AxisCommandoSkill2_66_4E4887BD4E0EBCBEAD656F99C24F019F; // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AxisHat_75_12C03A124EB6070CB4C5DC8AFC53A80F;       // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AxisOutfit_76_2CF1CBD949C96F8396133C8CD7679458;    // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AlliedHat_77_2E3525C442887A4CB9E82EAF29D5409D;     // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AlliedOutfit_78_77A572734314004AB900558A8C408F7F;  // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AxisSoldierExplosive_91_8B76E0084603871BBF97C68C5D6801B3; // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AlliedSoldierExplosive_92_B028B48941735AFB3DD8A3B8A7B43D41; // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AxisGunnerExplosive_93_7C6F29D641FA6B53527CF1BFF68E4069; // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AlliedGunnerExplosive_94_2C64DEBD437988778B300FB35628F69F; // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AxisCommandoExplosive_95_3568BCA84C0D07BC1BFBAD9D4B7DFE0E; // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AlliedCommandoExplosive_96_2374F10B4CF15D8035715FA806384EF3; // 0x0084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AxisEngineerWeapon1_102_685CEF944F3CF804C43C9D920F0E12DE; // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AxisEngineerWeapon2_103_F3F7E2B047EC01EFC8B57EA0C97348F9; // 0x008C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AlliedEngineerWeapon1_106_95FBEF724E00BAF6D1A66781EFFA082C; // 0x0090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AlliedEngineerWeapon2_107_2471F2B0439403172F8427B0E4946119; // 0x0094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AxisEngineerSkill1_110_1EA54663411952BEFA8657B419933BF8; // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AxisEngineerSkill2_111_4ADA97F8428DA3EA54FD9EA0B1C818ED; // 0x009C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AlliedEngineerSkill1_114_B0FF00A541ADC0F95DBFADA2883EBF51; // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AlliedEngineerSkill2_115_CFBCBD6645BA668B8A938CA370783FB7; // 0x00A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MemberVar_116_A7A8655E4DE657AF1F1D0F96EBA9AFE6;    // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FST_Loadout) == 0x000004, "Wrong alignment on FST_Loadout");
static_assert(sizeof(FST_Loadout) == 0x0000AC, "Wrong size on FST_Loadout");
static_assert(offsetof(FST_Loadout, AxisSoldierWeapon1_37_2813D96344FCDCD3D03614A18A3A1139) == 0x000000, "Member 'FST_Loadout::AxisSoldierWeapon1_37_2813D96344FCDCD3D03614A18A3A1139' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AxisSoldierWeapon2_38_0EB8D320433C3CD64EE2D7A65A4C8C8C) == 0x000004, "Member 'FST_Loadout::AxisSoldierWeapon2_38_0EB8D320433C3CD64EE2D7A65A4C8C8C' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AlliedSoldierWeapon1_39_6D20F9974EB6A8772C86DE89B057A1BA) == 0x000008, "Member 'FST_Loadout::AlliedSoldierWeapon1_39_6D20F9974EB6A8772C86DE89B057A1BA' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AlliedSoldierWeapon2_40_A8113DE747522074CFF8938F3AEFAE1C) == 0x00000C, "Member 'FST_Loadout::AlliedSoldierWeapon2_40_A8113DE747522074CFF8938F3AEFAE1C' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AxisGunnerWeapon1_41_1118BC5E43059BABE2CA4286B3667BEC) == 0x000010, "Member 'FST_Loadout::AxisGunnerWeapon1_41_1118BC5E43059BABE2CA4286B3667BEC' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AxisGunnerWeapon2_42_B778B24748D21A039A5AFC885DC6F02A) == 0x000014, "Member 'FST_Loadout::AxisGunnerWeapon2_42_B778B24748D21A039A5AFC885DC6F02A' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AlliedGunnerWeapon1_43_BBD4FAF04F4697A354C72DB2649E6540) == 0x000018, "Member 'FST_Loadout::AlliedGunnerWeapon1_43_BBD4FAF04F4697A354C72DB2649E6540' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AlliedGunnerWeapon2_44_6D55489D4D97B9CF56F76C856EC13059) == 0x00001C, "Member 'FST_Loadout::AlliedGunnerWeapon2_44_6D55489D4D97B9CF56F76C856EC13059' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AxisCommandoWeapon1_45_DD3453D6478F777AA32EE3B1EB7ED4C3) == 0x000020, "Member 'FST_Loadout::AxisCommandoWeapon1_45_DD3453D6478F777AA32EE3B1EB7ED4C3' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AxisCommandoWeapon2_46_EB7C05704A51CA637120D4BEE3A21C65) == 0x000024, "Member 'FST_Loadout::AxisCommandoWeapon2_46_EB7C05704A51CA637120D4BEE3A21C65' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AlliedCommandoWeapon1_47_D4E2C302407747F2F2839CBC76D08AC7) == 0x000028, "Member 'FST_Loadout::AlliedCommandoWeapon1_47_D4E2C302407747F2F2839CBC76D08AC7' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AlliedCommandoWeapon2_48_04F55DB645D341FDDDC2A4B945EF4B50) == 0x00002C, "Member 'FST_Loadout::AlliedCommandoWeapon2_48_04F55DB645D341FDDDC2A4B945EF4B50' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AlliedSoldierSkill1_55_0898AD434B82F8163E96748B6BF23A92) == 0x000030, "Member 'FST_Loadout::AlliedSoldierSkill1_55_0898AD434B82F8163E96748B6BF23A92' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AlliedSoldierSkill2_56_1647DB67413EDF214477F899C3C2DB80) == 0x000034, "Member 'FST_Loadout::AlliedSoldierSkill2_56_1647DB67413EDF214477F899C3C2DB80' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AxisSoldierSkill1_57_CD5684234B546DACBB3F648C5F8831BD) == 0x000038, "Member 'FST_Loadout::AxisSoldierSkill1_57_CD5684234B546DACBB3F648C5F8831BD' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AxisSoldierSkill2_58_25D80A6B4124D2AA7A8DA69B77AAA7C6) == 0x00003C, "Member 'FST_Loadout::AxisSoldierSkill2_58_25D80A6B4124D2AA7A8DA69B77AAA7C6' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AlliedGunnerSkill1_59_B7ABF7CE4060C024D6DEBE8B884C1DCB) == 0x000040, "Member 'FST_Loadout::AlliedGunnerSkill1_59_B7ABF7CE4060C024D6DEBE8B884C1DCB' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AlliedGunnerSkill2_60_BB776FB94FFB91F9012015999EDC45BC) == 0x000044, "Member 'FST_Loadout::AlliedGunnerSkill2_60_BB776FB94FFB91F9012015999EDC45BC' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AxisGunnerSkill1_61_8556F54C492D8E4B0B38B98B2FA4E739) == 0x000048, "Member 'FST_Loadout::AxisGunnerSkill1_61_8556F54C492D8E4B0B38B98B2FA4E739' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AxisGunnerSkill2_62_F744CF8A4103B0934759F88A1B8322AA) == 0x00004C, "Member 'FST_Loadout::AxisGunnerSkill2_62_F744CF8A4103B0934759F88A1B8322AA' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AlliedCommandoSkill1_63_D610E9CD456F63865A4EF0B769230979) == 0x000050, "Member 'FST_Loadout::AlliedCommandoSkill1_63_D610E9CD456F63865A4EF0B769230979' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AlliedCommandoSkill2_64_FA0E6FD5451FE780731D538BF659A727) == 0x000054, "Member 'FST_Loadout::AlliedCommandoSkill2_64_FA0E6FD5451FE780731D538BF659A727' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AxisCommandoSkill1_65_776F280A423E3A61F443AEB0809ED35A) == 0x000058, "Member 'FST_Loadout::AxisCommandoSkill1_65_776F280A423E3A61F443AEB0809ED35A' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AxisCommandoSkill2_66_4E4887BD4E0EBCBEAD656F99C24F019F) == 0x00005C, "Member 'FST_Loadout::AxisCommandoSkill2_66_4E4887BD4E0EBCBEAD656F99C24F019F' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AxisHat_75_12C03A124EB6070CB4C5DC8AFC53A80F) == 0x000060, "Member 'FST_Loadout::AxisHat_75_12C03A124EB6070CB4C5DC8AFC53A80F' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AxisOutfit_76_2CF1CBD949C96F8396133C8CD7679458) == 0x000064, "Member 'FST_Loadout::AxisOutfit_76_2CF1CBD949C96F8396133C8CD7679458' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AlliedHat_77_2E3525C442887A4CB9E82EAF29D5409D) == 0x000068, "Member 'FST_Loadout::AlliedHat_77_2E3525C442887A4CB9E82EAF29D5409D' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AlliedOutfit_78_77A572734314004AB900558A8C408F7F) == 0x00006C, "Member 'FST_Loadout::AlliedOutfit_78_77A572734314004AB900558A8C408F7F' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AxisSoldierExplosive_91_8B76E0084603871BBF97C68C5D6801B3) == 0x000070, "Member 'FST_Loadout::AxisSoldierExplosive_91_8B76E0084603871BBF97C68C5D6801B3' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AlliedSoldierExplosive_92_B028B48941735AFB3DD8A3B8A7B43D41) == 0x000074, "Member 'FST_Loadout::AlliedSoldierExplosive_92_B028B48941735AFB3DD8A3B8A7B43D41' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AxisGunnerExplosive_93_7C6F29D641FA6B53527CF1BFF68E4069) == 0x000078, "Member 'FST_Loadout::AxisGunnerExplosive_93_7C6F29D641FA6B53527CF1BFF68E4069' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AlliedGunnerExplosive_94_2C64DEBD437988778B300FB35628F69F) == 0x00007C, "Member 'FST_Loadout::AlliedGunnerExplosive_94_2C64DEBD437988778B300FB35628F69F' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AxisCommandoExplosive_95_3568BCA84C0D07BC1BFBAD9D4B7DFE0E) == 0x000080, "Member 'FST_Loadout::AxisCommandoExplosive_95_3568BCA84C0D07BC1BFBAD9D4B7DFE0E' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AlliedCommandoExplosive_96_2374F10B4CF15D8035715FA806384EF3) == 0x000084, "Member 'FST_Loadout::AlliedCommandoExplosive_96_2374F10B4CF15D8035715FA806384EF3' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AxisEngineerWeapon1_102_685CEF944F3CF804C43C9D920F0E12DE) == 0x000088, "Member 'FST_Loadout::AxisEngineerWeapon1_102_685CEF944F3CF804C43C9D920F0E12DE' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AxisEngineerWeapon2_103_F3F7E2B047EC01EFC8B57EA0C97348F9) == 0x00008C, "Member 'FST_Loadout::AxisEngineerWeapon2_103_F3F7E2B047EC01EFC8B57EA0C97348F9' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AlliedEngineerWeapon1_106_95FBEF724E00BAF6D1A66781EFFA082C) == 0x000090, "Member 'FST_Loadout::AlliedEngineerWeapon1_106_95FBEF724E00BAF6D1A66781EFFA082C' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AlliedEngineerWeapon2_107_2471F2B0439403172F8427B0E4946119) == 0x000094, "Member 'FST_Loadout::AlliedEngineerWeapon2_107_2471F2B0439403172F8427B0E4946119' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AxisEngineerSkill1_110_1EA54663411952BEFA8657B419933BF8) == 0x000098, "Member 'FST_Loadout::AxisEngineerSkill1_110_1EA54663411952BEFA8657B419933BF8' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AxisEngineerSkill2_111_4ADA97F8428DA3EA54FD9EA0B1C818ED) == 0x00009C, "Member 'FST_Loadout::AxisEngineerSkill2_111_4ADA97F8428DA3EA54FD9EA0B1C818ED' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AlliedEngineerSkill1_114_B0FF00A541ADC0F95DBFADA2883EBF51) == 0x0000A0, "Member 'FST_Loadout::AlliedEngineerSkill1_114_B0FF00A541ADC0F95DBFADA2883EBF51' has a wrong offset!");
static_assert(offsetof(FST_Loadout, AlliedEngineerSkill2_115_CFBCBD6645BA668B8A938CA370783FB7) == 0x0000A4, "Member 'FST_Loadout::AlliedEngineerSkill2_115_CFBCBD6645BA668B8A938CA370783FB7' has a wrong offset!");
static_assert(offsetof(FST_Loadout, MemberVar_116_A7A8655E4DE657AF1F1D0F96EBA9AFE6) == 0x0000A8, "Member 'FST_Loadout::MemberVar_116_A7A8655E4DE657AF1F1D0F96EBA9AFE6' has a wrong offset!");

}

