#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_Map

#include "Basic.hpp"

#include "E_Scenarios_structs.hpp"
#include "E_GameModes_structs.hpp"
#include "E_SubScenarios_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_Map.ST_Map
// 0x0048 (0x0048 - 0x0000)
struct FST_Map final
{
public:
	bool                                          Enabled_26_B2480361414C01DB294D52BCB642FEAD;       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             LoadingScreenShot_35_1D3DF4FE459BB4602338D29B464FFF80; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             ServerBrowserImage_40_F9A734A24BEB33EF89CC57A3408C50FB; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             DaytimeAmbienceSound_12_2DED413447306B7C60645BBD0CD63FC2; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             NighttimeAmbienceSound_14_978662F74471C6226CCB6BAD1723AD9D; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_GameModes                                   GameMode_29_C2A079BE4548F578B6C7BFBF0EA61A32;      // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<E_Scenarios>                           SupportedScenarios_20_866743A6438C82D941CDAA8D4B2044BD; // 0x0030(0x0010)(Edit, BlueprintVisible)
	bool                                          Experimental__41_A43353574C6CE5AB5176598482E9C1A1; // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	E_SubScenarios                                SubScenario_34_1B20478C491FEEEAFA8B4594069C988B;   // 0x0041(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FST_Map) == 0x000008, "Wrong alignment on FST_Map");
static_assert(sizeof(FST_Map) == 0x000048, "Wrong size on FST_Map");
static_assert(offsetof(FST_Map, Enabled_26_B2480361414C01DB294D52BCB642FEAD) == 0x000000, "Member 'FST_Map::Enabled_26_B2480361414C01DB294D52BCB642FEAD' has a wrong offset!");
static_assert(offsetof(FST_Map, LoadingScreenShot_35_1D3DF4FE459BB4602338D29B464FFF80) == 0x000008, "Member 'FST_Map::LoadingScreenShot_35_1D3DF4FE459BB4602338D29B464FFF80' has a wrong offset!");
static_assert(offsetof(FST_Map, ServerBrowserImage_40_F9A734A24BEB33EF89CC57A3408C50FB) == 0x000010, "Member 'FST_Map::ServerBrowserImage_40_F9A734A24BEB33EF89CC57A3408C50FB' has a wrong offset!");
static_assert(offsetof(FST_Map, DaytimeAmbienceSound_12_2DED413447306B7C60645BBD0CD63FC2) == 0x000018, "Member 'FST_Map::DaytimeAmbienceSound_12_2DED413447306B7C60645BBD0CD63FC2' has a wrong offset!");
static_assert(offsetof(FST_Map, NighttimeAmbienceSound_14_978662F74471C6226CCB6BAD1723AD9D) == 0x000020, "Member 'FST_Map::NighttimeAmbienceSound_14_978662F74471C6226CCB6BAD1723AD9D' has a wrong offset!");
static_assert(offsetof(FST_Map, GameMode_29_C2A079BE4548F578B6C7BFBF0EA61A32) == 0x000028, "Member 'FST_Map::GameMode_29_C2A079BE4548F578B6C7BFBF0EA61A32' has a wrong offset!");
static_assert(offsetof(FST_Map, SupportedScenarios_20_866743A6438C82D941CDAA8D4B2044BD) == 0x000030, "Member 'FST_Map::SupportedScenarios_20_866743A6438C82D941CDAA8D4B2044BD' has a wrong offset!");
static_assert(offsetof(FST_Map, Experimental__41_A43353574C6CE5AB5176598482E9C1A1) == 0x000040, "Member 'FST_Map::Experimental__41_A43353574C6CE5AB5176598482E9C1A1' has a wrong offset!");
static_assert(offsetof(FST_Map, SubScenario_34_1B20478C491FEEEAFA8B4594069C988B) == 0x000041, "Member 'FST_Map::SubScenario_34_1B20478C491FEEEAFA8B4594069C988B' has a wrong offset!");

}

