#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_SelectedCosmeticItems

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct ST_SelectedCosmeticItems.ST_SelectedCosmeticItems
// 0x0100 (0x0100 - 0x0000)
struct FST_SelectedCosmeticItems final
{
public:
	TArray<int32>                                 FacialHairStyles_46_1FC317574719BA1A39B99D82C3CD5957; // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 HairColors_47_AC0D988246DB7852F8C4A1A72E4273CA;    // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 WeaponSkins_45_66C1A89D484238B5826C759CC91FA6D2;   // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<float>                                 SkinTones_51_6FF09F11414BF7CCFDD9589E9B636BF5;     // 0x0030(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 Hats_57_409DC7B943AD9A59E136E4910C6F94D3;          // 0x0040(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 UpperFaceItems_59_035C7ADF4C969F48CD937396EC79AAC8; // 0x0050(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 LowerFaceItems_61_D5E05DAA40ACF3A0A7C8E88CB7F47C32; // 0x0060(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 Legs_74_00B105BE4B43D4A3AD652B8711CFD60B;          // 0x0070(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 HairStyles_67_460627FE4D6382017E5D6FA40FB8C5CB;    // 0x0080(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 Torso_75_847EB6C24E1CB4EE98818299ECCFD837;         // 0x0090(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 Shirts_77_495545E14EF208F49061B0866D7D5F8E;        // 0x00A0(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 Hands_79_23503DBC483675E2254D7794DEB1151C;         // 0x00B0(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 Feet_81_8F4C56CA40F15C015BCA9A87569F7826;          // 0x00C0(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 Underwear_83_45AD869D45703AEC1FF2BE966EDB4E39;     // 0x00D0(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 Back_85_AF22F9814BB6D60AB407B7897D662CEF;          // 0x00E0(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 Tattoos_87_524E718948ED70E6FF0D9EADA68919A1;       // 0x00F0(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FST_SelectedCosmeticItems) == 0x000008, "Wrong alignment on FST_SelectedCosmeticItems");
static_assert(sizeof(FST_SelectedCosmeticItems) == 0x000100, "Wrong size on FST_SelectedCosmeticItems");
static_assert(offsetof(FST_SelectedCosmeticItems, FacialHairStyles_46_1FC317574719BA1A39B99D82C3CD5957) == 0x000000, "Member 'FST_SelectedCosmeticItems::FacialHairStyles_46_1FC317574719BA1A39B99D82C3CD5957' has a wrong offset!");
static_assert(offsetof(FST_SelectedCosmeticItems, HairColors_47_AC0D988246DB7852F8C4A1A72E4273CA) == 0x000010, "Member 'FST_SelectedCosmeticItems::HairColors_47_AC0D988246DB7852F8C4A1A72E4273CA' has a wrong offset!");
static_assert(offsetof(FST_SelectedCosmeticItems, WeaponSkins_45_66C1A89D484238B5826C759CC91FA6D2) == 0x000020, "Member 'FST_SelectedCosmeticItems::WeaponSkins_45_66C1A89D484238B5826C759CC91FA6D2' has a wrong offset!");
static_assert(offsetof(FST_SelectedCosmeticItems, SkinTones_51_6FF09F11414BF7CCFDD9589E9B636BF5) == 0x000030, "Member 'FST_SelectedCosmeticItems::SkinTones_51_6FF09F11414BF7CCFDD9589E9B636BF5' has a wrong offset!");
static_assert(offsetof(FST_SelectedCosmeticItems, Hats_57_409DC7B943AD9A59E136E4910C6F94D3) == 0x000040, "Member 'FST_SelectedCosmeticItems::Hats_57_409DC7B943AD9A59E136E4910C6F94D3' has a wrong offset!");
static_assert(offsetof(FST_SelectedCosmeticItems, UpperFaceItems_59_035C7ADF4C969F48CD937396EC79AAC8) == 0x000050, "Member 'FST_SelectedCosmeticItems::UpperFaceItems_59_035C7ADF4C969F48CD937396EC79AAC8' has a wrong offset!");
static_assert(offsetof(FST_SelectedCosmeticItems, LowerFaceItems_61_D5E05DAA40ACF3A0A7C8E88CB7F47C32) == 0x000060, "Member 'FST_SelectedCosmeticItems::LowerFaceItems_61_D5E05DAA40ACF3A0A7C8E88CB7F47C32' has a wrong offset!");
static_assert(offsetof(FST_SelectedCosmeticItems, Legs_74_00B105BE4B43D4A3AD652B8711CFD60B) == 0x000070, "Member 'FST_SelectedCosmeticItems::Legs_74_00B105BE4B43D4A3AD652B8711CFD60B' has a wrong offset!");
static_assert(offsetof(FST_SelectedCosmeticItems, HairStyles_67_460627FE4D6382017E5D6FA40FB8C5CB) == 0x000080, "Member 'FST_SelectedCosmeticItems::HairStyles_67_460627FE4D6382017E5D6FA40FB8C5CB' has a wrong offset!");
static_assert(offsetof(FST_SelectedCosmeticItems, Torso_75_847EB6C24E1CB4EE98818299ECCFD837) == 0x000090, "Member 'FST_SelectedCosmeticItems::Torso_75_847EB6C24E1CB4EE98818299ECCFD837' has a wrong offset!");
static_assert(offsetof(FST_SelectedCosmeticItems, Shirts_77_495545E14EF208F49061B0866D7D5F8E) == 0x0000A0, "Member 'FST_SelectedCosmeticItems::Shirts_77_495545E14EF208F49061B0866D7D5F8E' has a wrong offset!");
static_assert(offsetof(FST_SelectedCosmeticItems, Hands_79_23503DBC483675E2254D7794DEB1151C) == 0x0000B0, "Member 'FST_SelectedCosmeticItems::Hands_79_23503DBC483675E2254D7794DEB1151C' has a wrong offset!");
static_assert(offsetof(FST_SelectedCosmeticItems, Feet_81_8F4C56CA40F15C015BCA9A87569F7826) == 0x0000C0, "Member 'FST_SelectedCosmeticItems::Feet_81_8F4C56CA40F15C015BCA9A87569F7826' has a wrong offset!");
static_assert(offsetof(FST_SelectedCosmeticItems, Underwear_83_45AD869D45703AEC1FF2BE966EDB4E39) == 0x0000D0, "Member 'FST_SelectedCosmeticItems::Underwear_83_45AD869D45703AEC1FF2BE966EDB4E39' has a wrong offset!");
static_assert(offsetof(FST_SelectedCosmeticItems, Back_85_AF22F9814BB6D60AB407B7897D662CEF) == 0x0000E0, "Member 'FST_SelectedCosmeticItems::Back_85_AF22F9814BB6D60AB407B7897D662CEF' has a wrong offset!");
static_assert(offsetof(FST_SelectedCosmeticItems, Tattoos_87_524E718948ED70E6FF0D9EADA68919A1) == 0x0000F0, "Member 'FST_SelectedCosmeticItems::Tattoos_87_524E718948ED70E6FF0D9EADA68919A1' has a wrong offset!");

}

