#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_ServerSettings

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct ST_ServerSettings.ST_ServerSettings
// 0x0040 (0x0040 - 0x0000)
struct FST_ServerSettings final
{
public:
	class FText                                   Servername_11_BF3FF09A4CCE5BEBD3DF268D548B93A6;    // 0x0000(0x0018)(Edit, BlueprintVisible)
	class FText                                   Password_17_A99791064F6F83746EF6B6AC15A0294C;      // 0x0018(0x0018)(Edit, BlueprintVisible)
	int32                                         BotAmount_2_93F9F88E4D92899E0916D095A8889922;      // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Tickets_8_FD04CABA4E334939FD434CAC2538AB1E;        // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Difficulty_18_B62D63F04F766AE106D5D88097380A86;    // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TeamBalance_20_333F2A8047A2C3CB3102399975D43518;   // 0x003C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FST_ServerSettings) == 0x000008, "Wrong alignment on FST_ServerSettings");
static_assert(sizeof(FST_ServerSettings) == 0x000040, "Wrong size on FST_ServerSettings");
static_assert(offsetof(FST_ServerSettings, Servername_11_BF3FF09A4CCE5BEBD3DF268D548B93A6) == 0x000000, "Member 'FST_ServerSettings::Servername_11_BF3FF09A4CCE5BEBD3DF268D548B93A6' has a wrong offset!");
static_assert(offsetof(FST_ServerSettings, Password_17_A99791064F6F83746EF6B6AC15A0294C) == 0x000018, "Member 'FST_ServerSettings::Password_17_A99791064F6F83746EF6B6AC15A0294C' has a wrong offset!");
static_assert(offsetof(FST_ServerSettings, BotAmount_2_93F9F88E4D92899E0916D095A8889922) == 0x000030, "Member 'FST_ServerSettings::BotAmount_2_93F9F88E4D92899E0916D095A8889922' has a wrong offset!");
static_assert(offsetof(FST_ServerSettings, Tickets_8_FD04CABA4E334939FD434CAC2538AB1E) == 0x000034, "Member 'FST_ServerSettings::Tickets_8_FD04CABA4E334939FD434CAC2538AB1E' has a wrong offset!");
static_assert(offsetof(FST_ServerSettings, Difficulty_18_B62D63F04F766AE106D5D88097380A86) == 0x000038, "Member 'FST_ServerSettings::Difficulty_18_B62D63F04F766AE106D5D88097380A86' has a wrong offset!");
static_assert(offsetof(FST_ServerSettings, TeamBalance_20_333F2A8047A2C3CB3102399975D43518) == 0x00003C, "Member 'FST_ServerSettings::TeamBalance_20_333F2A8047A2C3CB3102399975D43518' has a wrong offset!");

}

