#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_Selectable

#include "Basic.hpp"

#include "E_WeaponTypes_structs.hpp"
#include "SlateCore_structs.hpp"
#include "E_Teams_structs.hpp"
#include "E_Units_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_Selectable.ST_Selectable
// 0x00E0 (0x00E0 - 0x0000)
struct FST_Selectable final
{
public:
	bool                                          Enabled_27_DC03AEAF47E2A0413B04BB9C391ED8C3;       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Name_21_625DD9664508C43AF9B8C6954F25568E;          // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FSlateBrush                            Icon_60_24E5210F48C308FB7A6DDC83B7C6AC5E;          // 0x0018(0x0088)(Edit, BlueprintVisible)
	class UClass*                                 Blueprint_18_728491FC4590C719F8F32C921790AF76;     // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Teams                                       Team_13_D4412A6D48193592F72DA98EB1711E32;          // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<E_Units>                               Classes_62_BAA671974FB591E2C2DB33B2BFD5D9C4;       // 0x00B0(0x0010)(Edit, BlueprintVisible)
	class FText                                   Description_31_E75D316046E9CF34AFE65DA31FB7C72E;   // 0x00C0(0x0018)(Edit, BlueprintVisible)
	bool                                          ShouldBreakInvisibilitySkill_49_9BC14C0D4B3FA3F2E2F7AB8682A22E3A; // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ShowSkillDurationInHudSkill_56_D24C53E4431879C30F046EA22F85F9D1; // 0x00D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HeavyWeaponWeapon_51_772F9A9D420058329F416F9C55EAFD08; // 0x00DA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	E_WeaponTypes                                 WeaponTypeWeapon_52_5E28A5444B54B847C7F4D4BA371E63B0; // 0x00DB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NonDoubleWieldingWeaponTypeWeapon_65_FBC5578E42FD753DAC3C9286DC4D65BC; // 0x00DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsCoreWeapon_67_CD4B17AA4AF314F3645EC3AB7B3D743C;  // 0x00DD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FST_Selectable) == 0x000008, "Wrong alignment on FST_Selectable");
static_assert(sizeof(FST_Selectable) == 0x0000E0, "Wrong size on FST_Selectable");
static_assert(offsetof(FST_Selectable, Enabled_27_DC03AEAF47E2A0413B04BB9C391ED8C3) == 0x000000, "Member 'FST_Selectable::Enabled_27_DC03AEAF47E2A0413B04BB9C391ED8C3' has a wrong offset!");
static_assert(offsetof(FST_Selectable, Name_21_625DD9664508C43AF9B8C6954F25568E) == 0x000008, "Member 'FST_Selectable::Name_21_625DD9664508C43AF9B8C6954F25568E' has a wrong offset!");
static_assert(offsetof(FST_Selectable, Icon_60_24E5210F48C308FB7A6DDC83B7C6AC5E) == 0x000018, "Member 'FST_Selectable::Icon_60_24E5210F48C308FB7A6DDC83B7C6AC5E' has a wrong offset!");
static_assert(offsetof(FST_Selectable, Blueprint_18_728491FC4590C719F8F32C921790AF76) == 0x0000A0, "Member 'FST_Selectable::Blueprint_18_728491FC4590C719F8F32C921790AF76' has a wrong offset!");
static_assert(offsetof(FST_Selectable, Team_13_D4412A6D48193592F72DA98EB1711E32) == 0x0000A8, "Member 'FST_Selectable::Team_13_D4412A6D48193592F72DA98EB1711E32' has a wrong offset!");
static_assert(offsetof(FST_Selectable, Classes_62_BAA671974FB591E2C2DB33B2BFD5D9C4) == 0x0000B0, "Member 'FST_Selectable::Classes_62_BAA671974FB591E2C2DB33B2BFD5D9C4' has a wrong offset!");
static_assert(offsetof(FST_Selectable, Description_31_E75D316046E9CF34AFE65DA31FB7C72E) == 0x0000C0, "Member 'FST_Selectable::Description_31_E75D316046E9CF34AFE65DA31FB7C72E' has a wrong offset!");
static_assert(offsetof(FST_Selectable, ShouldBreakInvisibilitySkill_49_9BC14C0D4B3FA3F2E2F7AB8682A22E3A) == 0x0000D8, "Member 'FST_Selectable::ShouldBreakInvisibilitySkill_49_9BC14C0D4B3FA3F2E2F7AB8682A22E3A' has a wrong offset!");
static_assert(offsetof(FST_Selectable, ShowSkillDurationInHudSkill_56_D24C53E4431879C30F046EA22F85F9D1) == 0x0000D9, "Member 'FST_Selectable::ShowSkillDurationInHudSkill_56_D24C53E4431879C30F046EA22F85F9D1' has a wrong offset!");
static_assert(offsetof(FST_Selectable, HeavyWeaponWeapon_51_772F9A9D420058329F416F9C55EAFD08) == 0x0000DA, "Member 'FST_Selectable::HeavyWeaponWeapon_51_772F9A9D420058329F416F9C55EAFD08' has a wrong offset!");
static_assert(offsetof(FST_Selectable, WeaponTypeWeapon_52_5E28A5444B54B847C7F4D4BA371E63B0) == 0x0000DB, "Member 'FST_Selectable::WeaponTypeWeapon_52_5E28A5444B54B847C7F4D4BA371E63B0' has a wrong offset!");
static_assert(offsetof(FST_Selectable, NonDoubleWieldingWeaponTypeWeapon_65_FBC5578E42FD753DAC3C9286DC4D65BC) == 0x0000DC, "Member 'FST_Selectable::NonDoubleWieldingWeaponTypeWeapon_65_FBC5578E42FD753DAC3C9286DC4D65BC' has a wrong offset!");
static_assert(offsetof(FST_Selectable, IsCoreWeapon_67_CD4B17AA4AF314F3645EC3AB7B3D743C) == 0x0000DD, "Member 'FST_Selectable::IsCoreWeapon_67_CD4B17AA4AF314F3645EC3AB7B3D743C' has a wrong offset!");

}

