#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_Unlockable

#include "Basic.hpp"

#include "E_Teams_structs.hpp"
#include "E_UnlockableCategories_structs.hpp"
#include "E_Units_structs.hpp"
#include "E_CurrencyTypes_structs.hpp"
#include "E_SteamItemRarities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_Unlockable.ST_Unlockable
// 0x0148 (0x0148 - 0x0000)
struct FST_Unlockable final
{
public:
	bool                                          Enabled_180_A5BB547F461F23A380B968A57C641911;      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	E_UnlockableCategories                        Category_20_ED4E862040731943218B179172C69884;      // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name_2_676B704547B5547E12D39A9E2D4B7A7C;           // 0x0008(0x0018)(Edit, BlueprintVisible)
	int32                                         RequiredAmount_113_7112AC53455EDD997907FFACCE797B2C; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CurrencyTypes                               CurrencyType_112_40655FA74DE5301720ABFC90C2543A40; // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SteamItemRarities                           Rarity_223_023B74484A386B0FFBA9FAAD1484D24F;       // 0x0025(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<E_Teams>                               Teams_117_648E79674D3BE3250F06329D2ACE2925;        // 0x0028(0x0010)(Edit, BlueprintVisible)
	TArray<E_Units>                               ClassesLeaveemptyforallclasses_158_3AEA29284AA2E1CCE304C5AD22AE9159; // 0x0038(0x0010)(Edit, BlueprintVisible)
	class UTexture2D*                             Icon_5_58E515F64D01356B55F390A5C4580E03;           // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Material1_131_36CCBEAE4701A6C22997C6B6955E0A17;    // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Material2_130_0F9F8B35447A090E6E2D2D82F3A6C476;    // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          SkeletalMesh1_184_342E4AD249D58BFE5924469B595F7677; // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          SkeletalMesh2_183_23A807D64CA714AD2C1F33A1AD9744AE; // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Mirror_225_3DC4F3BB4B2A0A0B0A994396BA0E70CC;       // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          UseThinUpperLegsCoversUpperLegs_230_9B5DCA934EEED051EEE2D7AE7D072792; // 0x0071(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            StaticMesh1_132_88E33CE340E7D23EAAAD989E1043B3CD;  // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            StaticMesh2_133_7712B7364386ED0221C92585BD02B59F;  // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OverrideFacialHair_146_6486C1084B0662CEDAA26A8A476F0F6C; // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          OverrideUpperFace_153_B3D818D0401A6DD3796049BA654B20D7; // 0x0089(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          OverrideLowerFace_151_A096E98B477707E636B2159F12288600; // 0x008A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          OverrideLegs_147_C6045E1A466E65B574AD928BB18C1B7B; // 0x008B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          OverrideFeet_149_99DA52AE4C9D1A27C165959B0E541664; // 0x008C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          OverrideBack_207_6D900B7243362389D800359078CF5588; // 0x008D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HideUnderLongTorsoItem_229_D25B1D8345E0AFC0C75FF7886A1AF60C; // 0x008E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8F[0x1];                                       // 0x008F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Texture1_136_22F99B0F4EE096A1CD82008F1CD58AD5;     // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Texture2_138_8EEBDB414937EA2161EB4887DEE7C1D3;     // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Texture3_197_435B8FF04A7DEDC34DFCE3A933BE0A81;     // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Texture4_216_284F872C49772CFC70AFC59B5E35E290;     // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ColorOverlay1_198_F33304FC4503E80449BD1FACA52AD648; // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ColorOverlay2_201_08447861431E271F2CFD3795B6C64811; // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ColorOverlay3_204_910AE763485340E6516EE6965735CF75; // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TuckIntoShoesLegs_219_458F472F403C6A6B2F52A88292797A7A; // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         UVCoordinateOnCharacter_231_226735B448670893D9F8D48D71F29C2E; // 0x00E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           AnimMontage_124_B3141DC7470AE940B93E0B91BFCAF8C3;  // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 BlueprintRef_122_D3AEC4A74F179CA08EC909984F4A2B10; // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FlatColor_WeaponSkin_96_0166CF874F05BAB0154B2D8CE7F23E9B; // 0x00F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Texture_WeaponSkin_76_FBBFB9E24CCB1D04A19ACC8C24859526; // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TipColor_WeaponSkin_81_564A836541C56E22033AA589B5F742CE; // 0x0110(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SkinTileAmount_85_1CB964184E148B2419AB20AEA50E7B8D; // 0x0120(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Dontfliptexturesonmainlywoodenweapon_WeaponSkin_178_9372B6104002326730FF26BF158D2015; // 0x0124(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Usetextureoverentireweapon_WeaponSkin_WeaponSkin_109_CF75BE5A4C22488310BB30B0BC1B34D6; // 0x0125(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_126[0x2];                                      // 0x0126(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Roughness_WeaponSkin_161_52F57CD047AE4AF6BD7E38AEEBCE1001; // 0x0128(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Metalness_WeaponSkin_163_F28502B54A76AEF3048B37935292B749; // 0x012C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Specular_WeaponSkin_165_F7EACCEA4669CB01620F4FBE6DECB277; // 0x0130(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Emmissive_WeaponSkin_168_C054CD8E465F6A95CB7C2785CBAA3F6D; // 0x0134(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FresnelColor_WeaponSkin_177_9F65036549E6D5919B491CA23F3ED0D2; // 0x0138(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FST_Unlockable) == 0x000008, "Wrong alignment on FST_Unlockable");
static_assert(sizeof(FST_Unlockable) == 0x000148, "Wrong size on FST_Unlockable");
static_assert(offsetof(FST_Unlockable, Enabled_180_A5BB547F461F23A380B968A57C641911) == 0x000000, "Member 'FST_Unlockable::Enabled_180_A5BB547F461F23A380B968A57C641911' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, Category_20_ED4E862040731943218B179172C69884) == 0x000001, "Member 'FST_Unlockable::Category_20_ED4E862040731943218B179172C69884' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, Name_2_676B704547B5547E12D39A9E2D4B7A7C) == 0x000008, "Member 'FST_Unlockable::Name_2_676B704547B5547E12D39A9E2D4B7A7C' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, RequiredAmount_113_7112AC53455EDD997907FFACCE797B2C) == 0x000020, "Member 'FST_Unlockable::RequiredAmount_113_7112AC53455EDD997907FFACCE797B2C' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, CurrencyType_112_40655FA74DE5301720ABFC90C2543A40) == 0x000024, "Member 'FST_Unlockable::CurrencyType_112_40655FA74DE5301720ABFC90C2543A40' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, Rarity_223_023B74484A386B0FFBA9FAAD1484D24F) == 0x000025, "Member 'FST_Unlockable::Rarity_223_023B74484A386B0FFBA9FAAD1484D24F' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, Teams_117_648E79674D3BE3250F06329D2ACE2925) == 0x000028, "Member 'FST_Unlockable::Teams_117_648E79674D3BE3250F06329D2ACE2925' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, ClassesLeaveemptyforallclasses_158_3AEA29284AA2E1CCE304C5AD22AE9159) == 0x000038, "Member 'FST_Unlockable::ClassesLeaveemptyforallclasses_158_3AEA29284AA2E1CCE304C5AD22AE9159' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, Icon_5_58E515F64D01356B55F390A5C4580E03) == 0x000048, "Member 'FST_Unlockable::Icon_5_58E515F64D01356B55F390A5C4580E03' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, Material1_131_36CCBEAE4701A6C22997C6B6955E0A17) == 0x000050, "Member 'FST_Unlockable::Material1_131_36CCBEAE4701A6C22997C6B6955E0A17' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, Material2_130_0F9F8B35447A090E6E2D2D82F3A6C476) == 0x000058, "Member 'FST_Unlockable::Material2_130_0F9F8B35447A090E6E2D2D82F3A6C476' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, SkeletalMesh1_184_342E4AD249D58BFE5924469B595F7677) == 0x000060, "Member 'FST_Unlockable::SkeletalMesh1_184_342E4AD249D58BFE5924469B595F7677' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, SkeletalMesh2_183_23A807D64CA714AD2C1F33A1AD9744AE) == 0x000068, "Member 'FST_Unlockable::SkeletalMesh2_183_23A807D64CA714AD2C1F33A1AD9744AE' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, Mirror_225_3DC4F3BB4B2A0A0B0A994396BA0E70CC) == 0x000070, "Member 'FST_Unlockable::Mirror_225_3DC4F3BB4B2A0A0B0A994396BA0E70CC' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, UseThinUpperLegsCoversUpperLegs_230_9B5DCA934EEED051EEE2D7AE7D072792) == 0x000071, "Member 'FST_Unlockable::UseThinUpperLegsCoversUpperLegs_230_9B5DCA934EEED051EEE2D7AE7D072792' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, StaticMesh1_132_88E33CE340E7D23EAAAD989E1043B3CD) == 0x000078, "Member 'FST_Unlockable::StaticMesh1_132_88E33CE340E7D23EAAAD989E1043B3CD' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, StaticMesh2_133_7712B7364386ED0221C92585BD02B59F) == 0x000080, "Member 'FST_Unlockable::StaticMesh2_133_7712B7364386ED0221C92585BD02B59F' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, OverrideFacialHair_146_6486C1084B0662CEDAA26A8A476F0F6C) == 0x000088, "Member 'FST_Unlockable::OverrideFacialHair_146_6486C1084B0662CEDAA26A8A476F0F6C' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, OverrideUpperFace_153_B3D818D0401A6DD3796049BA654B20D7) == 0x000089, "Member 'FST_Unlockable::OverrideUpperFace_153_B3D818D0401A6DD3796049BA654B20D7' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, OverrideLowerFace_151_A096E98B477707E636B2159F12288600) == 0x00008A, "Member 'FST_Unlockable::OverrideLowerFace_151_A096E98B477707E636B2159F12288600' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, OverrideLegs_147_C6045E1A466E65B574AD928BB18C1B7B) == 0x00008B, "Member 'FST_Unlockable::OverrideLegs_147_C6045E1A466E65B574AD928BB18C1B7B' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, OverrideFeet_149_99DA52AE4C9D1A27C165959B0E541664) == 0x00008C, "Member 'FST_Unlockable::OverrideFeet_149_99DA52AE4C9D1A27C165959B0E541664' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, OverrideBack_207_6D900B7243362389D800359078CF5588) == 0x00008D, "Member 'FST_Unlockable::OverrideBack_207_6D900B7243362389D800359078CF5588' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, HideUnderLongTorsoItem_229_D25B1D8345E0AFC0C75FF7886A1AF60C) == 0x00008E, "Member 'FST_Unlockable::HideUnderLongTorsoItem_229_D25B1D8345E0AFC0C75FF7886A1AF60C' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, Texture1_136_22F99B0F4EE096A1CD82008F1CD58AD5) == 0x000090, "Member 'FST_Unlockable::Texture1_136_22F99B0F4EE096A1CD82008F1CD58AD5' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, Texture2_138_8EEBDB414937EA2161EB4887DEE7C1D3) == 0x000098, "Member 'FST_Unlockable::Texture2_138_8EEBDB414937EA2161EB4887DEE7C1D3' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, Texture3_197_435B8FF04A7DEDC34DFCE3A933BE0A81) == 0x0000A0, "Member 'FST_Unlockable::Texture3_197_435B8FF04A7DEDC34DFCE3A933BE0A81' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, Texture4_216_284F872C49772CFC70AFC59B5E35E290) == 0x0000A8, "Member 'FST_Unlockable::Texture4_216_284F872C49772CFC70AFC59B5E35E290' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, ColorOverlay1_198_F33304FC4503E80449BD1FACA52AD648) == 0x0000B0, "Member 'FST_Unlockable::ColorOverlay1_198_F33304FC4503E80449BD1FACA52AD648' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, ColorOverlay2_201_08447861431E271F2CFD3795B6C64811) == 0x0000C0, "Member 'FST_Unlockable::ColorOverlay2_201_08447861431E271F2CFD3795B6C64811' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, ColorOverlay3_204_910AE763485340E6516EE6965735CF75) == 0x0000D0, "Member 'FST_Unlockable::ColorOverlay3_204_910AE763485340E6516EE6965735CF75' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, TuckIntoShoesLegs_219_458F472F403C6A6B2F52A88292797A7A) == 0x0000E0, "Member 'FST_Unlockable::TuckIntoShoesLegs_219_458F472F403C6A6B2F52A88292797A7A' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, UVCoordinateOnCharacter_231_226735B448670893D9F8D48D71F29C2E) == 0x0000E4, "Member 'FST_Unlockable::UVCoordinateOnCharacter_231_226735B448670893D9F8D48D71F29C2E' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, AnimMontage_124_B3141DC7470AE940B93E0B91BFCAF8C3) == 0x0000E8, "Member 'FST_Unlockable::AnimMontage_124_B3141DC7470AE940B93E0B91BFCAF8C3' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, BlueprintRef_122_D3AEC4A74F179CA08EC909984F4A2B10) == 0x0000F0, "Member 'FST_Unlockable::BlueprintRef_122_D3AEC4A74F179CA08EC909984F4A2B10' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, FlatColor_WeaponSkin_96_0166CF874F05BAB0154B2D8CE7F23E9B) == 0x0000F8, "Member 'FST_Unlockable::FlatColor_WeaponSkin_96_0166CF874F05BAB0154B2D8CE7F23E9B' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, Texture_WeaponSkin_76_FBBFB9E24CCB1D04A19ACC8C24859526) == 0x000108, "Member 'FST_Unlockable::Texture_WeaponSkin_76_FBBFB9E24CCB1D04A19ACC8C24859526' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, TipColor_WeaponSkin_81_564A836541C56E22033AA589B5F742CE) == 0x000110, "Member 'FST_Unlockable::TipColor_WeaponSkin_81_564A836541C56E22033AA589B5F742CE' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, SkinTileAmount_85_1CB964184E148B2419AB20AEA50E7B8D) == 0x000120, "Member 'FST_Unlockable::SkinTileAmount_85_1CB964184E148B2419AB20AEA50E7B8D' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, Dontfliptexturesonmainlywoodenweapon_WeaponSkin_178_9372B6104002326730FF26BF158D2015) == 0x000124, "Member 'FST_Unlockable::Dontfliptexturesonmainlywoodenweapon_WeaponSkin_178_9372B6104002326730FF26BF158D2015' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, Usetextureoverentireweapon_WeaponSkin_WeaponSkin_109_CF75BE5A4C22488310BB30B0BC1B34D6) == 0x000125, "Member 'FST_Unlockable::Usetextureoverentireweapon_WeaponSkin_WeaponSkin_109_CF75BE5A4C22488310BB30B0BC1B34D6' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, Roughness_WeaponSkin_161_52F57CD047AE4AF6BD7E38AEEBCE1001) == 0x000128, "Member 'FST_Unlockable::Roughness_WeaponSkin_161_52F57CD047AE4AF6BD7E38AEEBCE1001' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, Metalness_WeaponSkin_163_F28502B54A76AEF3048B37935292B749) == 0x00012C, "Member 'FST_Unlockable::Metalness_WeaponSkin_163_F28502B54A76AEF3048B37935292B749' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, Specular_WeaponSkin_165_F7EACCEA4669CB01620F4FBE6DECB277) == 0x000130, "Member 'FST_Unlockable::Specular_WeaponSkin_165_F7EACCEA4669CB01620F4FBE6DECB277' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, Emmissive_WeaponSkin_168_C054CD8E465F6A95CB7C2785CBAA3F6D) == 0x000134, "Member 'FST_Unlockable::Emmissive_WeaponSkin_168_C054CD8E465F6A95CB7C2785CBAA3F6D' has a wrong offset!");
static_assert(offsetof(FST_Unlockable, FresnelColor_WeaponSkin_177_9F65036549E6D5919B491CA23F3ED0D2) == 0x000138, "Member 'FST_Unlockable::FresnelColor_WeaponSkin_177_9F65036549E6D5919B491CA23F3ED0D2' has a wrong offset!");

}

