#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Task_IsEnemyStillInLos

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Task_IsEnemyStillInLos.Task_IsEnemyStillInLos_C.ExecuteUbergraph_Task_IsEnemyStillInLos
// 0x0198 (0x0198 - 0x0000)
struct Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_Origin;                    // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_BoxExtent;                 // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue_1;              // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetValueAsObject_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_GetActorBounds_Origin_1;                  // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_BoxExtent_1;               // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x00BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_2;            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x00E8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_173[0x1];                                      // 0x0173(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRealTimeSeconds_ReturnValue;           // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRealTimeSeconds_ReturnValue_1;         // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_3;            // 0x0184(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_4;            // 0x018C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos) == 0x000008, "Wrong alignment on Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos");
static_assert(sizeof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos) == 0x000198, "Wrong size on Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos, EntryPoint) == 0x000000, "Member 'Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos::EntryPoint' has a wrong offset!");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos, K2Node_Event_OwnerController) == 0x000008, "Member 'Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos, K2Node_Event_ControlledPawn) == 0x000010, "Member 'Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos, CallFunc_GetBlackboard_ReturnValue) == 0x000018, "Member 'Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos, CallFunc_GetActorBounds_Origin) == 0x000020, "Member 'Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos::CallFunc_GetActorBounds_Origin' has a wrong offset!");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos, CallFunc_GetActorBounds_BoxExtent) == 0x00002C, "Member 'Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos::CallFunc_GetActorBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos, CallFunc_GetBlackboard_ReturnValue_1) == 0x000038, "Member 'Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos::CallFunc_GetBlackboard_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos, CallFunc_BreakVector_X) == 0x000040, "Member 'Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos, CallFunc_BreakVector_Y) == 0x000044, "Member 'Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos, CallFunc_BreakVector_Z) == 0x000048, "Member 'Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos, CallFunc_MakeLiteralName_ReturnValue) == 0x00004C, "Member 'Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000054, "Member 'Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos, CallFunc_GetValueAsObject_ReturnValue) == 0x000058, "Member 'Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos::CallFunc_GetValueAsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos, CallFunc_MakeVector_ReturnValue) == 0x000060, "Member 'Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos, K2Node_DynamicCast_AsActor) == 0x000070, "Member 'Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos, CallFunc_Add_VectorVector_ReturnValue) == 0x00007C, "Member 'Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos, K2Node_MakeArray_Array) == 0x000088, "Member 'Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos, CallFunc_GetActorBounds_Origin_1) == 0x000098, "Member 'Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos::CallFunc_GetActorBounds_Origin_1' has a wrong offset!");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos, CallFunc_GetActorBounds_BoxExtent_1) == 0x0000A4, "Member 'Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos::CallFunc_GetActorBounds_BoxExtent_1' has a wrong offset!");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos, CallFunc_BreakVector_X_1) == 0x0000B0, "Member 'Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos, CallFunc_BreakVector_Y_1) == 0x0000B4, "Member 'Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos, CallFunc_BreakVector_Z_1) == 0x0000B8, "Member 'Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos, CallFunc_MakeLiteralName_ReturnValue_1) == 0x0000BC, "Member 'Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos::CallFunc_MakeLiteralName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0000C4, "Member 'Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos, CallFunc_MakeLiteralName_ReturnValue_2) == 0x0000C8, "Member 'Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos::CallFunc_MakeLiteralName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos, CallFunc_MakeVector_ReturnValue_1) == 0x0000D0, "Member 'Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000DC, "Member 'Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos, CallFunc_LineTraceSingle_OutHit) == 0x0000E8, "Member 'Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos, CallFunc_LineTraceSingle_ReturnValue) == 0x000170, "Member 'Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos, CallFunc_Not_PreBool_ReturnValue) == 0x000171, "Member 'Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000172, "Member 'Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos, CallFunc_GetRealTimeSeconds_ReturnValue) == 0x000174, "Member 'Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos::CallFunc_GetRealTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos, CallFunc_GetRealTimeSeconds_ReturnValue_1) == 0x000178, "Member 'Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos::CallFunc_GetRealTimeSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00017C, "Member 'Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos, CallFunc_Add_FloatFloat_ReturnValue) == 0x000180, "Member 'Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos, CallFunc_MakeLiteralName_ReturnValue_3) == 0x000184, "Member 'Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos::CallFunc_MakeLiteralName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos, CallFunc_MakeLiteralName_ReturnValue_4) == 0x00018C, "Member 'Task_IsEnemyStillInLos_C_ExecuteUbergraph_Task_IsEnemyStillInLos::CallFunc_MakeLiteralName_ReturnValue_4' has a wrong offset!");

// Function Task_IsEnemyStillInLos.Task_IsEnemyStillInLos_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct Task_IsEnemyStillInLos_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_IsEnemyStillInLos_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on Task_IsEnemyStillInLos_C_ReceiveExecuteAI");
static_assert(sizeof(Task_IsEnemyStillInLos_C_ReceiveExecuteAI) == 0x000010, "Wrong size on Task_IsEnemyStillInLos_C_ReceiveExecuteAI");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'Task_IsEnemyStillInLos_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(Task_IsEnemyStillInLos_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'Task_IsEnemyStillInLos_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

