#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Task_RoamAround

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Task_RoamAround.Task_RoamAround_C.ExecuteUbergraph_Task_RoamAround
// 0x0128 (0x0128 - 0x0000)
struct Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_3;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_2;               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate;       // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          Temp_byte_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_1;     // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_1;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult;                 // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_2;     // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          Temp_byte_Variable_1;                              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation; // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue; // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_3;     // 0x007C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_GameInstance_C*                     K2Node_DynamicCast_AsBP_Game_Instance;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x00B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetValueAsObject_ReturnValue;             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GameStateBase_C*                    K2Node_DynamicCast_AsBP_Game_State_Base;           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetRandomPointInNavigableRadius_RandomLocation; // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetRandomPointInNavigableRadius_ReturnValue; // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue_1;    // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround) == 0x000008, "Wrong alignment on Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround");
static_assert(sizeof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround) == 0x000128, "Wrong size on Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, EntryPoint) == 0x000000, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::EntryPoint' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000004, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, K2Node_CustomEvent_MovementResult_3) == 0x000009, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::K2Node_CustomEvent_MovementResult_3' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, K2Node_CustomEvent_MovementResult_2) == 0x00000A, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::K2Node_CustomEvent_MovementResult_2' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, Temp_byte_Variable) == 0x00001C, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, K2Node_CustomEvent_MovementResult_1) == 0x000030, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::K2Node_CustomEvent_MovementResult_1' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, K2Node_CustomEvent_MovementResult) == 0x000031, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::K2Node_CustomEvent_MovementResult' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, K2Node_CreateDelegate_OutputDelegate_2) == 0x000034, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, Temp_byte_Variable_1) == 0x000044, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, K2Node_Event_OwnerController) == 0x000048, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, K2Node_Event_ControlledPawn) == 0x000050, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, CallFunc_GetBlackboard_ReturnValue) == 0x000058, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000060, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation) == 0x00006C, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue) == 0x000078, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, K2Node_CreateDelegate_OutputDelegate_3) == 0x00007C, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, CallFunc_CreateMoveToProxyObject_ReturnValue) == 0x000090, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::CallFunc_CreateMoveToProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, CallFunc_GetGameInstance_ReturnValue) == 0x000098, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, K2Node_DynamicCast_AsBP_Game_Instance) == 0x0000A0, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::K2Node_DynamicCast_AsBP_Game_Instance' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, CallFunc_IsValid_ReturnValue) == 0x0000A9, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, CallFunc_MapRangeClamped_ReturnValue) == 0x0000AC, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000B0, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, CallFunc_MakeLiteralName_ReturnValue) == 0x0000B4, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, CallFunc_GetValueAsObject_ReturnValue) == 0x0000C0, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::CallFunc_GetValueAsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x0000C8, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, CallFunc_IsValid_ReturnValue_1) == 0x0000CC, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, K2Node_DynamicCast_AsActor) == 0x0000D0, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, K2Node_DynamicCast_bSuccess_1) == 0x0000D8, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, CallFunc_GetGameState_ReturnValue) == 0x0000E0, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000E8, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, K2Node_DynamicCast_AsBP_Game_State_Base) == 0x0000F8, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::K2Node_DynamicCast_AsBP_Game_State_Base' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, K2Node_DynamicCast_bSuccess_2) == 0x000100, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, CallFunc_K2_GetRandomPointInNavigableRadius_RandomLocation) == 0x000104, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::CallFunc_K2_GetRandomPointInNavigableRadius_RandomLocation' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, CallFunc_K2_GetRandomPointInNavigableRadius_ReturnValue) == 0x000110, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::CallFunc_K2_GetRandomPointInNavigableRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, CallFunc_CreateMoveToProxyObject_ReturnValue_1) == 0x000118, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::CallFunc_CreateMoveToProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround, CallFunc_IsValid_ReturnValue_2) == 0x000120, "Member 'Task_RoamAround_C_ExecuteUbergraph_Task_RoamAround::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function Task_RoamAround.Task_RoamAround_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct Task_RoamAround_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_RoamAround_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on Task_RoamAround_C_ReceiveExecuteAI");
static_assert(sizeof(Task_RoamAround_C_ReceiveExecuteAI) == 0x000010, "Wrong size on Task_RoamAround_C_ReceiveExecuteAI");
static_assert(offsetof(Task_RoamAround_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'Task_RoamAround_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(Task_RoamAround_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'Task_RoamAround_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

// Function Task_RoamAround.Task_RoamAround_C.OnSuccess_F0FCE4A041523E800C1D33BF41836500
// 0x0001 (0x0001 - 0x0000)
struct Task_RoamAround_C_OnSuccess_F0FCE4A041523E800C1D33BF41836500 final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_RoamAround_C_OnSuccess_F0FCE4A041523E800C1D33BF41836500) == 0x000001, "Wrong alignment on Task_RoamAround_C_OnSuccess_F0FCE4A041523E800C1D33BF41836500");
static_assert(sizeof(Task_RoamAround_C_OnSuccess_F0FCE4A041523E800C1D33BF41836500) == 0x000001, "Wrong size on Task_RoamAround_C_OnSuccess_F0FCE4A041523E800C1D33BF41836500");
static_assert(offsetof(Task_RoamAround_C_OnSuccess_F0FCE4A041523E800C1D33BF41836500, MovementResult) == 0x000000, "Member 'Task_RoamAround_C_OnSuccess_F0FCE4A041523E800C1D33BF41836500::MovementResult' has a wrong offset!");

// Function Task_RoamAround.Task_RoamAround_C.OnFail_F0FCE4A041523E800C1D33BF41836500
// 0x0001 (0x0001 - 0x0000)
struct Task_RoamAround_C_OnFail_F0FCE4A041523E800C1D33BF41836500 final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_RoamAround_C_OnFail_F0FCE4A041523E800C1D33BF41836500) == 0x000001, "Wrong alignment on Task_RoamAround_C_OnFail_F0FCE4A041523E800C1D33BF41836500");
static_assert(sizeof(Task_RoamAround_C_OnFail_F0FCE4A041523E800C1D33BF41836500) == 0x000001, "Wrong size on Task_RoamAround_C_OnFail_F0FCE4A041523E800C1D33BF41836500");
static_assert(offsetof(Task_RoamAround_C_OnFail_F0FCE4A041523E800C1D33BF41836500, MovementResult) == 0x000000, "Member 'Task_RoamAround_C_OnFail_F0FCE4A041523E800C1D33BF41836500::MovementResult' has a wrong offset!");

// Function Task_RoamAround.Task_RoamAround_C.OnSuccess_A1A96A7D4C4CE93ADEA4A5A8877ABF9C
// 0x0001 (0x0001 - 0x0000)
struct Task_RoamAround_C_OnSuccess_A1A96A7D4C4CE93ADEA4A5A8877ABF9C final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_RoamAround_C_OnSuccess_A1A96A7D4C4CE93ADEA4A5A8877ABF9C) == 0x000001, "Wrong alignment on Task_RoamAround_C_OnSuccess_A1A96A7D4C4CE93ADEA4A5A8877ABF9C");
static_assert(sizeof(Task_RoamAround_C_OnSuccess_A1A96A7D4C4CE93ADEA4A5A8877ABF9C) == 0x000001, "Wrong size on Task_RoamAround_C_OnSuccess_A1A96A7D4C4CE93ADEA4A5A8877ABF9C");
static_assert(offsetof(Task_RoamAround_C_OnSuccess_A1A96A7D4C4CE93ADEA4A5A8877ABF9C, MovementResult) == 0x000000, "Member 'Task_RoamAround_C_OnSuccess_A1A96A7D4C4CE93ADEA4A5A8877ABF9C::MovementResult' has a wrong offset!");

// Function Task_RoamAround.Task_RoamAround_C.OnFail_A1A96A7D4C4CE93ADEA4A5A8877ABF9C
// 0x0001 (0x0001 - 0x0000)
struct Task_RoamAround_C_OnFail_A1A96A7D4C4CE93ADEA4A5A8877ABF9C final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_RoamAround_C_OnFail_A1A96A7D4C4CE93ADEA4A5A8877ABF9C) == 0x000001, "Wrong alignment on Task_RoamAround_C_OnFail_A1A96A7D4C4CE93ADEA4A5A8877ABF9C");
static_assert(sizeof(Task_RoamAround_C_OnFail_A1A96A7D4C4CE93ADEA4A5A8877ABF9C) == 0x000001, "Wrong size on Task_RoamAround_C_OnFail_A1A96A7D4C4CE93ADEA4A5A8877ABF9C");
static_assert(offsetof(Task_RoamAround_C_OnFail_A1A96A7D4C4CE93ADEA4A5A8877ABF9C, MovementResult) == 0x000000, "Member 'Task_RoamAround_C_OnFail_A1A96A7D4C4CE93ADEA4A5A8877ABF9C::MovementResult' has a wrong offset!");

}

