#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Task_FindSniperSPot

#include "Basic.hpp"

#include "E_Teams_structs.hpp"
#include "ST_PlayerStats_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Task_FindSniperSPot.Task_FindSniperSpot_C.ExecuteUbergraph_Task_FindSniperSpot
// 0x0118 (0x0118 - 0x0000)
struct Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController_1;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_1;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Teams                                       CallFunc_GetPawnData_Team;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPawnData_PlayerIndex;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_PlayerStats                        CallFunc_GetPawnData_PlayerStats;                  // 0x0030(0x0068)(HasGetValueTypeHash)
	class UPawnDataComponent_C*                   CallFunc_GetPawnData_PawnDataComponent;            // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AIControllerBase_C*                 K2Node_DynamicCast_AsBP_AIController_Base;         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SniperSpot_C*                       CallFunc_Array_Random_OutItem;                     // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SniperSpot_C*                       CallFunc_Array_Random_OutItem_1;                   // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex_1;                  // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x00DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Teams                                       Temp_byte_Variable;                                // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Select_Default;                             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation; // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue; // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot) == 0x000008, "Wrong alignment on Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot");
static_assert(sizeof(Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot) == 0x000118, "Wrong size on Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot");
static_assert(offsetof(Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot, EntryPoint) == 0x000000, "Member 'Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot::EntryPoint' has a wrong offset!");
static_assert(offsetof(Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot, Temp_object_Variable) == 0x000008, "Member 'Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot, K2Node_Event_OwnerController_1) == 0x000010, "Member 'Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot::K2Node_Event_OwnerController_1' has a wrong offset!");
static_assert(offsetof(Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot, K2Node_Event_ControlledPawn_1) == 0x000018, "Member 'Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot::K2Node_Event_ControlledPawn_1' has a wrong offset!");
static_assert(offsetof(Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot, CallFunc_GetBlackboard_ReturnValue) == 0x000020, "Member 'Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot, CallFunc_GetPawnData_Team) == 0x000028, "Member 'Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot::CallFunc_GetPawnData_Team' has a wrong offset!");
static_assert(offsetof(Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot, CallFunc_GetPawnData_PlayerIndex) == 0x00002C, "Member 'Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot::CallFunc_GetPawnData_PlayerIndex' has a wrong offset!");
static_assert(offsetof(Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot, CallFunc_GetPawnData_PlayerStats) == 0x000030, "Member 'Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot::CallFunc_GetPawnData_PlayerStats' has a wrong offset!");
static_assert(offsetof(Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot, CallFunc_GetPawnData_PawnDataComponent) == 0x000098, "Member 'Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot::CallFunc_GetPawnData_PawnDataComponent' has a wrong offset!");
static_assert(offsetof(Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot, K2Node_DynamicCast_AsBP_AIController_Base) == 0x0000A0, "Member 'Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot::K2Node_DynamicCast_AsBP_AIController_Base' has a wrong offset!");
static_assert(offsetof(Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot, K2Node_Event_OwnerController) == 0x0000B0, "Member 'Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot, K2Node_Event_ControlledPawn) == 0x0000B8, "Member 'Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot, CallFunc_Array_Random_OutItem) == 0x0000C0, "Member 'Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot, CallFunc_Array_Random_OutIndex) == 0x0000C8, "Member 'Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot, CallFunc_Array_Random_OutItem_1) == 0x0000D0, "Member 'Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot::CallFunc_Array_Random_OutItem_1' has a wrong offset!");
static_assert(offsetof(Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot, CallFunc_Array_Random_OutIndex_1) == 0x0000D8, "Member 'Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot::CallFunc_Array_Random_OutIndex_1' has a wrong offset!");
static_assert(offsetof(Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot, CallFunc_MakeLiteralName_ReturnValue) == 0x0000DC, "Member 'Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot, Temp_byte_Variable) == 0x0000E4, "Member 'Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot, CallFunc_MakeLiteralName_ReturnValue_1) == 0x0000E8, "Member 'Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot::CallFunc_MakeLiteralName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot, K2Node_Select_Default) == 0x0000F0, "Member 'Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000F8, "Member 'Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot, CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation) == 0x000104, "Member 'Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot::CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation' has a wrong offset!");
static_assert(offsetof(Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot, CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue) == 0x000110, "Member 'Task_FindSniperSpot_C_ExecuteUbergraph_Task_FindSniperSpot::CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue' has a wrong offset!");

// Function Task_FindSniperSPot.Task_FindSniperSpot_C.CustomEvent
// 0x0010 (0x0010 - 0x0000)
struct Task_FindSniperSpot_C_CustomEvent final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_FindSniperSpot_C_CustomEvent) == 0x000008, "Wrong alignment on Task_FindSniperSpot_C_CustomEvent");
static_assert(sizeof(Task_FindSniperSpot_C_CustomEvent) == 0x000010, "Wrong size on Task_FindSniperSpot_C_CustomEvent");
static_assert(offsetof(Task_FindSniperSpot_C_CustomEvent, OwnerController) == 0x000000, "Member 'Task_FindSniperSpot_C_CustomEvent::OwnerController' has a wrong offset!");
static_assert(offsetof(Task_FindSniperSpot_C_CustomEvent, ControlledPawn) == 0x000008, "Member 'Task_FindSniperSpot_C_CustomEvent::ControlledPawn' has a wrong offset!");

// Function Task_FindSniperSPot.Task_FindSniperSpot_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct Task_FindSniperSpot_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Task_FindSniperSpot_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on Task_FindSniperSpot_C_ReceiveExecuteAI");
static_assert(sizeof(Task_FindSniperSpot_C_ReceiveExecuteAI) == 0x000010, "Wrong size on Task_FindSniperSpot_C_ReceiveExecuteAI");
static_assert(offsetof(Task_FindSniperSpot_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'Task_FindSniperSpot_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(Task_FindSniperSpot_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'Task_FindSniperSpot_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

