#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ActiveSkill

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ActiveSkill.W_ActiveSkill_C
// 0x00B8 (0x0318 - 0x0260)
class UW_ActiveSkill_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SkillActivate;                                     // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar;                                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_ActiveSkill;                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateBrush                            SkillIcon;                                         // 0x0288(0x0088)(Edit, BlueprintVisible)
	float                                         Progress;                                          // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowInHUD;                                         // 0x0314(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_W_ActiveSkill(int32 EntryPoint);
	void Reset();
	void Activated();
	struct FSlateBrush SetIcon();
	float SetProgress();
	ESlateVisibility SetVisbility();
	ESlateVisibility ShowProgressBar();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_ActiveSkill_C">();
	}
	static class UW_ActiveSkill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_ActiveSkill_C>();
	}
};
static_assert(alignof(UW_ActiveSkill_C) == 0x000008, "Wrong alignment on UW_ActiveSkill_C");
static_assert(sizeof(UW_ActiveSkill_C) == 0x000318, "Wrong size on UW_ActiveSkill_C");
static_assert(offsetof(UW_ActiveSkill_C, UberGraphFrame) == 0x000260, "Member 'UW_ActiveSkill_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_ActiveSkill_C, SkillActivate) == 0x000268, "Member 'UW_ActiveSkill_C::SkillActivate' has a wrong offset!");
static_assert(offsetof(UW_ActiveSkill_C, Image_0) == 0x000270, "Member 'UW_ActiveSkill_C::Image_0' has a wrong offset!");
static_assert(offsetof(UW_ActiveSkill_C, ProgressBar) == 0x000278, "Member 'UW_ActiveSkill_C::ProgressBar' has a wrong offset!");
static_assert(offsetof(UW_ActiveSkill_C, VerticalBox_ActiveSkill) == 0x000280, "Member 'UW_ActiveSkill_C::VerticalBox_ActiveSkill' has a wrong offset!");
static_assert(offsetof(UW_ActiveSkill_C, SkillIcon) == 0x000288, "Member 'UW_ActiveSkill_C::SkillIcon' has a wrong offset!");
static_assert(offsetof(UW_ActiveSkill_C, Progress) == 0x000310, "Member 'UW_ActiveSkill_C::Progress' has a wrong offset!");
static_assert(offsetof(UW_ActiveSkill_C, ShowInHUD) == 0x000314, "Member 'UW_ActiveSkill_C::ShowInHUD' has a wrong offset!");

}

