#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_BattleCrafting

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "E_ChestTypes_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function W_BattleCrafting.W_BattleCrafting_C.ExecuteUbergraph_W_BattleCrafting
// 0x0258 (0x0258 - 0x0000)
struct W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(E_ChestTypes ChestType)>       K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	float                                         Temp_float_Variable_1;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_2;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ChestTypes                                  Temp_byte_Variable_4;                              // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_Tooltip_C*                           CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_PotentialChestItems_C*               CallFunc_Create_ReturnValue_1;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_PotentialChestItems_C*               CallFunc_Create_ReturnValue_2;                     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BaseController_C*                   K2Node_DynamicCast_AsBP_Base_Controller;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Get_Stacked_Item_ID_Amount_Amount;        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0060(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0080(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ReferenceParm)
	float                                         K2Node_Select_Default;                             // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D8(0x0018)()
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Get_Stacked_Item_ID_Amount_Amount_1;      // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Get_Stacked_Item_ID_Amount_Amount_2;      // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0100(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0118(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0160(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0170(0x0018)()
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BaseController_C*                   K2Node_DynamicCast_AsBP_Base_Controller_1;         // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_3;                             // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_3;                           // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_ChestTypes                                  K2Node_CustomEvent_ChestType;                      // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BaseController_C*                   K2Node_DynamicCast_AsBP_Base_Controller_2;         // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x01CC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BaseController_C*                   K2Node_DynamicCast_AsBP_Base_Controller_3;         // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BaseController_C*                   K2Node_DynamicCast_AsBP_Base_Controller_4;         // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_4;                           // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_222[0x6];                                      // 0x0222(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0228(0x0018)()
	class FText                                   Temp_text_Variable;                                // 0x0240(0x0018)(ConstParm)
};
static_assert(alignof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting) == 0x000008, "Wrong alignment on W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting");
static_assert(sizeof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting) == 0x000258, "Wrong size on W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, EntryPoint) == 0x000000, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, Temp_float_Variable) == 0x000004, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, Temp_bool_Variable) == 0x000008, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, Temp_byte_Variable) == 0x000009, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, Temp_byte_Variable_1) == 0x00000A, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, Temp_bool_Variable_1) == 0x00000B, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, Temp_float_Variable_1) == 0x00001C, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, Temp_float_Variable_2) == 0x000020, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, Temp_bool_Variable_2) == 0x000024, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, Temp_byte_Variable_2) == 0x000025, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, Temp_byte_Variable_3) == 0x000026, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, Temp_byte_Variable_4) == 0x000027, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, CallFunc_Create_ReturnValue) == 0x000028, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, CallFunc_Create_ReturnValue_1) == 0x000030, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, CallFunc_Create_ReturnValue_2) == 0x000038, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, K2Node_Event_IsDesignTime) == 0x000040, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, CallFunc_MakeLiteralByte_ReturnValue) == 0x000041, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, CallFunc_IsValid_ReturnValue) == 0x000042, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, CallFunc_GetPlayerController_ReturnValue) == 0x000048, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, K2Node_DynamicCast_AsBP_Base_Controller) == 0x000050, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::K2Node_DynamicCast_AsBP_Base_Controller' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, CallFunc_Get_Stacked_Item_ID_Amount_Amount) == 0x00005C, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::CallFunc_Get_Stacked_Item_ID_Amount_Amount' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, CallFunc_Conv_IntToText_ReturnValue) == 0x000060, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, CallFunc_Greater_IntInt_ReturnValue) == 0x000078, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, K2Node_MakeStruct_FormatArgumentData) == 0x000080, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, K2Node_MakeArray_Array) == 0x0000C0, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, K2Node_Select_Default) == 0x0000D0, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, CallFunc_Format_ReturnValue) == 0x0000D8, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, K2Node_Select_Default_1) == 0x0000F0, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, CallFunc_Get_Stacked_Item_ID_Amount_Amount_1) == 0x0000F4, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::CallFunc_Get_Stacked_Item_ID_Amount_Amount_1' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, CallFunc_Get_Stacked_Item_ID_Amount_Amount_2) == 0x0000F8, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::CallFunc_Get_Stacked_Item_ID_Amount_Amount_2' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000100, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, K2Node_MakeStruct_FormatArgumentData_1) == 0x000118, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000158, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, K2Node_MakeArray_Array_1) == 0x000160, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, CallFunc_Format_ReturnValue_1) == 0x000170, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, K2Node_Select_Default_2) == 0x000188, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, CallFunc_GetPlayerController_ReturnValue_1) == 0x000190, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, K2Node_DynamicCast_AsBP_Base_Controller_1) == 0x000198, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::K2Node_DynamicCast_AsBP_Base_Controller_1' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, K2Node_DynamicCast_bSuccess_1) == 0x0001A0, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, Temp_float_Variable_3) == 0x0001A4, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, Temp_bool_Variable_3) == 0x0001A8, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, K2Node_Select_Default_3) == 0x0001AC, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, K2Node_CustomEvent_ChestType) == 0x0001B0, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::K2Node_CustomEvent_ChestType' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, CallFunc_GetPlayerController_ReturnValue_2) == 0x0001B8, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, K2Node_DynamicCast_AsBP_Base_Controller_2) == 0x0001C0, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::K2Node_DynamicCast_AsBP_Base_Controller_2' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, K2Node_DynamicCast_bSuccess_2) == 0x0001C8, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001CC, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, CallFunc_GetPlayerController_ReturnValue_3) == 0x0001E0, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, K2Node_DynamicCast_AsBP_Base_Controller_3) == 0x0001E8, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::K2Node_DynamicCast_AsBP_Base_Controller_3' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, K2Node_DynamicCast_bSuccess_3) == 0x0001F0, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, CallFunc_GetPlayerController_ReturnValue_4) == 0x0001F8, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::CallFunc_GetPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, K2Node_DynamicCast_AsBP_Base_Controller_4) == 0x000200, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::K2Node_DynamicCast_AsBP_Base_Controller_4' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, K2Node_DynamicCast_bSuccess_4) == 0x000208, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, K2Node_Select_Default_4) == 0x000210, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, CallFunc_PlayAnimation_ReturnValue) == 0x000218, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000220, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000221, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, CallFunc_Conv_IntToText_ReturnValue_2) == 0x000228, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting, Temp_text_Variable) == 0x000240, "Member 'W_BattleCrafting_C_ExecuteUbergraph_W_BattleCrafting::Temp_text_Variable' has a wrong offset!");

// Function W_BattleCrafting.W_BattleCrafting_C.BasicChestCrafted
// 0x0001 (0x0001 - 0x0000)
struct W_BattleCrafting_C_BasicChestCrafted final
{
public:
	E_ChestTypes                                  ChestType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BattleCrafting_C_BasicChestCrafted) == 0x000001, "Wrong alignment on W_BattleCrafting_C_BasicChestCrafted");
static_assert(sizeof(W_BattleCrafting_C_BasicChestCrafted) == 0x000001, "Wrong size on W_BattleCrafting_C_BasicChestCrafted");
static_assert(offsetof(W_BattleCrafting_C_BasicChestCrafted, ChestType) == 0x000000, "Member 'W_BattleCrafting_C_BasicChestCrafted::ChestType' has a wrong offset!");

// Function W_BattleCrafting.W_BattleCrafting_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_BattleCrafting_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_BattleCrafting_C_PreConstruct) == 0x000001, "Wrong alignment on W_BattleCrafting_C_PreConstruct");
static_assert(sizeof(W_BattleCrafting_C_PreConstruct) == 0x000001, "Wrong size on W_BattleCrafting_C_PreConstruct");
static_assert(offsetof(W_BattleCrafting_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_BattleCrafting_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_BattleCrafting.W_BattleCrafting_C.GetbIsEnabled_0
// 0x0001 (0x0001 - 0x0000)
struct W_BattleCrafting_C_GetbIsEnabled_0 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_BattleCrafting_C_GetbIsEnabled_0) == 0x000001, "Wrong alignment on W_BattleCrafting_C_GetbIsEnabled_0");
static_assert(sizeof(W_BattleCrafting_C_GetbIsEnabled_0) == 0x000001, "Wrong size on W_BattleCrafting_C_GetbIsEnabled_0");
static_assert(offsetof(W_BattleCrafting_C_GetbIsEnabled_0, ReturnValue) == 0x000000, "Member 'W_BattleCrafting_C_GetbIsEnabled_0::ReturnValue' has a wrong offset!");

// Function W_BattleCrafting.W_BattleCrafting_C.GetbIsEnabled_1
// 0x0001 (0x0001 - 0x0000)
struct W_BattleCrafting_C_GetbIsEnabled_1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_BattleCrafting_C_GetbIsEnabled_1) == 0x000001, "Wrong alignment on W_BattleCrafting_C_GetbIsEnabled_1");
static_assert(sizeof(W_BattleCrafting_C_GetbIsEnabled_1) == 0x000001, "Wrong size on W_BattleCrafting_C_GetbIsEnabled_1");
static_assert(offsetof(W_BattleCrafting_C_GetbIsEnabled_1, ReturnValue) == 0x000000, "Member 'W_BattleCrafting_C_GetbIsEnabled_1::ReturnValue' has a wrong offset!");

// Function W_BattleCrafting.W_BattleCrafting_C.GetColorAndOpacity_0
// 0x0088 (0x0088 - 0x0000)
struct W_BattleCrafting_C_GetColorAndOpacity_0 final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0028)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x004C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0060(0x0028)()
};
static_assert(alignof(W_BattleCrafting_C_GetColorAndOpacity_0) == 0x000008, "Wrong alignment on W_BattleCrafting_C_GetColorAndOpacity_0");
static_assert(sizeof(W_BattleCrafting_C_GetColorAndOpacity_0) == 0x000088, "Wrong size on W_BattleCrafting_C_GetColorAndOpacity_0");
static_assert(offsetof(W_BattleCrafting_C_GetColorAndOpacity_0, ReturnValue) == 0x000000, "Member 'W_BattleCrafting_C_GetColorAndOpacity_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_GetColorAndOpacity_0, Temp_bool_Variable) == 0x000028, "Member 'W_BattleCrafting_C_GetColorAndOpacity_0::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_GetColorAndOpacity_0, Temp_struct_Variable) == 0x00002C, "Member 'W_BattleCrafting_C_GetColorAndOpacity_0::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_GetColorAndOpacity_0, Temp_struct_Variable_1) == 0x00003C, "Member 'W_BattleCrafting_C_GetColorAndOpacity_0::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_GetColorAndOpacity_0, K2Node_Select_Default) == 0x00004C, "Member 'W_BattleCrafting_C_GetColorAndOpacity_0::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateColor) == 0x000060, "Member 'W_BattleCrafting_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function W_BattleCrafting.W_BattleCrafting_C.GetColorAndOpacity_1
// 0x0088 (0x0088 - 0x0000)
struct W_BattleCrafting_C_GetColorAndOpacity_1 final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0028)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x004C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0060(0x0028)()
};
static_assert(alignof(W_BattleCrafting_C_GetColorAndOpacity_1) == 0x000008, "Wrong alignment on W_BattleCrafting_C_GetColorAndOpacity_1");
static_assert(sizeof(W_BattleCrafting_C_GetColorAndOpacity_1) == 0x000088, "Wrong size on W_BattleCrafting_C_GetColorAndOpacity_1");
static_assert(offsetof(W_BattleCrafting_C_GetColorAndOpacity_1, ReturnValue) == 0x000000, "Member 'W_BattleCrafting_C_GetColorAndOpacity_1::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_GetColorAndOpacity_1, Temp_bool_Variable) == 0x000028, "Member 'W_BattleCrafting_C_GetColorAndOpacity_1::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_BattleCrafting_C_GetColorAndOpacity_1, Temp_struct_Variable) == 0x00002C, "Member 'W_BattleCrafting_C_GetColorAndOpacity_1::Temp_struct_Variable' has a wrong offset!");
