#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_BanTypeConfirm

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_BanTypeConfirm.W_BanTypeConfirm_C
// 0x0038 (0x0298 - 0x0260)
class UW_BanTypeConfirm_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_106;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Button_C*                            W_Button;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Button_C*                            W_Button_1;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CloseButton_C*                       W_CloseButton_C_0;                                 // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TextBox_C*                           W_TextBox_Password;                                // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class APlayerState*                           PlayerState;                                       // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_BanTypeConfirm(int32 EntryPoint);
	void BndEvt__W_BanTypeConfirm_W_CloseButton_C_0_K2Node_ComponentBoundEvent_2_ButtonPressed__DelegateSignature();
	void BndEvt__W_BanTypeConfirm_W_Button_K2Node_ComponentBoundEvent_1_ButtonPressed__DelegateSignature();
	void BndEvt__W_BanTypeConfirm_W_Button_1_K2Node_ComponentBoundEvent_0_ButtonPressed__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_BanTypeConfirm_C">();
	}
	static class UW_BanTypeConfirm_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_BanTypeConfirm_C>();
	}
};
static_assert(alignof(UW_BanTypeConfirm_C) == 0x000008, "Wrong alignment on UW_BanTypeConfirm_C");
static_assert(sizeof(UW_BanTypeConfirm_C) == 0x000298, "Wrong size on UW_BanTypeConfirm_C");
static_assert(offsetof(UW_BanTypeConfirm_C, UberGraphFrame) == 0x000260, "Member 'UW_BanTypeConfirm_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_BanTypeConfirm_C, Image_106) == 0x000268, "Member 'UW_BanTypeConfirm_C::Image_106' has a wrong offset!");
static_assert(offsetof(UW_BanTypeConfirm_C, W_Button) == 0x000270, "Member 'UW_BanTypeConfirm_C::W_Button' has a wrong offset!");
static_assert(offsetof(UW_BanTypeConfirm_C, W_Button_1) == 0x000278, "Member 'UW_BanTypeConfirm_C::W_Button_1' has a wrong offset!");
static_assert(offsetof(UW_BanTypeConfirm_C, W_CloseButton_C_0) == 0x000280, "Member 'UW_BanTypeConfirm_C::W_CloseButton_C_0' has a wrong offset!");
static_assert(offsetof(UW_BanTypeConfirm_C, W_TextBox_Password) == 0x000288, "Member 'UW_BanTypeConfirm_C::W_TextBox_Password' has a wrong offset!");
static_assert(offsetof(UW_BanTypeConfirm_C, PlayerState) == 0x000290, "Member 'UW_BanTypeConfirm_C::PlayerState' has a wrong offset!");

}

