#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_BanListEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "ST_ServerManagerPlayerInfo_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_BanListEntry.W_BanListEntry_C
// 0x0048 (0x02A8 - 0x0260)
class UW_BanListEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             TextBlock;                                         // 0x0268(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_36;                                      // 0x0270(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Button_C*                            W_Button_1;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FST_ServerManagerPlayerInfo            PlayerInfo;                                        // 0x0280(0x0020)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UW_ServerManagement_C*                  ServerManagementWidgetRef;                         // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_BanListEntry(int32 EntryPoint);
	void BndEvt__W_BanListEntry_W_Button_1_K2Node_ComponentBoundEvent_0_ButtonPressed__DelegateSignature();
	class FText GetText_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_BanListEntry_C">();
	}
	static class UW_BanListEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_BanListEntry_C>();
	}
};
static_assert(alignof(UW_BanListEntry_C) == 0x000008, "Wrong alignment on UW_BanListEntry_C");
static_assert(sizeof(UW_BanListEntry_C) == 0x0002A8, "Wrong size on UW_BanListEntry_C");
static_assert(offsetof(UW_BanListEntry_C, UberGraphFrame) == 0x000260, "Member 'UW_BanListEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_BanListEntry_C, TextBlock) == 0x000268, "Member 'UW_BanListEntry_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UW_BanListEntry_C, TextBlock_36) == 0x000270, "Member 'UW_BanListEntry_C::TextBlock_36' has a wrong offset!");
static_assert(offsetof(UW_BanListEntry_C, W_Button_1) == 0x000278, "Member 'UW_BanListEntry_C::W_Button_1' has a wrong offset!");
static_assert(offsetof(UW_BanListEntry_C, PlayerInfo) == 0x000280, "Member 'UW_BanListEntry_C::PlayerInfo' has a wrong offset!");
static_assert(offsetof(UW_BanListEntry_C, ServerManagementWidgetRef) == 0x0002A0, "Member 'UW_BanListEntry_C::ServerManagementWidgetRef' has a wrong offset!");

}

