#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_BanTypeConfirm

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_BanTypeConfirm.W_BanTypeConfirm_C.ExecuteUbergraph_W_BanTypeConfirm
// 0x0050 (0x0050 - 0x0000)
struct W_BanTypeConfirm_C_ExecuteUbergraph_W_BanTypeConfirm final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GameStateBase_C*                    K2Node_DynamicCast_AsBP_Game_State_Base;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UW_ServerManagement_C*>          CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_ServerManagement_C*                  CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GameStateBase_C*                    K2Node_DynamicCast_AsBP_Game_State_Base_1;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_BanTypeConfirm_C_ExecuteUbergraph_W_BanTypeConfirm) == 0x000008, "Wrong alignment on W_BanTypeConfirm_C_ExecuteUbergraph_W_BanTypeConfirm");
static_assert(sizeof(W_BanTypeConfirm_C_ExecuteUbergraph_W_BanTypeConfirm) == 0x000050, "Wrong size on W_BanTypeConfirm_C_ExecuteUbergraph_W_BanTypeConfirm");
static_assert(offsetof(W_BanTypeConfirm_C_ExecuteUbergraph_W_BanTypeConfirm, EntryPoint) == 0x000000, "Member 'W_BanTypeConfirm_C_ExecuteUbergraph_W_BanTypeConfirm::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_BanTypeConfirm_C_ExecuteUbergraph_W_BanTypeConfirm, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'W_BanTypeConfirm_C_ExecuteUbergraph_W_BanTypeConfirm::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BanTypeConfirm_C_ExecuteUbergraph_W_BanTypeConfirm, K2Node_DynamicCast_AsBP_Game_State_Base) == 0x000010, "Member 'W_BanTypeConfirm_C_ExecuteUbergraph_W_BanTypeConfirm::K2Node_DynamicCast_AsBP_Game_State_Base' has a wrong offset!");
static_assert(offsetof(W_BanTypeConfirm_C_ExecuteUbergraph_W_BanTypeConfirm, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'W_BanTypeConfirm_C_ExecuteUbergraph_W_BanTypeConfirm::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_BanTypeConfirm_C_ExecuteUbergraph_W_BanTypeConfirm, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000020, "Member 'W_BanTypeConfirm_C_ExecuteUbergraph_W_BanTypeConfirm::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(W_BanTypeConfirm_C_ExecuteUbergraph_W_BanTypeConfirm, CallFunc_GetGameState_ReturnValue_1) == 0x000030, "Member 'W_BanTypeConfirm_C_ExecuteUbergraph_W_BanTypeConfirm::CallFunc_GetGameState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BanTypeConfirm_C_ExecuteUbergraph_W_BanTypeConfirm, CallFunc_Array_Get_Item) == 0x000038, "Member 'W_BanTypeConfirm_C_ExecuteUbergraph_W_BanTypeConfirm::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_BanTypeConfirm_C_ExecuteUbergraph_W_BanTypeConfirm, K2Node_DynamicCast_AsBP_Game_State_Base_1) == 0x000040, "Member 'W_BanTypeConfirm_C_ExecuteUbergraph_W_BanTypeConfirm::K2Node_DynamicCast_AsBP_Game_State_Base_1' has a wrong offset!");
static_assert(offsetof(W_BanTypeConfirm_C_ExecuteUbergraph_W_BanTypeConfirm, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'W_BanTypeConfirm_C_ExecuteUbergraph_W_BanTypeConfirm::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

