#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ChatOverlay

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_ChatOverlay.W_ChatOverlay_C.ExecuteUbergraph_W_ChatOverlay
// 0x00A8 (0x00A8 - 0x0000)
struct W_ChatOverlay_C_ExecuteUbergraph_W_ChatOverlay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x0004(0x0010)(NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0014(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Controller_C*                       K2Node_DynamicCast_AsBP_Controller;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_VehicleBase_C*                      K2Node_DynamicCast_AsBP_Vehicle_Base;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_SpawnSelect_C*                       K2Node_DynamicCast_AsW_Spawn_Select;               // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Character_C*                        K2Node_DynamicCast_AsBP_Character;                 // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_ChatOverlay_C_ExecuteUbergraph_W_ChatOverlay) == 0x000008, "Wrong alignment on W_ChatOverlay_C_ExecuteUbergraph_W_ChatOverlay");
static_assert(sizeof(W_ChatOverlay_C_ExecuteUbergraph_W_ChatOverlay) == 0x0000A8, "Wrong size on W_ChatOverlay_C_ExecuteUbergraph_W_ChatOverlay");
static_assert(offsetof(W_ChatOverlay_C_ExecuteUbergraph_W_ChatOverlay, EntryPoint) == 0x000000, "Member 'W_ChatOverlay_C_ExecuteUbergraph_W_ChatOverlay::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_ChatOverlay_C_ExecuteUbergraph_W_ChatOverlay, K2Node_MakeStruct_Anchors) == 0x000004, "Member 'W_ChatOverlay_C_ExecuteUbergraph_W_ChatOverlay::K2Node_MakeStruct_Anchors' has a wrong offset!");
static_assert(offsetof(W_ChatOverlay_C_ExecuteUbergraph_W_ChatOverlay, K2Node_Event_MyGeometry) == 0x000014, "Member 'W_ChatOverlay_C_ExecuteUbergraph_W_ChatOverlay::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_ChatOverlay_C_ExecuteUbergraph_W_ChatOverlay, K2Node_Event_InDeltaTime) == 0x00004C, "Member 'W_ChatOverlay_C_ExecuteUbergraph_W_ChatOverlay::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_ChatOverlay_C_ExecuteUbergraph_W_ChatOverlay, CallFunc_GetPlayerController_ReturnValue) == 0x000050, "Member 'W_ChatOverlay_C_ExecuteUbergraph_W_ChatOverlay::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ChatOverlay_C_ExecuteUbergraph_W_ChatOverlay, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000058, "Member 'W_ChatOverlay_C_ExecuteUbergraph_W_ChatOverlay::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ChatOverlay_C_ExecuteUbergraph_W_ChatOverlay, K2Node_DynamicCast_AsBP_Controller) == 0x000060, "Member 'W_ChatOverlay_C_ExecuteUbergraph_W_ChatOverlay::K2Node_DynamicCast_AsBP_Controller' has a wrong offset!");
static_assert(offsetof(W_ChatOverlay_C_ExecuteUbergraph_W_ChatOverlay, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'W_ChatOverlay_C_ExecuteUbergraph_W_ChatOverlay::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_ChatOverlay_C_ExecuteUbergraph_W_ChatOverlay, CallFunc_K2_GetPawn_ReturnValue) == 0x000070, "Member 'W_ChatOverlay_C_ExecuteUbergraph_W_ChatOverlay::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ChatOverlay_C_ExecuteUbergraph_W_ChatOverlay, K2Node_DynamicCast_AsBP_Vehicle_Base) == 0x000078, "Member 'W_ChatOverlay_C_ExecuteUbergraph_W_ChatOverlay::K2Node_DynamicCast_AsBP_Vehicle_Base' has a wrong offset!");
static_assert(offsetof(W_ChatOverlay_C_ExecuteUbergraph_W_ChatOverlay, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'W_ChatOverlay_C_ExecuteUbergraph_W_ChatOverlay::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_ChatOverlay_C_ExecuteUbergraph_W_ChatOverlay, K2Node_DynamicCast_AsW_Spawn_Select) == 0x000088, "Member 'W_ChatOverlay_C_ExecuteUbergraph_W_ChatOverlay::K2Node_DynamicCast_AsW_Spawn_Select' has a wrong offset!");
static_assert(offsetof(W_ChatOverlay_C_ExecuteUbergraph_W_ChatOverlay, K2Node_DynamicCast_bSuccess_2) == 0x000090, "Member 'W_ChatOverlay_C_ExecuteUbergraph_W_ChatOverlay::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(W_ChatOverlay_C_ExecuteUbergraph_W_ChatOverlay, K2Node_DynamicCast_AsBP_Character) == 0x000098, "Member 'W_ChatOverlay_C_ExecuteUbergraph_W_ChatOverlay::K2Node_DynamicCast_AsBP_Character' has a wrong offset!");
static_assert(offsetof(W_ChatOverlay_C_ExecuteUbergraph_W_ChatOverlay, K2Node_DynamicCast_bSuccess_3) == 0x0000A0, "Member 'W_ChatOverlay_C_ExecuteUbergraph_W_ChatOverlay::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");

// Function W_ChatOverlay.W_ChatOverlay_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_ChatOverlay_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ChatOverlay_C_Tick) == 0x000004, "Wrong alignment on W_ChatOverlay_C_Tick");
static_assert(sizeof(W_ChatOverlay_C_Tick) == 0x00003C, "Wrong size on W_ChatOverlay_C_Tick");
static_assert(offsetof(W_ChatOverlay_C_Tick, MyGeometry) == 0x000000, "Member 'W_ChatOverlay_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_ChatOverlay_C_Tick, InDeltaTime) == 0x000038, "Member 'W_ChatOverlay_C_Tick::InDeltaTime' has a wrong offset!");

// Function W_ChatOverlay.W_ChatOverlay_C.ShowHUD
// 0x0020 (0x0020 - 0x0000)
struct W_ChatOverlay_C_ShowHUD final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_GameInstance_C*                     K2Node_DynamicCast_AsBP_Game_Instance;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ChatOverlay_C_ShowHUD) == 0x000008, "Wrong alignment on W_ChatOverlay_C_ShowHUD");
static_assert(sizeof(W_ChatOverlay_C_ShowHUD) == 0x000020, "Wrong size on W_ChatOverlay_C_ShowHUD");
static_assert(offsetof(W_ChatOverlay_C_ShowHUD, ReturnValue) == 0x000000, "Member 'W_ChatOverlay_C_ShowHUD::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ChatOverlay_C_ShowHUD, Temp_bool_Variable) == 0x000001, "Member 'W_ChatOverlay_C_ShowHUD::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_ChatOverlay_C_ShowHUD, Temp_byte_Variable) == 0x000002, "Member 'W_ChatOverlay_C_ShowHUD::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_ChatOverlay_C_ShowHUD, Temp_byte_Variable_1) == 0x000003, "Member 'W_ChatOverlay_C_ShowHUD::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_ChatOverlay_C_ShowHUD, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'W_ChatOverlay_C_ShowHUD::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ChatOverlay_C_ShowHUD, K2Node_DynamicCast_AsBP_Game_Instance) == 0x000010, "Member 'W_ChatOverlay_C_ShowHUD::K2Node_DynamicCast_AsBP_Game_Instance' has a wrong offset!");
static_assert(offsetof(W_ChatOverlay_C_ShowHUD, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'W_ChatOverlay_C_ShowHUD::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_ChatOverlay_C_ShowHUD, K2Node_Select_Default) == 0x000019, "Member 'W_ChatOverlay_C_ShowHUD::K2Node_Select_Default' has a wrong offset!");

}

