#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ChatEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_ChatEntry.W_ChatEntry_C.ExecuteUbergraph_W_ChatEntry
// 0x0138 (0x0138 - 0x0000)
struct W_ChatEntry_C_ExecuteUbergraph_W_ChatEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0058(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0070(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00B0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x00F0(0x0010)(ReferenceParm)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0108(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0120(0x0018)(ConstParm)
};
static_assert(alignof(W_ChatEntry_C_ExecuteUbergraph_W_ChatEntry) == 0x000008, "Wrong alignment on W_ChatEntry_C_ExecuteUbergraph_W_ChatEntry");
static_assert(sizeof(W_ChatEntry_C_ExecuteUbergraph_W_ChatEntry) == 0x000138, "Wrong size on W_ChatEntry_C_ExecuteUbergraph_W_ChatEntry");
static_assert(offsetof(W_ChatEntry_C_ExecuteUbergraph_W_ChatEntry, EntryPoint) == 0x000000, "Member 'W_ChatEntry_C_ExecuteUbergraph_W_ChatEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_ChatEntry_C_ExecuteUbergraph_W_ChatEntry, Temp_bool_Variable) == 0x000004, "Member 'W_ChatEntry_C_ExecuteUbergraph_W_ChatEntry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_ChatEntry_C_ExecuteUbergraph_W_ChatEntry, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'W_ChatEntry_C_ExecuteUbergraph_W_ChatEntry::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_ChatEntry_C_ExecuteUbergraph_W_ChatEntry, K2Node_MakeArray_Array) == 0x000048, "Member 'W_ChatEntry_C_ExecuteUbergraph_W_ChatEntry::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_ChatEntry_C_ExecuteUbergraph_W_ChatEntry, CallFunc_Format_ReturnValue) == 0x000058, "Member 'W_ChatEntry_C_ExecuteUbergraph_W_ChatEntry::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ChatEntry_C_ExecuteUbergraph_W_ChatEntry, K2Node_MakeStruct_FormatArgumentData_1) == 0x000070, "Member 'W_ChatEntry_C_ExecuteUbergraph_W_ChatEntry::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_ChatEntry_C_ExecuteUbergraph_W_ChatEntry, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000B0, "Member 'W_ChatEntry_C_ExecuteUbergraph_W_ChatEntry::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(W_ChatEntry_C_ExecuteUbergraph_W_ChatEntry, K2Node_MakeArray_Array_1) == 0x0000F0, "Member 'W_ChatEntry_C_ExecuteUbergraph_W_ChatEntry::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(W_ChatEntry_C_ExecuteUbergraph_W_ChatEntry, K2Node_Event_IsDesignTime) == 0x000100, "Member 'W_ChatEntry_C_ExecuteUbergraph_W_ChatEntry::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_ChatEntry_C_ExecuteUbergraph_W_ChatEntry, CallFunc_Format_ReturnValue_1) == 0x000108, "Member 'W_ChatEntry_C_ExecuteUbergraph_W_ChatEntry::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ChatEntry_C_ExecuteUbergraph_W_ChatEntry, K2Node_Select_Default) == 0x000120, "Member 'W_ChatEntry_C_ExecuteUbergraph_W_ChatEntry::K2Node_Select_Default' has a wrong offset!");

// Function W_ChatEntry.W_ChatEntry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_ChatEntry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_ChatEntry_C_PreConstruct) == 0x000001, "Wrong alignment on W_ChatEntry_C_PreConstruct");
static_assert(sizeof(W_ChatEntry_C_PreConstruct) == 0x000001, "Wrong size on W_ChatEntry_C_PreConstruct");
static_assert(offsetof(W_ChatEntry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_ChatEntry_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

