#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CloseButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_CloseButton.W_CloseButton_C
// 0x0040 (0x02A0 - 0x0260)
class UW_CloseButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_1;                                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_74;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              ButtonPressed;                                     // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   ButtonText;                                        // 0x0288(0x0018)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_W_CloseButton(int32 EntryPoint);
	void BndEvt__W_Button_Button_1_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_CloseButton_C">();
	}
	static class UW_CloseButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_CloseButton_C>();
	}
};
static_assert(alignof(UW_CloseButton_C) == 0x000008, "Wrong alignment on UW_CloseButton_C");
static_assert(sizeof(UW_CloseButton_C) == 0x0002A0, "Wrong size on UW_CloseButton_C");
static_assert(offsetof(UW_CloseButton_C, UberGraphFrame) == 0x000260, "Member 'UW_CloseButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_CloseButton_C, Button_1) == 0x000268, "Member 'UW_CloseButton_C::Button_1' has a wrong offset!");
static_assert(offsetof(UW_CloseButton_C, Image_74) == 0x000270, "Member 'UW_CloseButton_C::Image_74' has a wrong offset!");
static_assert(offsetof(UW_CloseButton_C, ButtonPressed) == 0x000278, "Member 'UW_CloseButton_C::ButtonPressed' has a wrong offset!");
static_assert(offsetof(UW_CloseButton_C, ButtonText) == 0x000288, "Member 'UW_CloseButton_C::ButtonText' has a wrong offset!");

}

