#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Combobox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Combobox.W_Combobox_C
// 0x0040 (0x02A0 - 0x0260)
class UW_Combobox_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UComboBoxString*                        ComboBoxString_74;                                 // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FString>                         Options;                                           // 0x0270(0x0010)(Edit, BlueprintVisible)
	TMulticastInlineDelegate<void(const class FString& Selection)> OnSelectionChanged;               // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FString                                 SelectedOption;                                    // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Combobox(int32 EntryPoint);
	void Reload();
	void BndEvt__W_Combobox_ComboBoxString_74_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Combobox_C">();
	}
	static class UW_Combobox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Combobox_C>();
	}
};
static_assert(alignof(UW_Combobox_C) == 0x000008, "Wrong alignment on UW_Combobox_C");
static_assert(sizeof(UW_Combobox_C) == 0x0002A0, "Wrong size on UW_Combobox_C");
static_assert(offsetof(UW_Combobox_C, UberGraphFrame) == 0x000260, "Member 'UW_Combobox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Combobox_C, ComboBoxString_74) == 0x000268, "Member 'UW_Combobox_C::ComboBoxString_74' has a wrong offset!");
static_assert(offsetof(UW_Combobox_C, Options) == 0x000270, "Member 'UW_Combobox_C::Options' has a wrong offset!");
static_assert(offsetof(UW_Combobox_C, OnSelectionChanged) == 0x000280, "Member 'UW_Combobox_C::OnSelectionChanged' has a wrong offset!");
static_assert(offsetof(UW_Combobox_C, SelectedOption) == 0x000290, "Member 'UW_Combobox_C::SelectedOption' has a wrong offset!");

}

