#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_DamageNumberEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_DamageNumberEntry.W_DamageNumberEntry_C
// 0x0030 (0x0290 - 0x0260)
class UW_DamageNumberEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Refresh;                                           // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PopUp;                                             // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_0;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_DamageAmount;                            // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         TotalDamage;                                       // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Stacked;                                           // 0x028C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_W_DamageNumberEntry(int32 EntryPoint);
	void IncreaseDamageNumber(int32 DamageAmount);
	void ShowDamageNumber(const struct FST_DamageInformation& DamageInfo, int32 Counter);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_DamageNumberEntry_C">();
	}
	static class UW_DamageNumberEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_DamageNumberEntry_C>();
	}
};
static_assert(alignof(UW_DamageNumberEntry_C) == 0x000008, "Wrong alignment on UW_DamageNumberEntry_C");
static_assert(sizeof(UW_DamageNumberEntry_C) == 0x000290, "Wrong size on UW_DamageNumberEntry_C");
static_assert(offsetof(UW_DamageNumberEntry_C, UberGraphFrame) == 0x000260, "Member 'UW_DamageNumberEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_DamageNumberEntry_C, Refresh) == 0x000268, "Member 'UW_DamageNumberEntry_C::Refresh' has a wrong offset!");
static_assert(offsetof(UW_DamageNumberEntry_C, PopUp) == 0x000270, "Member 'UW_DamageNumberEntry_C::PopUp' has a wrong offset!");
static_assert(offsetof(UW_DamageNumberEntry_C, Border_0) == 0x000278, "Member 'UW_DamageNumberEntry_C::Border_0' has a wrong offset!");
static_assert(offsetof(UW_DamageNumberEntry_C, TextBlock_DamageAmount) == 0x000280, "Member 'UW_DamageNumberEntry_C::TextBlock_DamageAmount' has a wrong offset!");
static_assert(offsetof(UW_DamageNumberEntry_C, TotalDamage) == 0x000288, "Member 'UW_DamageNumberEntry_C::TotalDamage' has a wrong offset!");
static_assert(offsetof(UW_DamageNumberEntry_C, Stacked) == 0x00028C, "Member 'UW_DamageNumberEntry_C::Stacked' has a wrong offset!");

}

