#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_DamageNumberEntry

#include "Basic.hpp"

#include "ST_DamageInformation_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_DamageNumberEntry.W_DamageNumberEntry_C.ExecuteUbergraph_W_DamageNumberEntry
// 0x01E0 (0x01E0 - 0x0000)
struct W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0040)(HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0060(0x0018)()
	struct FST_DamageInformation                  K2Node_CustomEvent_DamageInfo;                     // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Counter;                        // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00A0(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00C0(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0108(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0120(0x0018)()
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_1;                // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_DamageAmount;                   // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_2;                // 0x015C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_3;                // 0x016C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_4;                // 0x017C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0190(0x0028)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry) == 0x000008, "Wrong alignment on W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry");
static_assert(sizeof(W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry) == 0x0001E0, "Wrong size on W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry");
static_assert(offsetof(W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry, EntryPoint) == 0x000000, "Member 'W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry, Temp_int_Variable) == 0x000004, "Member 'W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry, Temp_float_Variable) == 0x000048, "Member 'W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry, K2Node_MakeArray_Array) == 0x000050, "Member 'W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry, CallFunc_Format_ReturnValue) == 0x000060, "Member 'W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry, K2Node_CustomEvent_DamageInfo) == 0x000078, "Member 'W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry::K2Node_CustomEvent_DamageInfo' has a wrong offset!");
static_assert(offsetof(W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry, K2Node_CustomEvent_Counter) == 0x000090, "Member 'W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry::K2Node_CustomEvent_Counter' has a wrong offset!");
static_assert(offsetof(W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry, CallFunc_PlayAnimation_ReturnValue) == 0x000098, "Member 'W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry, CallFunc_Conv_IntToText_ReturnValue) == 0x0000A0, "Member 'W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000B8, "Member 'W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000C0, "Member 'W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000100, "Member 'W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry, K2Node_MakeArray_Array_1) == 0x000108, "Member 'W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000118, "Member 'W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry, CallFunc_Format_ReturnValue_1) == 0x000120, "Member 'W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry, CallFunc_SelectColor_ReturnValue) == 0x000138, "Member 'W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry, CallFunc_SelectColor_ReturnValue_1) == 0x000148, "Member 'W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry::CallFunc_SelectColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry, K2Node_CustomEvent_DamageAmount) == 0x000158, "Member 'W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry::K2Node_CustomEvent_DamageAmount' has a wrong offset!");
static_assert(offsetof(W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry, CallFunc_SelectColor_ReturnValue_2) == 0x00015C, "Member 'W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry::CallFunc_SelectColor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry, CallFunc_SelectColor_ReturnValue_3) == 0x00016C, "Member 'W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry::CallFunc_SelectColor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry, CallFunc_SelectColor_ReturnValue_4) == 0x00017C, "Member 'W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry::CallFunc_SelectColor_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry, K2Node_MakeStruct_SlateColor) == 0x000190, "Member 'W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry, CallFunc_Add_IntInt_ReturnValue) == 0x0001B8, "Member 'W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry, CallFunc_PlayAnimation_ReturnValue_1) == 0x0001C0, "Member 'W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry, CallFunc_RandomFloatInRange_ReturnValue) == 0x0001C8, "Member 'W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x0001CC, "Member 'W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x0001D0, "Member 'W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry, K2Node_Select_Default) == 0x0001D4, "Member 'W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry, CallFunc_MakeVector2D_ReturnValue) == 0x0001D8, "Member 'W_DamageNumberEntry_C_ExecuteUbergraph_W_DamageNumberEntry::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function W_DamageNumberEntry.W_DamageNumberEntry_C.IncreaseDamageNumber
// 0x0004 (0x0004 - 0x0000)
struct W_DamageNumberEntry_C_IncreaseDamageNumber final
{
public:
	int32                                         DamageAmount;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DamageNumberEntry_C_IncreaseDamageNumber) == 0x000004, "Wrong alignment on W_DamageNumberEntry_C_IncreaseDamageNumber");
static_assert(sizeof(W_DamageNumberEntry_C_IncreaseDamageNumber) == 0x000004, "Wrong size on W_DamageNumberEntry_C_IncreaseDamageNumber");
static_assert(offsetof(W_DamageNumberEntry_C_IncreaseDamageNumber, DamageAmount) == 0x000000, "Member 'W_DamageNumberEntry_C_IncreaseDamageNumber::DamageAmount' has a wrong offset!");

// Function W_DamageNumberEntry.W_DamageNumberEntry_C.ShowDamageNumber
// 0x0020 (0x0020 - 0x0000)
struct W_DamageNumberEntry_C_ShowDamageNumber final
{
public:
	struct FST_DamageInformation                  DamageInfo;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Counter;                                           // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DamageNumberEntry_C_ShowDamageNumber) == 0x000008, "Wrong alignment on W_DamageNumberEntry_C_ShowDamageNumber");
static_assert(sizeof(W_DamageNumberEntry_C_ShowDamageNumber) == 0x000020, "Wrong size on W_DamageNumberEntry_C_ShowDamageNumber");
static_assert(offsetof(W_DamageNumberEntry_C_ShowDamageNumber, DamageInfo) == 0x000000, "Member 'W_DamageNumberEntry_C_ShowDamageNumber::DamageInfo' has a wrong offset!");
static_assert(offsetof(W_DamageNumberEntry_C_ShowDamageNumber, Counter) == 0x000018, "Member 'W_DamageNumberEntry_C_ShowDamageNumber::Counter' has a wrong offset!");

}

