#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_EliminationPlaque

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "E_Teams_structs.hpp"


namespace SDK::Params
{

// Function W_EliminationPlaque.W_EliminationPlaque_C.SetPlaqueImage
// 0x01C0 (0x01C0 - 0x0000)
struct W_EliminationPlaque_C_SetPlaqueImage final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x0088)(Parm, OutParm, ReturnParm)
	E_Teams                                       Temp_byte_Variable;                                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_2;                            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x00A8(0x0088)()
	class UObject*                                K2Node_Select_Default;                             // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x0138(0x0088)()
};
static_assert(alignof(W_EliminationPlaque_C_SetPlaqueImage) == 0x000008, "Wrong alignment on W_EliminationPlaque_C_SetPlaqueImage");
static_assert(sizeof(W_EliminationPlaque_C_SetPlaqueImage) == 0x0001C0, "Wrong size on W_EliminationPlaque_C_SetPlaqueImage");
static_assert(offsetof(W_EliminationPlaque_C_SetPlaqueImage, ReturnValue) == 0x000000, "Member 'W_EliminationPlaque_C_SetPlaqueImage::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EliminationPlaque_C_SetPlaqueImage, Temp_byte_Variable) == 0x000088, "Member 'W_EliminationPlaque_C_SetPlaqueImage::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_EliminationPlaque_C_SetPlaqueImage, Temp_object_Variable) == 0x000090, "Member 'W_EliminationPlaque_C_SetPlaqueImage::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(W_EliminationPlaque_C_SetPlaqueImage, Temp_object_Variable_1) == 0x000098, "Member 'W_EliminationPlaque_C_SetPlaqueImage::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(W_EliminationPlaque_C_SetPlaqueImage, Temp_object_Variable_2) == 0x0000A0, "Member 'W_EliminationPlaque_C_SetPlaqueImage::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(W_EliminationPlaque_C_SetPlaqueImage, K2Node_MakeStruct_SlateBrush) == 0x0000A8, "Member 'W_EliminationPlaque_C_SetPlaqueImage::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(W_EliminationPlaque_C_SetPlaqueImage, K2Node_Select_Default) == 0x000130, "Member 'W_EliminationPlaque_C_SetPlaqueImage::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_EliminationPlaque_C_SetPlaqueImage, K2Node_MakeStruct_SlateBrush_1) == 0x000138, "Member 'W_EliminationPlaque_C_SetPlaqueImage::K2Node_MakeStruct_SlateBrush_1' has a wrong offset!");

}

