#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_EmoteMenu

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function W_EmoteMenu.W_EmoteMenu_C.ExecuteUbergraph_W_EmoteMenu
// 0x0088 (0x0088 - 0x0000)
struct W_EmoteMenu_C_ExecuteUbergraph_W_EmoteMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Controller_C*                       K2Node_DynamicCast_AsBP_Controller;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Controller_C*                       K2Node_DynamicCast_AsBP_Controller_1;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_EmoteMenu_C_ExecuteUbergraph_W_EmoteMenu) == 0x000008, "Wrong alignment on W_EmoteMenu_C_ExecuteUbergraph_W_EmoteMenu");
static_assert(sizeof(W_EmoteMenu_C_ExecuteUbergraph_W_EmoteMenu) == 0x000088, "Wrong size on W_EmoteMenu_C_ExecuteUbergraph_W_EmoteMenu");
static_assert(offsetof(W_EmoteMenu_C_ExecuteUbergraph_W_EmoteMenu, EntryPoint) == 0x000000, "Member 'W_EmoteMenu_C_ExecuteUbergraph_W_EmoteMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_EmoteMenu_C_ExecuteUbergraph_W_EmoteMenu, K2Node_Event_MyGeometry) == 0x000004, "Member 'W_EmoteMenu_C_ExecuteUbergraph_W_EmoteMenu::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_EmoteMenu_C_ExecuteUbergraph_W_EmoteMenu, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'W_EmoteMenu_C_ExecuteUbergraph_W_EmoteMenu::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_EmoteMenu_C_ExecuteUbergraph_W_EmoteMenu, CallFunc_GetPlayerController_ReturnValue) == 0x000040, "Member 'W_EmoteMenu_C_ExecuteUbergraph_W_EmoteMenu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EmoteMenu_C_ExecuteUbergraph_W_EmoteMenu, K2Node_DynamicCast_AsBP_Controller) == 0x000048, "Member 'W_EmoteMenu_C_ExecuteUbergraph_W_EmoteMenu::K2Node_DynamicCast_AsBP_Controller' has a wrong offset!");
static_assert(offsetof(W_EmoteMenu_C_ExecuteUbergraph_W_EmoteMenu, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'W_EmoteMenu_C_ExecuteUbergraph_W_EmoteMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_EmoteMenu_C_ExecuteUbergraph_W_EmoteMenu, CallFunc_PlayAnimation_ReturnValue) == 0x000058, "Member 'W_EmoteMenu_C_ExecuteUbergraph_W_EmoteMenu::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EmoteMenu_C_ExecuteUbergraph_W_EmoteMenu, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'W_EmoteMenu_C_ExecuteUbergraph_W_EmoteMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EmoteMenu_C_ExecuteUbergraph_W_EmoteMenu, CallFunc_GetPlayerController_ReturnValue_1) == 0x000068, "Member 'W_EmoteMenu_C_ExecuteUbergraph_W_EmoteMenu::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_EmoteMenu_C_ExecuteUbergraph_W_EmoteMenu, K2Node_DynamicCast_AsBP_Controller_1) == 0x000070, "Member 'W_EmoteMenu_C_ExecuteUbergraph_W_EmoteMenu::K2Node_DynamicCast_AsBP_Controller_1' has a wrong offset!");
static_assert(offsetof(W_EmoteMenu_C_ExecuteUbergraph_W_EmoteMenu, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'W_EmoteMenu_C_ExecuteUbergraph_W_EmoteMenu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_EmoteMenu_C_ExecuteUbergraph_W_EmoteMenu, CallFunc_PlayAnimation_ReturnValue_1) == 0x000080, "Member 'W_EmoteMenu_C_ExecuteUbergraph_W_EmoteMenu::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function W_EmoteMenu.W_EmoteMenu_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_EmoteMenu_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_EmoteMenu_C_Tick) == 0x000004, "Wrong alignment on W_EmoteMenu_C_Tick");
static_assert(sizeof(W_EmoteMenu_C_Tick) == 0x00003C, "Wrong size on W_EmoteMenu_C_Tick");
static_assert(offsetof(W_EmoteMenu_C_Tick, MyGeometry) == 0x000000, "Member 'W_EmoteMenu_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_EmoteMenu_C_Tick, InDeltaTime) == 0x000038, "Member 'W_EmoteMenu_C_Tick::InDeltaTime' has a wrong offset!");

// Function W_EmoteMenu.W_EmoteMenu_C.OnMouseButtonDown
// 0x0220 (0x0220 - 0x0000)
struct W_EmoteMenu_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue; // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0168(0x00B8)()
};
static_assert(alignof(W_EmoteMenu_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on W_EmoteMenu_C_OnMouseButtonDown");
static_assert(sizeof(W_EmoteMenu_C_OnMouseButtonDown) == 0x000220, "Wrong size on W_EmoteMenu_C_OnMouseButtonDown");
static_assert(offsetof(W_EmoteMenu_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'W_EmoteMenu_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_EmoteMenu_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'W_EmoteMenu_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(W_EmoteMenu_C_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'W_EmoteMenu_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EmoteMenu_C_OnMouseButtonDown, CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue) == 0x000160, "Member 'W_EmoteMenu_C_OnMouseButtonDown::CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EmoteMenu_C_OnMouseButtonDown, K2Node_MakeStruct_EventReply) == 0x000168, "Member 'W_EmoteMenu_C_OnMouseButtonDown::K2Node_MakeStruct_EventReply' has a wrong offset!");

// Function W_EmoteMenu.W_EmoteMenu_C.EnableEmotes
// 0x0020 (0x0020 - 0x0000)
struct W_EmoteMenu_C_EnableEmotes final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Controller_C*                       K2Node_DynamicCast_AsBP_Controller;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_EmoteMenu_C_EnableEmotes) == 0x000008, "Wrong alignment on W_EmoteMenu_C_EnableEmotes");
static_assert(sizeof(W_EmoteMenu_C_EnableEmotes) == 0x000020, "Wrong size on W_EmoteMenu_C_EnableEmotes");
static_assert(offsetof(W_EmoteMenu_C_EnableEmotes, ReturnValue) == 0x000000, "Member 'W_EmoteMenu_C_EnableEmotes::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EmoteMenu_C_EnableEmotes, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'W_EmoteMenu_C_EnableEmotes::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EmoteMenu_C_EnableEmotes, K2Node_DynamicCast_AsBP_Controller) == 0x000010, "Member 'W_EmoteMenu_C_EnableEmotes::K2Node_DynamicCast_AsBP_Controller' has a wrong offset!");
static_assert(offsetof(W_EmoteMenu_C_EnableEmotes, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'W_EmoteMenu_C_EnableEmotes::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_EmoteMenu_C_EnableEmotes, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'W_EmoteMenu_C_EnableEmotes::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

