#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_EmoteMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_EmoteMenu.W_EmoteMenu_C
// 0x0098 (0x02F8 - 0x0260)
class UW_EmoteMenu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Appear;                                            // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_1;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_2;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_3;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_4;                                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_5;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_183;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_301;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_370;                                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_288;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_1;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_84;                                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAnimMontage*                           EmoteMontage;                                      // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Emote_Duration;                                    // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_EmoteMenu(int32 EntryPoint);
	void BndEvt__W_EmoteMenu_Button_1_K2Node_ComponentBoundEvent_10_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__W_EmoteMenu_Button_K2Node_ComponentBoundEvent_9_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__W_EmoteMenu_Button_183_K2Node_ComponentBoundEvent_8_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__W_EmoteMenu_Button_4_K2Node_ComponentBoundEvent_7_OnButtonPressedEvent__DelegateSignature();
	void CloseEmoteMenu();
	void BndEvt__W_EmoteMenu_Button_2_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__W_EmoteMenu_Button_4_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__W_EmoteMenu_Button_1_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__W_EmoteMenu_Button_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__W_EmoteMenu_Button_183_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void Destruct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	bool EnableEmotes();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_EmoteMenu_C">();
	}
	static class UW_EmoteMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_EmoteMenu_C>();
	}
};
static_assert(alignof(UW_EmoteMenu_C) == 0x000008, "Wrong alignment on UW_EmoteMenu_C");
static_assert(sizeof(UW_EmoteMenu_C) == 0x0002F8, "Wrong size on UW_EmoteMenu_C");
static_assert(offsetof(UW_EmoteMenu_C, UberGraphFrame) == 0x000260, "Member 'UW_EmoteMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_EmoteMenu_C, Appear) == 0x000268, "Member 'UW_EmoteMenu_C::Appear' has a wrong offset!");
static_assert(offsetof(UW_EmoteMenu_C, Button) == 0x000270, "Member 'UW_EmoteMenu_C::Button' has a wrong offset!");
static_assert(offsetof(UW_EmoteMenu_C, Button_1) == 0x000278, "Member 'UW_EmoteMenu_C::Button_1' has a wrong offset!");
static_assert(offsetof(UW_EmoteMenu_C, Button_2) == 0x000280, "Member 'UW_EmoteMenu_C::Button_2' has a wrong offset!");
static_assert(offsetof(UW_EmoteMenu_C, Button_3) == 0x000288, "Member 'UW_EmoteMenu_C::Button_3' has a wrong offset!");
static_assert(offsetof(UW_EmoteMenu_C, Button_4) == 0x000290, "Member 'UW_EmoteMenu_C::Button_4' has a wrong offset!");
static_assert(offsetof(UW_EmoteMenu_C, Button_5) == 0x000298, "Member 'UW_EmoteMenu_C::Button_5' has a wrong offset!");
static_assert(offsetof(UW_EmoteMenu_C, Button_183) == 0x0002A0, "Member 'UW_EmoteMenu_C::Button_183' has a wrong offset!");
static_assert(offsetof(UW_EmoteMenu_C, Button_301) == 0x0002A8, "Member 'UW_EmoteMenu_C::Button_301' has a wrong offset!");
static_assert(offsetof(UW_EmoteMenu_C, Button_370) == 0x0002B0, "Member 'UW_EmoteMenu_C::Button_370' has a wrong offset!");
static_assert(offsetof(UW_EmoteMenu_C, Image) == 0x0002B8, "Member 'UW_EmoteMenu_C::Image' has a wrong offset!");
static_assert(offsetof(UW_EmoteMenu_C, Image_1) == 0x0002C0, "Member 'UW_EmoteMenu_C::Image_1' has a wrong offset!");
static_assert(offsetof(UW_EmoteMenu_C, Image_2) == 0x0002C8, "Member 'UW_EmoteMenu_C::Image_2' has a wrong offset!");
static_assert(offsetof(UW_EmoteMenu_C, Image_288) == 0x0002D0, "Member 'UW_EmoteMenu_C::Image_288' has a wrong offset!");
static_assert(offsetof(UW_EmoteMenu_C, SizeBox_1) == 0x0002D8, "Member 'UW_EmoteMenu_C::SizeBox_1' has a wrong offset!");
static_assert(offsetof(UW_EmoteMenu_C, VerticalBox_84) == 0x0002E0, "Member 'UW_EmoteMenu_C::VerticalBox_84' has a wrong offset!");
static_assert(offsetof(UW_EmoteMenu_C, EmoteMontage) == 0x0002E8, "Member 'UW_EmoteMenu_C::EmoteMontage' has a wrong offset!");
static_assert(offsetof(UW_EmoteMenu_C, Emote_Duration) == 0x0002F0, "Member 'UW_EmoteMenu_C::Emote_Duration' has a wrong offset!");

}

