#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_EndGameScreen

#include "Basic.hpp"

#include "ST_PlayerStats_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "E_Teams_structs.hpp"
#include "Engine_structs.hpp"
#include "ST_Map_structs.hpp"


namespace SDK::Params
{

// Function W_EndGameScreen.W_EndGameScreen_C.ExecuteUbergraph_W_EndGameScreen
// 0x0A10 (0x0A10 - 0x0000)
struct W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_GainedXPEntry_C*                     CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_GainedXPEntry_C*                     CallFunc_Create_ReturnValue_1;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_GainedXPEntry_C*                     CallFunc_Create_ReturnValue_2;                     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_GainedXPEntry_C*                     CallFunc_Create_ReturnValue_3;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_GainedXPEntry_C*                     CallFunc_Create_ReturnValue_4;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_GainedXPEntry_C*                     CallFunc_Create_ReturnValue_5;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Teams                                       Temp_byte_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x004C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x005C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Teams                                       Temp_byte_Variable_1;                              // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_4;                            // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_5;                            // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Teams                                       Temp_byte_Variable_2;                              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_6;                            // 0x00A4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_7;                            // 0x00B4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_8;                            // 0x00C4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Teams                                       Temp_byte_Variable_3;                              // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_9;                            // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_10;                           // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_11;                           // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0110(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_12;                           // 0x012C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_13;                           // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0158(0x0018)()
	class UW_EndGameMapVote_C*                    CallFunc_Create_ReturnValue_6;                     // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0178(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x0200(0x0088)()
	E_Teams                                       Temp_byte_Variable_4;                              // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_14;                           // 0x028C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_15;                           // 0x029C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_16;                           // 0x02AC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_2;                              // 0x02C0(0x0018)()
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x3];                                      // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x02E8(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GameStateBase_C*                    K2Node_DynamicCast_AsBP_Game_State_Base;           // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0342(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0343(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GameStateBase_C*                    K2Node_DynamicCast_AsBP_Game_State_Base_1;         // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0359(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35A[0x6];                                      // 0x035A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0360(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x03A0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x03B0(0x0018)()
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_2;               // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GameStateBase_C*                    K2Node_DynamicCast_AsBP_Game_State_Base_2;         // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1[0x3];                                      // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPlayerWithHighestHealScore_PlayerIndex; // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPlayerWithHighestHealScore_NoScore;    // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9[0x3];                                      // 0x03E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPlayerWithMostPlaneScore_PlayerIndex;  // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPlayerWithMostPlaneScore_NoScore;      // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F1[0x3];                                      // 0x03F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPlayerWithMostTankScore_PlayerIndex;   // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPlayerWithMostTankScore_NoScore;       // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F9[0x3];                                      // 0x03F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPlayerWithMostKills_PlayerIndex;       // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerWithHighestScore_PlayerIndex;    // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_404[0x4];                                      // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_PlayerStats                        CallFunc_Array_Get_Item;                           // 0x0408(0x0068)(HasGetValueTypeHash)
	struct FST_PlayerStats                        CallFunc_Array_Get_Item_1;                         // 0x0470(0x0068)(HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x04D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x04E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x04F8(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0520(0x0028)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0548(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0560(0x0018)()
	struct FST_PlayerStats                        CallFunc_Array_Get_Item_2;                         // 0x0578(0x0068)(HasGetValueTypeHash)
	struct FST_PlayerStats                        CallFunc_Array_Get_Item_3;                         // 0x05E0(0x0068)(HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_2;                           // 0x0648(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_3;                           // 0x0658(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_4;                           // 0x0668(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_5;                           // 0x0678(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0688(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x06B0(0x0028)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x06D8(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x06F0(0x0018)()
	class FText                                   K2Node_Select_Default_6;                           // 0x0708(0x0018)()
	class FText                                   K2Node_Select_Default_7;                           // 0x0720(0x0018)()
	struct FST_PlayerStats                        CallFunc_Array_Get_Item_4;                         // 0x0738(0x0068)(HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x07A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A1[0x3];                                      // 0x07A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_8;                           // 0x07A4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B4[0x4];                                      // 0x07B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x07B8(0x0028)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x07E0(0x0018)()
	class FText                                   K2Node_Select_Default_9;                           // 0x07F8(0x0018)()
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0810(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_811[0x7];                                      // 0x0811(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0818(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Controller_C*                       K2Node_DynamicCast_AsBP_Controller;                // 0x0820(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0828(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_829[0x7];                                      // 0x0829(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0830(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_PlayerStats                        CallFunc_GetPlayerStats_Stats;                     // 0x0838(0x0068)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x08A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x08A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x08A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x08A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_4;             // 0x08A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_5;             // 0x08A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A6[0x2];                                      // 0x08A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x08A8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x08C0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0900(0x0010)(ReferenceParm)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x0910(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0918(0x0018)()
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0930(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_931[0x7];                                      // 0x0931(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_2;                   // 0x0938(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0940(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_941[0x7];                                      // 0x0941(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_3;                   // 0x0948(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_4;                   // 0x0950(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x0958(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_959[0x7];                                      // 0x0959(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_5;                   // 0x0960(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0968(0x0010)(ReferenceParm)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_8;            // 0x0978(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_979[0x3];                                      // 0x0979(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_5;                         // 0x097C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_984[0x4];                                      // 0x0984(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_Map                                CallFunc_GetDataTableRowFromName_OutRow;           // 0x0988(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x09D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D1[0x7];                                      // 0x09D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x09D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x09E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x09EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9ED[0x3];                                      // 0x09ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_6;                   // 0x09F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_9;            // 0x09F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9F9[0x3];                                      // 0x09F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x09FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0A00(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen) == 0x000008, "Wrong alignment on W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen");
static_assert(sizeof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen) == 0x000A10, "Wrong size on W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, EntryPoint) == 0x000000, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_Create_ReturnValue) == 0x000008, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_Create_ReturnValue_1) == 0x000010, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_Create_ReturnValue_2) == 0x000018, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_Create_ReturnValue_3) == 0x000020, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_Create_ReturnValue_4) == 0x000028, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_Create_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_Create_ReturnValue_5) == 0x000030, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_Create_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, Temp_byte_Variable) == 0x000038, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, Temp_struct_Variable) == 0x00003C, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, Temp_struct_Variable_1) == 0x00004C, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, Temp_struct_Variable_2) == 0x00005C, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, Temp_byte_Variable_1) == 0x00006C, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, Temp_struct_Variable_3) == 0x000070, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, Temp_struct_Variable_4) == 0x000080, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, Temp_struct_Variable_5) == 0x000090, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, Temp_byte_Variable_2) == 0x0000A0, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, Temp_struct_Variable_6) == 0x0000A4, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, Temp_struct_Variable_7) == 0x0000B4, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::Temp_struct_Variable_7' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, Temp_struct_Variable_8) == 0x0000C4, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::Temp_struct_Variable_8' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, Temp_byte_Variable_3) == 0x0000D4, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, Temp_struct_Variable_9) == 0x0000D8, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::Temp_struct_Variable_9' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, Temp_struct_Variable_10) == 0x0000E8, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::Temp_struct_Variable_10' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, Temp_struct_Variable_11) == 0x0000F8, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::Temp_struct_Variable_11' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, Temp_bool_Variable) == 0x000108, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, Temp_text_Variable) == 0x000110, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, Temp_bool_Variable_1) == 0x000128, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, Temp_struct_Variable_12) == 0x00012C, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::Temp_struct_Variable_12' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, Temp_bool_Variable_2) == 0x00013C, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, Temp_struct_Variable_13) == 0x000140, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::Temp_struct_Variable_13' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, Temp_bool_Variable_3) == 0x000150, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, Temp_text_Variable_1) == 0x000158, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_Create_ReturnValue_6) == 0x000170, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_Create_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, K2Node_MakeStruct_SlateBrush) == 0x000178, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, K2Node_MakeStruct_SlateBrush_1) == 0x000200, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::K2Node_MakeStruct_SlateBrush_1' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, Temp_byte_Variable_4) == 0x000288, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, Temp_struct_Variable_14) == 0x00028C, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::Temp_struct_Variable_14' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, Temp_struct_Variable_15) == 0x00029C, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::Temp_struct_Variable_15' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, Temp_struct_Variable_16) == 0x0002AC, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::Temp_struct_Variable_16' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, Temp_bool_Variable_4) == 0x0002BC, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, Temp_text_Variable_2) == 0x0002C0, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_MakeLiteralByte_ReturnValue) == 0x0002D8, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, Temp_int_Loop_Counter_Variable) == 0x0002DC, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_Add_IntInt_ReturnValue) == 0x0002E0, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, Temp_int_Array_Index_Variable) == 0x0002E4, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, K2Node_Event_MyGeometry) == 0x0002E8, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, K2Node_Event_InDeltaTime) == 0x000320, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_GetGameState_ReturnValue) == 0x000328, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000330, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, K2Node_DynamicCast_AsBP_Game_State_Base) == 0x000338, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::K2Node_DynamicCast_AsBP_Game_State_Base' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, K2Node_DynamicCast_bSuccess) == 0x000340, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000341, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, K2Node_SwitchEnum_CmpSuccess) == 0x000342, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, Temp_bool_IsClosed_Variable) == 0x000343, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_GetGameState_ReturnValue_1) == 0x000348, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_GetGameState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, K2Node_DynamicCast_AsBP_Game_State_Base_1) == 0x000350, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::K2Node_DynamicCast_AsBP_Game_State_Base_1' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, K2Node_DynamicCast_bSuccess_1) == 0x000358, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000359, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, K2Node_MakeStruct_FormatArgumentData) == 0x000360, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, K2Node_MakeArray_Array) == 0x0003A0, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_Format_ReturnValue) == 0x0003B0, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_GetGameState_ReturnValue_2) == 0x0003C8, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_GetGameState_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_PlayAnimation_ReturnValue) == 0x0003D0, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, K2Node_DynamicCast_AsBP_Game_State_Base_2) == 0x0003D8, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::K2Node_DynamicCast_AsBP_Game_State_Base_2' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, K2Node_DynamicCast_bSuccess_2) == 0x0003E0, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_GetPlayerWithHighestHealScore_PlayerIndex) == 0x0003E4, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_GetPlayerWithHighestHealScore_PlayerIndex' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_GetPlayerWithHighestHealScore_NoScore) == 0x0003E8, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_GetPlayerWithHighestHealScore_NoScore' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_GetPlayerWithMostPlaneScore_PlayerIndex) == 0x0003EC, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_GetPlayerWithMostPlaneScore_PlayerIndex' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_GetPlayerWithMostPlaneScore_NoScore) == 0x0003F0, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_GetPlayerWithMostPlaneScore_NoScore' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_GetPlayerWithMostTankScore_PlayerIndex) == 0x0003F4, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_GetPlayerWithMostTankScore_PlayerIndex' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_GetPlayerWithMostTankScore_NoScore) == 0x0003F8, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_GetPlayerWithMostTankScore_NoScore' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_GetPlayerWithMostKills_PlayerIndex) == 0x0003FC, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_GetPlayerWithMostKills_PlayerIndex' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_GetPlayerWithHighestScore_PlayerIndex) == 0x000400, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_GetPlayerWithHighestScore_PlayerIndex' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_Array_Get_Item) == 0x000408, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_Array_Get_Item_1) == 0x000470, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, K2Node_Select_Default) == 0x0004D8, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, K2Node_Select_Default_1) == 0x0004E8, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, K2Node_MakeStruct_SlateColor) == 0x0004F8, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, K2Node_MakeStruct_SlateColor_1) == 0x000520, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_Conv_StringToText_ReturnValue) == 0x000548, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000560, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_Array_Get_Item_2) == 0x000578, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_Array_Get_Item_3) == 0x0005E0, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, K2Node_Select_Default_2) == 0x000648, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, K2Node_Select_Default_3) == 0x000658, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, K2Node_Select_Default_4) == 0x000668, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, K2Node_Select_Default_5) == 0x000678, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, K2Node_MakeStruct_SlateColor_2) == 0x000688, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, K2Node_MakeStruct_SlateColor_3) == 0x0006B0, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0006D8, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_Conv_StringToText_ReturnValue_3) == 0x0006F0, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, K2Node_Select_Default_6) == 0x000708, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, K2Node_Select_Default_7) == 0x000720, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_Array_Get_Item_4) == 0x000738, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x0007A0, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, K2Node_Select_Default_8) == 0x0007A4, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::K2Node_Select_Default_8' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, K2Node_MakeStruct_SlateColor_4) == 0x0007B8, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::K2Node_MakeStruct_SlateColor_4' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_Conv_StringToText_ReturnValue_4) == 0x0007E0, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_Conv_StringToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, K2Node_Select_Default_9) == 0x0007F8, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::K2Node_Select_Default_9' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000810, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_GetPlayerController_ReturnValue) == 0x000818, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, K2Node_DynamicCast_AsBP_Controller) == 0x000820, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::K2Node_DynamicCast_AsBP_Controller' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, K2Node_DynamicCast_bSuccess_3) == 0x000828, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_AddChild_ReturnValue) == 0x000830, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_GetPlayerStats_Stats) == 0x000838, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_GetPlayerStats_Stats' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_Greater_IntInt_ReturnValue) == 0x0008A0, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0008A1, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_Greater_IntInt_ReturnValue_2) == 0x0008A2, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_Greater_IntInt_ReturnValue_3) == 0x0008A3, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_Greater_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_Greater_IntInt_ReturnValue_4) == 0x0008A4, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_Greater_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_Greater_IntInt_ReturnValue_5) == 0x0008A5, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_Greater_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_Conv_IntToText_ReturnValue) == 0x0008A8, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, K2Node_MakeStruct_FormatArgumentData_1) == 0x0008C0, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, K2Node_MakeArray_Array_1) == 0x000900, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_AddChild_ReturnValue_1) == 0x000910, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_Format_ReturnValue_1) == 0x000918, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000930, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_AddChild_ReturnValue_2) == 0x000938, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_AddChild_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x000940, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_AddChild_ReturnValue_3) == 0x000948, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_AddChild_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_AddChild_ReturnValue_4) == 0x000950, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_AddChild_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x000958, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_AddChild_ReturnValue_5) == 0x000960, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_AddChild_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000968, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_MakeLiteralByte_ReturnValue_8) == 0x000978, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_MakeLiteralByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_Array_Get_Item_5) == 0x00097C, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_GetDataTableRowFromName_OutRow) == 0x000988, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0009D0, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_Conv_NameToString_ReturnValue) == 0x0009D8, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_Array_Length_ReturnValue) == 0x0009E8, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen, CallFunc_Less_IntInt_ReturnValue) == 0x0009EC, "Member 'W_EndGameScreen_C_ExecuteUbergraph_W_EndGameScreen::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
