#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_EndGameScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_Teams_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_EndGameScreen.W_EndGameScreen_C
// 0x0108 (0x0368 - 0x0260)
class UW_EndGameScreen_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Rewards;                                           // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ClockTick;                                         // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       DropDown;                                          // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_0;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_135;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_142;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_156;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_229;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_535;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_654;                                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_1;                                       // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_2;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_4;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_5;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_8;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_BestPlane;                               // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_BestTank;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_HighestScorePlayer;                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_MosthealingScore;                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_MostKillsPlayer;                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_WinningTeam;                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Allies;                                // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Axis;                                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_MapVoteList;                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_GainedXPEntry_C*                     W_GainedXPEntry;                                   // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_GainedXPEntry_C*                     W_GainedXPEntry_1;                                 // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_GainedXPEntry_C*                     W_GainedXPEntry_2;                                 // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_GainedXPEntry_C*                     W_GainedXPEntry_3;                                 // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_GainedXPEntry_C*                     W_GainedXPEntry_4;                                 // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_GainedXPEntry_C*                     W_GainedXPEntry_126;                               // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	E_Teams                                       WinningTeam;                                       // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_EndGameScreen(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	ESlateVisibility ShowRestartButton();
	ESlateVisibility ShowAxisIcon();
	ESlateVisibility ShowAlliedIcon();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_EndGameScreen_C">();
	}
	static class UW_EndGameScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_EndGameScreen_C>();
	}
};
static_assert(alignof(UW_EndGameScreen_C) == 0x000008, "Wrong alignment on UW_EndGameScreen_C");
static_assert(sizeof(UW_EndGameScreen_C) == 0x000368, "Wrong size on UW_EndGameScreen_C");
static_assert(offsetof(UW_EndGameScreen_C, UberGraphFrame) == 0x000260, "Member 'UW_EndGameScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_EndGameScreen_C, Rewards) == 0x000268, "Member 'UW_EndGameScreen_C::Rewards' has a wrong offset!");
static_assert(offsetof(UW_EndGameScreen_C, ClockTick) == 0x000270, "Member 'UW_EndGameScreen_C::ClockTick' has a wrong offset!");
static_assert(offsetof(UW_EndGameScreen_C, DropDown) == 0x000278, "Member 'UW_EndGameScreen_C::DropDown' has a wrong offset!");
static_assert(offsetof(UW_EndGameScreen_C, Border_0) == 0x000280, "Member 'UW_EndGameScreen_C::Border_0' has a wrong offset!");
static_assert(offsetof(UW_EndGameScreen_C, Image) == 0x000288, "Member 'UW_EndGameScreen_C::Image' has a wrong offset!");
static_assert(offsetof(UW_EndGameScreen_C, Image_135) == 0x000290, "Member 'UW_EndGameScreen_C::Image_135' has a wrong offset!");
static_assert(offsetof(UW_EndGameScreen_C, Image_142) == 0x000298, "Member 'UW_EndGameScreen_C::Image_142' has a wrong offset!");
static_assert(offsetof(UW_EndGameScreen_C, Image_156) == 0x0002A0, "Member 'UW_EndGameScreen_C::Image_156' has a wrong offset!");
static_assert(offsetof(UW_EndGameScreen_C, Image_229) == 0x0002A8, "Member 'UW_EndGameScreen_C::Image_229' has a wrong offset!");
static_assert(offsetof(UW_EndGameScreen_C, Image_535) == 0x0002B0, "Member 'UW_EndGameScreen_C::Image_535' has a wrong offset!");
static_assert(offsetof(UW_EndGameScreen_C, Image_654) == 0x0002B8, "Member 'UW_EndGameScreen_C::Image_654' has a wrong offset!");
static_assert(offsetof(UW_EndGameScreen_C, TextBlock_1) == 0x0002C0, "Member 'UW_EndGameScreen_C::TextBlock_1' has a wrong offset!");
static_assert(offsetof(UW_EndGameScreen_C, TextBlock_2) == 0x0002C8, "Member 'UW_EndGameScreen_C::TextBlock_2' has a wrong offset!");
static_assert(offsetof(UW_EndGameScreen_C, TextBlock_4) == 0x0002D0, "Member 'UW_EndGameScreen_C::TextBlock_4' has a wrong offset!");
static_assert(offsetof(UW_EndGameScreen_C, TextBlock_5) == 0x0002D8, "Member 'UW_EndGameScreen_C::TextBlock_5' has a wrong offset!");
static_assert(offsetof(UW_EndGameScreen_C, TextBlock_8) == 0x0002E0, "Member 'UW_EndGameScreen_C::TextBlock_8' has a wrong offset!");
static_assert(offsetof(UW_EndGameScreen_C, TextBlock_BestPlane) == 0x0002E8, "Member 'UW_EndGameScreen_C::TextBlock_BestPlane' has a wrong offset!");
static_assert(offsetof(UW_EndGameScreen_C, TextBlock_BestTank) == 0x0002F0, "Member 'UW_EndGameScreen_C::TextBlock_BestTank' has a wrong offset!");
static_assert(offsetof(UW_EndGameScreen_C, TextBlock_HighestScorePlayer) == 0x0002F8, "Member 'UW_EndGameScreen_C::TextBlock_HighestScorePlayer' has a wrong offset!");
static_assert(offsetof(UW_EndGameScreen_C, TextBlock_MosthealingScore) == 0x000300, "Member 'UW_EndGameScreen_C::TextBlock_MosthealingScore' has a wrong offset!");
static_assert(offsetof(UW_EndGameScreen_C, TextBlock_MostKillsPlayer) == 0x000308, "Member 'UW_EndGameScreen_C::TextBlock_MostKillsPlayer' has a wrong offset!");
static_assert(offsetof(UW_EndGameScreen_C, TextBlock_WinningTeam) == 0x000310, "Member 'UW_EndGameScreen_C::TextBlock_WinningTeam' has a wrong offset!");
static_assert(offsetof(UW_EndGameScreen_C, VerticalBox_Allies) == 0x000318, "Member 'UW_EndGameScreen_C::VerticalBox_Allies' has a wrong offset!");
static_assert(offsetof(UW_EndGameScreen_C, VerticalBox_Axis) == 0x000320, "Member 'UW_EndGameScreen_C::VerticalBox_Axis' has a wrong offset!");
static_assert(offsetof(UW_EndGameScreen_C, VerticalBox_MapVoteList) == 0x000328, "Member 'UW_EndGameScreen_C::VerticalBox_MapVoteList' has a wrong offset!");
static_assert(offsetof(UW_EndGameScreen_C, W_GainedXPEntry) == 0x000330, "Member 'UW_EndGameScreen_C::W_GainedXPEntry' has a wrong offset!");
static_assert(offsetof(UW_EndGameScreen_C, W_GainedXPEntry_1) == 0x000338, "Member 'UW_EndGameScreen_C::W_GainedXPEntry_1' has a wrong offset!");
static_assert(offsetof(UW_EndGameScreen_C, W_GainedXPEntry_2) == 0x000340, "Member 'UW_EndGameScreen_C::W_GainedXPEntry_2' has a wrong offset!");
static_assert(offsetof(UW_EndGameScreen_C, W_GainedXPEntry_3) == 0x000348, "Member 'UW_EndGameScreen_C::W_GainedXPEntry_3' has a wrong offset!");
static_assert(offsetof(UW_EndGameScreen_C, W_GainedXPEntry_4) == 0x000350, "Member 'UW_EndGameScreen_C::W_GainedXPEntry_4' has a wrong offset!");
static_assert(offsetof(UW_EndGameScreen_C, W_GainedXPEntry_126) == 0x000358, "Member 'UW_EndGameScreen_C::W_GainedXPEntry_126' has a wrong offset!");
static_assert(offsetof(UW_EndGameScreen_C, WinningTeam) == 0x000360, "Member 'UW_EndGameScreen_C::WinningTeam' has a wrong offset!");

}

