#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_EquipScreen

#include "Basic.hpp"

#include "E_UnlockableCategories_structs.hpp"
#include "E_Teams_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "E_CurrencyTypes_structs.hpp"
#include "ST_UnitProgress_structs.hpp"
#include "ST_Unlockable_structs.hpp"


namespace SDK::Params
{

// Function W_EquipScreen.W_EquipScreen_C.ExecuteUbergraph_W_EquipScreen
// 0x0830 (0x0830 - 0x0000)
struct W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Teams                                       Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable_3;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_4;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_5;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Teams                                       Temp_byte_Variable_1;                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_EquipPreview_C*>             CallFunc_GetAllActorsOfClass_OutActors;            // 0x0068(0x0010)(ReferenceParm)
	TSubclassOf<class AActor>                     Temp_class_Variable;                               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class ABP_EquipPreview_C*                     CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Mannequin_C*                        K2Node_DynamicCast_AsBP_Mannequin;                 // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AActor>                     Temp_class_Variable_1;                             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class ABP_Mannequin_C*                        K2Node_DynamicCast_AsBP_Mannequin_1;               // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Mannequin_C*                        K2Node_DynamicCast_AsBP_Mannequin_2;               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default;                             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Select_Default_1;                           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class AActor>                     Temp_class_Variable_2;                             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	E_Teams                                       Temp_byte_Variable_2;                              // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AActor>                     Temp_class_Variable_3;                             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class AActor>                     K2Node_Select_Default_2;                           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FST_UnitProgress                       CallFunc_GetPlayerUnitProgress_Progress;           // 0x0100(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	TSubclassOf<class AActor>                     Temp_class_Variable_4;                             // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_GetUnitLevel_Level;                       // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetUnitLevel_RequiredXPForNextLevel;      // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetUnitLevel_CurrentXPAmountProgress;     // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0198(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01D8(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01F0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0200(0x0018)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FST_UnitProgress>               CallFunc_GetAllPlayerUnitsProgress_UnitProgress;   // 0x0220(0x0010)(ReferenceParm)
	struct FST_UnitProgress                       CallFunc_Array_Get_Item_1;                         // 0x0230(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLevelFromXP_Level;                     // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLevelFromXP_RequiredXPForNextLevel;    // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLevelFromXP_CurrentXPAmountProgress;   // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0260(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x02A0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x02E0(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x02F0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0300(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0318(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0330(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0370(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x03B0(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_4;                          // 0x03C0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x03D0(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_4;                     // 0x03E8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0400(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x0440(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_5;                          // 0x0480(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_6;                          // 0x0490(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_5;                     // 0x04A0(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_6;                     // 0x04B8(0x0018)()
	bool                                          K2Node_SwitchString_CmpSuccess_1;                  // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D1[0x7];                                      // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AActor>                     Temp_class_Variable_5;                             // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_Teams                                       Temp_byte_Variable_3;                              // 0x04E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E2[0x6];                                      // 0x04E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AActor>                     K2Node_Select_Default_3;                           // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class AActor>                     Temp_class_Variable_6;                             // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0500(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0510(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_2;                         // 0x0514(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51C[0x4];                                      // 0x051C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0520(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_531[0x7];                                      // 0x0531(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0538(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x054C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_Selection_2;            // 0x0550(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue_1;                    // 0x0560(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames_1;       // 0x0578(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0588(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58C[0x4];                                      // 0x058C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Mannequin_C*                        K2Node_DynamicCast_AsBP_Mannequin_3;               // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_599[0x7];                                      // 0x0599(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames_2;       // 0x05A0(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_3;                         // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x05B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x05C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5CC[0x4];                                      // 0x05CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Replace_ReturnValue_2;                    // 0x05D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E1[0x7];                                      // 0x05E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_Selection_1;            // 0x05E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue_3;                    // 0x05F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames_3;       // 0x0610(0x0010)(ReferenceParm)
	class ABP_Mannequin_C*                        K2Node_DynamicCast_AsBP_Mannequin_4;               // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0628(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_629[0x3];                                      // 0x0629(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue_1;                 // 0x062C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_GameInstance_C*                     K2Node_DynamicCast_AsBP_Game_Instance;             // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0640(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_641[0x3];                                      // 0x0641(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetClassAndTeamUnitIndex_Index;           // 0x0644(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_4;                         // 0x0648(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item_5;                         // 0x064C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_6;                         // 0x0650(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_7;                         // 0x0654(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class AActor>                     Temp_class_Variable_7;                             // 0x0658(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0668(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x06A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A4[0x4];                                      // 0x06A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x06A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MainMenuController_C*               K2Node_DynamicCast_AsBP_Main_Menu_Controller;      // 0x06B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x06B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B9[0x3];                                      // 0x06B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInputMouseDelta_DeltaX;                // 0x06BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInputMouseDelta_DeltaY;                // 0x06C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x06C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C5[0x3];                                      // 0x06C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x06C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x06CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddActorWorldRotation_SweepHitResult;  // 0x06D8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x0760(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_764[0x4];                                      // 0x0764(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Mannequin_C*                        K2Node_DynamicCast_AsBP_Mannequin_5;               // 0x0768(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0770(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_771[0x7];                                      // 0x0771(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AActor>                     Temp_class_Variable_8;                             // 0x0778(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames_4;       // 0x0780(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_8;                         // 0x0790(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0798(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79C[0x4];                                      // 0x079C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_2;          // 0x07A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x07B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B1[0x7];                                      // 0x07B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Replace_ReturnValue_4;                    // 0x07B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_Selection;              // 0x07C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue_5;                    // 0x07D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_2;          // 0x07E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames_5;       // 0x07F0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Find_ReturnValue_2;                 // 0x0800(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_804[0x4];                                      // 0x0804(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Mannequin_C*                        K2Node_DynamicCast_AsBP_Mannequin_6;               // 0x0808(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0810(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_811[0x3];                                      // 0x0811(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0814(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0818(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_819[0x3];                                      // 0x0819(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x081C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Teams                                       Temp_byte_Variable_4;                              // 0x0820(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_821[0x7];                                      // 0x0821(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AActor>                     K2Node_Select_Default_4;                           // 0x0828(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen) == 0x000008, "Wrong alignment on W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen");
static_assert(sizeof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen) == 0x000830, "Wrong size on W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, EntryPoint) == 0x000000, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, Temp_object_Variable) == 0x000008, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, Temp_object_Variable_1) == 0x000010, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, Temp_object_Variable_2) == 0x000018, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, Temp_byte_Variable) == 0x000020, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, Temp_object_Variable_3) == 0x000028, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, Temp_object_Variable_4) == 0x000030, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, Temp_object_Variable_5) == 0x000038, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, Temp_int_Array_Index_Variable) == 0x000040, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, Temp_int_Array_Index_Variable_1) == 0x00004C, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, Temp_byte_Variable_1) == 0x000050, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, Temp_int_Array_Index_Variable_2) == 0x000054, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, Temp_int_Loop_Counter_Variable_1) == 0x000058, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_Add_IntInt_ReturnValue_1) == 0x00005C, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, Temp_int_Array_Index_Variable_3) == 0x000060, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_GetAllActorsOfClass_OutActors) == 0x000068, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, Temp_class_Variable) == 0x000078, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_Array_Get_Item) == 0x000080, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_PlayAnimation_ReturnValue) == 0x000088, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_PlayAnimation_ReturnValue_1) == 0x000090, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, K2Node_DynamicCast_AsBP_Mannequin) == 0x000098, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::K2Node_DynamicCast_AsBP_Mannequin' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, Temp_class_Variable_1) == 0x0000A8, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, K2Node_DynamicCast_AsBP_Mannequin_1) == 0x0000B0, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::K2Node_DynamicCast_AsBP_Mannequin_1' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, K2Node_DynamicCast_bSuccess_1) == 0x0000B8, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, K2Node_DynamicCast_AsBP_Mannequin_2) == 0x0000C0, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::K2Node_DynamicCast_AsBP_Mannequin_2' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, K2Node_DynamicCast_bSuccess_2) == 0x0000C8, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, K2Node_Select_Default) == 0x0000D0, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, K2Node_Select_Default_1) == 0x0000D8, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, Temp_class_Variable_2) == 0x0000E0, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::Temp_class_Variable_2' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, Temp_byte_Variable_2) == 0x0000E8, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, Temp_class_Variable_3) == 0x0000F0, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::Temp_class_Variable_3' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, K2Node_Select_Default_2) == 0x0000F8, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_GetPlayerUnitProgress_Progress) == 0x000100, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_GetPlayerUnitProgress_Progress' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, Temp_class_Variable_4) == 0x000118, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::Temp_class_Variable_4' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_GetUnitLevel_Level) == 0x000120, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_GetUnitLevel_Level' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_GetUnitLevel_RequiredXPForNextLevel) == 0x000124, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_GetUnitLevel_RequiredXPForNextLevel' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_GetUnitLevel_CurrentXPAmountProgress) == 0x000128, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_GetUnitLevel_CurrentXPAmountProgress' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_Conv_IntToString_ReturnValue) == 0x000130, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000140, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_Concat_StrStr_ReturnValue) == 0x000148, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000158, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000168, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000170, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000180, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000188, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, K2Node_MakeStruct_FormatArgumentData) == 0x000198, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_Conv_StringToText_ReturnValue) == 0x0001D8, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, K2Node_MakeArray_Array) == 0x0001F0, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_Format_ReturnValue) == 0x000200, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, K2Node_SwitchEnum_CmpSuccess) == 0x000218, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_GetAllPlayerUnitsProgress_UnitProgress) == 0x000220, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_GetAllPlayerUnitsProgress_UnitProgress' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_Array_Get_Item_1) == 0x000230, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_Array_Length_ReturnValue) == 0x000248, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_GetLevelFromXP_Level) == 0x00024C, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_GetLevelFromXP_Level' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_GetLevelFromXP_RequiredXPForNextLevel) == 0x000250, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_GetLevelFromXP_RequiredXPForNextLevel' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_GetLevelFromXP_CurrentXPAmountProgress) == 0x000254, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_GetLevelFromXP_CurrentXPAmountProgress' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, K2Node_SwitchString_CmpSuccess) == 0x000258, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, K2Node_MakeStruct_FormatArgumentData_1) == 0x000260, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, K2Node_MakeStruct_FormatArgumentData_2) == 0x0002A0, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, K2Node_MakeArray_Array_1) == 0x0002E0, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, K2Node_MakeArray_Array_2) == 0x0002F0, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_Format_ReturnValue_1) == 0x000300, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_Format_ReturnValue_2) == 0x000318, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, K2Node_MakeStruct_FormatArgumentData_3) == 0x000330, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, K2Node_MakeStruct_FormatArgumentData_4) == 0x000370, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, K2Node_MakeArray_Array_3) == 0x0003B0, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, K2Node_MakeArray_Array_4) == 0x0003C0, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_Format_ReturnValue_3) == 0x0003D0, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_Format_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_Format_ReturnValue_4) == 0x0003E8, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_Format_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, K2Node_MakeStruct_FormatArgumentData_5) == 0x000400, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, K2Node_MakeStruct_FormatArgumentData_6) == 0x000440, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::K2Node_MakeStruct_FormatArgumentData_6' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, K2Node_MakeArray_Array_5) == 0x000480, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::K2Node_MakeArray_Array_5' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, K2Node_MakeArray_Array_6) == 0x000490, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::K2Node_MakeArray_Array_6' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_Format_ReturnValue_5) == 0x0004A0, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_Format_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_Format_ReturnValue_6) == 0x0004B8, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_Format_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, K2Node_SwitchString_CmpSuccess_1) == 0x0004D0, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::K2Node_SwitchString_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, Temp_class_Variable_5) == 0x0004D8, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::Temp_class_Variable_5' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, K2Node_SwitchEnum_CmpSuccess_1) == 0x0004E0, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, Temp_byte_Variable_3) == 0x0004E1, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, K2Node_Select_Default_3) == 0x0004E8, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, Temp_class_Variable_6) == 0x0004F0, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::Temp_class_Variable_6' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_PlayAnimation_ReturnValue_2) == 0x0004F8, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000500, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, Temp_int_Loop_Counter_Variable_2) == 0x000510, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_Array_Get_Item_2) == 0x000514, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_Conv_NameToString_ReturnValue) == 0x000520, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_Less_IntInt_ReturnValue) == 0x000530, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_Replace_ReturnValue) == 0x000538, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_Add_IntInt_ReturnValue_2) == 0x000548, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_Array_Length_ReturnValue_1) == 0x00054C, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, K2Node_ComponentBoundEvent_Selection_2) == 0x000550, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::K2Node_ComponentBoundEvent_Selection_2' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_Replace_ReturnValue_1) == 0x000560, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_Replace_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_Conv_StringToName_ReturnValue) == 0x000570, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_GetDataTableRowNames_OutRowNames_1) == 0x000578, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_GetDataTableRowNames_OutRowNames_1' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_Array_Find_ReturnValue) == 0x000588, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, K2Node_DynamicCast_AsBP_Mannequin_3) == 0x000590, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::K2Node_DynamicCast_AsBP_Mannequin_3' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, K2Node_DynamicCast_bSuccess_3) == 0x000598, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_GetDataTableRowNames_OutRowNames_2) == 0x0005A0, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_GetDataTableRowNames_OutRowNames_2' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_Array_Get_Item_3) == 0x0005B0, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_Conv_NameToString_ReturnValue_1) == 0x0005B8, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_Array_Length_ReturnValue_2) == 0x0005C8, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_Replace_ReturnValue_2) == 0x0005D0, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_Replace_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_Less_IntInt_ReturnValue_1) == 0x0005E0, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, K2Node_ComponentBoundEvent_Selection_1) == 0x0005E8, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::K2Node_ComponentBoundEvent_Selection_1' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_Replace_ReturnValue_3) == 0x0005F8, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_Replace_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_Conv_StringToName_ReturnValue_1) == 0x000608, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_GetDataTableRowNames_OutRowNames_3) == 0x000610, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_GetDataTableRowNames_OutRowNames_3' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, K2Node_DynamicCast_AsBP_Mannequin_4) == 0x000620, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::K2Node_DynamicCast_AsBP_Mannequin_4' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, K2Node_DynamicCast_bSuccess_4) == 0x000628, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_Array_Find_ReturnValue_1) == 0x00062C, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_Array_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_GetGameInstance_ReturnValue) == 0x000630, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, K2Node_DynamicCast_AsBP_Game_Instance) == 0x000638, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::K2Node_DynamicCast_AsBP_Game_Instance' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, K2Node_DynamicCast_bSuccess_5) == 0x000640, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen, CallFunc_GetClassAndTeamUnitIndex_Index) == 0x000644, "Member 'W_EquipScreen_C_ExecuteUbergraph_W_EquipScreen::CallFunc_GetClassAndTeamUnitIndex_Index' has a wrong offset!");
