#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_GainedXPEntry

#include "Basic.hpp"

#include "E_Teams_structs.hpp"
#include "E_Units_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_GainedXPEntry.W_GainedXPEntry_C
// 0x0020 (0x0280 - 0x0260)
class UW_GainedXPEntry_C final : public UUserWidget
{
public:
	class UImage*                                 Image_127;                                         // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x0268(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_412;                                     // 0x0270(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	E_Teams                                       Team;                                              // 0x0278(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	E_Units                                       UnitType;                                          // 0x0279(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_27A[0x2];                                      // 0x027A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         GainedXPAmount;                                    // 0x027C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	struct FSlateBrush SetClassIcon();
	class FText SetUnit();
	class FText SetXPAmount();
	struct FSlateColor SetColor();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_GainedXPEntry_C">();
	}
	static class UW_GainedXPEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_GainedXPEntry_C>();
	}
};
static_assert(alignof(UW_GainedXPEntry_C) == 0x000008, "Wrong alignment on UW_GainedXPEntry_C");
static_assert(sizeof(UW_GainedXPEntry_C) == 0x000280, "Wrong size on UW_GainedXPEntry_C");
static_assert(offsetof(UW_GainedXPEntry_C, Image_127) == 0x000260, "Member 'UW_GainedXPEntry_C::Image_127' has a wrong offset!");
static_assert(offsetof(UW_GainedXPEntry_C, TextBlock) == 0x000268, "Member 'UW_GainedXPEntry_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UW_GainedXPEntry_C, TextBlock_412) == 0x000270, "Member 'UW_GainedXPEntry_C::TextBlock_412' has a wrong offset!");
static_assert(offsetof(UW_GainedXPEntry_C, Team) == 0x000278, "Member 'UW_GainedXPEntry_C::Team' has a wrong offset!");
static_assert(offsetof(UW_GainedXPEntry_C, UnitType) == 0x000279, "Member 'UW_GainedXPEntry_C::UnitType' has a wrong offset!");
static_assert(offsetof(UW_GainedXPEntry_C, GainedXPAmount) == 0x00027C, "Member 'UW_GainedXPEntry_C::GainedXPAmount' has a wrong offset!");

}

