#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_IconTab

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_IconTab.W_IconTab_C.ExecuteUbergraph_W_IconTab
// 0x0090 (0x0090 - 0x0000)
struct W_IconTab_C_ExecuteUbergraph_W_IconTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UW_IconTab_C*>                   CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_IconTab_C*                           CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UButtonSlot*                            K2Node_DynamicCast_AsButton_Slot;                  // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UW_Button_C*>                    CallFunc_GetAllWidgetsOfClass_FoundWidgets_1;      // 0x0068(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Button_C*                            CallFunc_Array_Get_Item_1;                         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_IconTab_C_ExecuteUbergraph_W_IconTab) == 0x000008, "Wrong alignment on W_IconTab_C_ExecuteUbergraph_W_IconTab");
static_assert(sizeof(W_IconTab_C_ExecuteUbergraph_W_IconTab) == 0x000090, "Wrong size on W_IconTab_C_ExecuteUbergraph_W_IconTab");
static_assert(offsetof(W_IconTab_C_ExecuteUbergraph_W_IconTab, EntryPoint) == 0x000000, "Member 'W_IconTab_C_ExecuteUbergraph_W_IconTab::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_IconTab_C_ExecuteUbergraph_W_IconTab, Temp_int_Array_Index_Variable) == 0x000004, "Member 'W_IconTab_C_ExecuteUbergraph_W_IconTab::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_IconTab_C_ExecuteUbergraph_W_IconTab, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'W_IconTab_C_ExecuteUbergraph_W_IconTab::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_IconTab_C_ExecuteUbergraph_W_IconTab, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'W_IconTab_C_ExecuteUbergraph_W_IconTab::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_IconTab_C_ExecuteUbergraph_W_IconTab, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'W_IconTab_C_ExecuteUbergraph_W_IconTab::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(W_IconTab_C_ExecuteUbergraph_W_IconTab, K2Node_Event_IsDesignTime) == 0x000014, "Member 'W_IconTab_C_ExecuteUbergraph_W_IconTab::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_IconTab_C_ExecuteUbergraph_W_IconTab, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000018, "Member 'W_IconTab_C_ExecuteUbergraph_W_IconTab::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(W_IconTab_C_ExecuteUbergraph_W_IconTab, Temp_int_Loop_Counter_Variable_1) == 0x000028, "Member 'W_IconTab_C_ExecuteUbergraph_W_IconTab::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(W_IconTab_C_ExecuteUbergraph_W_IconTab, CallFunc_Array_Get_Item) == 0x000030, "Member 'W_IconTab_C_ExecuteUbergraph_W_IconTab::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_IconTab_C_ExecuteUbergraph_W_IconTab, CallFunc_Add_IntInt_ReturnValue_1) == 0x000038, "Member 'W_IconTab_C_ExecuteUbergraph_W_IconTab::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_IconTab_C_ExecuteUbergraph_W_IconTab, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'W_IconTab_C_ExecuteUbergraph_W_IconTab::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_IconTab_C_ExecuteUbergraph_W_IconTab, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'W_IconTab_C_ExecuteUbergraph_W_IconTab::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_IconTab_C_ExecuteUbergraph_W_IconTab, CallFunc_Add_FloatFloat_ReturnValue) == 0x000044, "Member 'W_IconTab_C_ExecuteUbergraph_W_IconTab::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_IconTab_C_ExecuteUbergraph_W_IconTab, K2Node_MakeStruct_Margin) == 0x000048, "Member 'W_IconTab_C_ExecuteUbergraph_W_IconTab::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(W_IconTab_C_ExecuteUbergraph_W_IconTab, K2Node_DynamicCast_AsButton_Slot) == 0x000058, "Member 'W_IconTab_C_ExecuteUbergraph_W_IconTab::K2Node_DynamicCast_AsButton_Slot' has a wrong offset!");
static_assert(offsetof(W_IconTab_C_ExecuteUbergraph_W_IconTab, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'W_IconTab_C_ExecuteUbergraph_W_IconTab::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_IconTab_C_ExecuteUbergraph_W_IconTab, CallFunc_GetAllWidgetsOfClass_FoundWidgets_1) == 0x000068, "Member 'W_IconTab_C_ExecuteUbergraph_W_IconTab::CallFunc_GetAllWidgetsOfClass_FoundWidgets_1' has a wrong offset!");
static_assert(offsetof(W_IconTab_C_ExecuteUbergraph_W_IconTab, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000078, "Member 'W_IconTab_C_ExecuteUbergraph_W_IconTab::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_IconTab_C_ExecuteUbergraph_W_IconTab, CallFunc_Array_Get_Item_1) == 0x000080, "Member 'W_IconTab_C_ExecuteUbergraph_W_IconTab::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_IconTab_C_ExecuteUbergraph_W_IconTab, CallFunc_Array_Length_ReturnValue_1) == 0x000088, "Member 'W_IconTab_C_ExecuteUbergraph_W_IconTab::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_IconTab_C_ExecuteUbergraph_W_IconTab, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x00008C, "Member 'W_IconTab_C_ExecuteUbergraph_W_IconTab::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_IconTab_C_ExecuteUbergraph_W_IconTab, CallFunc_Less_IntInt_ReturnValue_1) == 0x00008D, "Member 'W_IconTab_C_ExecuteUbergraph_W_IconTab::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function W_IconTab.W_IconTab_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_IconTab_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_IconTab_C_PreConstruct) == 0x000001, "Wrong alignment on W_IconTab_C_PreConstruct");
static_assert(sizeof(W_IconTab_C_PreConstruct) == 0x000001, "Wrong size on W_IconTab_C_PreConstruct");
static_assert(offsetof(W_IconTab_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_IconTab_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_IconTab.W_IconTab_C.SetHighlighted
// 0x0488 (0x0488 - 0x0000)
struct W_IconTab_C_SetHighlighted final
{
public:
	bool                                          Highlighted_0;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0038(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0060(0x0028)()
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0088(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x00B0(0x0028)()
	struct FSlateColor                            K2Node_Select_Default_1;                           // 0x00D8(0x0028)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0100(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x0188(0x0088)()
	struct FButtonStyle                           K2Node_MakeStruct_ButtonStyle;                     // 0x0210(0x0278)()
};
static_assert(alignof(W_IconTab_C_SetHighlighted) == 0x000008, "Wrong alignment on W_IconTab_C_SetHighlighted");
static_assert(sizeof(W_IconTab_C_SetHighlighted) == 0x000488, "Wrong size on W_IconTab_C_SetHighlighted");
static_assert(offsetof(W_IconTab_C_SetHighlighted, Highlighted_0) == 0x000000, "Member 'W_IconTab_C_SetHighlighted::Highlighted_0' has a wrong offset!");
static_assert(offsetof(W_IconTab_C_SetHighlighted, Temp_bool_Variable) == 0x000001, "Member 'W_IconTab_C_SetHighlighted::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_IconTab_C_SetHighlighted, Temp_bool_Variable_1) == 0x000002, "Member 'W_IconTab_C_SetHighlighted::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_IconTab_C_SetHighlighted, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'W_IconTab_C_SetHighlighted::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_IconTab_C_SetHighlighted, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'W_IconTab_C_SetHighlighted::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_IconTab_C_SetHighlighted, K2Node_MakeStruct_SlateColor_1) == 0x000038, "Member 'W_IconTab_C_SetHighlighted::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_IconTab_C_SetHighlighted, K2Node_MakeStruct_SlateColor_2) == 0x000060, "Member 'W_IconTab_C_SetHighlighted::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(W_IconTab_C_SetHighlighted, K2Node_Select_Default) == 0x000088, "Member 'W_IconTab_C_SetHighlighted::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_IconTab_C_SetHighlighted, K2Node_MakeStruct_SlateColor_3) == 0x0000B0, "Member 'W_IconTab_C_SetHighlighted::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(W_IconTab_C_SetHighlighted, K2Node_Select_Default_1) == 0x0000D8, "Member 'W_IconTab_C_SetHighlighted::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_IconTab_C_SetHighlighted, K2Node_MakeStruct_SlateBrush) == 0x000100, "Member 'W_IconTab_C_SetHighlighted::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(W_IconTab_C_SetHighlighted, K2Node_MakeStruct_SlateBrush_1) == 0x000188, "Member 'W_IconTab_C_SetHighlighted::K2Node_MakeStruct_SlateBrush_1' has a wrong offset!");
static_assert(offsetof(W_IconTab_C_SetHighlighted, K2Node_MakeStruct_ButtonStyle) == 0x000210, "Member 'W_IconTab_C_SetHighlighted::K2Node_MakeStruct_ButtonStyle' has a wrong offset!");

}

