#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_IngameChat

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ST_Options_structs.hpp"


namespace SDK::Params
{

// Function W_IngameChat.W_IngameChat_C.ExecuteUbergraph_W_IngameChat
// 0x01E0 (0x01E0 - 0x0000)
struct W_IngameChat_C_ExecuteUbergraph_W_IngameChat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_Options                            CallFunc_GetOptions_Options;                       // 0x0008(0x0070)(HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x007C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Controller_C*                       K2Node_DynamicCast_AsBP_Controller;                // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Username;                       // 0x00E8(0x0018)()
	class FText                                   K2Node_CustomEvent_Message;                        // 0x0100(0x0018)()
	bool                                          K2Node_CustomEvent_SpecialMessage;                 // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_ChatEntry_C*                         K2Node_DynamicCast_AsW_Chat_Entry;                 // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_ChatEntry_C*                         CallFunc_Create_ReturnValue;                       // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text_1;                 // 0x0158(0x0018)(ConstParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0180(0x0018)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01B8(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Len_ReturnValue;                          // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_IngameChat_C_ExecuteUbergraph_W_IngameChat) == 0x000008, "Wrong alignment on W_IngameChat_C_ExecuteUbergraph_W_IngameChat");
static_assert(sizeof(W_IngameChat_C_ExecuteUbergraph_W_IngameChat) == 0x0001E0, "Wrong size on W_IngameChat_C_ExecuteUbergraph_W_IngameChat");
static_assert(offsetof(W_IngameChat_C_ExecuteUbergraph_W_IngameChat, EntryPoint) == 0x000000, "Member 'W_IngameChat_C_ExecuteUbergraph_W_IngameChat::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ExecuteUbergraph_W_IngameChat, CallFunc_GetOptions_Options) == 0x000008, "Member 'W_IngameChat_C_ExecuteUbergraph_W_IngameChat::CallFunc_GetOptions_Options' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ExecuteUbergraph_W_IngameChat, Temp_bool_Has_Been_Initd_Variable) == 0x000078, "Member 'W_IngameChat_C_ExecuteUbergraph_W_IngameChat::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ExecuteUbergraph_W_IngameChat, Temp_bool_IsClosed_Variable) == 0x000079, "Member 'W_IngameChat_C_ExecuteUbergraph_W_IngameChat::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ExecuteUbergraph_W_IngameChat, K2Node_Event_MyGeometry) == 0x00007C, "Member 'W_IngameChat_C_ExecuteUbergraph_W_IngameChat::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ExecuteUbergraph_W_IngameChat, K2Node_Event_InDeltaTime) == 0x0000B4, "Member 'W_IngameChat_C_ExecuteUbergraph_W_IngameChat::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ExecuteUbergraph_W_IngameChat, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000B8, "Member 'W_IngameChat_C_ExecuteUbergraph_W_IngameChat::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ExecuteUbergraph_W_IngameChat, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000BC, "Member 'W_IngameChat_C_ExecuteUbergraph_W_IngameChat::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ExecuteUbergraph_W_IngameChat, CallFunc_FClamp_ReturnValue) == 0x0000C0, "Member 'W_IngameChat_C_ExecuteUbergraph_W_IngameChat::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ExecuteUbergraph_W_IngameChat, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000C4, "Member 'W_IngameChat_C_ExecuteUbergraph_W_IngameChat::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ExecuteUbergraph_W_IngameChat, CallFunc_FClamp_ReturnValue_1) == 0x0000C8, "Member 'W_IngameChat_C_ExecuteUbergraph_W_IngameChat::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ExecuteUbergraph_W_IngameChat, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x0000CC, "Member 'W_IngameChat_C_ExecuteUbergraph_W_IngameChat::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ExecuteUbergraph_W_IngameChat, CallFunc_GetPlayerController_ReturnValue) == 0x0000D0, "Member 'W_IngameChat_C_ExecuteUbergraph_W_IngameChat::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ExecuteUbergraph_W_IngameChat, K2Node_DynamicCast_AsBP_Controller) == 0x0000D8, "Member 'W_IngameChat_C_ExecuteUbergraph_W_IngameChat::K2Node_DynamicCast_AsBP_Controller' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ExecuteUbergraph_W_IngameChat, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'W_IngameChat_C_ExecuteUbergraph_W_IngameChat::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ExecuteUbergraph_W_IngameChat, K2Node_CustomEvent_Username) == 0x0000E8, "Member 'W_IngameChat_C_ExecuteUbergraph_W_IngameChat::K2Node_CustomEvent_Username' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ExecuteUbergraph_W_IngameChat, K2Node_CustomEvent_Message) == 0x000100, "Member 'W_IngameChat_C_ExecuteUbergraph_W_IngameChat::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ExecuteUbergraph_W_IngameChat, K2Node_CustomEvent_SpecialMessage) == 0x000118, "Member 'W_IngameChat_C_ExecuteUbergraph_W_IngameChat::K2Node_CustomEvent_SpecialMessage' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ExecuteUbergraph_W_IngameChat, CallFunc_GetChildAt_ReturnValue) == 0x000120, "Member 'W_IngameChat_C_ExecuteUbergraph_W_IngameChat::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ExecuteUbergraph_W_IngameChat, CallFunc_GetChildrenCount_ReturnValue) == 0x000128, "Member 'W_IngameChat_C_ExecuteUbergraph_W_IngameChat::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ExecuteUbergraph_W_IngameChat, K2Node_DynamicCast_AsW_Chat_Entry) == 0x000130, "Member 'W_IngameChat_C_ExecuteUbergraph_W_IngameChat::K2Node_DynamicCast_AsW_Chat_Entry' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ExecuteUbergraph_W_IngameChat, K2Node_DynamicCast_bSuccess_1) == 0x000138, "Member 'W_IngameChat_C_ExecuteUbergraph_W_IngameChat::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ExecuteUbergraph_W_IngameChat, CallFunc_Greater_IntInt_ReturnValue) == 0x000139, "Member 'W_IngameChat_C_ExecuteUbergraph_W_IngameChat::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ExecuteUbergraph_W_IngameChat, CallFunc_Create_ReturnValue) == 0x000140, "Member 'W_IngameChat_C_ExecuteUbergraph_W_IngameChat::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ExecuteUbergraph_W_IngameChat, CallFunc_AddChild_ReturnValue) == 0x000148, "Member 'W_IngameChat_C_ExecuteUbergraph_W_IngameChat::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ExecuteUbergraph_W_IngameChat, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000150, "Member 'W_IngameChat_C_ExecuteUbergraph_W_IngameChat::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ExecuteUbergraph_W_IngameChat, K2Node_ComponentBoundEvent_Text_1) == 0x000158, "Member 'W_IngameChat_C_ExecuteUbergraph_W_IngameChat::K2Node_ComponentBoundEvent_Text_1' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ExecuteUbergraph_W_IngameChat, CallFunc_Conv_TextToString_ReturnValue) == 0x000170, "Member 'W_IngameChat_C_ExecuteUbergraph_W_IngameChat::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ExecuteUbergraph_W_IngameChat, K2Node_ComponentBoundEvent_Text) == 0x000180, "Member 'W_IngameChat_C_ExecuteUbergraph_W_IngameChat::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ExecuteUbergraph_W_IngameChat, K2Node_ComponentBoundEvent_CommitMethod) == 0x000198, "Member 'W_IngameChat_C_ExecuteUbergraph_W_IngameChat::K2Node_ComponentBoundEvent_CommitMethod' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ExecuteUbergraph_W_IngameChat, CallFunc_GetSubstring_ReturnValue) == 0x0001A0, "Member 'W_IngameChat_C_ExecuteUbergraph_W_IngameChat::CallFunc_GetSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ExecuteUbergraph_W_IngameChat, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001B0, "Member 'W_IngameChat_C_ExecuteUbergraph_W_IngameChat::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ExecuteUbergraph_W_IngameChat, CallFunc_Conv_StringToText_ReturnValue) == 0x0001B8, "Member 'W_IngameChat_C_ExecuteUbergraph_W_IngameChat::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ExecuteUbergraph_W_IngameChat, CallFunc_TextIsEmpty_ReturnValue) == 0x0001D0, "Member 'W_IngameChat_C_ExecuteUbergraph_W_IngameChat::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ExecuteUbergraph_W_IngameChat, CallFunc_Len_ReturnValue) == 0x0001D4, "Member 'W_IngameChat_C_ExecuteUbergraph_W_IngameChat::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ExecuteUbergraph_W_IngameChat, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0001D8, "Member 'W_IngameChat_C_ExecuteUbergraph_W_IngameChat::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");

// Function W_IngameChat.W_IngameChat_C.BndEvt__W_IngameChat_EditableTextBox_172_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct W_IngameChat_C_BndEvt__W_IngameChat_EditableTextBox_172_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_IngameChat_C_BndEvt__W_IngameChat_EditableTextBox_172_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on W_IngameChat_C_BndEvt__W_IngameChat_EditableTextBox_172_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(sizeof(W_IngameChat_C_BndEvt__W_IngameChat_EditableTextBox_172_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000020, "Wrong size on W_IngameChat_C_BndEvt__W_IngameChat_EditableTextBox_172_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(offsetof(W_IngameChat_C_BndEvt__W_IngameChat_EditableTextBox_172_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'W_IngameChat_C_BndEvt__W_IngameChat_EditableTextBox_172_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_BndEvt__W_IngameChat_EditableTextBox_172_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature, CommitMethod) == 0x000018, "Member 'W_IngameChat_C_BndEvt__W_IngameChat_EditableTextBox_172_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function W_IngameChat.W_IngameChat_C.BndEvt__W_IngameChat_EditableTextBox_172_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_IngameChat_C_BndEvt__W_IngameChat_EditableTextBox_172_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_IngameChat_C_BndEvt__W_IngameChat_EditableTextBox_172_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on W_IngameChat_C_BndEvt__W_IngameChat_EditableTextBox_172_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(W_IngameChat_C_BndEvt__W_IngameChat_EditableTextBox_172_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000018, "Wrong size on W_IngameChat_C_BndEvt__W_IngameChat_EditableTextBox_172_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(W_IngameChat_C_BndEvt__W_IngameChat_EditableTextBox_172_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'W_IngameChat_C_BndEvt__W_IngameChat_EditableTextBox_172_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function W_IngameChat.W_IngameChat_C.AddMessage
// 0x0038 (0x0038 - 0x0000)
struct W_IngameChat_C_AddMessage final
{
public:
	class FText                                   UserName;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Message;                                           // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          SpecialMessage;                                    // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_IngameChat_C_AddMessage) == 0x000008, "Wrong alignment on W_IngameChat_C_AddMessage");
static_assert(sizeof(W_IngameChat_C_AddMessage) == 0x000038, "Wrong size on W_IngameChat_C_AddMessage");
static_assert(offsetof(W_IngameChat_C_AddMessage, UserName) == 0x000000, "Member 'W_IngameChat_C_AddMessage::UserName' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_AddMessage, Message) == 0x000018, "Member 'W_IngameChat_C_AddMessage::Message' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_AddMessage, SpecialMessage) == 0x000030, "Member 'W_IngameChat_C_AddMessage::SpecialMessage' has a wrong offset!");

// Function W_IngameChat.W_IngameChat_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_IngameChat_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_IngameChat_C_Tick) == 0x000004, "Wrong alignment on W_IngameChat_C_Tick");
static_assert(sizeof(W_IngameChat_C_Tick) == 0x00003C, "Wrong size on W_IngameChat_C_Tick");
static_assert(offsetof(W_IngameChat_C_Tick, MyGeometry) == 0x000000, "Member 'W_IngameChat_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_Tick, InDeltaTime) == 0x000038, "Member 'W_IngameChat_C_Tick::InDeltaTime' has a wrong offset!");

// Function W_IngameChat.W_IngameChat_C.ShowHUD
// 0x0028 (0x0028 - 0x0000)
struct W_IngameChat_C_ShowHUD final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_FreeCam_C*                          K2Node_DynamicCast_AsBP_Free_Cam;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_IngameChat_C_ShowHUD) == 0x000008, "Wrong alignment on W_IngameChat_C_ShowHUD");
static_assert(sizeof(W_IngameChat_C_ShowHUD) == 0x000028, "Wrong size on W_IngameChat_C_ShowHUD");
static_assert(offsetof(W_IngameChat_C_ShowHUD, ReturnValue) == 0x000000, "Member 'W_IngameChat_C_ShowHUD::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ShowHUD, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'W_IngameChat_C_ShowHUD::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ShowHUD, CallFunc_K2_GetPawn_ReturnValue) == 0x000010, "Member 'W_IngameChat_C_ShowHUD::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ShowHUD, K2Node_DynamicCast_AsBP_Free_Cam) == 0x000018, "Member 'W_IngameChat_C_ShowHUD::K2Node_DynamicCast_AsBP_Free_Cam' has a wrong offset!");
static_assert(offsetof(W_IngameChat_C_ShowHUD, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'W_IngameChat_C_ShowHUD::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

