#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_KeybindEntry

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_KeybindEntry.W_KeybindEntry_C.ExecuteUbergraph_W_KeybindEntry
// 0x0200 (0x0200 - 0x0000)
struct W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputChord                            K2Node_ComponentBoundEvent_SelectedKey;            // 0x0018(0x0020)(HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionKeyMapping                 K2Node_MakeStruct_InputActionKeyMapping;           // 0x0040(0x0028)()
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_1;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputAxisKeyMapping>           CallFunc_GetAxisMappingByName_OutMappings;         // 0x0070(0x0010)(ReferenceParm)
	struct FInputAxisKeyMapping                   CallFunc_Array_Get_Item;                           // 0x0080(0x0028)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInputActionKeyMapping>         CallFunc_GetActionMappingByName_OutMappings;       // 0x00B0(0x0010)(ReferenceParm)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionKeyMapping                 CallFunc_Array_Get_Item_1;                         // 0x00C8(0x0028)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x00F8(0x0018)()
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_2;           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputAxisKeyMapping>           CallFunc_GetAxisMappingByName_OutMappings_1;       // 0x0118(0x0010)(ReferenceParm)
	TArray<struct FInputActionKeyMapping>         CallFunc_GetActionMappingByName_OutMappings_1;     // 0x0128(0x0010)(ReferenceParm)
	struct FInputAxisKeyMapping                   CallFunc_Array_Get_Item_2;                         // 0x0138(0x0028)()
	struct FInputActionKeyMapping                 CallFunc_Array_Get_Item_3;                         // 0x0160(0x0028)()
	struct FInputChord                            K2Node_MakeStruct_InputChord;                      // 0x0188(0x0020)(HasGetValueTypeHash)
	struct FInputChord                            K2Node_MakeStruct_InputChord_1;                    // 0x01A8(0x0020)(HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CD[0x3];                                      // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputAxisKeyMapping                   K2Node_MakeStruct_InputAxisKeyMapping;             // 0x01D8(0x0028)()
};
static_assert(alignof(W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry) == 0x000008, "Wrong alignment on W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry");
static_assert(sizeof(W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry) == 0x000200, "Wrong size on W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry");
static_assert(offsetof(W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry, EntryPoint) == 0x000000, "Member 'W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry, Temp_int_Array_Index_Variable) == 0x000004, "Member 'W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry, K2Node_ComponentBoundEvent_SelectedKey) == 0x000018, "Member 'W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry::K2Node_ComponentBoundEvent_SelectedKey' has a wrong offset!");
static_assert(offsetof(W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry, CallFunc_GetInputSettings_ReturnValue) == 0x000038, "Member 'W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry::CallFunc_GetInputSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry, K2Node_MakeStruct_InputActionKeyMapping) == 0x000040, "Member 'W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry::K2Node_MakeStruct_InputActionKeyMapping' has a wrong offset!");
static_assert(offsetof(W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry, CallFunc_GetInputSettings_ReturnValue_1) == 0x000068, "Member 'W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry::CallFunc_GetInputSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry, CallFunc_GetAxisMappingByName_OutMappings) == 0x000070, "Member 'W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry::CallFunc_GetAxisMappingByName_OutMappings' has a wrong offset!");
static_assert(offsetof(W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry, CallFunc_Array_Get_Item) == 0x000080, "Member 'W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry, CallFunc_Array_Length_ReturnValue) == 0x0000A8, "Member 'W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry, CallFunc_Less_IntInt_ReturnValue) == 0x0000AC, "Member 'W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry, CallFunc_GetActionMappingByName_OutMappings) == 0x0000B0, "Member 'W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry::CallFunc_GetActionMappingByName_OutMappings' has a wrong offset!");
static_assert(offsetof(W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry, K2Node_Event_IsDesignTime) == 0x0000C0, "Member 'W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry, CallFunc_Array_Get_Item_1) == 0x0000C8, "Member 'W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry, CallFunc_Array_Length_ReturnValue_1) == 0x0000F0, "Member 'W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry, CallFunc_Conv_NameToText_ReturnValue) == 0x0000F8, "Member 'W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry, CallFunc_GetInputSettings_ReturnValue_2) == 0x000110, "Member 'W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry::CallFunc_GetInputSettings_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry, CallFunc_GetAxisMappingByName_OutMappings_1) == 0x000118, "Member 'W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry::CallFunc_GetAxisMappingByName_OutMappings_1' has a wrong offset!");
static_assert(offsetof(W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry, CallFunc_GetActionMappingByName_OutMappings_1) == 0x000128, "Member 'W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry::CallFunc_GetActionMappingByName_OutMappings_1' has a wrong offset!");
static_assert(offsetof(W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry, CallFunc_Array_Get_Item_2) == 0x000138, "Member 'W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry, CallFunc_Array_Get_Item_3) == 0x000160, "Member 'W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry, K2Node_MakeStruct_InputChord) == 0x000188, "Member 'W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry::K2Node_MakeStruct_InputChord' has a wrong offset!");
static_assert(offsetof(W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry, K2Node_MakeStruct_InputChord_1) == 0x0001A8, "Member 'W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry::K2Node_MakeStruct_InputChord_1' has a wrong offset!");
static_assert(offsetof(W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry, Temp_int_Loop_Counter_Variable_1) == 0x0001C8, "Member 'W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001CC, "Member 'W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001D0, "Member 'W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry, CallFunc_SelectFloat_ReturnValue) == 0x0001D4, "Member 'W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry, K2Node_MakeStruct_InputAxisKeyMapping) == 0x0001D8, "Member 'W_KeybindEntry_C_ExecuteUbergraph_W_KeybindEntry::K2Node_MakeStruct_InputAxisKeyMapping' has a wrong offset!");

// Function W_KeybindEntry.W_KeybindEntry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_KeybindEntry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_KeybindEntry_C_PreConstruct) == 0x000001, "Wrong alignment on W_KeybindEntry_C_PreConstruct");
static_assert(sizeof(W_KeybindEntry_C_PreConstruct) == 0x000001, "Wrong size on W_KeybindEntry_C_PreConstruct");
static_assert(offsetof(W_KeybindEntry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_KeybindEntry_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_KeybindEntry.W_KeybindEntry_C.BndEvt__W_KeybindEntry_InputKeySelector_29_K2Node_ComponentBoundEvent_0_OnKeySelected__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct W_KeybindEntry_C_BndEvt__W_KeybindEntry_InputKeySelector_29_K2Node_ComponentBoundEvent_0_OnKeySelected__DelegateSignature final
{
public:
	struct FInputChord                            SelectedKey;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(W_KeybindEntry_C_BndEvt__W_KeybindEntry_InputKeySelector_29_K2Node_ComponentBoundEvent_0_OnKeySelected__DelegateSignature) == 0x000008, "Wrong alignment on W_KeybindEntry_C_BndEvt__W_KeybindEntry_InputKeySelector_29_K2Node_ComponentBoundEvent_0_OnKeySelected__DelegateSignature");
static_assert(sizeof(W_KeybindEntry_C_BndEvt__W_KeybindEntry_InputKeySelector_29_K2Node_ComponentBoundEvent_0_OnKeySelected__DelegateSignature) == 0x000020, "Wrong size on W_KeybindEntry_C_BndEvt__W_KeybindEntry_InputKeySelector_29_K2Node_ComponentBoundEvent_0_OnKeySelected__DelegateSignature");
static_assert(offsetof(W_KeybindEntry_C_BndEvt__W_KeybindEntry_InputKeySelector_29_K2Node_ComponentBoundEvent_0_OnKeySelected__DelegateSignature, SelectedKey) == 0x000000, "Member 'W_KeybindEntry_C_BndEvt__W_KeybindEntry_InputKeySelector_29_K2Node_ComponentBoundEvent_0_OnKeySelected__DelegateSignature::SelectedKey' has a wrong offset!");

}

