#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_KeybindEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_KeybindEntry.W_KeybindEntry_C
// 0x0028 (0x0288 - 0x0260)
class UW_KeybindEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UInputKeySelector*                      InputKeySelector_29;                               // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_44;                                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   ActionName;                                        // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AxisMapping;                                       // 0x0280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReverseKey_opposite_;                              // 0x0281(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_W_KeybindEntry(int32 EntryPoint);
	void ReloadKey();
	void PreConstruct(bool IsDesignTime);
	void BndEvt__W_KeybindEntry_InputKeySelector_29_K2Node_ComponentBoundEvent_0_OnKeySelected__DelegateSignature(const struct FInputChord& SelectedKey);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_KeybindEntry_C">();
	}
	static class UW_KeybindEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_KeybindEntry_C>();
	}
};
static_assert(alignof(UW_KeybindEntry_C) == 0x000008, "Wrong alignment on UW_KeybindEntry_C");
static_assert(sizeof(UW_KeybindEntry_C) == 0x000288, "Wrong size on UW_KeybindEntry_C");
static_assert(offsetof(UW_KeybindEntry_C, UberGraphFrame) == 0x000260, "Member 'UW_KeybindEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_KeybindEntry_C, InputKeySelector_29) == 0x000268, "Member 'UW_KeybindEntry_C::InputKeySelector_29' has a wrong offset!");
static_assert(offsetof(UW_KeybindEntry_C, TextBlock_44) == 0x000270, "Member 'UW_KeybindEntry_C::TextBlock_44' has a wrong offset!");
static_assert(offsetof(UW_KeybindEntry_C, ActionName) == 0x000278, "Member 'UW_KeybindEntry_C::ActionName' has a wrong offset!");
static_assert(offsetof(UW_KeybindEntry_C, AxisMapping) == 0x000280, "Member 'UW_KeybindEntry_C::AxisMapping' has a wrong offset!");
static_assert(offsetof(UW_KeybindEntry_C, ReverseKey_opposite_) == 0x000281, "Member 'UW_KeybindEntry_C::ReverseKey_opposite_' has a wrong offset!");

}

