#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_KillFeedEntry

#include "Basic.hpp"

#include "E_Teams_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_KillFeedEntry.W_KillFeedEntry_C.ExecuteUbergraph_W_KillFeedEntry
// 0x0278 (0x0278 - 0x0000)
struct W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	E_Teams                                       Temp_byte_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            Temp_struct_Variable;                              // 0x0038(0x0028)()
	E_Teams                                       Temp_byte_Variable_1;                              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            Temp_struct_Variable_1;                            // 0x0068(0x0028)()
	bool                                          Temp_bool_Variable;                                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_4;                              // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0098(0x0018)()
	bool                                          CallFunc_CheckIfSelf_IsSelf;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00B8(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckIfSelf_IsSelf_1;                     // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x00D8(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00F0(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0108(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0130(0x0028)()
	struct FSlateColor                            K2Node_Select_Default_1;                           // 0x0158(0x0028)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_Select_Default_2;                           // 0x0188(0x0028)()
	struct FSlateColor                            K2Node_Select_Default_3;                           // 0x01B0(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x01D8(0x0028)()
	struct FSlateColor                            K2Node_Select_Default_4;                           // 0x0200(0x0028)()
	struct FSlateColor                            K2Node_Select_Default_5;                           // 0x0228(0x0028)()
	struct FSlateColor                            K2Node_Select_Default_6;                           // 0x0250(0x0028)()
};
static_assert(alignof(W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry) == 0x000008, "Wrong alignment on W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry");
static_assert(sizeof(W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry) == 0x000278, "Wrong size on W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry");
static_assert(offsetof(W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry, EntryPoint) == 0x000000, "Member 'W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry, Temp_byte_Variable) == 0x000030, "Member 'W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry, Temp_struct_Variable) == 0x000038, "Member 'W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry, Temp_byte_Variable_1) == 0x000060, "Member 'W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry, Temp_struct_Variable_1) == 0x000068, "Member 'W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry, Temp_bool_Variable) == 0x000090, "Member 'W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry, Temp_bool_Variable_1) == 0x000091, "Member 'W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry, Temp_bool_Variable_2) == 0x000092, "Member 'W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry, Temp_bool_Variable_3) == 0x000093, "Member 'W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry, Temp_bool_Variable_4) == 0x000094, "Member 'W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry, Temp_text_Variable) == 0x000098, "Member 'W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry, CallFunc_CheckIfSelf_IsSelf) == 0x0000B0, "Member 'W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry::CallFunc_CheckIfSelf_IsSelf' has a wrong offset!");
static_assert(offsetof(W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry, CallFunc_Conv_StringToText_ReturnValue) == 0x0000B8, "Member 'W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry, CallFunc_TextIsEmpty_ReturnValue) == 0x0000D0, "Member 'W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry, CallFunc_CheckIfSelf_IsSelf_1) == 0x0000D1, "Member 'W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry::CallFunc_CheckIfSelf_IsSelf_1' has a wrong offset!");
static_assert(offsetof(W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry, K2Node_Select_Default) == 0x0000D8, "Member 'W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000F0, "Member 'W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry, K2Node_MakeStruct_SlateColor_1) == 0x000108, "Member 'W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry, K2Node_MakeStruct_SlateColor_2) == 0x000130, "Member 'W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry, K2Node_Select_Default_1) == 0x000158, "Member 'W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry, CallFunc_PlayAnimation_ReturnValue) == 0x000180, "Member 'W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry, K2Node_Select_Default_2) == 0x000188, "Member 'W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry, K2Node_Select_Default_3) == 0x0001B0, "Member 'W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry, K2Node_MakeStruct_SlateColor_3) == 0x0001D8, "Member 'W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry, K2Node_Select_Default_4) == 0x000200, "Member 'W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry, K2Node_Select_Default_5) == 0x000228, "Member 'W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry, K2Node_Select_Default_6) == 0x000250, "Member 'W_KillFeedEntry_C_ExecuteUbergraph_W_KillFeedEntry::K2Node_Select_Default_6' has a wrong offset!");

// Function W_KillFeedEntry.W_KillFeedEntry_C.CheckIfSelf
// 0x0020 (0x0020 - 0x0000)
struct W_KillFeedEntry_C_CheckIfSelf final
{
public:
	int32                                         PlayewrIndex;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSelf;                                            // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Controller_C*                       K2Node_DynamicCast_AsBP_Controller;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_KillFeedEntry_C_CheckIfSelf) == 0x000008, "Wrong alignment on W_KillFeedEntry_C_CheckIfSelf");
static_assert(sizeof(W_KillFeedEntry_C_CheckIfSelf) == 0x000020, "Wrong size on W_KillFeedEntry_C_CheckIfSelf");
static_assert(offsetof(W_KillFeedEntry_C_CheckIfSelf, PlayewrIndex) == 0x000000, "Member 'W_KillFeedEntry_C_CheckIfSelf::PlayewrIndex' has a wrong offset!");
static_assert(offsetof(W_KillFeedEntry_C_CheckIfSelf, IsSelf) == 0x000004, "Member 'W_KillFeedEntry_C_CheckIfSelf::IsSelf' has a wrong offset!");
static_assert(offsetof(W_KillFeedEntry_C_CheckIfSelf, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'W_KillFeedEntry_C_CheckIfSelf::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_KillFeedEntry_C_CheckIfSelf, K2Node_DynamicCast_AsBP_Controller) == 0x000010, "Member 'W_KillFeedEntry_C_CheckIfSelf::K2Node_DynamicCast_AsBP_Controller' has a wrong offset!");
static_assert(offsetof(W_KillFeedEntry_C_CheckIfSelf, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'W_KillFeedEntry_C_CheckIfSelf::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_KillFeedEntry_C_CheckIfSelf, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'W_KillFeedEntry_C_CheckIfSelf::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_KillFeedEntry_C_CheckIfSelf, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00001A, "Member 'W_KillFeedEntry_C_CheckIfSelf::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_KillFeedEntry_C_CheckIfSelf, CallFunc_Not_PreBool_ReturnValue) == 0x00001B, "Member 'W_KillFeedEntry_C_CheckIfSelf::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_KillFeedEntry_C_CheckIfSelf, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00001C, "Member 'W_KillFeedEntry_C_CheckIfSelf::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_KillFeedEntry_C_CheckIfSelf, CallFunc_BooleanAND_ReturnValue) == 0x00001D, "Member 'W_KillFeedEntry_C_CheckIfSelf::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

