#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_KickBanEntry

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_KickBanEntry.W_KickBanEntry_C.ExecuteUbergraph_W_KickBanEntry
// 0x0020 (0x0020 - 0x0000)
struct W_KickBanEntry_C_ExecuteUbergraph_W_KickBanEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_BanTypeConfirm_C*                    CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerState_C*                      K2Node_DynamicCast_AsBP_Player_State;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_KickBanEntry_C_ExecuteUbergraph_W_KickBanEntry) == 0x000008, "Wrong alignment on W_KickBanEntry_C_ExecuteUbergraph_W_KickBanEntry");
static_assert(sizeof(W_KickBanEntry_C_ExecuteUbergraph_W_KickBanEntry) == 0x000020, "Wrong size on W_KickBanEntry_C_ExecuteUbergraph_W_KickBanEntry");
static_assert(offsetof(W_KickBanEntry_C_ExecuteUbergraph_W_KickBanEntry, EntryPoint) == 0x000000, "Member 'W_KickBanEntry_C_ExecuteUbergraph_W_KickBanEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_KickBanEntry_C_ExecuteUbergraph_W_KickBanEntry, CallFunc_Create_ReturnValue) == 0x000008, "Member 'W_KickBanEntry_C_ExecuteUbergraph_W_KickBanEntry::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_KickBanEntry_C_ExecuteUbergraph_W_KickBanEntry, K2Node_DynamicCast_AsBP_Player_State) == 0x000010, "Member 'W_KickBanEntry_C_ExecuteUbergraph_W_KickBanEntry::K2Node_DynamicCast_AsBP_Player_State' has a wrong offset!");
static_assert(offsetof(W_KickBanEntry_C_ExecuteUbergraph_W_KickBanEntry, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'W_KickBanEntry_C_ExecuteUbergraph_W_KickBanEntry::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function W_KickBanEntry.W_KickBanEntry_C.EnableBanButton
// 0x0001 (0x0001 - 0x0000)
struct W_KickBanEntry_C_EnableBanButton final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_KickBanEntry_C_EnableBanButton) == 0x000001, "Wrong alignment on W_KickBanEntry_C_EnableBanButton");
static_assert(sizeof(W_KickBanEntry_C_EnableBanButton) == 0x000001, "Wrong size on W_KickBanEntry_C_EnableBanButton");
static_assert(offsetof(W_KickBanEntry_C_EnableBanButton, ReturnValue) == 0x000000, "Member 'W_KickBanEntry_C_EnableBanButton::ReturnValue' has a wrong offset!");

}

