#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_KillConfirmEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_KillConfirmEntry.W_KillConfirmEntry_C
// 0x0050 (0x02B0 - 0x0260)
class UW_KillConfirmEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       KillConfirm;                                       // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_0;                                          // 0x0270(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_86;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_541;                                     // 0x0280(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Kill;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   KillText;                                          // 0x0290(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          IsAssistKill;                                      // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_W_KillConfirmEntry(int32 EntryPoint);
	void Construct();
	struct FSlateBrush SetIcon();
	class FText SetKillType();
	struct FLinearColor SetBgColor();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_KillConfirmEntry_C">();
	}
	static class UW_KillConfirmEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_KillConfirmEntry_C>();
	}
};
static_assert(alignof(UW_KillConfirmEntry_C) == 0x000008, "Wrong alignment on UW_KillConfirmEntry_C");
static_assert(sizeof(UW_KillConfirmEntry_C) == 0x0002B0, "Wrong size on UW_KillConfirmEntry_C");
static_assert(offsetof(UW_KillConfirmEntry_C, UberGraphFrame) == 0x000260, "Member 'UW_KillConfirmEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_KillConfirmEntry_C, KillConfirm) == 0x000268, "Member 'UW_KillConfirmEntry_C::KillConfirm' has a wrong offset!");
static_assert(offsetof(UW_KillConfirmEntry_C, Border_0) == 0x000270, "Member 'UW_KillConfirmEntry_C::Border_0' has a wrong offset!");
static_assert(offsetof(UW_KillConfirmEntry_C, Image_86) == 0x000278, "Member 'UW_KillConfirmEntry_C::Image_86' has a wrong offset!");
static_assert(offsetof(UW_KillConfirmEntry_C, TextBlock_541) == 0x000280, "Member 'UW_KillConfirmEntry_C::TextBlock_541' has a wrong offset!");
static_assert(offsetof(UW_KillConfirmEntry_C, TextBlock_Kill) == 0x000288, "Member 'UW_KillConfirmEntry_C::TextBlock_Kill' has a wrong offset!");
static_assert(offsetof(UW_KillConfirmEntry_C, KillText) == 0x000290, "Member 'UW_KillConfirmEntry_C::KillText' has a wrong offset!");
static_assert(offsetof(UW_KillConfirmEntry_C, IsAssistKill) == 0x0002A8, "Member 'UW_KillConfirmEntry_C::IsAssistKill' has a wrong offset!");

}

