#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_KillFeedEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "ST_PlayerStats_structs.hpp"
#include "E_Teams_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_KillFeedEntry.W_KillFeedEntry_C
// 0x00F8 (0x0358 - 0x0260)
class UW_KillFeedEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PopIn;                                             // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Killer;                                  // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Victim;                                  // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FST_PlayerStats                        Killer;                                            // 0x0288(0x0068)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	struct FST_PlayerStats                        Victim;                                            // 0x02F0(0x0068)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_KillFeedEntry(int32 EntryPoint);
	void Construct();
	void CheckIfSelf(int32 PlayewrIndex, bool* IsSelf);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_KillFeedEntry_C">();
	}
	static class UW_KillFeedEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_KillFeedEntry_C>();
	}
};
static_assert(alignof(UW_KillFeedEntry_C) == 0x000008, "Wrong alignment on UW_KillFeedEntry_C");
static_assert(sizeof(UW_KillFeedEntry_C) == 0x000358, "Wrong size on UW_KillFeedEntry_C");
static_assert(offsetof(UW_KillFeedEntry_C, UberGraphFrame) == 0x000260, "Member 'UW_KillFeedEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_KillFeedEntry_C, PopIn) == 0x000268, "Member 'UW_KillFeedEntry_C::PopIn' has a wrong offset!");
static_assert(offsetof(UW_KillFeedEntry_C, TextBlock) == 0x000270, "Member 'UW_KillFeedEntry_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UW_KillFeedEntry_C, TextBlock_Killer) == 0x000278, "Member 'UW_KillFeedEntry_C::TextBlock_Killer' has a wrong offset!");
static_assert(offsetof(UW_KillFeedEntry_C, TextBlock_Victim) == 0x000280, "Member 'UW_KillFeedEntry_C::TextBlock_Victim' has a wrong offset!");
static_assert(offsetof(UW_KillFeedEntry_C, Killer) == 0x000288, "Member 'UW_KillFeedEntry_C::Killer' has a wrong offset!");
static_assert(offsetof(UW_KillFeedEntry_C, Victim) == 0x0002F0, "Member 'UW_KillFeedEntry_C::Victim' has a wrong offset!");

}

