#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MainMenu

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AdvancedSessions_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "OnlineSubsystemUtils_structs.hpp"
#include "ST_Map_structs.hpp"
#include "ST_UnitProgress_structs.hpp"


namespace SDK::Params
{

// Function W_MainMenu.W_MainMenu_C.ExecuteUbergraph_W_MainMenu
// 0x0BD0 (0x0BD0 - 0x0000)
struct W_MainMenu_C_ExecuteUbergraph_W_MainMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSessionsSearchSetting>         Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	class UW_Tooltip_C*                           CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_ServerbrowserEntry_C*                CallFunc_Create_ReturnValue_1;                     // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_LoadingScreen_C*                     CallFunc_Create_ReturnValue_2;                     // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value_2;                // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x00D8(0x0018)()
	int32                                         CallFunc_Round_ReturnValue;                        // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSessionPropertyKeyPair                CallFunc_MakeLiteralSessionPropertyString_ReturnValue; // 0x0108(0x0020)()
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value_1;                // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GameInstance_C*                     K2Node_DynamicCast_AsBP_Game_Instance;             // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue_1;                      // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0160(0x0018)()
	class FString                                 K2Node_ComponentBoundEvent_Selection_1;            // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x018C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_Selection;              // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x01B0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x01C8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0208(0x0010)(ReferenceParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0220(0x0018)()
	class UFindSessionsCallbackProxyAdvanced*     CallFunc_FindSessionsAdvanced_ReturnValue;         // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0248(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x025C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_Map                                CallFunc_GetDataTableRowFromName_OutRow;           // 0x0268(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x02B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue_1;                    // 0x02C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default_1;                           // 0x02D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x02E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x02F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0308(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0318(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0330(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_ServerBrowserEntry2_C*               CallFunc_Create_ReturnValue_3;                     // 0x0348(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_LevelName;                      // 0x0350(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindSubstring_ReturnValue;                // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0368(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue_2;                    // 0x0378(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue_3;                    // 0x0388(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSessionPropertyKeyPair                CallFunc_MakeLiteralSessionPropertyString_ReturnValue_1; // 0x0398(0x0020)()
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x03B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSessionPropertyKeyPair                CallFunc_MakeLiteralSessionPropertyString_ReturnValue_2; // 0x03C8(0x0020)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithTag_OutActors;            // 0x03F0(0x0010)(ReferenceParm)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithTag_OutActors_1;          // 0x0400(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_2;                         // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FBlueprintSessionResult>        Temp_struct_Variable_1;                            // 0x0420(0x0010)(ReferenceParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBlueprintSessionResult                CallFunc_Array_Get_Item_3;                         // 0x0438(0x0108)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0544(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_545[0x3];                                      // 0x0545(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x054C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_54D[0x3];                                      // 0x054D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_WithAnimation_1;                // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_559[0x7];                                      // 0x0559(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_WithAnimation;                  // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_571[0x7];                                      // 0x0571(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FST_UnitProgress>               CallFunc_GetAllPlayerUnitsProgress_UnitProgress;   // 0x0578(0x0010)(ReferenceParm)
	struct FST_UnitProgress                       CallFunc_Array_Get_Item_4;                         // 0x0588(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x05A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x05A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A5[0x3];                                      // 0x05A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetLevelFromXP_Level;                     // 0x05A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLevelFromXP_RequiredXPForNextLevel;    // 0x05AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLevelFromXP_CurrentXPAmountProgress;   // 0x05B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x05B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x05B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x05BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BD[0x3];                                      // 0x05BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x05C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C4[0x4];                                      // 0x05C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x05C8(0x0018)(ConstParm)
	TArray<struct FBlueprintSessionResult>        K2Node_CustomEvent_Results;                        // 0x05E0(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x05F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F4[0x4];                                      // 0x05F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x05F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBlueprintSessionResult                CallFunc_Array_Get_Item_5;                         // 0x0600(0x0108)()
	class ABP_BaseController_C*                   K2Node_DynamicCast_AsBP_Base_Controller;           // 0x0708(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0710(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_711[0x7];                                      // 0x0711(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0718(0x0018)()
	struct FSessionPropertyKeyPair                CallFunc_MakeLiteralSessionPropertyInt_ReturnValue; // 0x0730(0x0020)()
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0750(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_GameInstance_C*                     K2Node_DynamicCast_AsBP_Game_Instance_1;           // 0x0758(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0760(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_761[0x7];                                      // 0x0761(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0768(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0780(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0790(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSessionPropertyKeyPair                CallFunc_MakeLiteralSessionPropertyString_ReturnValue_3; // 0x07A0(0x0020)()
	struct FSessionPropertyKeyPair                CallFunc_MakeLiteralSessionPropertyString_ReturnValue_4; // 0x07C0(0x0020)()
	TArray<class ABP_Mannequin_C*>                CallFunc_GetAllActorsOfClass_OutActors;            // 0x07E0(0x0010)(ReferenceParm)
	class ABP_Mannequin_C*                        CallFunc_Array_Get_Item_6;                         // 0x07F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x07F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x07FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7FD[0x3];                                      // 0x07FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x0800(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text_1;                 // 0x0808(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0820(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_821[0x7];                                      // 0x0821(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0828(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSessionPropertyKeyPair                CallFunc_MakeLiteralSessionPropertyString_ReturnValue_5; // 0x0838(0x0020)()
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x0858(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_GameInstance_C*                     K2Node_DynamicCast_AsBP_Game_Instance_2;           // 0x0860(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0868(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_869[0x3];                                      // 0x0869(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const TArray<struct FBlueprintSessionResult>& Results)> K2Node_CreateDelegate_OutputDelegate_3; // 0x086C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_87C[0x4];                                      // 0x087C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0880(0x0018)()
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_3;            // 0x0898(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x08A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A1[0x7];                                      // 0x08A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GameInstance_C*                     K2Node_DynamicCast_AsBP_Game_Instance_3;           // 0x08A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x08B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B1[0x7];                                      // 0x08B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_4;            // 0x08B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_GameInstance_C*                     K2Node_DynamicCast_AsBP_Game_Instance_4;           // 0x08C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x08C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C9[0x7];                                      // 0x08C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_5;            // 0x08D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_GameInstance_C*                     K2Node_DynamicCast_AsBP_Game_Instance_5;           // 0x08D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x08E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E1[0x7];                                      // 0x08E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_6;            // 0x08E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_GameInstance_C*                     K2Node_DynamicCast_AsBP_Game_Instance_6;           // 0x08F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x08F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8F9[0x7];                                      // 0x08F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBlueprintSessionResult>        K2Node_CustomEvent_Results_1;                      // 0x0900(0x0010)(ConstParm, ReferenceParm)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_7;            // 0x0910(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_GameInstance_C*                     K2Node_DynamicCast_AsBP_Game_Instance_7;           // 0x0918(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0920(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_State_1;                // 0x0921(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_922[0x6];                                      // 0x0922(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_8;            // 0x0928(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_GameInstance_C*                     K2Node_DynamicCast_AsBP_Game_Instance_8;           // 0x0930(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0938(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_939[0x3];                                      // 0x0939(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const TArray<struct FBlueprintSessionResult>& Results)> K2Node_CreateDelegate_OutputDelegate_4; // 0x093C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_94C[0x4];                                      // 0x094C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_9;            // 0x0950(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_GameInstance_C*                     K2Node_DynamicCast_AsBP_Game_Instance_9;           // 0x0958(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0960(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_961[0x7];                                      // 0x0961(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0968(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_State;                  // 0x0970(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_971[0x7];                                      // 0x0971(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSessionPropertyKeyPair                CallFunc_MakeLiteralSessionPropertyBool_ReturnValue; // 0x0978(0x0020)()
	TArray<struct FSessionPropertyKeyPair>        K2Node_MakeArray_Array_1;                          // 0x0998(0x0010)(ConstParm, ReferenceParm)
	class UCreateSessionCallbackProxyAdvanced*    CallFunc_CreateAdvancedSession_ReturnValue;        // 0x09A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x09B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B1[0x7];                                      // 0x09B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x09B8(0x0018)(ConstParm)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x09D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x09D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_1;             // 0x09DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x09E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x09E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x09E8(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0A00(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0A18(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_6;        // 0x0A28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlayerName_ReturnValue_1;              // 0x0A30(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0A40(0x0018)()
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_10;           // 0x0A58(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0A60(0x0040)(HasGetValueTypeHash)
	class UBP_GameInstance_C*                     K2Node_DynamicCast_AsBP_Game_Instance_10;          // 0x0AA0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0AA8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA9[0x7];                                      // 0x0AA9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0AB0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0AC0(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue_2;                // 0x0AD8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD9[0x3];                                      // 0x0AD9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0ADC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_2;                           // 0x0AE0(0x0018)()
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0AF8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0AFC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_1;           // 0x0B00(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0B18(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_3;             // 0x0B58(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0B70(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0B80(0x0018)()
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x0B98(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0B9C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_1;                      // 0x0BA0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA4[0x4];                                      // 0x0BA4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_4;             // 0x0BA8(0x0018)()
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_3;            // 0x0BC0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0BC4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_3;                // 0x0BC8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu) == 0x000008, "Wrong alignment on W_MainMenu_C_ExecuteUbergraph_W_MainMenu");
static_assert(sizeof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu) == 0x000BD0, "Wrong size on W_MainMenu_C_ExecuteUbergraph_W_MainMenu");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, EntryPoint) == 0x000000, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_struct_Variable) == 0x000008, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Create_ReturnValue) == 0x000018, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_bool_Variable) == 0x000020, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_string_Variable) == 0x000038, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_string_Variable_1) == 0x000048, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x000058, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_bool_Variable_1) == 0x000068, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_int_Variable) == 0x00006C, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_int_Variable_1) == 0x000070, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Create_ReturnValue_1) == 0x000078, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_bool_Variable_2) == 0x000080, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_Select_Default) == 0x000084, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_int_Array_Index_Variable) == 0x000088, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_int_Loop_Counter_Variable) == 0x00008C, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_int_Loop_Counter_Variable_1) == 0x000090, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Add_IntInt_ReturnValue) == 0x000094, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Add_IntInt_ReturnValue_1) == 0x000098, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_int_Array_Index_Variable_1) == 0x00009C, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000A0, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_int_Array_Index_Variable_2) == 0x0000B0, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_int_Loop_Counter_Variable_2) == 0x0000B4, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000B8, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_int_Array_Index_Variable_3) == 0x0000BC, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Create_ReturnValue_2) == 0x0000C0, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetPlayerController_ReturnValue) == 0x0000C8, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_ComponentBoundEvent_Value_2) == 0x0000D0, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_ComponentBoundEvent_Value_2' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000D4, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetText_ReturnValue) == 0x0000D8, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Round_ReturnValue) == 0x0000F0, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Conv_TextToString_ReturnValue) == 0x0000F8, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_MakeLiteralSessionPropertyString_ReturnValue) == 0x000108, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_MakeLiteralSessionPropertyString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetGameInstance_ReturnValue) == 0x000128, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_ComponentBoundEvent_Value_1) == 0x000130, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_ComponentBoundEvent_Value_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_DynamicCast_AsBP_Game_Instance) == 0x000138, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_DynamicCast_AsBP_Game_Instance' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_DynamicCast_bSuccess) == 0x000140, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000144, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Round_ReturnValue_1) == 0x000148, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Round_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Replace_ReturnValue) == 0x000150, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Conv_StringToText_ReturnValue) == 0x000160, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_ComponentBoundEvent_Selection_1) == 0x000178, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_ComponentBoundEvent_Selection_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_SwitchString_CmpSuccess) == 0x000188, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Conv_StringToName_ReturnValue) == 0x00018C, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_ComponentBoundEvent_Selection) == 0x000198, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_ComponentBoundEvent_Selection' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_ComponentBoundEvent_Value) == 0x0001A8, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_MapRangeClamped_ReturnValue) == 0x0001AC, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Conv_FloatToText_ReturnValue) == 0x0001B0, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_MakeStruct_FormatArgumentData) == 0x0001C8, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_MakeArray_Array) == 0x000208, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetPlayerController_ReturnValue_1) == 0x000218, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Format_ReturnValue) == 0x000220, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_FindSessionsAdvanced_ReturnValue) == 0x000238, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_FindSessionsAdvanced_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_IsValid_ReturnValue) == 0x000240, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000248, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, Temp_int_Loop_Counter_Variable_3) == 0x000258, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Array_Get_Item) == 0x00025C, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Add_IntInt_ReturnValue_3) == 0x000264, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetDataTableRowFromName_OutRow) == 0x000268, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0002B0, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Conv_NameToString_ReturnValue) == 0x0002B8, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Replace_ReturnValue_1) == 0x0002C8, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Replace_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_Select_Default_1) == 0x0002D8, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Concat_StrStr_ReturnValue) == 0x0002E8, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x0002F8, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000308, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000318, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Array_Length_ReturnValue) == 0x000328, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000330, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Array_Add_ReturnValue) == 0x000340, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Create_ReturnValue_3) == 0x000348, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, K2Node_CustomEvent_LevelName) == 0x000350, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::K2Node_CustomEvent_LevelName' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_FindSubstring_ReturnValue) == 0x000360, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_FindSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Subtract_IntInt_ReturnValue) == 0x000364, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetSubstring_ReturnValue) == 0x000368, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Replace_ReturnValue_2) == 0x000378, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Replace_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_Replace_ReturnValue_3) == 0x000388, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_Replace_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_MakeLiteralSessionPropertyString_ReturnValue_1) == 0x000398, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_MakeLiteralSessionPropertyString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1) == 0x0003B8, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_MakeLiteralSessionPropertyString_ReturnValue_2) == 0x0003C8, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_MakeLiteralSessionPropertyString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_PlayAnimation_ReturnValue) == 0x0003E8, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetAllActorsWithTag_OutActors) == 0x0003F0, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetAllActorsWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(W_MainMenu_C_ExecuteUbergraph_W_MainMenu, CallFunc_GetAllActorsWithTag_OutActors_1) == 0x000400, "Member 'W_MainMenu_C_ExecuteUbergraph_W_MainMenu::CallFunc_GetAllActorsWithTag_OutActors_1' has a wrong offset!");
