#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_NewItemPopup

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "SteamCore_structs.hpp"
#include "ST_Unlockable_structs.hpp"


namespace SDK::Params
{

// Function W_NewItemPopup.W_NewItemPopup_C.ExecuteUbergraph_W_NewItemPopup
// 0x01E8 (0x01E8 - 0x0000)
struct W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_EquipEntry_C*                        CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSteamItemDetails                      CallFunc_Array_Get_Item;                           // 0x0020(0x0020)()
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_GetItemDefinitionProperty_Value;          // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetItemDefinitionProperty_ReturnValue;    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0080(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_Unlockable                         CallFunc_GetDataTableRowFromName_OutRow;           // 0x0098(0x0148)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup) == 0x000008, "Wrong alignment on W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup");
static_assert(sizeof(W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup) == 0x0001E8, "Wrong size on W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup");
static_assert(offsetof(W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup, EntryPoint) == 0x000000, "Member 'W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup, CallFunc_Create_ReturnValue) == 0x000008, "Member 'W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup, Temp_int_Array_Index_Variable) == 0x000010, "Member 'W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup, CallFunc_MakeLiteralFloat_ReturnValue) == 0x00001C, "Member 'W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup, CallFunc_Array_Get_Item) == 0x000020, "Member 'W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup, K2Node_MakeStruct_Margin) == 0x000040, "Member 'W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup, CallFunc_GetItemDefinitionProperty_Value) == 0x000050, "Member 'W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup::CallFunc_GetItemDefinitionProperty_Value' has a wrong offset!");
static_assert(offsetof(W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup, CallFunc_GetItemDefinitionProperty_ReturnValue) == 0x000060, "Member 'W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup::CallFunc_GetItemDefinitionProperty_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup, CallFunc_Conv_StringToInt_ReturnValue) == 0x000068, "Member 'W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup, CallFunc_Less_IntInt_ReturnValue) == 0x00006C, "Member 'W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup, CallFunc_Subtract_IntInt_ReturnValue) == 0x000070, "Member 'W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup, CallFunc_AddChild_ReturnValue) == 0x000078, "Member 'W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000080, "Member 'W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup, CallFunc_Array_Get_Item_1) == 0x000090, "Member 'W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup, CallFunc_GetDataTableRowFromName_OutRow) == 0x000098, "Member 'W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0001E0, "Member 'W_NewItemPopup_C_ExecuteUbergraph_W_NewItemPopup::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

}

