#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_NewItemPopup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SteamCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_NewItemPopup.W_NewItemPopup_C
// 0x0028 (0x0288 - 0x0260)
class UW_NewItemPopup_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HorizontalBox_56;                                  // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Button_C*                            W_Button_C_0;                                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FSteamItemDetails>              NewItems;                                          // 0x0278(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_W_NewItemPopup(int32 EntryPoint);
	void BndEvt__W_NewItemPopup_W_Button_C_0_K2Node_ComponentBoundEvent_1_ButtonPressed__DelegateSignature();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_NewItemPopup_C">();
	}
	static class UW_NewItemPopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_NewItemPopup_C>();
	}
};
static_assert(alignof(UW_NewItemPopup_C) == 0x000008, "Wrong alignment on UW_NewItemPopup_C");
static_assert(sizeof(UW_NewItemPopup_C) == 0x000288, "Wrong size on UW_NewItemPopup_C");
static_assert(offsetof(UW_NewItemPopup_C, UberGraphFrame) == 0x000260, "Member 'UW_NewItemPopup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_NewItemPopup_C, HorizontalBox_56) == 0x000268, "Member 'UW_NewItemPopup_C::HorizontalBox_56' has a wrong offset!");
static_assert(offsetof(UW_NewItemPopup_C, W_Button_C_0) == 0x000270, "Member 'UW_NewItemPopup_C::W_Button_C_0' has a wrong offset!");
static_assert(offsetof(UW_NewItemPopup_C, NewItems) == 0x000278, "Member 'UW_NewItemPopup_C::NewItems' has a wrong offset!");

}

