#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Notification

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Notification.W_Notification_C
// 0x0048 (0x02A8 - 0x0260)
class UW_Notification_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PopupAnimation;                                    // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Message;                                 // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_0;                                     // 0x0280(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   NotificationMessage;                               // 0x0288(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UTexture2D*                             NotificationIcon;                                  // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Notification(int32 EntryPoint);
	void Construct();
	ESlateVisibility ShowNotification();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Notification_C">();
	}
	static class UW_Notification_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Notification_C>();
	}
};
static_assert(alignof(UW_Notification_C) == 0x000008, "Wrong alignment on UW_Notification_C");
static_assert(sizeof(UW_Notification_C) == 0x0002A8, "Wrong size on UW_Notification_C");
static_assert(offsetof(UW_Notification_C, UberGraphFrame) == 0x000260, "Member 'UW_Notification_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Notification_C, PopupAnimation) == 0x000268, "Member 'UW_Notification_C::PopupAnimation' has a wrong offset!");
static_assert(offsetof(UW_Notification_C, Image_Icon) == 0x000270, "Member 'UW_Notification_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UW_Notification_C, TextBlock_Message) == 0x000278, "Member 'UW_Notification_C::TextBlock_Message' has a wrong offset!");
static_assert(offsetof(UW_Notification_C, VerticalBox_0) == 0x000280, "Member 'UW_Notification_C::VerticalBox_0' has a wrong offset!");
static_assert(offsetof(UW_Notification_C, NotificationMessage) == 0x000288, "Member 'UW_Notification_C::NotificationMessage' has a wrong offset!");
static_assert(offsetof(UW_Notification_C, NotificationIcon) == 0x0002A0, "Member 'UW_Notification_C::NotificationIcon' has a wrong offset!");

}

