#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Notification

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function W_Notification.W_Notification_C.ExecuteUbergraph_W_Notification
// 0x0010 (0x0010 - 0x0000)
struct W_Notification_C_ExecuteUbergraph_W_Notification final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Notification_C_ExecuteUbergraph_W_Notification) == 0x000008, "Wrong alignment on W_Notification_C_ExecuteUbergraph_W_Notification");
static_assert(sizeof(W_Notification_C_ExecuteUbergraph_W_Notification) == 0x000010, "Wrong size on W_Notification_C_ExecuteUbergraph_W_Notification");
static_assert(offsetof(W_Notification_C_ExecuteUbergraph_W_Notification, EntryPoint) == 0x000000, "Member 'W_Notification_C_ExecuteUbergraph_W_Notification::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Notification_C_ExecuteUbergraph_W_Notification, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'W_Notification_C_ExecuteUbergraph_W_Notification::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function W_Notification.W_Notification_C.ShowNotification
// 0x0020 (0x0020 - 0x0000)
struct W_Notification_C_ShowNotification final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_GameInstance_C*                     K2Node_DynamicCast_AsBP_Game_Instance;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_Notification_C_ShowNotification) == 0x000008, "Wrong alignment on W_Notification_C_ShowNotification");
static_assert(sizeof(W_Notification_C_ShowNotification) == 0x000020, "Wrong size on W_Notification_C_ShowNotification");
static_assert(offsetof(W_Notification_C_ShowNotification, ReturnValue) == 0x000000, "Member 'W_Notification_C_ShowNotification::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Notification_C_ShowNotification, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'W_Notification_C_ShowNotification::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Notification_C_ShowNotification, K2Node_DynamicCast_AsBP_Game_Instance) == 0x000010, "Member 'W_Notification_C_ShowNotification::K2Node_DynamicCast_AsBP_Game_Instance' has a wrong offset!");
static_assert(offsetof(W_Notification_C_ShowNotification, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'W_Notification_C_ShowNotification::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

