#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PasswordPrompt

#include "Basic.hpp"

#include "AdvancedSessions_structs.hpp"


namespace SDK::Params
{

// Function W_PasswordPrompt.W_PasswordPrompt_C.ExecuteUbergraph_W_PasswordPrompt
// 0x0078 (0x0078 - 0x0000)
struct W_PasswordPrompt_C_ExecuteUbergraph_W_PasswordPrompt final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0008(0x0018)()
	TArray<struct FSessionPropertyKeyPair>        CallFunc_GetExtraSettings_ExtraSettings;           // 0x0020(0x0010)(ReferenceParm)
	ESessionSettingSearchResult                   CallFunc_GetSessionPropertyString_SearchResult;    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSessionPropertyString_SettingValue;    // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_PasswordPrompt_C_ExecuteUbergraph_W_PasswordPrompt) == 0x000008, "Wrong alignment on W_PasswordPrompt_C_ExecuteUbergraph_W_PasswordPrompt");
static_assert(sizeof(W_PasswordPrompt_C_ExecuteUbergraph_W_PasswordPrompt) == 0x000078, "Wrong size on W_PasswordPrompt_C_ExecuteUbergraph_W_PasswordPrompt");
static_assert(offsetof(W_PasswordPrompt_C_ExecuteUbergraph_W_PasswordPrompt, EntryPoint) == 0x000000, "Member 'W_PasswordPrompt_C_ExecuteUbergraph_W_PasswordPrompt::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_PasswordPrompt_C_ExecuteUbergraph_W_PasswordPrompt, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'W_PasswordPrompt_C_ExecuteUbergraph_W_PasswordPrompt::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PasswordPrompt_C_ExecuteUbergraph_W_PasswordPrompt, CallFunc_GetText_ReturnValue) == 0x000008, "Member 'W_PasswordPrompt_C_ExecuteUbergraph_W_PasswordPrompt::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PasswordPrompt_C_ExecuteUbergraph_W_PasswordPrompt, CallFunc_GetExtraSettings_ExtraSettings) == 0x000020, "Member 'W_PasswordPrompt_C_ExecuteUbergraph_W_PasswordPrompt::CallFunc_GetExtraSettings_ExtraSettings' has a wrong offset!");
static_assert(offsetof(W_PasswordPrompt_C_ExecuteUbergraph_W_PasswordPrompt, CallFunc_GetSessionPropertyString_SearchResult) == 0x000030, "Member 'W_PasswordPrompt_C_ExecuteUbergraph_W_PasswordPrompt::CallFunc_GetSessionPropertyString_SearchResult' has a wrong offset!");
static_assert(offsetof(W_PasswordPrompt_C_ExecuteUbergraph_W_PasswordPrompt, CallFunc_GetSessionPropertyString_SettingValue) == 0x000038, "Member 'W_PasswordPrompt_C_ExecuteUbergraph_W_PasswordPrompt::CallFunc_GetSessionPropertyString_SettingValue' has a wrong offset!");
static_assert(offsetof(W_PasswordPrompt_C_ExecuteUbergraph_W_PasswordPrompt, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'W_PasswordPrompt_C_ExecuteUbergraph_W_PasswordPrompt::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_PasswordPrompt_C_ExecuteUbergraph_W_PasswordPrompt, CallFunc_Conv_StringToText_ReturnValue) == 0x000050, "Member 'W_PasswordPrompt_C_ExecuteUbergraph_W_PasswordPrompt::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PasswordPrompt_C_ExecuteUbergraph_W_PasswordPrompt, CallFunc_EqualEqual_TextText_ReturnValue) == 0x000068, "Member 'W_PasswordPrompt_C_ExecuteUbergraph_W_PasswordPrompt::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_PasswordPrompt_C_ExecuteUbergraph_W_PasswordPrompt, K2Node_SwitchEnum_CmpSuccess) == 0x000069, "Member 'W_PasswordPrompt_C_ExecuteUbergraph_W_PasswordPrompt::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_PasswordPrompt_C_ExecuteUbergraph_W_PasswordPrompt, CallFunc_PlayAnimation_ReturnValue) == 0x000070, "Member 'W_PasswordPrompt_C_ExecuteUbergraph_W_PasswordPrompt::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

