#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PlaneHUD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_PlaneHUD.W_PlaneHUD_C
// 0x00A8 (0x0308 - 0x0260)
class UW_PlaneHUD_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_29;                                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_31;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_86;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Skill1;                                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Skill1_1;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Skill2;                                      // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Skill2_1;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Skill2_2;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_Skill2;                                // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_Skill2_1;                              // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_Skill2_2;                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Skill1;                                  // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Textblock_Skill2;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Skill3;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_VehicleHP_C*                         W_VehicleHP;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Skill2;                             // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Skill2_1;                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Skill2_2;                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAudioComponent*                        CockpitWarningSound;                               // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlaneBase_C*                        PlaneRef;                                          // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_PlaneHUD(int32 EntryPoint);
	void Destruct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	struct FLinearColor SetMGBorderColor();
	struct FLinearColor SetSpeedBoostBorderColor();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_PlaneHUD_C">();
	}
	static class UW_PlaneHUD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_PlaneHUD_C>();
	}
};
static_assert(alignof(UW_PlaneHUD_C) == 0x000008, "Wrong alignment on UW_PlaneHUD_C");
static_assert(sizeof(UW_PlaneHUD_C) == 0x000308, "Wrong size on UW_PlaneHUD_C");
static_assert(offsetof(UW_PlaneHUD_C, UberGraphFrame) == 0x000260, "Member 'UW_PlaneHUD_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_PlaneHUD_C, Image_29) == 0x000268, "Member 'UW_PlaneHUD_C::Image_29' has a wrong offset!");
static_assert(offsetof(UW_PlaneHUD_C, Image_31) == 0x000270, "Member 'UW_PlaneHUD_C::Image_31' has a wrong offset!");
static_assert(offsetof(UW_PlaneHUD_C, Image_86) == 0x000278, "Member 'UW_PlaneHUD_C::Image_86' has a wrong offset!");
static_assert(offsetof(UW_PlaneHUD_C, Image_Skill1) == 0x000280, "Member 'UW_PlaneHUD_C::Image_Skill1' has a wrong offset!");
static_assert(offsetof(UW_PlaneHUD_C, Image_Skill1_1) == 0x000288, "Member 'UW_PlaneHUD_C::Image_Skill1_1' has a wrong offset!");
static_assert(offsetof(UW_PlaneHUD_C, Image_Skill2) == 0x000290, "Member 'UW_PlaneHUD_C::Image_Skill2' has a wrong offset!");
static_assert(offsetof(UW_PlaneHUD_C, Image_Skill2_1) == 0x000298, "Member 'UW_PlaneHUD_C::Image_Skill2_1' has a wrong offset!");
static_assert(offsetof(UW_PlaneHUD_C, Image_Skill2_2) == 0x0002A0, "Member 'UW_PlaneHUD_C::Image_Skill2_2' has a wrong offset!");
static_assert(offsetof(UW_PlaneHUD_C, ProgressBar_Skill2) == 0x0002A8, "Member 'UW_PlaneHUD_C::ProgressBar_Skill2' has a wrong offset!");
static_assert(offsetof(UW_PlaneHUD_C, ProgressBar_Skill2_1) == 0x0002B0, "Member 'UW_PlaneHUD_C::ProgressBar_Skill2_1' has a wrong offset!");
static_assert(offsetof(UW_PlaneHUD_C, ProgressBar_Skill2_2) == 0x0002B8, "Member 'UW_PlaneHUD_C::ProgressBar_Skill2_2' has a wrong offset!");
static_assert(offsetof(UW_PlaneHUD_C, TextBlock_Skill1) == 0x0002C0, "Member 'UW_PlaneHUD_C::TextBlock_Skill1' has a wrong offset!");
static_assert(offsetof(UW_PlaneHUD_C, Textblock_Skill2) == 0x0002C8, "Member 'UW_PlaneHUD_C::Textblock_Skill2' has a wrong offset!");
static_assert(offsetof(UW_PlaneHUD_C, TextBlock_Skill3) == 0x0002D0, "Member 'UW_PlaneHUD_C::TextBlock_Skill3' has a wrong offset!");
static_assert(offsetof(UW_PlaneHUD_C, W_VehicleHP) == 0x0002D8, "Member 'UW_PlaneHUD_C::W_VehicleHP' has a wrong offset!");
static_assert(offsetof(UW_PlaneHUD_C, WidgetSwitcher_Skill2) == 0x0002E0, "Member 'UW_PlaneHUD_C::WidgetSwitcher_Skill2' has a wrong offset!");
static_assert(offsetof(UW_PlaneHUD_C, WidgetSwitcher_Skill2_1) == 0x0002E8, "Member 'UW_PlaneHUD_C::WidgetSwitcher_Skill2_1' has a wrong offset!");
static_assert(offsetof(UW_PlaneHUD_C, WidgetSwitcher_Skill2_2) == 0x0002F0, "Member 'UW_PlaneHUD_C::WidgetSwitcher_Skill2_2' has a wrong offset!");
static_assert(offsetof(UW_PlaneHUD_C, CockpitWarningSound) == 0x0002F8, "Member 'UW_PlaneHUD_C::CockpitWarningSound' has a wrong offset!");
static_assert(offsetof(UW_PlaneHUD_C, PlaneRef) == 0x000300, "Member 'UW_PlaneHUD_C::PlaneRef' has a wrong offset!");

}

