#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_RocketHUD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "E_Teams_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_RocketHUD.W_RocketHUD_C
// 0x0040 (0x02A0 - 0x0260)
class UW_RocketHUD_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image;                                             // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_66;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x0290(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_155;                                     // 0x0298(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_RocketHUD(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	class FText GetAlliedTime();
	class FText GetAxisTime();
	float GetAlliedTimerPercentage();
	float GetAxisTimerPercentage();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_RocketHUD_C">();
	}
	static class UW_RocketHUD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_RocketHUD_C>();
	}
};
static_assert(alignof(UW_RocketHUD_C) == 0x000008, "Wrong alignment on UW_RocketHUD_C");
static_assert(sizeof(UW_RocketHUD_C) == 0x0002A0, "Wrong size on UW_RocketHUD_C");
static_assert(offsetof(UW_RocketHUD_C, UberGraphFrame) == 0x000260, "Member 'UW_RocketHUD_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_RocketHUD_C, Image) == 0x000268, "Member 'UW_RocketHUD_C::Image' has a wrong offset!");
static_assert(offsetof(UW_RocketHUD_C, Image_2) == 0x000270, "Member 'UW_RocketHUD_C::Image_2' has a wrong offset!");
static_assert(offsetof(UW_RocketHUD_C, Image_3) == 0x000278, "Member 'UW_RocketHUD_C::Image_3' has a wrong offset!");
static_assert(offsetof(UW_RocketHUD_C, ProgressBar) == 0x000280, "Member 'UW_RocketHUD_C::ProgressBar' has a wrong offset!");
static_assert(offsetof(UW_RocketHUD_C, ProgressBar_66) == 0x000288, "Member 'UW_RocketHUD_C::ProgressBar_66' has a wrong offset!");
static_assert(offsetof(UW_RocketHUD_C, TextBlock) == 0x000290, "Member 'UW_RocketHUD_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UW_RocketHUD_C, TextBlock_155) == 0x000298, "Member 'UW_RocketHUD_C::TextBlock_155' has a wrong offset!");

}

