#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ScoreBoard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "E_Teams_structs.hpp"
#include "E_Units_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ScoreBoard.W_ScoreBoard_C
// 0x0130 (0x0390 - 0x0260)
class UW_ScoreBoard_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SlideDown;                                         // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_6;                                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_7;                                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_8;                                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_9;                                           // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_10;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_11;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_12;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_84;                                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_135;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_138;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_864;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1086;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1207;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1285;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Allies;                                  // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Axis;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_10;                                      // 0x0320(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_11;                                      // 0x0328(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_178;                                     // 0x0330(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ScoreboardEntry_C*                   W_ScoreboardEntry;                                 // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ScoreboardEntry_C*                   W_ScoreboardEntry_1;                               // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ScoreboardEntry_C*                   W_ScoreboardEntry_2;                               // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ScoreboardEntry_C*                   W_ScoreboardEntry_5;                               // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ScoreboardSpectatorEntry_C*          W_ScoreboardSpectatorEntry;                        // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ScoreboardSpectatorEntry_C*          W_ScoreboardSpectatorEntry_109;                    // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ScoreboardSpectatorEntry_C*          W_ScoreboardSpectatorEntry_214;                    // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ScoreboardSpectatorEntry_C*          W_ScoreboardSpectatorEntry_322;                    // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ScoreboardSpectatorEntry_C*          W_ScoreboardSpectatorEntry_446;                    // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               WrapBox_Spectators;                                // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         LastPlayerCount;                                   // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastSpectatorAmount;                               // 0x038C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_ScoreBoard(int32 EntryPoint);
	void CloseScoreboard();
	void ReloadScoreboard();
	void UpdateScoreboard();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void GetConnectedPlayersCount(int32* PlayerCount);
	void SortListOnScore(E_Teams Team, TArray<struct FST_PlayerStats>* SortedEntries);
	void UpdateSortedEntries(E_Teams Team);
	void UpdateStats(class UPanelWidget* List);
	class FText SetServerName();
	void GetSpectatorAmount(int32* PlayerCount);
	class FText SetPlayerAmount();
	class FText SetHostName();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_ScoreBoard_C">();
	}
	static class UW_ScoreBoard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_ScoreBoard_C>();
	}
};
static_assert(alignof(UW_ScoreBoard_C) == 0x000008, "Wrong alignment on UW_ScoreBoard_C");
static_assert(sizeof(UW_ScoreBoard_C) == 0x000390, "Wrong size on UW_ScoreBoard_C");
static_assert(offsetof(UW_ScoreBoard_C, UberGraphFrame) == 0x000260, "Member 'UW_ScoreBoard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_ScoreBoard_C, SlideDown) == 0x000268, "Member 'UW_ScoreBoard_C::SlideDown' has a wrong offset!");
static_assert(offsetof(UW_ScoreBoard_C, Image) == 0x000270, "Member 'UW_ScoreBoard_C::Image' has a wrong offset!");
static_assert(offsetof(UW_ScoreBoard_C, Image_1) == 0x000278, "Member 'UW_ScoreBoard_C::Image_1' has a wrong offset!");
static_assert(offsetof(UW_ScoreBoard_C, Image_2) == 0x000280, "Member 'UW_ScoreBoard_C::Image_2' has a wrong offset!");
static_assert(offsetof(UW_ScoreBoard_C, Image_3) == 0x000288, "Member 'UW_ScoreBoard_C::Image_3' has a wrong offset!");
static_assert(offsetof(UW_ScoreBoard_C, Image_4) == 0x000290, "Member 'UW_ScoreBoard_C::Image_4' has a wrong offset!");
static_assert(offsetof(UW_ScoreBoard_C, Image_5) == 0x000298, "Member 'UW_ScoreBoard_C::Image_5' has a wrong offset!");
static_assert(offsetof(UW_ScoreBoard_C, Image_6) == 0x0002A0, "Member 'UW_ScoreBoard_C::Image_6' has a wrong offset!");
static_assert(offsetof(UW_ScoreBoard_C, Image_7) == 0x0002A8, "Member 'UW_ScoreBoard_C::Image_7' has a wrong offset!");
static_assert(offsetof(UW_ScoreBoard_C, Image_8) == 0x0002B0, "Member 'UW_ScoreBoard_C::Image_8' has a wrong offset!");
static_assert(offsetof(UW_ScoreBoard_C, Image_9) == 0x0002B8, "Member 'UW_ScoreBoard_C::Image_9' has a wrong offset!");
static_assert(offsetof(UW_ScoreBoard_C, Image_10) == 0x0002C0, "Member 'UW_ScoreBoard_C::Image_10' has a wrong offset!");
static_assert(offsetof(UW_ScoreBoard_C, Image_11) == 0x0002C8, "Member 'UW_ScoreBoard_C::Image_11' has a wrong offset!");
static_assert(offsetof(UW_ScoreBoard_C, Image_12) == 0x0002D0, "Member 'UW_ScoreBoard_C::Image_12' has a wrong offset!");
static_assert(offsetof(UW_ScoreBoard_C, Image_84) == 0x0002D8, "Member 'UW_ScoreBoard_C::Image_84' has a wrong offset!");
static_assert(offsetof(UW_ScoreBoard_C, Image_135) == 0x0002E0, "Member 'UW_ScoreBoard_C::Image_135' has a wrong offset!");
static_assert(offsetof(UW_ScoreBoard_C, Image_138) == 0x0002E8, "Member 'UW_ScoreBoard_C::Image_138' has a wrong offset!");
static_assert(offsetof(UW_ScoreBoard_C, Image_864) == 0x0002F0, "Member 'UW_ScoreBoard_C::Image_864' has a wrong offset!");
static_assert(offsetof(UW_ScoreBoard_C, Image_1086) == 0x0002F8, "Member 'UW_ScoreBoard_C::Image_1086' has a wrong offset!");
static_assert(offsetof(UW_ScoreBoard_C, Image_1207) == 0x000300, "Member 'UW_ScoreBoard_C::Image_1207' has a wrong offset!");
static_assert(offsetof(UW_ScoreBoard_C, Image_1285) == 0x000308, "Member 'UW_ScoreBoard_C::Image_1285' has a wrong offset!");
static_assert(offsetof(UW_ScoreBoard_C, ScrollBox_Allies) == 0x000310, "Member 'UW_ScoreBoard_C::ScrollBox_Allies' has a wrong offset!");
static_assert(offsetof(UW_ScoreBoard_C, ScrollBox_Axis) == 0x000318, "Member 'UW_ScoreBoard_C::ScrollBox_Axis' has a wrong offset!");
static_assert(offsetof(UW_ScoreBoard_C, TextBlock_10) == 0x000320, "Member 'UW_ScoreBoard_C::TextBlock_10' has a wrong offset!");
static_assert(offsetof(UW_ScoreBoard_C, TextBlock_11) == 0x000328, "Member 'UW_ScoreBoard_C::TextBlock_11' has a wrong offset!");
static_assert(offsetof(UW_ScoreBoard_C, TextBlock_178) == 0x000330, "Member 'UW_ScoreBoard_C::TextBlock_178' has a wrong offset!");
static_assert(offsetof(UW_ScoreBoard_C, W_ScoreboardEntry) == 0x000338, "Member 'UW_ScoreBoard_C::W_ScoreboardEntry' has a wrong offset!");
static_assert(offsetof(UW_ScoreBoard_C, W_ScoreboardEntry_1) == 0x000340, "Member 'UW_ScoreBoard_C::W_ScoreboardEntry_1' has a wrong offset!");
static_assert(offsetof(UW_ScoreBoard_C, W_ScoreboardEntry_2) == 0x000348, "Member 'UW_ScoreBoard_C::W_ScoreboardEntry_2' has a wrong offset!");
static_assert(offsetof(UW_ScoreBoard_C, W_ScoreboardEntry_5) == 0x000350, "Member 'UW_ScoreBoard_C::W_ScoreboardEntry_5' has a wrong offset!");
static_assert(offsetof(UW_ScoreBoard_C, W_ScoreboardSpectatorEntry) == 0x000358, "Member 'UW_ScoreBoard_C::W_ScoreboardSpectatorEntry' has a wrong offset!");
static_assert(offsetof(UW_ScoreBoard_C, W_ScoreboardSpectatorEntry_109) == 0x000360, "Member 'UW_ScoreBoard_C::W_ScoreboardSpectatorEntry_109' has a wrong offset!");
static_assert(offsetof(UW_ScoreBoard_C, W_ScoreboardSpectatorEntry_214) == 0x000368, "Member 'UW_ScoreBoard_C::W_ScoreboardSpectatorEntry_214' has a wrong offset!");
static_assert(offsetof(UW_ScoreBoard_C, W_ScoreboardSpectatorEntry_322) == 0x000370, "Member 'UW_ScoreBoard_C::W_ScoreboardSpectatorEntry_322' has a wrong offset!");
static_assert(offsetof(UW_ScoreBoard_C, W_ScoreboardSpectatorEntry_446) == 0x000378, "Member 'UW_ScoreBoard_C::W_ScoreboardSpectatorEntry_446' has a wrong offset!");
static_assert(offsetof(UW_ScoreBoard_C, WrapBox_Spectators) == 0x000380, "Member 'UW_ScoreBoard_C::WrapBox_Spectators' has a wrong offset!");
static_assert(offsetof(UW_ScoreBoard_C, LastPlayerCount) == 0x000388, "Member 'UW_ScoreBoard_C::LastPlayerCount' has a wrong offset!");
static_assert(offsetof(UW_ScoreBoard_C, LastSpectatorAmount) == 0x00038C, "Member 'UW_ScoreBoard_C::LastSpectatorAmount' has a wrong offset!");

}

