#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SelectionDropDownEntry

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_SelectionDropDownEntry.W_SelectionDropDownEntry_C.ExecuteUbergraph_W_SelectionDropDownEntry
// 0x0148 (0x0148 - 0x0000)
struct W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Tooltip_C*                           CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetSelectableStatsAsText_Stats;           // 0x0020(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0078(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D0(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00E8(0x0018)()
	TArray<class UW_SelectionDropDown_C*>         CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0100(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UW_SelectionDropDown_C*                 CallFunc_Array_Get_Item;                           // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11E[0x2];                                      // 0x011E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry) == 0x000008, "Wrong alignment on W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry");
static_assert(sizeof(W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry) == 0x000148, "Wrong size on W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry");
static_assert(offsetof(W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry, EntryPoint) == 0x000000, "Member 'W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry, CallFunc_Create_ReturnValue) == 0x000008, "Member 'W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry, Temp_bool_True_if_break_was_hit_Variable) == 0x000010, "Member 'W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry, Temp_int_Array_Index_Variable) == 0x000014, "Member 'W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry, CallFunc_GetSelectableStatsAsText_Stats) == 0x000020, "Member 'W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry::CallFunc_GetSelectableStatsAsText_Stats' has a wrong offset!");
static_assert(offsetof(W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry, K2Node_MakeStruct_FormatArgumentData_1) == 0x000078, "Member 'W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry, CallFunc_TextIsEmpty_ReturnValue) == 0x0000B8, "Member 'W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry, K2Node_MakeArray_Array) == 0x0000C0, "Member 'W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry, CallFunc_Format_ReturnValue) == 0x0000D0, "Member 'W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry, CallFunc_Conv_StringToText_ReturnValue) == 0x0000E8, "Member 'W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000100, "Member 'W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry, CallFunc_Array_Get_Item) == 0x000110, "Member 'W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry, CallFunc_Array_Length_ReturnValue) == 0x000118, "Member 'W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry, CallFunc_IsValid_ReturnValue) == 0x00011C, "Member 'W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x00011D, "Member 'W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry, CallFunc_Array_Length_ReturnValue_1) == 0x000120, "Member 'W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry, CallFunc_Conv_IntToString_ReturnValue) == 0x000128, "Member 'W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry, Temp_int_Loop_Counter_Variable) == 0x000138, "Member 'W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry, CallFunc_Less_IntInt_ReturnValue) == 0x00013C, "Member 'W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry, CallFunc_Add_IntInt_ReturnValue) == 0x000140, "Member 'W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry, CallFunc_BooleanAND_ReturnValue) == 0x000144, "Member 'W_SelectionDropDownEntry_C_ExecuteUbergraph_W_SelectionDropDownEntry::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function W_SelectionDropDownEntry.W_SelectionDropDownEntry_C.EnableButton
// 0x0002 (0x0002 - 0x0000)
struct W_SelectionDropDownEntry_C_EnableButton final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_SelectionDropDownEntry_C_EnableButton) == 0x000001, "Wrong alignment on W_SelectionDropDownEntry_C_EnableButton");
static_assert(sizeof(W_SelectionDropDownEntry_C_EnableButton) == 0x000002, "Wrong size on W_SelectionDropDownEntry_C_EnableButton");
static_assert(offsetof(W_SelectionDropDownEntry_C_EnableButton, ReturnValue) == 0x000000, "Member 'W_SelectionDropDownEntry_C_EnableButton::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SelectionDropDownEntry_C_EnableButton, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'W_SelectionDropDownEntry_C_EnableButton::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function W_SelectionDropDownEntry.W_SelectionDropDownEntry_C.SetSelectableColor
// 0x0020 (0x0020 - 0x0000)
struct W_SelectionDropDownEntry_C_SetSelectableColor final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SelectionDropDownEntry_C_SetSelectableColor) == 0x000004, "Wrong alignment on W_SelectionDropDownEntry_C_SetSelectableColor");
static_assert(sizeof(W_SelectionDropDownEntry_C_SetSelectableColor) == 0x000020, "Wrong size on W_SelectionDropDownEntry_C_SetSelectableColor");
static_assert(offsetof(W_SelectionDropDownEntry_C_SetSelectableColor, ReturnValue) == 0x000000, "Member 'W_SelectionDropDownEntry_C_SetSelectableColor::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SelectionDropDownEntry_C_SetSelectableColor, CallFunc_SelectColor_ReturnValue) == 0x000010, "Member 'W_SelectionDropDownEntry_C_SetSelectableColor::CallFunc_SelectColor_ReturnValue' has a wrong offset!");

// Function W_SelectionDropDownEntry.W_SelectionDropDownEntry_C.ShowRifleDualEquipWarning
// 0x0005 (0x0005 - 0x0000)
struct W_SelectionDropDownEntry_C_ShowRifleDualEquipWarning final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SelectionDropDownEntry_C_ShowRifleDualEquipWarning) == 0x000001, "Wrong alignment on W_SelectionDropDownEntry_C_ShowRifleDualEquipWarning");
static_assert(sizeof(W_SelectionDropDownEntry_C_ShowRifleDualEquipWarning) == 0x000005, "Wrong size on W_SelectionDropDownEntry_C_ShowRifleDualEquipWarning");
static_assert(offsetof(W_SelectionDropDownEntry_C_ShowRifleDualEquipWarning, ReturnValue) == 0x000000, "Member 'W_SelectionDropDownEntry_C_ShowRifleDualEquipWarning::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SelectionDropDownEntry_C_ShowRifleDualEquipWarning, Temp_bool_Variable) == 0x000001, "Member 'W_SelectionDropDownEntry_C_ShowRifleDualEquipWarning::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_SelectionDropDownEntry_C_ShowRifleDualEquipWarning, Temp_byte_Variable) == 0x000002, "Member 'W_SelectionDropDownEntry_C_ShowRifleDualEquipWarning::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_SelectionDropDownEntry_C_ShowRifleDualEquipWarning, Temp_byte_Variable_1) == 0x000003, "Member 'W_SelectionDropDownEntry_C_ShowRifleDualEquipWarning::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_SelectionDropDownEntry_C_ShowRifleDualEquipWarning, K2Node_Select_Default) == 0x000004, "Member 'W_SelectionDropDownEntry_C_ShowRifleDualEquipWarning::K2Node_Select_Default' has a wrong offset!");

// Function W_SelectionDropDownEntry.W_SelectionDropDownEntry_C.ShowSkullIcon
// 0x0001 (0x0001 - 0x0000)
struct W_SelectionDropDownEntry_C_ShowSkullIcon final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SelectionDropDownEntry_C_ShowSkullIcon) == 0x000001, "Wrong alignment on W_SelectionDropDownEntry_C_ShowSkullIcon");
static_assert(sizeof(W_SelectionDropDownEntry_C_ShowSkullIcon) == 0x000001, "Wrong size on W_SelectionDropDownEntry_C_ShowSkullIcon");
static_assert(offsetof(W_SelectionDropDownEntry_C_ShowSkullIcon, ReturnValue) == 0x000000, "Member 'W_SelectionDropDownEntry_C_ShowSkullIcon::ReturnValue' has a wrong offset!");

}

