#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ShopToolTipPreview

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_ShopToolTipPreview.W_ShopToolTipPreview_C.ExecuteUbergraph_W_ShopToolTipPreview
// 0x0020 (0x0020 - 0x0000)
struct W_ShopToolTipPreview_C_ExecuteUbergraph_W_ShopToolTipPreview final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_CosmeticPreview_C*>          CallFunc_GetAllActorsOfClass_OutActors;            // 0x0008(0x0010)(ReferenceParm)
	class ABP_CosmeticPreview_C*                  CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ShopToolTipPreview_C_ExecuteUbergraph_W_ShopToolTipPreview) == 0x000008, "Wrong alignment on W_ShopToolTipPreview_C_ExecuteUbergraph_W_ShopToolTipPreview");
static_assert(sizeof(W_ShopToolTipPreview_C_ExecuteUbergraph_W_ShopToolTipPreview) == 0x000020, "Wrong size on W_ShopToolTipPreview_C_ExecuteUbergraph_W_ShopToolTipPreview");
static_assert(offsetof(W_ShopToolTipPreview_C_ExecuteUbergraph_W_ShopToolTipPreview, EntryPoint) == 0x000000, "Member 'W_ShopToolTipPreview_C_ExecuteUbergraph_W_ShopToolTipPreview::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_ShopToolTipPreview_C_ExecuteUbergraph_W_ShopToolTipPreview, CallFunc_GetAllActorsOfClass_OutActors) == 0x000008, "Member 'W_ShopToolTipPreview_C_ExecuteUbergraph_W_ShopToolTipPreview::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(W_ShopToolTipPreview_C_ExecuteUbergraph_W_ShopToolTipPreview, CallFunc_Array_Get_Item) == 0x000018, "Member 'W_ShopToolTipPreview_C_ExecuteUbergraph_W_ShopToolTipPreview::CallFunc_Array_Get_Item' has a wrong offset!");

}

