#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SliderNoStep

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_SliderNoStep.W_SliderNoStep_C.ExecuteUbergraph_W_SliderNoStep
// 0x000C (0x000C - 0x0000)
struct W_SliderNoStep_C_ExecuteUbergraph_W_SliderNoStep final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SliderNoStep_C_ExecuteUbergraph_W_SliderNoStep) == 0x000004, "Wrong alignment on W_SliderNoStep_C_ExecuteUbergraph_W_SliderNoStep");
static_assert(sizeof(W_SliderNoStep_C_ExecuteUbergraph_W_SliderNoStep) == 0x00000C, "Wrong size on W_SliderNoStep_C_ExecuteUbergraph_W_SliderNoStep");
static_assert(offsetof(W_SliderNoStep_C_ExecuteUbergraph_W_SliderNoStep, EntryPoint) == 0x000000, "Member 'W_SliderNoStep_C_ExecuteUbergraph_W_SliderNoStep::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_SliderNoStep_C_ExecuteUbergraph_W_SliderNoStep, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_SliderNoStep_C_ExecuteUbergraph_W_SliderNoStep::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_SliderNoStep_C_ExecuteUbergraph_W_SliderNoStep, K2Node_ComponentBoundEvent_Value) == 0x000008, "Member 'W_SliderNoStep_C_ExecuteUbergraph_W_SliderNoStep::K2Node_ComponentBoundEvent_Value' has a wrong offset!");

// Function W_SliderNoStep.W_SliderNoStep_C.BndEvt__W_Slider_Slider_49_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_SliderNoStep_C_BndEvt__W_Slider_Slider_49_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SliderNoStep_C_BndEvt__W_Slider_Slider_49_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on W_SliderNoStep_C_BndEvt__W_Slider_Slider_49_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(W_SliderNoStep_C_BndEvt__W_Slider_Slider_49_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on W_SliderNoStep_C_BndEvt__W_Slider_Slider_49_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(W_SliderNoStep_C_BndEvt__W_Slider_Slider_49_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'W_SliderNoStep_C_BndEvt__W_Slider_Slider_49_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function W_SliderNoStep.W_SliderNoStep_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_SliderNoStep_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_SliderNoStep_C_PreConstruct) == 0x000001, "Wrong alignment on W_SliderNoStep_C_PreConstruct");
static_assert(sizeof(W_SliderNoStep_C_PreConstruct) == 0x000001, "Wrong size on W_SliderNoStep_C_PreConstruct");
static_assert(offsetof(W_SliderNoStep_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_SliderNoStep_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

