#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SpecialActionStack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_SpecialActionStack.W_SpecialActionStack_C
// 0x0020 (0x0280 - 0x0260)
class UW_SpecialActionStack_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HorizontalBox_KillConfirms;                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_SpecialKills;                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_0;                                  // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_SpecialActionStack(int32 EntryPoint);
	void AddNotification(const class FText& Message, const struct FLinearColor& Color, class FName Tag, const class FText& KilledPlayerUsername);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void CheckIfNotificationAlreadyExists(const class FText& Message, const struct FLinearColor& Color, class FName Tag, const class FText& KilledPlayerUsername, bool* AlreadyExistsAndReplayed);
	void AddEntry(class UPanelWidget* HorBox, const struct FST_Notification& Notification);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_SpecialActionStack_C">();
	}
	static class UW_SpecialActionStack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_SpecialActionStack_C>();
	}
};
static_assert(alignof(UW_SpecialActionStack_C) == 0x000008, "Wrong alignment on UW_SpecialActionStack_C");
static_assert(sizeof(UW_SpecialActionStack_C) == 0x000280, "Wrong size on UW_SpecialActionStack_C");
static_assert(offsetof(UW_SpecialActionStack_C, UberGraphFrame) == 0x000260, "Member 'UW_SpecialActionStack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_SpecialActionStack_C, HorizontalBox_KillConfirms) == 0x000268, "Member 'UW_SpecialActionStack_C::HorizontalBox_KillConfirms' has a wrong offset!");
static_assert(offsetof(UW_SpecialActionStack_C, HorizontalBox_SpecialKills) == 0x000270, "Member 'UW_SpecialActionStack_C::HorizontalBox_SpecialKills' has a wrong offset!");
static_assert(offsetof(UW_SpecialActionStack_C, WidgetSwitcher_0) == 0x000278, "Member 'UW_SpecialActionStack_C::WidgetSwitcher_0' has a wrong offset!");

}

