#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_TankHUD

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_TankHUD.W_TankHUD_C.ExecuteUbergraph_W_TankHUD
// 0x01D0 (0x01D0 - 0x0000)
struct W_TankHUD_C_ExecuteUbergraph_W_TankHUD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputActionKeyMapping>         CallFunc_GetActionMappingByName_OutMappings;       // 0x0010(0x0010)(ReferenceParm)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0020(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionKeyMapping                 CallFunc_Array_Get_Item;                           // 0x0060(0x0028)()
	class FText                                   CallFunc_Key_GetDisplayName_ReturnValue;           // 0x0088(0x0018)()
	class FText                                   CallFunc_FormatKeybindName_ReturnValue;            // 0x00A0(0x0018)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Controller_C*                       K2Node_DynamicCast_AsBP_Controller;                // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_TankBase_C*                         K2Node_DynamicCast_AsBP_Tank_Base;                 // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsReloading__IsReloading;                 // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E3[0x1];                                       // 0x00E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_1;           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputActionKeyMapping>         CallFunc_GetActionMappingByName_OutMappings_1;     // 0x00F8(0x0010)(ReferenceParm)
	struct FInputActionKeyMapping                 CallFunc_Array_Get_Item_1;                         // 0x0108(0x0028)()
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_2;           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputActionKeyMapping>         CallFunc_GetActionMappingByName_OutMappings_2;     // 0x0138(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Key_GetDisplayName_ReturnValue_1;         // 0x0148(0x0018)()
	struct FInputActionKeyMapping                 CallFunc_Array_Get_Item_2;                         // 0x0160(0x0028)()
	class FText                                   CallFunc_FormatKeybindName_ReturnValue_1;          // 0x0188(0x0018)()
	class FText                                   CallFunc_Key_GetDisplayName_ReturnValue_2;         // 0x01A0(0x0018)()
	class FText                                   CallFunc_FormatKeybindName_ReturnValue_2;          // 0x01B8(0x0018)()
};
static_assert(alignof(W_TankHUD_C_ExecuteUbergraph_W_TankHUD) == 0x000008, "Wrong alignment on W_TankHUD_C_ExecuteUbergraph_W_TankHUD");
static_assert(sizeof(W_TankHUD_C_ExecuteUbergraph_W_TankHUD) == 0x0001D0, "Wrong size on W_TankHUD_C_ExecuteUbergraph_W_TankHUD");
static_assert(offsetof(W_TankHUD_C_ExecuteUbergraph_W_TankHUD, EntryPoint) == 0x000000, "Member 'W_TankHUD_C_ExecuteUbergraph_W_TankHUD::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_TankHUD_C_ExecuteUbergraph_W_TankHUD, CallFunc_GetInputSettings_ReturnValue) == 0x000008, "Member 'W_TankHUD_C_ExecuteUbergraph_W_TankHUD::CallFunc_GetInputSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TankHUD_C_ExecuteUbergraph_W_TankHUD, CallFunc_GetActionMappingByName_OutMappings) == 0x000010, "Member 'W_TankHUD_C_ExecuteUbergraph_W_TankHUD::CallFunc_GetActionMappingByName_OutMappings' has a wrong offset!");
static_assert(offsetof(W_TankHUD_C_ExecuteUbergraph_W_TankHUD, K2Node_Event_MyGeometry) == 0x000020, "Member 'W_TankHUD_C_ExecuteUbergraph_W_TankHUD::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_TankHUD_C_ExecuteUbergraph_W_TankHUD, K2Node_Event_InDeltaTime) == 0x000058, "Member 'W_TankHUD_C_ExecuteUbergraph_W_TankHUD::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_TankHUD_C_ExecuteUbergraph_W_TankHUD, CallFunc_Array_Get_Item) == 0x000060, "Member 'W_TankHUD_C_ExecuteUbergraph_W_TankHUD::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_TankHUD_C_ExecuteUbergraph_W_TankHUD, CallFunc_Key_GetDisplayName_ReturnValue) == 0x000088, "Member 'W_TankHUD_C_ExecuteUbergraph_W_TankHUD::CallFunc_Key_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TankHUD_C_ExecuteUbergraph_W_TankHUD, CallFunc_FormatKeybindName_ReturnValue) == 0x0000A0, "Member 'W_TankHUD_C_ExecuteUbergraph_W_TankHUD::CallFunc_FormatKeybindName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TankHUD_C_ExecuteUbergraph_W_TankHUD, CallFunc_GetPlayerController_ReturnValue) == 0x0000B8, "Member 'W_TankHUD_C_ExecuteUbergraph_W_TankHUD::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TankHUD_C_ExecuteUbergraph_W_TankHUD, K2Node_DynamicCast_AsBP_Controller) == 0x0000C0, "Member 'W_TankHUD_C_ExecuteUbergraph_W_TankHUD::K2Node_DynamicCast_AsBP_Controller' has a wrong offset!");
static_assert(offsetof(W_TankHUD_C_ExecuteUbergraph_W_TankHUD, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'W_TankHUD_C_ExecuteUbergraph_W_TankHUD::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_TankHUD_C_ExecuteUbergraph_W_TankHUD, CallFunc_IsValid_ReturnValue) == 0x0000C9, "Member 'W_TankHUD_C_ExecuteUbergraph_W_TankHUD::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TankHUD_C_ExecuteUbergraph_W_TankHUD, CallFunc_K2_GetPawn_ReturnValue) == 0x0000D0, "Member 'W_TankHUD_C_ExecuteUbergraph_W_TankHUD::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TankHUD_C_ExecuteUbergraph_W_TankHUD, K2Node_DynamicCast_AsBP_Tank_Base) == 0x0000D8, "Member 'W_TankHUD_C_ExecuteUbergraph_W_TankHUD::K2Node_DynamicCast_AsBP_Tank_Base' has a wrong offset!");
static_assert(offsetof(W_TankHUD_C_ExecuteUbergraph_W_TankHUD, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'W_TankHUD_C_ExecuteUbergraph_W_TankHUD::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_TankHUD_C_ExecuteUbergraph_W_TankHUD, CallFunc_IsReloading__IsReloading) == 0x0000E1, "Member 'W_TankHUD_C_ExecuteUbergraph_W_TankHUD::CallFunc_IsReloading__IsReloading' has a wrong offset!");
static_assert(offsetof(W_TankHUD_C_ExecuteUbergraph_W_TankHUD, CallFunc_Not_PreBool_ReturnValue) == 0x0000E2, "Member 'W_TankHUD_C_ExecuteUbergraph_W_TankHUD::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TankHUD_C_ExecuteUbergraph_W_TankHUD, CallFunc_SelectInt_ReturnValue) == 0x0000E4, "Member 'W_TankHUD_C_ExecuteUbergraph_W_TankHUD::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TankHUD_C_ExecuteUbergraph_W_TankHUD, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000E8, "Member 'W_TankHUD_C_ExecuteUbergraph_W_TankHUD::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TankHUD_C_ExecuteUbergraph_W_TankHUD, CallFunc_GetInputSettings_ReturnValue_1) == 0x0000F0, "Member 'W_TankHUD_C_ExecuteUbergraph_W_TankHUD::CallFunc_GetInputSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_TankHUD_C_ExecuteUbergraph_W_TankHUD, CallFunc_GetActionMappingByName_OutMappings_1) == 0x0000F8, "Member 'W_TankHUD_C_ExecuteUbergraph_W_TankHUD::CallFunc_GetActionMappingByName_OutMappings_1' has a wrong offset!");
static_assert(offsetof(W_TankHUD_C_ExecuteUbergraph_W_TankHUD, CallFunc_Array_Get_Item_1) == 0x000108, "Member 'W_TankHUD_C_ExecuteUbergraph_W_TankHUD::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_TankHUD_C_ExecuteUbergraph_W_TankHUD, CallFunc_GetInputSettings_ReturnValue_2) == 0x000130, "Member 'W_TankHUD_C_ExecuteUbergraph_W_TankHUD::CallFunc_GetInputSettings_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_TankHUD_C_ExecuteUbergraph_W_TankHUD, CallFunc_GetActionMappingByName_OutMappings_2) == 0x000138, "Member 'W_TankHUD_C_ExecuteUbergraph_W_TankHUD::CallFunc_GetActionMappingByName_OutMappings_2' has a wrong offset!");
static_assert(offsetof(W_TankHUD_C_ExecuteUbergraph_W_TankHUD, CallFunc_Key_GetDisplayName_ReturnValue_1) == 0x000148, "Member 'W_TankHUD_C_ExecuteUbergraph_W_TankHUD::CallFunc_Key_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_TankHUD_C_ExecuteUbergraph_W_TankHUD, CallFunc_Array_Get_Item_2) == 0x000160, "Member 'W_TankHUD_C_ExecuteUbergraph_W_TankHUD::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(W_TankHUD_C_ExecuteUbergraph_W_TankHUD, CallFunc_FormatKeybindName_ReturnValue_1) == 0x000188, "Member 'W_TankHUD_C_ExecuteUbergraph_W_TankHUD::CallFunc_FormatKeybindName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_TankHUD_C_ExecuteUbergraph_W_TankHUD, CallFunc_Key_GetDisplayName_ReturnValue_2) == 0x0001A0, "Member 'W_TankHUD_C_ExecuteUbergraph_W_TankHUD::CallFunc_Key_GetDisplayName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_TankHUD_C_ExecuteUbergraph_W_TankHUD, CallFunc_FormatKeybindName_ReturnValue_2) == 0x0001B8, "Member 'W_TankHUD_C_ExecuteUbergraph_W_TankHUD::CallFunc_FormatKeybindName_ReturnValue_2' has a wrong offset!");

// Function W_TankHUD.W_TankHUD_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_TankHUD_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_TankHUD_C_Tick) == 0x000004, "Wrong alignment on W_TankHUD_C_Tick");
static_assert(sizeof(W_TankHUD_C_Tick) == 0x00003C, "Wrong size on W_TankHUD_C_Tick");
static_assert(offsetof(W_TankHUD_C_Tick, MyGeometry) == 0x000000, "Member 'W_TankHUD_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_TankHUD_C_Tick, InDeltaTime) == 0x000038, "Member 'W_TankHUD_C_Tick::InDeltaTime' has a wrong offset!");

// Function W_TankHUD.W_TankHUD_C.SetMGBorderColor
// 0x0020 (0x0020 - 0x0000)
struct W_TankHUD_C_SetMGBorderColor final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_TankHUD_C_SetMGBorderColor) == 0x000004, "Wrong alignment on W_TankHUD_C_SetMGBorderColor");
static_assert(sizeof(W_TankHUD_C_SetMGBorderColor) == 0x000020, "Wrong size on W_TankHUD_C_SetMGBorderColor");
static_assert(offsetof(W_TankHUD_C_SetMGBorderColor, ReturnValue) == 0x000000, "Member 'W_TankHUD_C_SetMGBorderColor::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TankHUD_C_SetMGBorderColor, CallFunc_SelectColor_ReturnValue) == 0x000010, "Member 'W_TankHUD_C_SetMGBorderColor::CallFunc_SelectColor_ReturnValue' has a wrong offset!");

// Function W_TankHUD.W_TankHUD_C.SetRepairBorderColor
// 0x0020 (0x0020 - 0x0000)
struct W_TankHUD_C_SetRepairBorderColor final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_TankHUD_C_SetRepairBorderColor) == 0x000004, "Wrong alignment on W_TankHUD_C_SetRepairBorderColor");
static_assert(sizeof(W_TankHUD_C_SetRepairBorderColor) == 0x000020, "Wrong size on W_TankHUD_C_SetRepairBorderColor");
static_assert(offsetof(W_TankHUD_C_SetRepairBorderColor, ReturnValue) == 0x000000, "Member 'W_TankHUD_C_SetRepairBorderColor::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TankHUD_C_SetRepairBorderColor, CallFunc_SelectColor_ReturnValue) == 0x000010, "Member 'W_TankHUD_C_SetRepairBorderColor::CallFunc_SelectColor_ReturnValue' has a wrong offset!");

}

