#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Tab

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_Tab.W_Tab_C.ExecuteUbergraph_W_Tab
// 0x00B0 (0x00B0 - 0x0000)
struct W_Tab_C_ExecuteUbergraph_W_Tab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UW_Tab_C*>                       CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UW_Tab_C*                               CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0058(0x0058)(HasGetValueTypeHash)
};
static_assert(alignof(W_Tab_C_ExecuteUbergraph_W_Tab) == 0x000008, "Wrong alignment on W_Tab_C_ExecuteUbergraph_W_Tab");
static_assert(sizeof(W_Tab_C_ExecuteUbergraph_W_Tab) == 0x0000B0, "Wrong size on W_Tab_C_ExecuteUbergraph_W_Tab");
static_assert(offsetof(W_Tab_C_ExecuteUbergraph_W_Tab, EntryPoint) == 0x000000, "Member 'W_Tab_C_ExecuteUbergraph_W_Tab::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Tab_C_ExecuteUbergraph_W_Tab, Temp_bool_Variable) == 0x000004, "Member 'W_Tab_C_ExecuteUbergraph_W_Tab::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_Tab_C_ExecuteUbergraph_W_Tab, Temp_float_Variable) == 0x000008, "Member 'W_Tab_C_ExecuteUbergraph_W_Tab::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(W_Tab_C_ExecuteUbergraph_W_Tab, Temp_float_Variable_1) == 0x00000C, "Member 'W_Tab_C_ExecuteUbergraph_W_Tab::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Tab_C_ExecuteUbergraph_W_Tab, Temp_int_Array_Index_Variable) == 0x000010, "Member 'W_Tab_C_ExecuteUbergraph_W_Tab::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_Tab_C_ExecuteUbergraph_W_Tab, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'W_Tab_C_ExecuteUbergraph_W_Tab::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_Tab_C_ExecuteUbergraph_W_Tab, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'W_Tab_C_ExecuteUbergraph_W_Tab::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Tab_C_ExecuteUbergraph_W_Tab, K2Node_Event_IsDesignTime) == 0x00001C, "Member 'W_Tab_C_ExecuteUbergraph_W_Tab::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Tab_C_ExecuteUbergraph_W_Tab, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000020, "Member 'W_Tab_C_ExecuteUbergraph_W_Tab::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(W_Tab_C_ExecuteUbergraph_W_Tab, CallFunc_Array_Get_Item) == 0x000030, "Member 'W_Tab_C_ExecuteUbergraph_W_Tab::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_Tab_C_ExecuteUbergraph_W_Tab, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'W_Tab_C_ExecuteUbergraph_W_Tab::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Tab_C_ExecuteUbergraph_W_Tab, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'W_Tab_C_ExecuteUbergraph_W_Tab::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Tab_C_ExecuteUbergraph_W_Tab, CallFunc_EqualEqual_TextText_ReturnValue) == 0x00003D, "Member 'W_Tab_C_ExecuteUbergraph_W_Tab::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Tab_C_ExecuteUbergraph_W_Tab, K2Node_Select_Default) == 0x000040, "Member 'W_Tab_C_ExecuteUbergraph_W_Tab::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_Tab_C_ExecuteUbergraph_W_Tab, CallFunc_MakeVector2D_ReturnValue) == 0x000044, "Member 'W_Tab_C_ExecuteUbergraph_W_Tab::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Tab_C_ExecuteUbergraph_W_Tab, CallFunc_MakeVector2D_ReturnValue_1) == 0x00004C, "Member 'W_Tab_C_ExecuteUbergraph_W_Tab::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Tab_C_ExecuteUbergraph_W_Tab, K2Node_MakeStruct_SlateFontInfo) == 0x000058, "Member 'W_Tab_C_ExecuteUbergraph_W_Tab::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");

// Function W_Tab.W_Tab_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Tab_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_Tab_C_PreConstruct) == 0x000001, "Wrong alignment on W_Tab_C_PreConstruct");
static_assert(sizeof(W_Tab_C_PreConstruct) == 0x000001, "Wrong size on W_Tab_C_PreConstruct");
static_assert(offsetof(W_Tab_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Tab_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Tab.W_Tab_C.SetHighlighted
// 0x0480 (0x0480 - 0x0000)
struct W_Tab_C_SetHighlighted final
{
public:
	bool                                          IsHighlighted_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0030(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0058(0x0028)()
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0080(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x00A8(0x0028)()
	struct FSlateColor                            K2Node_Select_Default_1;                           // 0x00D0(0x0028)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x00F8(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x0180(0x0088)()
	struct FButtonStyle                           K2Node_MakeStruct_ButtonStyle;                     // 0x0208(0x0278)()
};
static_assert(alignof(W_Tab_C_SetHighlighted) == 0x000008, "Wrong alignment on W_Tab_C_SetHighlighted");
static_assert(sizeof(W_Tab_C_SetHighlighted) == 0x000480, "Wrong size on W_Tab_C_SetHighlighted");
static_assert(offsetof(W_Tab_C_SetHighlighted, IsHighlighted_0) == 0x000000, "Member 'W_Tab_C_SetHighlighted::IsHighlighted_0' has a wrong offset!");
static_assert(offsetof(W_Tab_C_SetHighlighted, Temp_bool_Variable) == 0x000001, "Member 'W_Tab_C_SetHighlighted::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_Tab_C_SetHighlighted, Temp_bool_Variable_1) == 0x000002, "Member 'W_Tab_C_SetHighlighted::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Tab_C_SetHighlighted, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'W_Tab_C_SetHighlighted::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_Tab_C_SetHighlighted, K2Node_MakeStruct_SlateColor_1) == 0x000030, "Member 'W_Tab_C_SetHighlighted::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_Tab_C_SetHighlighted, K2Node_MakeStruct_SlateColor_2) == 0x000058, "Member 'W_Tab_C_SetHighlighted::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(W_Tab_C_SetHighlighted, K2Node_Select_Default) == 0x000080, "Member 'W_Tab_C_SetHighlighted::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_Tab_C_SetHighlighted, K2Node_MakeStruct_SlateColor_3) == 0x0000A8, "Member 'W_Tab_C_SetHighlighted::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(W_Tab_C_SetHighlighted, K2Node_Select_Default_1) == 0x0000D0, "Member 'W_Tab_C_SetHighlighted::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_Tab_C_SetHighlighted, K2Node_MakeStruct_SlateBrush) == 0x0000F8, "Member 'W_Tab_C_SetHighlighted::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(W_Tab_C_SetHighlighted, K2Node_MakeStruct_SlateBrush_1) == 0x000180, "Member 'W_Tab_C_SetHighlighted::K2Node_MakeStruct_SlateBrush_1' has a wrong offset!");
static_assert(offsetof(W_Tab_C_SetHighlighted, K2Node_MakeStruct_ButtonStyle) == 0x000208, "Member 'W_Tab_C_SetHighlighted::K2Node_MakeStruct_ButtonStyle' has a wrong offset!");

}

