#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_TeamSelect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_TeamSelect.W_TeamSelect_C
// 0x0058 (0x02B8 - 0x0260)
class UW_TeamSelect_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button;                                            // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_0;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_372;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x0280(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_0;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_1;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_3;                                       // 0x0298(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_4;                                       // 0x02A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Allied_Players;                                    // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Axis_Players;                                      // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AllowAlliedJoin;                                   // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          AllowAxisJoin;                                     // 0x02B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_W_TeamSelect(int32 EntryPoint);
	void BndEvt__W_TeamSelect_Button_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__W_TeamSelect_Button_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__W_TeamSelect_Button_0_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__W_TeamSelect_Button_0_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__W_TeamSelect_Button_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__W_TeamSelect_Button_0_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	class FText SetMapName();
	bool EnableAlliedFlag();
	bool EnableAxisFlag();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_TeamSelect_C">();
	}
	static class UW_TeamSelect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_TeamSelect_C>();
	}
};
static_assert(alignof(UW_TeamSelect_C) == 0x000008, "Wrong alignment on UW_TeamSelect_C");
static_assert(sizeof(UW_TeamSelect_C) == 0x0002B8, "Wrong size on UW_TeamSelect_C");
static_assert(offsetof(UW_TeamSelect_C, UberGraphFrame) == 0x000260, "Member 'UW_TeamSelect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_TeamSelect_C, Button) == 0x000268, "Member 'UW_TeamSelect_C::Button' has a wrong offset!");
static_assert(offsetof(UW_TeamSelect_C, Button_0) == 0x000270, "Member 'UW_TeamSelect_C::Button_0' has a wrong offset!");
static_assert(offsetof(UW_TeamSelect_C, Image_372) == 0x000278, "Member 'UW_TeamSelect_C::Image_372' has a wrong offset!");
static_assert(offsetof(UW_TeamSelect_C, TextBlock) == 0x000280, "Member 'UW_TeamSelect_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UW_TeamSelect_C, TextBlock_0) == 0x000288, "Member 'UW_TeamSelect_C::TextBlock_0' has a wrong offset!");
static_assert(offsetof(UW_TeamSelect_C, TextBlock_1) == 0x000290, "Member 'UW_TeamSelect_C::TextBlock_1' has a wrong offset!");
static_assert(offsetof(UW_TeamSelect_C, TextBlock_3) == 0x000298, "Member 'UW_TeamSelect_C::TextBlock_3' has a wrong offset!");
static_assert(offsetof(UW_TeamSelect_C, TextBlock_4) == 0x0002A0, "Member 'UW_TeamSelect_C::TextBlock_4' has a wrong offset!");
static_assert(offsetof(UW_TeamSelect_C, Allied_Players) == 0x0002A8, "Member 'UW_TeamSelect_C::Allied_Players' has a wrong offset!");
static_assert(offsetof(UW_TeamSelect_C, Axis_Players) == 0x0002AC, "Member 'UW_TeamSelect_C::Axis_Players' has a wrong offset!");
static_assert(offsetof(UW_TeamSelect_C, AllowAlliedJoin) == 0x0002B0, "Member 'UW_TeamSelect_C::AllowAlliedJoin' has a wrong offset!");
static_assert(offsetof(UW_TeamSelect_C, AllowAxisJoin) == 0x0002B1, "Member 'UW_TeamSelect_C::AllowAxisJoin' has a wrong offset!");

}

