#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_USername

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_USername.W_Username_C
// 0x0050 (0x02B0 - 0x0260)
class UW_Username_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x0268(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_58;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_152;                                   // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_32;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_0;                                     // 0x0290(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_Character_C*                        Character;                                         // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FarAway;                                           // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsEnemy;                                           // 0x02A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          InLOS;                                             // 0x02A2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A3[0x5];                                      // 0x02A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  Pawn;                                              // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Username(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	ESlateVisibility ShowFullName();
	class FText SetUserName();
	struct FSlateColor SetNameColor();
	struct FSlateColor SetTitleColor();
	ESlateVisibility ShowDot();
	struct FLinearColor ShowBorder();
	float SetHP();
	struct FLinearColor HPColor();
	ESlateVisibility ShowHUD();
	ESlateVisibility ShowHPBar();
	class FText SetTitle();
	void IsPawnAIControlled_(bool* IsAIControlled);
	void GetPawnUsername(class FString* UserName);
	void GetPawnHealthInfo(int32* CurrentHP, int32* MaxHP);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Username_C">();
	}
	static class UW_Username_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Username_C>();
	}
};
static_assert(alignof(UW_Username_C) == 0x000008, "Wrong alignment on UW_Username_C");
static_assert(sizeof(UW_Username_C) == 0x0002B0, "Wrong size on UW_Username_C");
static_assert(offsetof(UW_Username_C, UberGraphFrame) == 0x000260, "Member 'UW_Username_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Username_C, CanvasPanel_0) == 0x000268, "Member 'UW_Username_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UW_Username_C, Image_58) == 0x000270, "Member 'UW_Username_C::Image_58' has a wrong offset!");
static_assert(offsetof(UW_Username_C, ProgressBar_152) == 0x000278, "Member 'UW_Username_C::ProgressBar_152' has a wrong offset!");
static_assert(offsetof(UW_Username_C, TextBlock) == 0x000280, "Member 'UW_Username_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UW_Username_C, TextBlock_32) == 0x000288, "Member 'UW_Username_C::TextBlock_32' has a wrong offset!");
static_assert(offsetof(UW_Username_C, VerticalBox_0) == 0x000290, "Member 'UW_Username_C::VerticalBox_0' has a wrong offset!");
static_assert(offsetof(UW_Username_C, Character) == 0x000298, "Member 'UW_Username_C::Character' has a wrong offset!");
static_assert(offsetof(UW_Username_C, FarAway) == 0x0002A0, "Member 'UW_Username_C::FarAway' has a wrong offset!");
static_assert(offsetof(UW_Username_C, IsEnemy) == 0x0002A1, "Member 'UW_Username_C::IsEnemy' has a wrong offset!");
static_assert(offsetof(UW_Username_C, InLOS) == 0x0002A2, "Member 'UW_Username_C::InLOS' has a wrong offset!");
static_assert(offsetof(UW_Username_C, Pawn) == 0x0002A8, "Member 'UW_Username_C::Pawn' has a wrong offset!");

}

