#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_VoteKickEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_VoteKickEntry.W_VoteKickEntry_C
// 0x0030 (0x0290 - 0x0260)
class UW_VoteKickEntry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             TextBlock_36;                                      // 0x0268(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Button_C*                            W_Button;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Button_C*                            W_Button_1;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class APlayerState*                           PlayerState;                                       // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Is_Host;                                           // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_W_VoteKickEntry(int32 EntryPoint);
	void BndEvt__W_VoteKickEntry_W_Button_K2Node_ComponentBoundEvent_0_ButtonPressed__DelegateSignature();
	void BndEvt__W_KickBanEntry_W_Button_1_K2Node_ComponentBoundEvent_2_ButtonPressed__DelegateSignature();
	void Construct();
	bool EnableVoteKick();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_VoteKickEntry_C">();
	}
	static class UW_VoteKickEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_VoteKickEntry_C>();
	}
};
static_assert(alignof(UW_VoteKickEntry_C) == 0x000008, "Wrong alignment on UW_VoteKickEntry_C");
static_assert(sizeof(UW_VoteKickEntry_C) == 0x000290, "Wrong size on UW_VoteKickEntry_C");
static_assert(offsetof(UW_VoteKickEntry_C, UberGraphFrame) == 0x000260, "Member 'UW_VoteKickEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_VoteKickEntry_C, TextBlock_36) == 0x000268, "Member 'UW_VoteKickEntry_C::TextBlock_36' has a wrong offset!");
static_assert(offsetof(UW_VoteKickEntry_C, W_Button) == 0x000270, "Member 'UW_VoteKickEntry_C::W_Button' has a wrong offset!");
static_assert(offsetof(UW_VoteKickEntry_C, W_Button_1) == 0x000278, "Member 'UW_VoteKickEntry_C::W_Button_1' has a wrong offset!");
static_assert(offsetof(UW_VoteKickEntry_C, PlayerState) == 0x000280, "Member 'UW_VoteKickEntry_C::PlayerState' has a wrong offset!");
static_assert(offsetof(UW_VoteKickEntry_C, Is_Host) == 0x000288, "Member 'UW_VoteKickEntry_C::Is_Host' has a wrong offset!");

}

