#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_VoteKickEntry

#include "Basic.hpp"

#include "SteamCore_structs.hpp"


namespace SDK::Params
{

// Function W_VoteKickEntry.W_VoteKickEntry_C.ExecuteUbergraph_W_VoteKickEntry
// 0x0060 (0x0060 - 0x0000)
struct W_VoteKickEntry_C_ExecuteUbergraph_W_VoteKickEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerState_C*                      K2Node_DynamicCast_AsBP_Player_State;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Controller_C*                       K2Node_DynamicCast_AsBP_Controller;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerState_C*                      K2Node_DynamicCast_AsBP_Player_State_1;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_SteamID_C*                           CallFunc_Create_ReturnValue;                       // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSteamID                               CallFunc_GetSteamIdFromPlayerState_ReturnValue;    // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BreakSteamID_ReturnValue;                 // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_VoteKickEntry_C_ExecuteUbergraph_W_VoteKickEntry) == 0x000008, "Wrong alignment on W_VoteKickEntry_C_ExecuteUbergraph_W_VoteKickEntry");
static_assert(sizeof(W_VoteKickEntry_C_ExecuteUbergraph_W_VoteKickEntry) == 0x000060, "Wrong size on W_VoteKickEntry_C_ExecuteUbergraph_W_VoteKickEntry");
static_assert(offsetof(W_VoteKickEntry_C_ExecuteUbergraph_W_VoteKickEntry, EntryPoint) == 0x000000, "Member 'W_VoteKickEntry_C_ExecuteUbergraph_W_VoteKickEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_VoteKickEntry_C_ExecuteUbergraph_W_VoteKickEntry, K2Node_DynamicCast_AsBP_Player_State) == 0x000008, "Member 'W_VoteKickEntry_C_ExecuteUbergraph_W_VoteKickEntry::K2Node_DynamicCast_AsBP_Player_State' has a wrong offset!");
static_assert(offsetof(W_VoteKickEntry_C_ExecuteUbergraph_W_VoteKickEntry, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'W_VoteKickEntry_C_ExecuteUbergraph_W_VoteKickEntry::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_VoteKickEntry_C_ExecuteUbergraph_W_VoteKickEntry, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'W_VoteKickEntry_C_ExecuteUbergraph_W_VoteKickEntry::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_VoteKickEntry_C_ExecuteUbergraph_W_VoteKickEntry, K2Node_DynamicCast_AsBP_Controller) == 0x000020, "Member 'W_VoteKickEntry_C_ExecuteUbergraph_W_VoteKickEntry::K2Node_DynamicCast_AsBP_Controller' has a wrong offset!");
static_assert(offsetof(W_VoteKickEntry_C_ExecuteUbergraph_W_VoteKickEntry, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'W_VoteKickEntry_C_ExecuteUbergraph_W_VoteKickEntry::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_VoteKickEntry_C_ExecuteUbergraph_W_VoteKickEntry, K2Node_DynamicCast_AsBP_Player_State_1) == 0x000030, "Member 'W_VoteKickEntry_C_ExecuteUbergraph_W_VoteKickEntry::K2Node_DynamicCast_AsBP_Player_State_1' has a wrong offset!");
static_assert(offsetof(W_VoteKickEntry_C_ExecuteUbergraph_W_VoteKickEntry, K2Node_DynamicCast_bSuccess_2) == 0x000038, "Member 'W_VoteKickEntry_C_ExecuteUbergraph_W_VoteKickEntry::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(W_VoteKickEntry_C_ExecuteUbergraph_W_VoteKickEntry, CallFunc_Create_ReturnValue) == 0x000040, "Member 'W_VoteKickEntry_C_ExecuteUbergraph_W_VoteKickEntry::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_VoteKickEntry_C_ExecuteUbergraph_W_VoteKickEntry, CallFunc_GetSteamIdFromPlayerState_ReturnValue) == 0x000048, "Member 'W_VoteKickEntry_C_ExecuteUbergraph_W_VoteKickEntry::CallFunc_GetSteamIdFromPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_VoteKickEntry_C_ExecuteUbergraph_W_VoteKickEntry, CallFunc_BreakSteamID_ReturnValue) == 0x000050, "Member 'W_VoteKickEntry_C_ExecuteUbergraph_W_VoteKickEntry::CallFunc_BreakSteamID_ReturnValue' has a wrong offset!");

// Function W_VoteKickEntry.W_VoteKickEntry_C.EnableVoteKick
// 0x0050 (0x0050 - 0x0000)
struct W_VoteKickEntry_C_EnableVoteKick final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerState_C*                      K2Node_DynamicCast_AsBP_Player_State;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Controller_C*                       K2Node_DynamicCast_AsBP_Controller;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GameStateBase_C*                    K2Node_DynamicCast_AsBP_Game_State_Base;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_VoteKickEntry_C_EnableVoteKick) == 0x000008, "Wrong alignment on W_VoteKickEntry_C_EnableVoteKick");
static_assert(sizeof(W_VoteKickEntry_C_EnableVoteKick) == 0x000050, "Wrong size on W_VoteKickEntry_C_EnableVoteKick");
static_assert(offsetof(W_VoteKickEntry_C_EnableVoteKick, ReturnValue) == 0x000000, "Member 'W_VoteKickEntry_C_EnableVoteKick::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_VoteKickEntry_C_EnableVoteKick, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'W_VoteKickEntry_C_EnableVoteKick::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_VoteKickEntry_C_EnableVoteKick, K2Node_DynamicCast_AsBP_Player_State) == 0x000010, "Member 'W_VoteKickEntry_C_EnableVoteKick::K2Node_DynamicCast_AsBP_Player_State' has a wrong offset!");
static_assert(offsetof(W_VoteKickEntry_C_EnableVoteKick, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'W_VoteKickEntry_C_EnableVoteKick::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_VoteKickEntry_C_EnableVoteKick, CallFunc_GetPlayerController_ReturnValue_1) == 0x000020, "Member 'W_VoteKickEntry_C_EnableVoteKick::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_VoteKickEntry_C_EnableVoteKick, K2Node_DynamicCast_AsBP_Controller) == 0x000028, "Member 'W_VoteKickEntry_C_EnableVoteKick::K2Node_DynamicCast_AsBP_Controller' has a wrong offset!");
static_assert(offsetof(W_VoteKickEntry_C_EnableVoteKick, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'W_VoteKickEntry_C_EnableVoteKick::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_VoteKickEntry_C_EnableVoteKick, CallFunc_GetGameState_ReturnValue) == 0x000038, "Member 'W_VoteKickEntry_C_EnableVoteKick::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_VoteKickEntry_C_EnableVoteKick, K2Node_DynamicCast_AsBP_Game_State_Base) == 0x000040, "Member 'W_VoteKickEntry_C_EnableVoteKick::K2Node_DynamicCast_AsBP_Game_State_Base' has a wrong offset!");
static_assert(offsetof(W_VoteKickEntry_C_EnableVoteKick, K2Node_DynamicCast_bSuccess_2) == 0x000048, "Member 'W_VoteKickEntry_C_EnableVoteKick::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(W_VoteKickEntry_C_EnableVoteKick, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'W_VoteKickEntry_C_EnableVoteKick::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

